[
  {
    "id": "1f082639-a939-4522-ac1b-c6ebb199eff2",
    "text": "What is the name of Homer Simpson's favorite beer in 'The Simpsons'?",
    "options": [
      "Duff",
      "Budweiser",
      "Heineken",
      "Corona"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Duff is the fictional beer brand that Homer Simpson regularly drinks throughout the series.",
    "detailedExplanation": "Duff Beer is a fictional brand of beer that appears in the animated television series The Simpsons. It is Homer Simpson's beverage of choice and is featured prominently throughout the show's run. The beer is produced by the Duff Brewing Company and has become an iconic element of the series, even inspiring real-world merchandise and theme park attractions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Duff_Beer",
    "citationTitle": "Wikipedia: Duff Beer"
  },
  {
    "id": "2f40b19b-593f-4c86-a102-65e5738c7232",
    "text": "Which character in 'SpongeBob SquarePants' is known for being cheap and greedy?",
    "options": [
      "Squidward",
      "Patrick",
      "Mr. Krabs",
      "Sandy"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Mr. Krabs is the owner of the Krusty Krab restaurant and is notorious for his love of money and penny-pinching ways.",
    "detailedExplanation": "Eugene Harold Krabs, commonly known as Mr. Krabs, is a main character in the Nickelodeon animated series SpongeBob SquarePants. He is a red crab who owns and operates the Krusty Krab restaurant where SpongeBob works. Mr. Krabs is characterized by his obsessive love for money and his extremely frugal, often greedy behavior, which serves as a running gag throughout the series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mr._Krabs",
    "citationTitle": "Wikipedia: Mr. Krabs"
  },
  {
    "id": "850ec371-bbd1-4583-86ab-4146c44c9d57",
    "text": "What type of animal is Scooby-Doo?",
    "options": [
      "Cat",
      "Dog",
      "Bear",
      "Wolf"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Scooby-Doo is a Great Dane dog who solves mysteries with his human friends.",
    "detailedExplanation": "Scooby-Doo is the titular character of the long-running animated franchise that began in 1969. He is a Great Dane dog known for his cowardly personality, distinctive speech impediment, and love of Scooby Snacks. Along with his best friend Shaggy and the rest of Mystery Inc., Scooby-Doo investigates supernatural mysteries that usually turn out to have logical explanations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Scooby-Doo_(character)",
    "citationTitle": "Wikipedia: Scooby-Doo (character)"
  },
  {
    "id": "4405cb93-2d02-4a8d-a3ef-02b30be3ff7e",
    "text": "In 'Tom and Jerry', which character is the cat?",
    "options": [
      "Jerry",
      "Tom",
      "Spike",
      "Butch"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tom is the gray cat who constantly chases Jerry the mouse in the classic animated series.",
    "detailedExplanation": "Tom Cat is one of the two main characters in the Tom and Jerry animated series created by William Hanna and Joseph Barbera. Tom is a gray domestic cat who makes numerous attempts to catch Jerry Mouse, his nemesis. The series, which debuted in 1940, is built around their endless chase sequences and slapstick comedy, with Tom typically being the aggressor but rarely succeeding in his goal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tom_Cat",
    "citationTitle": "Wikipedia: Tom Cat"
  },
  {
    "id": "1aa8005c-1407-4541-9d70-79155472879d",
    "text": "What is the name of the baby in 'The Flintstones'?",
    "options": [
      "Pebbles",
      "Bamm-Bamm",
      "Dino",
      "Hoppy"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Pebbles Flintstone is Fred and Wilma's red-haired daughter in the Stone Age animated series.",
    "detailedExplanation": "Pebbles Flintstone is the daughter of Fred and Wilma Flintstone in the animated television series The Flintstones. She was introduced in the fourth season of the show and became a central character. Pebbles is known for her distinctive red hair and her friendship with Bamm-Bamm Rubble, the super-strong adopted son of Barney and Betty Rubble. The character helped revitalize the series and spawned various spin-offs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pebbles_Flintstone",
    "citationTitle": "Wikipedia: Pebbles Flintstone"
  },
  {
    "id": "15d83dd4-5cf8-4359-96fa-d8d88ea1ddf7",
    "text": "Which animated series features a character named Bart Simpson?",
    "options": [
      "Family Guy",
      "South Park",
      "The Simpsons",
      "Futurama"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Bart Simpson is one of the main characters in 'The Simpsons', the eldest child of the Simpson family.",
    "detailedExplanation": "Bartholomew JoJo 'Bart' Simpson is a main character in the American animated sitcom The Simpsons. He is the mischievous, rebellious, and troublemaking eldest child of the Simpson family. Created by cartoonist Matt Groening, Bart is known for his catchphrases like 'Eat my shorts!' and 'Don't have a cow, man!' The character has become a cultural icon since the show's debut in 1989.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bart_Simpson",
    "citationTitle": "Wikipedia: Bart Simpson"
  },
  {
    "id": "dbce2471-34ed-4f45-9d60-92a1ccabc0e6",
    "text": "What is the name of Popeye's girlfriend?",
    "options": [
      "Betty Boop",
      "Olive Oyl",
      "Minnie Mouse",
      "Petunia Pig"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Olive Oyl is Popeye's tall, thin girlfriend who often needs rescuing in the animated series.",
    "detailedExplanation": "Olive Oyl is a cartoon character created by E.C. Segar in 1919 for his comic strip Thimble Theatre, which later became the Popeye comic strip and animated series. She is Popeye's girlfriend and is characterized by her extremely thin build, black hair, and her tendency to get into trouble, often requiring Popeye to rescue her. Olive Oyl actually appeared in the comic strip before Popeye was introduced as a character.",
    "citationUrl": "https://en.wikipedia.org/wiki/Olive_Oyl",
    "citationTitle": "Wikipedia: Olive Oyl"
  },
  {
    "id": "62f8efc3-da28-45c4-9d2b-5639e2df470e",
    "text": "In 'Looney Tunes', what type of animal is Bugs Bunny?",
    "options": [
      "Mouse",
      "Rabbit",
      "Duck",
      "Cat"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Bugs Bunny is a gray rabbit known for his catchphrase 'What's up, Doc?' and carrot-eating habits.",
    "detailedExplanation": "Bugs Bunny is an animated cartoon character created in the late 1930s by Leon Schlesinger Productions and voiced originally by Mel Blanc. He is a gray and white rabbit known for his flippant, insouciant personality and his famous catchphrase 'What's up, Doc?' Bugs Bunny has appeared in more films than any other cartoon character and is considered one of the most recognizable characters in the world, serving as the official mascot of Warner Bros. Entertainment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bugs_Bunny",
    "citationTitle": "Wikipedia: Bugs Bunny"
  },
  {
    "id": "ca7b908d-1557-41fe-9247-c5f1e4e11fcc",
    "text": "Which animated TV series features a family of yellow-skinned characters living in Springfield?",
    "options": [
      "Family Guy",
      "The Simpsons",
      "South Park",
      "King of the Hill"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Simpsons is set in the fictional town of Springfield and features the iconic yellow-skinned Simpson family.",
    "detailedExplanation": "The Simpsons, created by Matt Groening, is one of the longest-running American animated series. The show is famous for its distinctive animation style where all characters have yellow skin, and it's set in the fictional town of Springfield. The series has been on the air since 1989 and has become a cultural phenomenon worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Simpsons",
    "citationTitle": "Wikipedia: The Simpsons"
  },
  {
    "id": "ab35ecf9-7d20-4d6f-82d4-bbe0a24e5fc7",
    "text": "What is the name of the town where 'South Park' takes place?",
    "options": [
      "Springfield",
      "Quahog",
      "South Park",
      "Arlen"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "South Park is both the name of the animated series and the fictional Colorado town where it's set.",
    "detailedExplanation": "South Park is an adult animated sitcom created by Trey Parker and Matt Stone. The show is set in the fictional town of South Park, Colorado, and follows the adventures of four boys: Stan Marsh, Kyle Broflovski, Eric Cartman, and Kenny McCormick. The series is known for its satirical humor and controversial content.",
    "citationUrl": "https://en.wikipedia.org/wiki/South_Park",
    "citationTitle": "Wikipedia: South Park"
  },
  {
    "id": "811e7627-d24a-4313-8e2b-9b63e360f5f8",
    "text": "In 'Family Guy', what is the name of the family's talking dog?",
    "options": [
      "Brian",
      "Stewie",
      "Peter",
      "Glenn"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Brian Griffin is the anthropomorphic white dog who can talk and is a member of the Griffin family.",
    "detailedExplanation": "Brian Griffin is one of the main characters in the animated series Family Guy. He's an anthropomorphic white labrador who walks on two legs, talks, and displays human characteristics. Brian is known for his intellectual pretensions, liberal political views, and his struggles with alcoholism. He serves as a voice of reason in the chaotic Griffin household.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brian_Griffin",
    "citationTitle": "Wikipedia: Brian Griffin"
  },
  {
    "id": "9dabcc82-edf9-4488-a416-4e5b24d42681",
    "text": "Which animated series features characters named Beavis and Butt-Head?",
    "options": [
      "King of the Hill",
      "Daria",
      "Beavis and Butt-Head",
      "The Simpsons"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Beavis and Butt-Head is the name of the animated series featuring the two teenage characters.",
    "detailedExplanation": "Beavis and Butt-Head is an American adult animated series created by Mike Judge. The show centers on two socially incompetent teenage metalheads, Beavis and Butt-Head, who live in the fictional town of Highland, Texas. The series originally ran on MTV from 1993 to 1997 and was known for its crude humor and music video commentary segments.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beavis_and_Butt-Head",
    "citationTitle": "Wikipedia: Beavis and Butt-Head"
  },
  {
    "id": "ce61670a-41da-41f8-a43b-91ae4c1e0b1a",
    "text": "What is the name of the main character in 'Adventure Time'?",
    "options": [
      "Jake",
      "Finn",
      "Marceline",
      "Princess Bubblegum"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Finn the Human is the main protagonist of Adventure Time, along with his best friend Jake the Dog.",
    "detailedExplanation": "Adventure Time is an American animated television series created by Pendleton Ward for Cartoon Network. The series follows the adventures of Finn the Human, a teenage boy, and his best friend and adoptive brother Jake the Dog in the post-apocalyptic Land of Ooo. Finn is characterized by his heroic nature, optimism, and his iconic white bear hat.",
    "citationUrl": "https://en.wikipedia.org/wiki/Adventure_Time",
    "citationTitle": "Wikipedia: Adventure Time"
  },
  {
    "id": "37ef67cf-c4d1-4ec5-b0a5-80739936b313",
    "text": "In 'Rick and Morty', what is the relationship between Rick and Morty?",
    "options": [
      "Father and son",
      "Grandfather and grandson",
      "Uncle and nephew",
      "Brothers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Rick Sanchez is Morty Smith's maternal grandfather in the series.",
    "detailedExplanation": "Rick and Morty is an American adult animated science fiction sitcom created by Justin Roiland and Dan Harmon. The show follows the misadventures of cynical mad scientist Rick Sanchez and his good-hearted but fretful grandson Morty Smith. Rick is Morty's maternal grandfather who moved in with the family after a 20-year absence, bringing chaos and interdimensional adventures into their lives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rick_and_Morty",
    "citationTitle": "Wikipedia: Rick and Morty"
  },
  {
    "id": "c683f68b-80ac-4136-b56e-e8506a771cba",
    "text": "Which animated series features a character named Eric Cartman?",
    "options": [
      "Family Guy",
      "The Simpsons",
      "South Park",
      "American Dad"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Eric Cartman is one of the main characters in South Park, known for his controversial and outrageous behavior.",
    "detailedExplanation": "Eric Theodore Cartman is one of the four main characters in the animated series South Park. He's portrayed as an obese, narcissistic, and manipulative fourth-grader who often serves as the show's primary antagonist. Cartman is known for his bigoted views, schemes to get rich or gain power, and his catchphrase 'Respect my authoritah!' The character is voiced by Trey Parker, one of the show's creators.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eric_Cartman",
    "citationTitle": "Wikipedia: Eric Cartman"
  },
  {
    "id": "39db9fe4-93e4-40be-9ecd-335303004914",
    "text": "What is the name of the network that originally aired 'Avatar: The Last Airbender'?",
    "options": [
      "Cartoon Network",
      "Disney Channel",
      "Nickelodeon",
      "Adult Swim"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Avatar: The Last Airbender originally aired on Nickelodeon from 2005 to 2008.",
    "detailedExplanation": "Avatar: The Last Airbender is an American animated television series created by Michael Dante DiMartino and Bryan Konietzko. The series aired on Nickelodeon for three seasons from February 2005 to July 2008. Set in an Asiatic world where some people can manipulate the elements through telekinetic variants of Chinese martial arts, the series follows Aang, the Avatar who must master all four elements to stop the Fire Nation from conquering the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avatar:_The_Last_Airbender",
    "citationTitle": "Wikipedia: Avatar: The Last Airbender"
  },
  {
    "id": "96bc662a-3b0c-4bdf-b037-916403c54e11",
    "text": "Which animated series features a superhero family with the last name Parr?",
    "options": [
      "The Incredibles TV series",
      "The Powerpuff Girls",
      "Teen Titans",
      "Justice League"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Incredibles features the Parr family as superheroes.",
    "detailedExplanation": "The Incredibles, originally a Pixar film, was later adapted into various animated TV specials and shorts. The main characters are the Parr family: Bob (Mr. Incredible), Helen (Elastigirl), and their children Violet, Dash, and Jack-Jack. While primarily known as a movie franchise, it has spawned several TV specials and animated content that qualifies it as part of animated television entertainment.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Incredibles",
    "citationTitle": "Wikipedia: The Incredibles"
  },
  {
    "id": "7da1352d-9af5-45d3-a345-b19ab6aeefce",
    "text": "What is the name of the crystal gems' leader in 'Steven Universe'?",
    "options": [
      "Amethyst",
      "Pearl",
      "Garnet",
      "Rose Quartz"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Garnet is the leader of the Crystal Gems in Steven Universe.",
    "detailedExplanation": "In the Cartoon Network series 'Steven Universe', Garnet serves as the de facto leader of the Crystal Gems, a group of magical alien warriors. She is a fusion of two gems, Ruby and Sapphire, and is known for her calm demeanor, future vision abilities, and protective nature toward Steven. The show ran from 2013 to 2019 and was praised for its representation and storytelling.",
    "citationUrl": "https://en.wikipedia.org/wiki/Steven_Universe",
    "citationTitle": "Wikipedia: Steven Universe"
  },
  {
    "id": "11f584bc-9df8-47e1-a5ef-adde2d573c77",
    "text": "Which animated series follows the adventures of a boy and his magical dog who can shape-shift?",
    "options": [
      "Regular Show",
      "Adventure Time",
      "Gravity Falls",
      "Over the Garden Wall"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Adventure Time features Finn the boy and Jake the magical shape-shifting dog.",
    "detailedExplanation": "Adventure Time aired on Cartoon Network from 2010 to 2018 and followed the adventures of Finn the Human and his best friend Jake the Dog in the post-apocalyptic Land of Ooo. Jake possesses magical powers that allow him to stretch, shrink, and shape-shift into almost anything. The series was known for its surreal humor, creative storytelling, and deeper themes about growing up and relationships.",
    "citationUrl": "https://en.wikipedia.org/wiki/Adventure_Time",
    "citationTitle": "Wikipedia: Adventure Time"
  },
  {
    "id": "eccac8bd-7c4f-44f6-bfd0-c06bca97ac3a",
    "text": "In 'Teenage Mutant Ninja Turtles', what is the name of their rat sensei?",
    "options": [
      "Splinter",
      "Shredder",
      "Casey",
      "April"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Master Splinter is the rat sensei who trained the Teenage Mutant Ninja Turtles.",
    "detailedExplanation": "Master Splinter is the wise rat sensei who serves as a father figure and martial arts teacher to Leonardo, Donatello, Michelangelo, and Raphael in the various Teenage Mutant Ninja Turtles animated series. Originally human (Hamato Yoshi in most versions), he was transformed into a rat through exposure to mutagen. The TMNT franchise has had multiple animated series adaptations since the late 1980s, with Splinter being a constant central character throughout.",
    "citationUrl": "https://en.wikipedia.org/wiki/Splinter_(Teenage_Mutant_Ninja_Turtles)",
    "citationTitle": "Wikipedia: Splinter (Teenage Mutant Ninja Turtles)"
  }
]