[
  {
    "id": "5a78bc7b-585e-42e0-bb4f-671ff8fe02b7",
    "text": "Which novel by Paula Hawkins became a bestseller in 2015 and was later adapted into a film starring Emily Blunt?",
    "options": [
      "The Girl on the Train",
      "Gone Girl",
      "The Silent Patient",
      "Big Little Lies"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Girl on the Train was Paula Hawkins' debut psychological thriller that became a massive bestseller.",
    "detailedExplanation": "The Girl on the Train by Paula Hawkins was published in 2015 and quickly became an international bestseller, spending weeks at number one on various bestseller lists. The psychological thriller follows an unreliable narrator who becomes entangled in a missing person investigation. The novel's success led to a 2016 film adaptation starring Emily Blunt, directed by Tate Taylor.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Girl_on_the_Train_(novel)",
    "citationTitle": "Wikipedia: The Girl on the Train (novel)"
  },
  {
    "id": "c057bf87-05da-48aa-8978-693cf67f50ce",
    "text": "Which bestselling author wrote the 'Fifty Shades' trilogy that began as fan fiction based on the Twilight series?",
    "options": [
      "Stephenie Meyer",
      "E. L. James",
      "Sylvia Day",
      "Maya Banks"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "E. L. James wrote the Fifty Shades trilogy, which originally started as Twilight fan fiction.",
    "detailedExplanation": "E. L. James (Erika Leonard) wrote the Fifty Shades trilogy, beginning with Fifty Shades of Grey in 2011. The series originated as fan fiction titled 'Master of the Universe' based on Stephenie Meyer's Twilight characters. After being reworked with original characters, it became one of the fastest-selling paperback series of all time, spending over 100 weeks on bestseller lists and spawning a successful film franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fifty_Shades_of_Grey",
    "citationTitle": "Wikipedia: Fifty Shades of Grey"
  },
  {
    "id": "4038d014-0de0-45e4-9b91-5f986bade26e",
    "text": "Colleen Hoover's novel 'It Ends with Us' became a massive bestseller decades after its publication thanks to which social media platform?",
    "options": [
      "Instagram",
      "Twitter",
      "TikTok",
      "Facebook"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "TikTok's BookTok community drove the resurgence of Colleen Hoover's novels, making them bestsellers years after publication.",
    "detailedExplanation": "Colleen Hoover's 2016 novel 'It Ends with Us' experienced a remarkable resurgence and became a bestseller in the early 2020s thanks to TikTok's BookTok community. Young readers on the platform created videos recommending and discussing the book, leading to massive sales increases. This phenomenon helped several of Hoover's older titles climb bestseller lists simultaneously, demonstrating the power of social media in modern book marketing.",
    "citationUrl": "https://en.wikipedia.org/wiki/It_Ends_with_Us",
    "citationTitle": "Wikipedia: It Ends with Us"
  },
  {
    "id": "4bcbed2f-b44c-4470-b815-4cde43609d05",
    "text": "Which Delia Owens novel about a young woman living alone in the marshes of North Carolina became a bestseller and book club favorite?",
    "options": [
      "Where the Crawdads Sing",
      "The Marsh King's Daughter",
      "Educated",
      "Little Fires Everywhere"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Where the Crawdads Sing by Delia Owens became a massive bestseller and was adapted into a 2022 film.",
    "detailedExplanation": "Where the Crawdads Sing by Delia Owens was published in 2018 and became one of the decade's biggest bestsellers, spending over 150 weeks on the New York Times bestseller list. The novel tells the story of Kya Clark, known as the 'Marsh Girl,' who grows up isolated in the North Carolina wetlands. The book combines coming-of-age elements with a murder mystery and was praised for its lyrical descriptions of nature. It was adapted into a successful film in 2022.",
    "citationUrl": "https://en.wikipedia.org/wiki/Where_the_Crawdads_Sing",
    "citationTitle": "Wikipedia: Where the Crawdads Sing"
  },
  {
    "id": "d6a5948e-01fa-4864-b681-2adeef2d48d5",
    "text": "What is the first book in Sally Rooney's bestselling series that explores millennial relationships and was adapted by the BBC?",
    "options": [
      "Normal People",
      "Conversations with Friends",
      "Such a Pretty Girl",
      "My Education"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Conversations with Friends was Sally Rooney's debut novel, published before Normal People.",
    "detailedExplanation": "Conversations with Friends, published in 2017, was Sally Rooney's debut novel and the first in her exploration of complex modern relationships among young adults in Ireland. The book follows Frances, a 21-year-old college student, and her relationships with her ex-girlfriend Bobbi and a married couple, Nick and Melissa. While Normal People (2018) gained more widespread recognition first, Conversations with Friends was recently adapted by the BBC in 2022, following the success of the Normal People adaptation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Conversations_with_Friends",
    "citationTitle": "Wikipedia: Conversations with Friends"
  },
  {
    "id": "e1a9c902-1e6f-4000-a19a-0b2ae70b80bf",
    "text": "Which psychological thriller by Alex Michaelides features a woman who refuses to speak after allegedly murdering her husband?",
    "options": [
      "The Guest List",
      "The Silent Patient",
      "The Woman in the Window",
      "Sharp Objects"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Silent Patient by Alex Michaelides centers on Alicia Berenson, who stops speaking after her husband's murder.",
    "detailedExplanation": "The Silent Patient by Alex Michaelides was published in 2019 and became an instant bestseller, spending months on the New York Times bestseller list. The psychological thriller follows Alicia Berenson, a woman who shoots her husband and then never speaks again, and the psychotherapist determined to understand her motive. The book was praised for its twist ending and became one of the best-selling debut novels of recent years, establishing Michaelides as a major voice in psychological suspense.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Silent_Patient",
    "citationTitle": "Wikipedia: The Silent Patient"
  },
  {
    "id": "08ed438c-f4b0-422e-a39e-b975df3cf8a9",
    "text": "Hanya Yanagihara's bestselling novel 'A Little Life' follows four friends in New York, but which character's traumatic past becomes the central focus?",
    "options": [
      "Willem",
      "JB",
      "Malcolm",
      "Jude"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jude St. Francis and his traumatic childhood and ongoing struggles become the emotional center of A Little Life.",
    "detailedExplanation": "A Little Life by Hanya Yanagihara, published in 2015, became a bestseller and critical phenomenon despite its challenging subject matter. While the novel begins by following four friends - Willem, JB, Malcolm, and Jude - it gradually focuses on Jude St. Francis and his horrific childhood experiences and their lasting impact on his adult life. The 720-page novel was longlisted for the Man Booker Prize and became a word-of-mouth bestseller, praised for its emotional depth and unflinching examination of trauma and friendship.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Little_Life",
    "citationTitle": "Wikipedia: A Little Life"
  },
  {
    "id": "f0c53614-313c-4147-b702-8353d1b48467",
    "text": "Which dystopian novel by Margaret Atwood became a bestseller in the 1980s and experienced a major resurgence after the 2017 TV adaptation?",
    "options": [
      "The Testaments",
      "Oryx and Crake",
      "The Handmaid's Tale",
      "Cat's Eye"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Handmaid's Tale saw renewed bestseller status after the Hulu series premiered in 2017.",
    "detailedExplanation": "Margaret Atwood's The Handmaid's Tale, originally published in 1985, experienced a remarkable revival in sales following the premiere of the Hulu television adaptation in 2017. The show's critical acclaim and cultural relevance brought the dystopian novel back to bestseller lists decades after its initial publication, introducing Atwood's cautionary tale to a new generation of readers.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale",
    "citationTitle": "Wikipedia: The Handmaid's Tale"
  },
  {
    "id": "b406629d-36a7-4495-9822-388041ca3706",
    "text": "Which bestselling author created the character of Jack Reacher in a series of thriller novels that began with 'Killing Floor' in 1997?",
    "options": [
      "John Grisham",
      "Lee Child",
      "Michael Crichton",
      "James Patterson"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Lee Child created the popular Jack Reacher character in his bestselling thriller series.",
    "detailedExplanation": "British author Lee Child (real name Jim Grant) created the iconic character Jack Reacher, a former U.S. Army Military Police Major who becomes a drifter solving crimes across America. The series began with 'Killing Floor' in 1997 and has become one of the most successful modern thriller franchises, with over 100 million books sold worldwide and film adaptations starring Tom Cruise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lee_Child",
    "citationTitle": "Wikipedia: Lee Child"
  },
  {
    "id": "76c88136-e827-4298-aaef-7748c30bb706",
    "text": "What is the title of Donna Tartt's Pulitzer Prize-winning novel that became a bestseller in 2013 and centers around a painting by Carel Fabritius?",
    "options": [
      "The Secret History",
      "The Little Friend",
      "The Goldfinch",
      "The Dutch House"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Goldfinch won the 2014 Pulitzer Prize for Fiction and became a major bestseller.",
    "detailedExplanation": "Donna Tartt's The Goldfinch, published in 2013, became both a critical and commercial success, winning the 2014 Pulitzer Prize for Fiction. The novel tells the story of a young man whose life is changed after a terrorist attack at an art museum, and his connection to a famous painting by Dutch artist Carel Fabritius. Despite some mixed critical reception, it became a bestseller and was adapted into a film in 2019.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Goldfinch_(novel)",
    "citationTitle": "Wikipedia: The Goldfinch (novel)"
  },
  {
    "id": "be59690a-1d83-469e-8ec9-d82b07729ca2",
    "text": "Which bestselling romance author wrote 'Beach Read' and 'Book Lovers', becoming hugely popular on BookTok?",
    "options": [
      "Taylor Jenkins Reid",
      "Emily Henry",
      "Christina Lauren",
      "Jasmine Guillory"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Emily Henry wrote both 'Beach Read' and 'Book Lovers', which became BookTok sensations.",
    "detailedExplanation": "Emily Henry has become one of the most popular contemporary romance authors, particularly among younger readers on social media platforms like BookTok (TikTok's book community). Her novels 'Beach Read' (2020) and 'Book Lovers' (2022) both became bestsellers, praised for their witty dialogue, complex characters, and fresh takes on romance tropes. Her success represents the growing influence of social media on book sales and reading trends.",
    "citationUrl": "https://en.wikipedia.org/wiki/Emily_Henry",
    "citationTitle": "Wikipedia: Emily Henry"
  },
  {
    "id": "cebff1e4-e6b7-4b39-b2bb-9eeb32965dcf",
    "text": "Which novel by Kazuo Ishiguro became a bestseller and won the Booker Prize in 1989, later adapted into a film starring Anthony Hopkins?",
    "options": [
      "Never Let Me Go",
      "The Remains of the Day",
      "Klara and the Sun",
      "The Buried Giant"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Remains of the Day won the 1989 Booker Prize and was adapted into an acclaimed film.",
    "detailedExplanation": "Kazuo Ishiguro's The Remains of the Day won the 1989 Booker Prize and became an international bestseller. The novel, told from the perspective of an English butler reflecting on his life and service, was adapted into a critically acclaimed 1993 film starring Anthony Hopkins and Emma Thompson. Ishiguro later won the Nobel Prize in Literature in 2017, further cementing his status as one of the most important contemporary writers.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Remains_of_the_Day",
    "citationTitle": "Wikipedia: The Remains of the Day"
  },
  {
    "id": "a8cc7909-a900-41a3-9aac-b568a47d9338",
    "text": "Which bestselling author wrote 'The Seven Husbands of Evelyn Hugo', a novel about a reclusive Hollywood icon that became hugely popular on social media?",
    "options": [
      "Taylor Jenkins Reid",
      "Rainbow Rowell",
      "Celeste Ng",
      "Jojo Moyes"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Taylor Jenkins Reid wrote 'The Seven Husbands of Evelyn Hugo', which became a social media phenomenon.",
    "detailedExplanation": "Taylor Jenkins Reid's 'The Seven Husbands of Evelyn Hugo' (2017) initially had moderate success but became a massive bestseller years later, largely due to enthusiastic recommendations on BookTok and other social media platforms. The novel tells the story of a reclusive Hollywood legend finally ready to tell her life story to a young journalist. Its popularity demonstrates how social media can revive and sustain book sales long after initial publication.",
    "citationUrl": "https://en.wikipedia.org/wiki/Taylor_Jenkins_Reid",
    "citationTitle": "Wikipedia: Taylor Jenkins Reid"
  },
  {
    "id": "5ec144c9-88ba-42a5-8f16-d3ed5c74f188",
    "text": "Which bestselling fantasy series by Sarah J. Maas began with 'Throne of Glass' and has sold millions of copies worldwide?",
    "options": [
      "A Court of Thorns and Roses",
      "Throne of Glass",
      "Crescent City",
      "The Witcher"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Throne of Glass series is one of Sarah J. Maas's bestselling fantasy series.",
    "detailedExplanation": "Sarah J. Maas's Throne of Glass series, beginning with the novel of the same name in 2012, has become one of the most successful young adult fantasy series of the 2010s. The series follows assassin Celaena Sardothien and spans eight books, selling millions of copies worldwide. Maas has become a dominant force in modern fantasy literature, with her various series consistently topping bestseller lists and gaining devoted fan followings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sarah_J._Maas",
    "citationTitle": "Wikipedia: Sarah J. Maas"
  },
  {
    "id": "4392299f-59be-47c8-a9fe-04fb3f2a3296",
    "text": "Which bestselling mystery writer created the Thursday Murder Club series featuring elderly residents of a retirement village?",
    "options": [
      "Louise Penny",
      "Tana French",
      "Richard Osman",
      "Kate Atkinson"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Richard Osman created the Thursday Murder Club series featuring retirement home detectives.",
    "detailedExplanation": "Television presenter turned author Richard Osman created the Thursday Murder Club series, beginning with the 2020 novel of the same name. The series follows four residents of a peaceful retirement village who meet weekly to investigate cold cases, until they find themselves investigating real murders. The books became instant bestsellers in the UK and internationally, praised for their humor, heart, and clever plotting, proving that cozy mysteries remain popular with modern readers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Richard_Osman",
    "citationTitle": "Wikipedia: Richard Osman"
  },
  {
    "id": "98e8e131-1a82-4993-8c26-fe8f9169b211",
    "text": "Which novel by Gillian Flynn became a massive bestseller in 2012 and was adapted into a film directed by David Fincher?",
    "options": [
      "Sharp Objects",
      "Gone Girl",
      "Dark Places",
      "The Grownup"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Gone Girl became a major bestseller and cultural phenomenon.",
    "detailedExplanation": "Gillian Flynn's psychological thriller 'Gone Girl' was published in 2012 and became a massive international bestseller, spending weeks on the New York Times bestseller list. The novel, which tells the story of Nick Dunne and his wife Amy's disappearance, was praised for its unreliable narrators and dark exploration of marriage. David Fincher adapted it into a successful 2014 film starring Ben Affleck and Rosamund Pike, who received an Oscar nomination for her performance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gone_Girl_(novel)",
    "citationTitle": "Wikipedia: Gone Girl (novel)"
  },
  {
    "id": "e59592d3-ef99-4800-8334-c15705e2ccae",
    "text": "Which bestselling novel by Dan Brown features symbologist Robert Langdon investigating murders at the Louvre Museum?",
    "options": [
      "Angels & Demons",
      "The Lost Symbol",
      "The Da Vinci Code",
      "Inferno"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Da Vinci Code features Langdon investigating murders at the Louvre in Paris.",
    "detailedExplanation": "Dan Brown's 'The Da Vinci Code', published in 2003, became one of the best-selling novels of all time with over 80 million copies sold worldwide. The thriller follows Harvard symbologist Robert Langdon as he investigates a murder at the Louvre Museum in Paris, uncovering a conspiracy involving the Catholic Church and the Holy Grail. The novel sparked controversy due to its fictional claims about Christianity and was adapted into a 2006 film starring Tom Hanks.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Da_Vinci_Code",
    "citationTitle": "Wikipedia: The Da Vinci Code"
  },
  {
    "id": "29a6b66a-f474-4c7b-957a-21665393dfdd",
    "text": "Which bestselling novel by Yann Martel won the Booker Prize in 2002 and tells the story of a boy stranded on a lifeboat with a Bengal tiger?",
    "options": [
      "The High Mountains of Portugal",
      "Beatrice and Virgil",
      "Life of Pi",
      "Self"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Life of Pi won the 2002 Booker Prize and became a global bestseller.",
    "detailedExplanation": "Yann Martel's 'Life of Pi' was published in 2001 and won the prestigious Booker Prize in 2002, becoming an international bestseller translated into dozens of languages. The novel tells the extraordinary story of Piscine 'Pi' Patel, a young Indian boy who survives 227 days stranded on a lifeboat in the Pacific Ocean with a Bengal tiger named Richard Parker. The philosophical adventure novel explores themes of survival, faith, and storytelling, and was adapted into an Academy Award-winning film by Ang Lee in 2012.",
    "citationUrl": "https://en.wikipedia.org/wiki/Life_of_Pi",
    "citationTitle": "Wikipedia: Life of Pi"
  },
  {
    "id": "d3beebf1-6fc9-47aa-9358-4ac9b8de964b",
    "text": "Which bestselling author wrote 'The Kite Runner', a novel set in Afghanistan that became a global phenomenon in the 2000s?",
    "options": [
      "Mohsin Hamid",
      "Khaled Hosseini",
      "Azar Nafisi",
      "Kamila Shamsie"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Khaled Hosseini wrote The Kite Runner, his bestselling debut novel.",
    "detailedExplanation": "Khaled Hosseini's debut novel 'The Kite Runner' was published in 2003 and became a massive international bestseller, spending over 100 weeks on the New York Times bestseller list. The novel tells the story of Amir, a young boy from Kabul, and his complex relationship with Hassan, the son of his father's servant, set against the backdrop of Afghanistan's tumultuous history. The book brought Afghan culture and history to global attention and was adapted into a successful film in 2007. Hosseini followed it with other bestsellers including 'A Thousand Splendid Suns' and 'And the Mountains Echoed'.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kite_Runner",
    "citationTitle": "Wikipedia: The Kite Runner"
  },
  {
    "id": "5c7c4def-7bd1-43bf-89be-f99305e020a1",
    "text": "Which bestselling dystopian trilogy by Suzanne Collins features the character Katniss Everdeen and became a major film franchise?",
    "options": [
      "Divergent",
      "The Maze Runner",
      "The Hunger Games",
      "The Selection"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Hunger Games trilogy features Katniss Everdeen in a dystopian future.",
    "detailedExplanation": "Suzanne Collins' 'The Hunger Games' trilogy, published between 2008-2010, became a global publishing phenomenon and cultural milestone in young adult literature. The series follows sixteen-year-old Katniss Everdeen in the dystopian nation of Panem, where she volunteers to participate in the deadly Hunger Games to save her sister. The trilogy has sold over 100 million copies worldwide and was adapted into a highly successful film franchise starring Jennifer Lawrence, grossing nearly $3 billion worldwide and establishing the template for many subsequent YA dystopian adaptations.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Hunger_Games",
    "citationTitle": "Wikipedia: The Hunger Games"
  }
]