[
  {
    "id": "da831de8-72f9-4cbd-a132-f403570a32f9",
    "text": "Which NFL team has appeared in the most Super Bowls without ever winning one?",
    "options": [
      "Buffalo Bills",
      "Minnesota Vikings",
      "Atlanta Falcons",
      "Carolina Panthers"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Buffalo Bills have appeared in 4 Super Bowls (1991-1994) without winning any.",
    "detailedExplanation": "The Buffalo Bills hold the unfortunate record of appearing in the most Super Bowls without a victory, having lost four consecutive Super Bowls from 1991 to 1994 (Super Bowls XXV, XXVI, XXVII, and XXVIII). This unprecedented streak of four straight Super Bowl appearances by the same team remains unmatched in NFL history, though it resulted in heartbreak for Bills fans each time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Buffalo_Bills",
    "citationTitle": "Wikipedia: Buffalo Bills"
  },
  {
    "id": "7571f5db-2452-493a-81fe-7262ae5d5d39",
    "text": "What was unique about the halftime show performer for Super Bowl XXV in 1991?",
    "options": [
      "It was the first rock band to perform",
      "It featured New Kids on the Block during wartime",
      "It was performed entirely by military bands",
      "It was the shortest halftime show ever"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "New Kids on the Block performed during the Gulf War, making it a notable wartime Super Bowl.",
    "detailedExplanation": "Super Bowl XXV took place on January 27, 1991, during the Gulf War, creating a unique atmosphere of patriotism and tension. New Kids on the Block performed the halftime show titled 'A Small World Salute to 25 Years of the Super Bowl,' but the game is more remembered for its heightened security measures and the missed field goal by Buffalo's Scott Norwood. The wartime context made this Super Bowl particularly memorable beyond just the entertainment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XXV",
    "citationTitle": "Wikipedia: Super Bowl XXV"
  },
  {
    "id": "71071362-bd20-425b-b971-b8081e5767fb",
    "text": "Which Super Bowl featured the infamous 'wardrobe malfunction' incident?",
    "options": [
      "Super Bowl XXXVII",
      "Super Bowl XXXVIII",
      "Super Bowl XXXIX",
      "Super Bowl XL"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XXXVIII in 2004 featured Janet Jackson and Justin Timberlake's halftime show incident.",
    "detailedExplanation": "Super Bowl XXXVIII on February 1, 2004, became infamous for Janet Jackson and Justin Timberlake's halftime show performance that ended with Jackson's brief wardrobe exposure. This incident, dubbed 'Nipplegate,' led to massive FCC fines, increased broadcast delays, and fundamentally changed how live television events are monitored. The controversy overshadowed what was actually an exciting game between the New England Patriots and Carolina Panthers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XXXVIII_halftime_show_controversy",
    "citationTitle": "Wikipedia: Super Bowl XXXVIII halftime show controversy"
  },
  {
    "id": "a6950b9b-1621-4383-b72a-b658f5127d2e",
    "text": "What is the largest point deficit that a team has overcome to win a Super Bowl?",
    "options": [
      "10 points",
      "25 points",
      "21 points",
      "14 points"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The New England Patriots overcame a 25-point deficit against Atlanta in Super Bowl LI.",
    "detailedExplanation": "Super Bowl LI on February 5, 2017, witnessed the greatest comeback in Super Bowl history when the New England Patriots trailed the Atlanta Falcons 28-3 in the third quarter. The Patriots, led by Tom Brady, scored 31 unanswered points to tie the game 28-28 and force the first Super Bowl overtime. They then won 34-28 in overtime, completing a 25-point comeback that many consider the greatest Super Bowl performance ever.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_LI",
    "citationTitle": "Wikipedia: Super Bowl LI"
  },
  {
    "id": "85e95791-db09-48f1-94d4-0345e1ffcdde",
    "text": "Which team scored the fastest touchdown in Super Bowl history, and how long did it take?",
    "options": [
      "Denver Broncos, 8 seconds",
      "Seattle Seahawks, 12 seconds",
      "New England Patriots, 14 seconds",
      "Pittsburgh Steelers, 18 seconds"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Seattle Seahawks scored in 12 seconds against Denver in Super Bowl XLVIII on a safety, then quick touchdown.",
    "detailedExplanation": "In Super Bowl XLVIII on February 2, 2014, the Seattle Seahawks dominated the Denver Broncos from the very first play. The game began with a safety when the snap sailed over Peyton Manning's head into the end zone just 12 seconds into the game. While this was technically a safety, not a touchdown, the Seahawks scored their first touchdown shortly after. The fastest actual touchdown from scrimmage was scored by the Patriots' James White in Super Bowl LI at 2:06 of the first quarter.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XLVIII",
    "citationTitle": "Wikipedia: Super Bowl XLVIII"
  },
  {
    "id": "59483ac4-8769-411b-9aa2-4ec4552b9454",
    "text": "Which Super Bowl was the first to be played in a domed stadium?",
    "options": [
      "Super Bowl IX",
      "Super Bowl XII",
      "Super Bowl XVIII",
      "Super Bowl XXIV"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XII in 1978 was played at the Louisiana Superdome in New Orleans.",
    "detailedExplanation": "Super Bowl XII, played on January 15, 1978, at the Louisiana Superdome in New Orleans, was the first Super Bowl held in a domed stadium. This game saw the Dallas Cowboys defeat the Denver Broncos 27-10. The controlled environment of the dome eliminated weather as a factor, which would become increasingly important as the Super Bowl grew into a major television spectacle requiring optimal playing conditions regardless of the season or location.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XII",
    "citationTitle": "Wikipedia: Super Bowl XII"
  },
  {
    "id": "8c6fb56f-cc32-4b68-b175-ea8b529a7d27",
    "text": "Who is the only player to win Super Bowl MVP awards with two different teams?",
    "options": [
      "Joe Montana",
      "Peyton Manning",
      "Tom Brady",
      "None - no player has done this"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "No player has ever won Super Bowl MVP with two different teams.",
    "detailedExplanation": "Despite several legendary quarterbacks playing for multiple teams and winning Super Bowls with different franchises, no player has ever won the Super Bowl MVP award with two different teams. Peyton Manning won with Indianapolis but was not MVP when Denver won Super Bowl 50. Joe Montana won all his MVPs with San Francisco. Tom Brady won all his Super Bowl MVP awards with New England, despite later winning a Super Bowl with Tampa Bay where he was not named MVP.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_Most_Valuable_Player_Award",
    "citationTitle": "Wikipedia: Super Bowl Most Valuable Player Award"
  },
  {
    "id": "94c6ad71-6f56-4c94-8821-d88a8ef5684d",
    "text": "What was the original name of the Super Bowl trophy before it was renamed in honor of Vince Lombardi?",
    "options": [
      "The NFL Championship Trophy",
      "The World Professional Football Championship Trophy",
      "The Super Bowl Championship Trophy",
      "The Pete Rozelle Trophy"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "It was originally called 'The World Professional Football Championship Trophy.'",
    "detailedExplanation": "The Super Bowl trophy was originally known as 'The World Professional Football Championship Trophy' when it was first awarded in 1967. Following the death of legendary Green Bay Packers coach Vince Lombardi in September 1970, the trophy was renamed the 'Vince Lombardi Trophy' in his honor before Super Bowl V in 1971. Lombardi had led the Packers to victories in the first two Super Bowls, making him a fitting namesake for the NFL's ultimate prize.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vince_Lombardi_Trophy",
    "citationTitle": "Wikipedia: Vince Lombardi Trophy"
  },
  {
    "id": "1ee7a93d-56b6-4e9c-a6c4-a850106fdc84",
    "text": "Which Super Bowl holds the record for the highest television viewership in U.S. history?",
    "options": [
      "Super Bowl XLIX (Patriots vs Seahawks)",
      "Super Bowl LI (Patriots vs Falcons)",
      "Super Bowl XLVI (Giants vs Patriots)",
      "Super Bowl 50 (Broncos vs Panthers)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XLIX drew 114.4 million viewers, the most-watched program in U.S. TV history.",
    "detailedExplanation": "Super Bowl XLIX between the New England Patriots and Seattle Seahawks on February 1, 2015, attracted an average of 114.4 million viewers in the United States, making it the most-watched television program in American history. The game's dramatic finish, which included Malcolm Butler's goal-line interception with 20 seconds remaining, likely contributed to viewers staying tuned throughout the broadcast. This record has stood despite several subsequent Super Bowls drawing massive audiences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XLIX",
    "citationTitle": "Wikipedia: Super Bowl XLIX"
  },
  {
    "id": "f3c03c7e-18c2-42e6-85b0-2c96fd46f6f4",
    "text": "Which quarterback has thrown the most interceptions in Super Bowl history?",
    "options": [
      "Johnny Unitas",
      "John Elway",
      "Peyton Manning",
      "Craig Morton"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "John Elway threw 8 interceptions across his 5 Super Bowl appearances.",
    "detailedExplanation": "John Elway holds the unfortunate record of throwing the most interceptions in Super Bowl history with 8 picks across his five Super Bowl appearances. Despite this record, Elway managed to win two of those Super Bowls (XXXII and XXXIII) late in his career. His interception total was accumulated over more Super Bowl games than most quarterbacks ever play, as he appeared in five Super Bowls between 1987 and 1999, which was a record at the time for quarterback appearances.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Elway",
    "citationTitle": "Wikipedia: John Elway"
  },
  {
    "id": "888d3e53-160f-4cba-9f7b-bef2d6c2bc6b",
    "text": "Which Super Bowl was postponed due to the September 11, 2001 terrorist attacks?",
    "options": [
      "Super Bowl XXXV",
      "Super Bowl XXXVI",
      "Super Bowl XXXVII",
      "None - no Super Bowl was postponed"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XXXVI was moved from January to February 2002 due to the NFL season being extended after 9/11.",
    "detailedExplanation": "Super Bowl XXXVI was originally scheduled to be played in late January 2002, but the September 11, 2001 terrorist attacks led to the postponement of NFL games during Week 2 of the 2001 season. This caused the entire season to be extended by one week, pushing the Super Bowl from its traditional late January date to February 3, 2002. The game was played at the Louisiana Superdome in New Orleans, where the New England Patriots defeated the St. Louis Rams 20-17, beginning the Patriots' dynasty under Tom Brady and Bill Belichick.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XXXVI",
    "citationTitle": "Wikipedia: Super Bowl XXXVI"
  },
  {
    "id": "9492eacd-49dd-490b-92b7-7f5b7b15612e",
    "text": "Which team scored the most points ever in a single Super Bowl game?",
    "options": [
      "San Francisco 49ers in Super Bowl XXIX",
      "Denver Broncos in Super Bowl XXII",
      "Dallas Cowboys in Super Bowl XXVII",
      "Washington Redskins in Super Bowl XXII"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 49ers scored 49 points in Super Bowl XXIX against the Chargers in 1995.",
    "detailedExplanation": "The San Francisco 49ers hold the record for most points scored by a single team in a Super Bowl, putting up 49 points in their 49-26 victory over the San Diego Chargers in Super Bowl XXIX on January 29, 1995. Steve Young threw a Super Bowl record 6 touchdown passes in the game, finally emerging from Joe Montana's shadow to lead the 49ers to their fifth Super Bowl championship. The 49ers' offensive explosion helped them become the first team to win five Super Bowl titles.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XXIX",
    "citationTitle": "Wikipedia: Super Bowl XXIX"
  },
  {
    "id": "d572e860-1a4c-4383-a80e-737f75139b9d",
    "text": "Which Super Bowl featured the first successful onside kick recovery in Super Bowl history?",
    "options": [
      "Super Bowl XXV",
      "Super Bowl XLIV",
      "Super Bowl XL",
      "Super Bowl XLII"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The New Orleans Saints successfully recovered an onside kick to start the second half of Super Bowl XLIV.",
    "detailedExplanation": "Super Bowl XLIV featured the first successful onside kick recovery in Super Bowl history when the New Orleans Saints executed a surprise onside kick to start the second half against the Indianapolis Colts. The play, called 'Ambush,' was perfectly executed by kicker Thomas Morstead and recovered by Chris Reis. This bold strategic decision by head coach Sean Payton helped shift momentum in favor of the Saints, who went on to win their first Super Bowl championship 31-17 on February 7, 2010, in Miami Gardens, Florida.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XLIV",
    "citationTitle": "Wikipedia: Super Bowl XLIV"
  },
  {
    "id": "a47f8d72-e1b2-4071-b19c-876b8827e8c6",
    "text": "Which Super Bowl had the smallest margin of victory in the game's history?",
    "options": [
      "Super Bowl XXV (1 point)",
      "Super Bowl XXXVI (3 points)",
      "Super Bowl XLIX (4 points)",
      "Super Bowl LI (6 points)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XXV ended with the Giants beating the Bills 20-19, a 1-point margin.",
    "detailedExplanation": "Super Bowl XXV holds the record for the smallest margin of victory in Super Bowl history, with the New York Giants defeating the Buffalo Bills 20-19 on January 27, 1991. The game came down to the final seconds when Bills kicker Scott Norwood attempted a 47-yard field goal that sailed wide right, preserving the Giants' one-point victory. This dramatic finish occurred during the Gulf War, adding extra emotional weight to the game, and is remembered as one of the most thrilling Super Bowl conclusions ever.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XXV",
    "citationTitle": "Wikipedia: Super Bowl XXV"
  },
  {
    "id": "7672cb97-f5ad-4397-a0af-3639803291b9",
    "text": "Which defensive player recorded the most sacks in a single Super Bowl game?",
    "options": [
      "Reggie White",
      "Darnell Dockett",
      "Aldon Smith",
      "Multiple players with 2 sacks each"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Several players share the record with 2 sacks in a single Super Bowl, including Reggie White and Darnell Dockett.",
    "detailedExplanation": "The record for most sacks in a single Super Bowl is 2, shared by several players including Reggie White (Super Bowl XXXI), Darnell Dockett (Super Bowl XLIII), Aldon Smith (Super Bowl XLVII), and others. Despite many dominant defensive performances throughout Super Bowl history, no player has managed to record 3 or more sacks in a single game. This relatively modest record reflects both the high level of offensive line play in Super Bowl games and the typically strong game-planning that goes into protecting quarterbacks in the championship game.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Super_Bowl_records",
    "citationTitle": "Wikipedia: List of Super Bowl records"
  },
  {
    "id": "58b10892-e886-4c31-a3ea-3ed7cb7c9a7c",
    "text": "Which Super Bowl was the first to feature two teams that had never won a Super Bowl before?",
    "options": [
      "Super Bowl XL",
      "Super Bowl XXXV",
      "Super Bowl XLI",
      "Super Bowl XLVIII"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XXXV featured the Ravens and Giants, both seeking their first Super Bowl title, though the Giants had won pre-Super Bowl era championships.",
    "detailedExplanation": "Super Bowl XXXV between the Baltimore Ravens and New York Giants was the first Super Bowl to feature two franchises that had never won a Super Bowl championship, though this requires clarification since the Giants had won NFL championships in the pre-Super Bowl era. The Ravens, as a relatively new franchise (founded in 1996), had never won a Super Bowl, while the Giants hadn't won since Super Bowl XXI and XXV. The Ravens won 34-7 on January 28, 2001, capturing their first Super Bowl title behind one of the greatest defenses in NFL history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XXXV",
    "citationTitle": "Wikipedia: Super Bowl XXXV"
  },
  {
    "id": "9a7d936b-08cb-45b3-b54f-7a639bce8ec0",
    "text": "Which Super Bowl featured the longest play from scrimmage in Super Bowl history, and what type of play was it?",
    "options": [
      "Super Bowl XLVIII - 87-yard touchdown pass from Peyton Manning to Demaryius Thomas",
      "Super Bowl XL - 85-yard touchdown run by Willie Parker",
      "Super Bowl XLIII - 100-yard interception return by James Harrison",
      "Super Bowl XXXVII - 76-yard touchdown pass from Brad Johnson to Keenan McCardell"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Willie Parker's 85-yard touchdown run in Super Bowl XL is the longest play from scrimmage in Super Bowl history.",
    "detailedExplanation": "In Super Bowl XL between the Pittsburgh Steelers and Seattle Seahawks, Willie Parker broke free for an 85-yard touchdown run in the third quarter, which stands as the longest play from scrimmage (rushing or passing) in Super Bowl history. This play helped the Steelers secure their 21-10 victory. Note that while James Harrison's 100-yard interception return in Super Bowl XLIII was longer, it was not a play from scrimmage as it began with a defensive turnover.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XL",
    "citationTitle": "Wikipedia: Super Bowl XL"
  },
  {
    "id": "b9a34e9b-9701-4f2c-9445-e89fc6697888",
    "text": "Which Super Bowl featured the first successful two-point conversion in the game's history?",
    "options": [
      "Super Bowl XXIX - San Francisco 49ers vs San Diego Chargers",
      "Super Bowl XXX - Dallas Cowboys vs Pittsburgh Steelers",
      "Super Bowl XXXI - Green Bay Packers vs New England Patriots",
      "Super Bowl XXXII - Denver Broncos vs Green Bay Packers"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XXIX featured the first successful two-point conversion when the 49ers converted after a touchdown.",
    "detailedExplanation": "Super Bowl XXIX in 1995 between the San Francisco 49ers and San Diego Chargers was notable for featuring the NFL's first successful two-point conversion in Super Bowl history. The two-point conversion rule had been adopted by the NFL in 1994, making this Super Bowl the second since the rule's implementation. The 49ers dominated the game 49-26, and their successful two-point conversion was part of their record-setting offensive performance that included 455 total yards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XXIX",
    "citationTitle": "Wikipedia: Super Bowl XXIX"
  },
  {
    "id": "ddb132e4-1fa5-4385-837c-45955c9ea0d8",
    "text": "Which head coach has the most Super Bowl losses without ever winning one?",
    "options": [
      "Jim Kelly with 4 losses",
      "Marv Levy with 4 losses",
      "Dan Reeves with 4 losses",
      "Bud Grant with 4 losses"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Marv Levy coached the Buffalo Bills to four consecutive Super Bowl appearances from 1991-1994, losing all four games.",
    "detailedExplanation": "Marv Levy holds the unfortunate record of most Super Bowl losses by a head coach without a victory, having led the Buffalo Bills to four consecutive Super Bowl defeats from 1991 to 1994 (Super Bowls XXV, XXVI, XXVII, and XXVIII). This remarkable streak of four straight AFC Championships was overshadowed by the team's inability to capture the ultimate prize. Dan Reeves also lost four Super Bowls as a head coach (three with Denver, one with Atlanta) but is tied with Levy rather than having more losses. Note that Jim Kelly was a player, not a coach.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marv_Levy",
    "citationTitle": "Wikipedia: Marv Levy"
  },
  {
    "id": "c782816d-4ff4-4593-8f3d-40da27e0ef6e",
    "text": "What unique weather condition affected Super Bowl XLVIII, making it the first Super Bowl played under these circumstances?",
    "options": [
      "It was played in freezing temperatures below 32°F",
      "It was played during a snowstorm with active precipitation",
      "It was the first Super Bowl played outdoors in a cold-weather city",
      "It was played with wind speeds exceeding 25 mph"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Bowl XLVIII was the first Super Bowl played outdoors in a cold-weather city (New York/New Jersey area).",
    "detailedExplanation": "Super Bowl XLVIII in 2014 at MetLife Stadium in East Rutherford, New Jersey, was groundbreaking as the first Super Bowl played outdoors in a cold-weather city. Previous cold-weather Super Bowls had been played in domed stadiums (like Detroit or Minneapolis), while outdoor Super Bowls had been held in warm-weather locations. Despite concerns about potential harsh weather conditions, game day featured relatively mild temperatures in the 40s°F with no precipitation, allowing the Seattle Seahawks to defeat the Denver Broncos 43-8 without weather becoming a significant factor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_XLVIII",
    "citationTitle": "Wikipedia: Super Bowl XLVIII"
  }
]