[
  {
    "id": "dadd4f57-b8c1-4876-8824-c1cad98b3489",
    "text": "Which political party has ruled the People's Republic of China since 1949?",
    "options": [
      "Chinese Nationalist Party",
      "Communist Party of China",
      "China Democratic League",
      "Revolutionary Committee of the Chinese Kuomintang"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Communist Party of China has been the sole ruling party of mainland China since 1949.",
    "detailedExplanation": "The Communist Party of China (CPC) established control over mainland China in 1949 after defeating the Nationalist forces in the Chinese Civil War. Led initially by Mao Zedong, the CPC has maintained single-party rule for over 70 years, making it one of the longest-ruling political parties in modern history. The party operates under a system of democratic centralism and has overseen China's transformation from an agricultural economy to the world's second-largest economy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Communist_Party_of_China",
    "citationTitle": "Wikipedia: Communist Party of China"
  },
  {
    "id": "a918d8d3-17a4-4e86-80d1-3f8001901644",
    "text": "What is the name of the main conservative political party in the United Kingdom?",
    "options": [
      "Liberal Democrats",
      "Conservative Party",
      "Labour Party",
      "UK Independence Party"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Conservative Party, also known as the Tories, is the UK's main center-right political party.",
    "detailedExplanation": "The Conservative Party, officially known as the Conservative and Unionist Party, is one of the UK's oldest political parties, founded in 1834. Often referred to as the Tories, the party has produced many British Prime Ministers and traditionally advocates for free-market economics, strong national defense, and traditional values. The party has been in government for much of the 20th and early 21st centuries, including under leaders like Winston Churchill, Margaret Thatcher, and more recently Boris Johnson.",
    "citationUrl": "https://en.wikipedia.org/wiki/Conservative_Party_(UK)",
    "citationTitle": "Wikipedia: Conservative Party (UK)"
  },
  {
    "id": "38f6015e-a82d-412a-8143-f0658b97a305",
    "text": "Which political party does Emmanuel Macron belong to in France?",
    "options": [
      "La République En Marche!",
      "National Rally",
      "Socialist Party",
      "The Republicans"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Emmanuel Macron founded and leads La République En Marche!, a centrist political party.",
    "detailedExplanation": "Emmanuel Macron founded La République En Marche! (Republic On The Move!) in 2016, initially as a political movement before it became a formal party. The centrist party was created to transcend traditional left-right divisions in French politics. Macron successfully ran for President in 2017 as the party's candidate, defeating Marine Le Pen in the runoff election. The party positions itself as pro-European, liberal, and reformist, appealing to voters from both the center-left and center-right.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_R%C3%A9publique_En_Marche!",
    "citationTitle": "Wikipedia: La République En Marche!"
  },
  {
    "id": "20612d39-6adb-444e-b6e5-04e06f93e7d3",
    "text": "What are the two main political parties in the United States?",
    "options": [
      "Republicans and Libertarians",
      "Democrats and Green Party",
      "Democrats and Republicans",
      "Republicans and Tea Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Democratic Party and Republican Party are the two dominant political parties in the US.",
    "detailedExplanation": "The United States operates under a two-party system dominated by the Democratic Party and the Republican Party. The Democratic Party, founded in 1828, is generally considered center-left and supports progressive policies, while the Republican Party, founded in 1854, is generally conservative. These two parties have alternated control of the presidency and Congress for over 150 years. While third parties exist, the electoral system and political structure make it extremely difficult for them to compete at the national level.",
    "citationUrl": "https://en.wikipedia.org/wiki/Political_parties_in_the_United_States",
    "citationTitle": "Wikipedia: Political parties in the United States"
  },
  {
    "id": "dace954b-14a6-4ac9-8049-09fd08a7b9dd",
    "text": "Which party has Narendra Modi belonged to as Prime Minister of India?",
    "options": [
      "Indian National Congress",
      "Bharatiya Janata Party",
      "Aam Aadmi Party",
      "Communist Party of India"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Narendra Modi is a member of the Bharatiya Janata Party (BJP) and has served as Prime Minister since 2014.",
    "detailedExplanation": "The Bharatiya Janata Party (BJP), meaning 'Indian People's Party,' is a right-wing political party that has been one of India's major political forces since the 1980s. Narendra Modi, who previously served as Chief Minister of Gujarat, became the party's prime ministerial candidate and led the BJP to decisive victories in 2014 and 2019. The party promotes Hindu nationalism and economic liberalization, positioning itself as an alternative to the historically dominant Indian National Congress party.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bharatiya_Janata_Party",
    "citationTitle": "Wikipedia: Bharatiya Janata Party"
  },
  {
    "id": "8cedcd65-2273-46eb-a32c-ceaa928eca6f",
    "text": "What is the name of the social democratic party that has historically been dominant in Sweden?",
    "options": [
      "Swedish Social Democratic Party",
      "Moderate Party",
      "Sweden Democrats",
      "Centre Party"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Swedish Social Democratic Party has been Sweden's largest party and governed for most of the 20th century.",
    "detailedExplanation": "The Swedish Social Democratic Party (Sveriges socialdemokratiska arbetareparti) has been the dominant political force in Sweden for most of the past century, governing for about 65 of the last 90 years. Founded in 1889, the party is credited with building Sweden's comprehensive welfare state and promoting the 'Swedish Model' of social democracy that combines free markets with strong social safety nets. The party has produced many long-serving Prime Ministers and has been instrumental in shaping modern Swedish society.",
    "citationUrl": "https://en.wikipedia.org/wiki/Swedish_Social_Democratic_Party",
    "citationTitle": "Wikipedia: Swedish Social Democratic Party"
  },
  {
    "id": "6da70014-f577-4ce6-8283-1d884cccfffb",
    "text": "Which political party does Angela Merkel belong to in Germany?",
    "options": [
      "Social Democratic Party",
      "Alternative for Germany",
      "Christian Democratic Union",
      "Free Democratic Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Angela Merkel was the leader of the Christian Democratic Union (CDU) and served as German Chancellor from 2005 to 2021.",
    "detailedExplanation": "Angela Merkel belonged to the Christian Democratic Union of Germany (CDU), a center-right political party founded in 1945. As party leader from 2000 to 2018 and German Chancellor from 2005 to 2021, Merkel became one of the most influential politicians in modern European history. The CDU traditionally represents Christian democratic values, supporting social market economics and European integration. Under Merkel's leadership, the party maintained its position as Germany's largest political party for most of her tenure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christian_Democratic_Union_of_Germany",
    "citationTitle": "Wikipedia: Christian Democratic Union of Germany"
  },
  {
    "id": "36f42862-907a-4996-a5cf-22ae2b34f615",
    "text": "What is the name of the ruling party in South Africa that came to power after apartheid ended?",
    "options": [
      "Democratic Alliance",
      "Economic Freedom Fighters",
      "African National Congress",
      "Inkatha Freedom Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The African National Congress (ANC) has governed South Africa since the first democratic elections in 1994.",
    "detailedExplanation": "The African National Congress (ANC) is South Africa's ruling party and the oldest liberation movement on the African continent, founded in 1912. The ANC fought against apartheid for decades, with leaders like Nelson Mandela spending years in prison for their activism. When apartheid ended and South Africa held its first democratic elections in 1994, the ANC won a decisive victory with Mandela becoming the country's first Black president. The party has won every national election since then, though with declining margins in recent years.",
    "citationUrl": "https://en.wikipedia.org/wiki/African_National_Congress",
    "citationTitle": "Wikipedia: African National Congress"
  },
  {
    "id": "f2680323-4f1a-47cd-b58e-620c8beaacb4",
    "text": "Which political party's symbol is the hammer and sickle?",
    "options": [
      "Labour Party",
      "Communist Party",
      "Socialist Party",
      "Green Party"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The hammer and sickle is the internationally recognized symbol of Communist parties worldwide.",
    "detailedExplanation": "The hammer and sickle symbol represents the unity of industrial and agricultural workers and has been adopted by Communist parties around the world since the early 20th century. It originated in the Soviet Union and became the universal symbol for communist movements globally, appearing on flags, party emblems, and propaganda materials of various national Communist parties.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hammer_and_sickle",
    "citationTitle": "Wikipedia: Hammer and sickle"
  },
  {
    "id": "d7459ec9-0ef5-467a-9a26-1a715b4da941",
    "text": "What color is traditionally associated with Labour and Social Democratic parties worldwide?",
    "options": [
      "Blue",
      "Green",
      "Red",
      "Yellow"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Red is the traditional color of Labour, Social Democratic, and socialist parties globally.",
    "detailedExplanation": "Red has been the symbolic color of left-wing political movements since the 19th century, representing workers' rights and social democracy. Labour parties, Social Democratic parties, and socialist movements worldwide commonly use red in their logos, flags, and campaign materials. This tradition stems from the red flag being a symbol of revolution and workers' solidarity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Red_flag_(politics)",
    "citationTitle": "Wikipedia: Red flag (politics)"
  },
  {
    "id": "ccdae9e2-7dd2-4a80-a054-ad35988b99db",
    "text": "Which Canadian political party is led by Justin Trudeau?",
    "options": [
      "Conservative Party",
      "New Democratic Party",
      "Liberal Party",
      "Bloc Québécois"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Justin Trudeau is the leader of Canada's Liberal Party and has served as Prime Minister since 2015.",
    "detailedExplanation": "Justin Trudeau became leader of the Liberal Party of Canada in 2013 and led the party to victory in the 2015 federal election, becoming Prime Minister. The Liberal Party is one of Canada's oldest political parties, traditionally positioned in the center of the political spectrum. Trudeau succeeded his father Pierre Trudeau's legacy, who also served as a Liberal Prime Minister.",
    "citationUrl": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "citationTitle": "Wikipedia: Justin Trudeau"
  },
  {
    "id": "7574aec9-8104-4058-aa6c-cd91aa2e0245",
    "text": "What is the name of the main political party that supports Scottish independence?",
    "options": [
      "Scottish Labour",
      "Scottish Conservatives",
      "Scottish National Party",
      "Scottish Liberal Democrats"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Scottish National Party (SNP) is the main pro-independence party in Scotland.",
    "detailedExplanation": "The Scottish National Party, founded in 1934, is Scotland's largest political party and the primary advocate for Scottish independence from the United Kingdom. The SNP has dominated Scottish politics since 2007, controlling the Scottish Parliament and most Scottish seats in the UK Parliament. The party led the campaign for the 'Yes' vote in the 2014 Scottish independence referendum.",
    "citationUrl": "https://en.wikipedia.org/wiki/Scottish_National_Party",
    "citationTitle": "Wikipedia: Scottish National Party"
  },
  {
    "id": "57c88a8b-1422-4fc4-8880-7a9a11f493c0",
    "text": "Which political party founded by Nelson Mandela governed South Africa before the ANC?",
    "options": [
      "Democratic Alliance",
      "Economic Freedom Fighters",
      "None - the ANC was Mandela's party",
      "Inkatha Freedom Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Nelson Mandela was a founding member and leader of the African National Congress (ANC), not founder of a different party.",
    "detailedExplanation": "Nelson Mandela joined the African National Congress in 1943 and became one of its most prominent leaders in the fight against apartheid. He did not found a separate political party but remained loyal to the ANC throughout his political career. After his release from prison in 1990, Mandela led the ANC in negotiations to end apartheid and became South Africa's first Black president in 1994 under the ANC banner.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nelson_Mandela",
    "citationTitle": "Wikipedia: Nelson Mandela"
  },
  {
    "id": "af61ddfb-6a9e-4197-9245-cffc04f83704",
    "text": "Which Australian political party uses a kangaroo as part of its unofficial symbolism?",
    "options": [
      "Liberal Party",
      "Labor Party",
      "Greens",
      "One Nation"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Australian Labor Party has historically used kangaroo imagery in some of its campaigns and symbolism.",
    "detailedExplanation": "While not an official logo, the kangaroo has appeared in various Australian Labor Party campaigns and materials over the years as a symbol representing Australian nationalism and working-class values. The Labor Party, founded in 1891, is one of Australia's two major political parties and has traditionally represented trade unions and workers' interests. The party's official symbol is typically the red rose.",
    "citationUrl": "https://en.wikipedia.org/wiki/Australian_Labor_Party",
    "citationTitle": "Wikipedia: Australian Labor Party"
  },
  {
    "id": "66b38e8f-5b99-4001-8cd8-8d86d1d1b96d",
    "text": "What does 'GOP' stand for in American politics?",
    "options": [
      "Great Old Party",
      "Grand Old Party",
      "General Organization Party",
      "Government Official Party"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "GOP stands for 'Grand Old Party,' a nickname for the Republican Party in the United States.",
    "detailedExplanation": "The term 'Grand Old Party' became a popular nickname for the Republican Party in the 1880s, emphasizing the party's role in preserving the Union during the Civil War and its established position in American politics. The acronym GOP is now widely used in media, political discourse, and official contexts to refer to the Republican Party, one of the two major political parties in the United States.",
    "citationUrl": "https://en.wikipedia.org/wiki/Republican_Party_(United_States)",
    "citationTitle": "Wikipedia: Republican Party (United States)"
  },
  {
    "id": "535c558c-e845-4acf-a9c7-84b9d3503523",
    "text": "Which Japanese political party dominated the country's politics for most of the post-WWII era?",
    "options": [
      "Democratic Party",
      "Liberal Democratic Party",
      "Social Democratic Party",
      "Communist Party"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Liberal Democratic Party (LDP) has ruled Japan for most of the post-war period since 1955.",
    "detailedExplanation": "The Liberal Democratic Party of Japan was formed in 1955 and has been the dominant political force in Japanese politics, holding power for all but about four years since its formation. Despite its name, the LDP is considered a center-right conservative party. This period of LDP dominance is often referred to as the '1955 System' in Japanese politics, characterized by stable, business-friendly governance that oversaw Japan's economic miracle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Liberal_Democratic_Party_(Japan)",
    "citationTitle": "Wikipedia: Liberal Democratic Party (Japan)"
  },
  {
    "id": "27ebf3c9-89e3-4e09-b931-7a5264c6acb5",
    "text": "Which political party won the most seats in Italy's 2022 general election?",
    "options": [
      "Five Star Movement",
      "Brothers of Italy",
      "Democratic Party",
      "Lega"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Brothers of Italy (Fratelli d'Italia) won the most seats in Italy's 2022 election.",
    "detailedExplanation": "Brothers of Italy, led by Giorgia Meloni, emerged as the largest party in Italy's September 2022 general election, winning approximately 26% of the vote and the most parliamentary seats. This victory made Meloni Italy's first female Prime Minister and marked the rise of a right-wing coalition government. The party has its roots in the post-fascist Italian Social Movement but has evolved into a mainstream conservative party.",
    "citationUrl": "https://en.wikipedia.org/wiki/2022_Italian_general_election",
    "citationTitle": "Wikipedia: 2022 Italian general election"
  },
  {
    "id": "7b4952df-9d5c-4d58-91cf-9e0f4c83bbb7",
    "text": "What is the name of the political party founded by Volodymyr Zelensky in Ukraine?",
    "options": [
      "European Solidarity",
      "Servant of the People",
      "Opposition Platform",
      "Fatherland"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Servant of the People was founded by Zelensky and won the 2019 Ukrainian parliamentary election.",
    "detailedExplanation": "Servant of the People (Sluha Narodu) was established by Volodymyr Zelensky in 2018, named after the popular television series in which he starred as a fictional president of Ukraine. The party ran on an anti-corruption, pro-European platform and achieved a remarkable electoral success in 2019, winning an absolute majority in the Ukrainian parliament. This made Zelensky's transition from comedian and actor to president one of the most unusual political rises in modern history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Servant_of_the_People_(political_party)",
    "citationTitle": "Wikipedia: Servant of the People (political party)"
  },
  {
    "id": "13efa51c-ab3b-4143-bb2d-1ebe91428409",
    "text": "Which Brazilian political party was founded by former president Luiz Inácio Lula da Silva?",
    "options": [
      "Brazilian Democratic Movement",
      "Workers' Party",
      "Brazilian Social Democracy Party",
      "Party of National Mobilization"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Workers' Party (Partido dos Trabalhadores) was co-founded by Lula in 1980.",
    "detailedExplanation": "The Workers' Party (Partido dos Trabalhadores, PT) was founded in 1980 by a coalition of trade union leaders, intellectuals, and social activists, with Lula da Silva as one of its key founders. The party emerged from Brazil's labor movement during the country's transition from military dictatorship to democracy. Under Lula's leadership, the PT became Brazil's dominant left-wing party, with Lula serving as president from 2003 to 2011, followed by Dilma Rousseff from 2011 to 2016.",
    "citationUrl": "https://en.wikipedia.org/wiki/Workers%27_Party_(Brazil)",
    "citationTitle": "Wikipedia: Workers' Party (Brazil)"
  },
  {
    "id": "e9e129b6-9ba1-49ba-b5c5-d24c8c8192f8",
    "text": "Which animal symbol is famously used by Russia's United Russia party?",
    "options": [
      "Eagle",
      "Bear",
      "Wolf",
      "Lion"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The bear is the symbol of United Russia, reflecting traditional Russian symbolism.",
    "detailedExplanation": "United Russia uses the bear as its official symbol, which resonates deeply with Russian cultural identity as the bear has long been associated with Russia in popular imagination and folklore. United Russia has been the dominant political party in Russia since the early 2000s and is closely associated with Vladimir Putin's presidency. The bear symbol appears on the party's logo and campaign materials, reinforcing themes of strength and Russian national identity.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Russia",
    "citationTitle": "Wikipedia: United Russia"
  }
]