[
  {
    "id": "32b2a613-6f27-4277-b9f3-c88cd4951973",
    "text": "Which political party holds the record for the longest continuous rule by a single party in a democracy, governing Japan for 54 of 64 years between 1955-2019?",
    "options": [
      "Democratic Party of Japan",
      "Liberal Democratic Party",
      "Japan Socialist Party",
      "Komeito"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Liberal Democratic Party (LDP) dominated Japanese politics from 1955-2009 with only brief interruptions.",
    "detailedExplanation": "Japan's Liberal Democratic Party established what political scientists call the '1955 System' - a period of near-continuous conservative rule that lasted until 2009. The LDP governed Japan for 54 out of 64 years, making it one of the most successful political parties in democratic history. This dominance was built on economic growth, strong rural support, and effective coalition-building, though it was briefly interrupted by coalition governments in the 1990s and the Democratic Party of Japan's rule from 2009-2012.",
    "citationUrl": "https://en.wikipedia.org/wiki/Liberal_Democratic_Party_(Japan)",
    "citationTitle": "Wikipedia: Liberal Democratic Party (Japan)"
  },
  {
    "id": "e2913e56-0c1e-4be5-99db-c7e9b2465b03",
    "text": "The African National Congress (ANC) has won every South African national election since 1994, but which party currently serves as the official opposition?",
    "options": [
      "Economic Freedom Fighters",
      "Democratic Alliance",
      "Inkatha Freedom Party",
      "Freedom Front Plus"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Democratic Alliance became the official opposition after winning the second-most seats in parliament.",
    "detailedExplanation": "The Democratic Alliance (DA) has served as South Africa's official opposition since 2009, consistently winning the second-highest number of parliamentary seats after the ANC. Founded through mergers of liberal and centrist parties, the DA has its strongest support base in the Western Cape province and among urban, educated voters. The party advocates for liberal democracy, free market economics, and non-racial politics, positioning itself as the primary alternative to ANC governance in post-apartheid South Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/Democratic_Alliance_(South_Africa)",
    "citationTitle": "Wikipedia: Democratic Alliance (South Africa)"
  },
  {
    "id": "97fe7834-f4ad-4ac8-b42b-26db6cea7972",
    "text": "Which European political party was founded by comedian Beppe Grillo and became the largest single party in Italy's 2018 general election?",
    "options": [
      "Lega",
      "Five Star Movement",
      "Brothers of Italy",
      "Forza Italia"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Five Star Movement, founded by comedian Beppe Grillo, won the most votes in Italy's 2018 election.",
    "detailedExplanation": "The Five Star Movement (Movimento 5 Stelle) was established in 2009 by comedian and activist Beppe Grillo as an anti-establishment, populist party. Using digital democracy and online platforms for decision-making, the party campaigned on anti-corruption, environmental issues, and Euroscepticism. In the 2018 Italian general election, M5S won 32.7% of the vote, making it the largest single party, though it needed to form a coalition government. The party's success represented a dramatic shift in Italian politics toward populist movements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Five_Star_Movement",
    "citationTitle": "Wikipedia: Five Star Movement"
  },
  {
    "id": "c0ed1157-b821-4eef-8875-87a040c35564",
    "text": "What is the name of the world's oldest continuously active political party, founded in 1792 in the United States?",
    "options": [
      "Federalist Party",
      "Democratic-Republican Party",
      "Democratic Party",
      "Whig Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Democratic Party traces its origins to 1792, making it the world's oldest continuously active political party.",
    "detailedExplanation": "The Democratic Party claims the distinction of being the world's oldest continuously active political party, tracing its roots back to the Democratic-Republican Party founded by Thomas Jefferson and James Madison in 1792. The party evolved through various iterations, including the Democratic-Republican Party (1792-1834) and officially became the Democratic Party in the 1830s under Andrew Jackson. Despite significant ideological shifts throughout its history, particularly regarding civil rights and federal power, the party has maintained organizational continuity for over two centuries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Democratic_Party_(United_States)",
    "citationTitle": "Wikipedia: Democratic Party (United States)"
  },
  {
    "id": "24d6ee2c-c039-4a22-8370-e54a4ec2fa0c",
    "text": "Which political party dominated Mexican politics for 71 consecutive years until losing the presidency in 2000?",
    "options": [
      "National Action Party (PAN)",
      "Party of the Democratic Revolution (PRD)",
      "Institutional Revolutionary Party (PRI)",
      "Labor Party (PT)"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Institutional Revolutionary Party (PRI) ruled Mexico from 1929 to 2000, one of the longest single-party dominances in modern history.",
    "detailedExplanation": "The Institutional Revolutionary Party (Partido Revolucionario Institucional - PRI) maintained power in Mexico from 1929 to 2000, creating what was effectively a one-party state despite holding regular elections. The PRI's rule was characterized by corporatism, patronage networks, and electoral manipulation. This 71-year dominance ended when Vicente Fox of the National Action Party (PAN) won the 2000 presidential election, marking Mexico's transition to genuine multiparty democracy. The PRI's long rule is considered one of the most durable authoritarian systems of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Institutional_Revolutionary_Party",
    "citationTitle": "Wikipedia: Institutional Revolutionary Party"
  },
  {
    "id": "965999d1-524a-42dd-ab27-a805b3ddbea9",
    "text": "In which country would you find the Pirate Party, which first gained parliamentary representation in 2009 and focuses on digital rights and government transparency?",
    "options": [
      "Germany",
      "Sweden",
      "Netherlands",
      "Iceland"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Swedish Pirate Party was the first to gain parliamentary representation, winning seats in the European Parliament in 2009.",
    "detailedExplanation": "The Pirate Party movement began in Sweden in 2006, founded by Rick Falkvinge to advocate for digital rights, internet freedom, and government transparency. The Swedish Pirate Party achieved a historic breakthrough in 2009 when it won two seats in the European Parliament, becoming the first Pirate Party to gain significant electoral success. The party's platform focuses on reforming copyright and patent laws, protecting privacy rights, and increasing government transparency. The success in Sweden inspired similar Pirate Parties worldwide, with the movement spreading to over 40 countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pirate_Party",
    "citationTitle": "Wikipedia: Pirate Party"
  },
  {
    "id": "03637952-76f7-46bf-8713-716a428b7b75",
    "text": "Which Indian political party, founded in 2012, won 67 out of 70 seats in the Delhi state election just two years after its formation?",
    "options": [
      "Bharatiya Janata Party",
      "Indian National Congress",
      "Aam Aadmi Party",
      "Bahujan Samaj Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Aam Aadmi Party achieved a landslide victory in Delhi's 2015 state election, winning 67 of 70 seats.",
    "detailedExplanation": "The Aam Aadmi Party (AAP), meaning 'Common Man's Party,' was founded in 2012 by anti-corruption activist Arvind Kejriwal. Emerging from the India Against Corruption movement, AAP positioned itself as an alternative to traditional parties, focusing on anti-corruption measures, transparency, and populist policies. In the 2015 Delhi Legislative Assembly election, AAP achieved a stunning victory by winning 67 out of 70 seats, reducing both the BJP and Congress to minimal representation. This victory demonstrated the potential for new political movements to rapidly gain power in Indian democracy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aam_Aadmi_Party",
    "citationTitle": "Wikipedia: Aam Aadmi Party"
  },
  {
    "id": "2bde2153-251e-44e3-9fce-8c21f3030a83",
    "text": "Which Canadian political party, despite never forming a federal government, won 54 seats in 1993 and advocates for Quebec independence?",
    "options": [
      "New Democratic Party",
      "Bloc Québécois",
      "Green Party of Canada",
      "People's Party of Canada"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Bloc Québécois won 54 seats in 1993, becoming the official opposition despite being a regional separatist party.",
    "detailedExplanation": "The Bloc Québécois, founded in 1991, achieved the unique distinction of becoming Canada's official opposition in 1993 despite only running candidates in Quebec. The party won 54 seats and formed the official opposition under Lucien Bouchard, making it the first time a regional party advocating for independence held this position in Canadian history. The Bloc's primary goal is to promote Quebec's interests in Ottawa and eventually achieve Quebec independence. This unusual situation highlighted the regional nature of Canadian politics and the strength of Quebec nationalism in federal elections.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bloc_Qu%C3%A9b%C3%A9cois",
    "citationTitle": "Wikipedia: Bloc Québécois"
  },
  {
    "id": "eb16c7e1-e457-4349-9003-3c3fa4f60862",
    "text": "Which political party founded by Nelson Mandela's former wife became South Africa's third-largest party after splitting from the ANC in 2013?",
    "options": [
      "Economic Freedom Fighters",
      "Democratic Alliance",
      "United Democratic Movement",
      "African Christian Democratic Party"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Economic Freedom Fighters (EFF) was founded by Julius Malema in 2013 and became South Africa's third-largest political party.",
    "detailedExplanation": "The Economic Freedom Fighters was established in 2013 by Julius Malema, a former ANC Youth League president who was expelled from the ANC. The party advocates for radical economic transformation, land redistribution without compensation, and nationalization of mines and banks. In their first election in 2014, they won 6.35% of the vote and 25 seats, becoming the third-largest party in Parliament. The party is known for its red berets and militant rhetoric, positioning itself as a more radical alternative to the governing ANC.",
    "citationUrl": "https://en.wikipedia.org/wiki/Economic_Freedom_Fighters",
    "citationTitle": "Wikipedia: Economic Freedom Fighters"
  },
  {
    "id": "12a48abc-e164-432b-9050-f8f2f1681401",
    "text": "Which communist party governed the world's most populous country for over 70 years and still maintains single-party rule today?",
    "options": [
      "Communist Party of Vietnam",
      "Communist Party of Cuba",
      "Communist Party of China",
      "Workers' Party of Korea"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Communist Party of China has ruled China since 1949 and continues to maintain single-party control over the world's most populous nation.",
    "detailedExplanation": "The Communist Party of China (CPC) has been the sole governing party of China since the establishment of the People's Republic of China in 1949. Founded in 1921, the party came to power after winning the Chinese Civil War against the Kuomintang. Under leaders from Mao Zedong to Xi Jinping, the CPC has overseen China's transformation from an agricultural economy to the world's second-largest economy while maintaining strict political control. With over 95 million members, it is the world's second-largest political party after India's Bharatiya Janata Party.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chinese_Communist_Party",
    "citationTitle": "Wikipedia: Chinese Communist Party"
  },
  {
    "id": "a4e60dc4-47e0-48c7-9663-1f0be75c87f3",
    "text": "Which far-right political party, led by Marine Le Pen, reached the final round of France's presidential election in both 2017 and 2022?",
    "options": [
      "Alternative for Germany",
      "National Rally",
      "League",
      "Vox"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The National Rally (formerly National Front) led by Marine Le Pen reached the runoff in both 2017 and 2022 French presidential elections.",
    "detailedExplanation": "The National Rally (Rassemblement National), formerly known as the National Front, is a far-right political party in France founded in 1972 by Jean-Marie Le Pen. His daughter Marine Le Pen took over leadership in 2011 and has worked to 'detoxify' the party's image while maintaining its core nationalist and anti-immigration positions. Under her leadership, the party has achieved unprecedented electoral success, with Le Pen reaching the second round of the presidential election in 2017 (losing to Emmanuel Macron 66.1% to 33.9%) and again in 2022 (losing 58.5% to 41.5%).",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Rally",
    "citationTitle": "Wikipedia: National Rally"
  },
  {
    "id": "60570882-44d3-4930-8197-fd7adfa08d15",
    "text": "Which political party, founded by former London mayor Ken Livingstone ally George Galloway, is known for its anti-war stance and has won parliamentary seats in both England and Scotland?",
    "options": [
      "UKIP",
      "Respect Party",
      "Green Party",
      "Liberal Democrats"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Respect Party was co-founded by George Galloway in 2004 and is known for its anti-war positions and left-wing politics.",
    "detailedExplanation": "The Respect Party was founded in 2004 by George Galloway and other left-wing activists, primarily in opposition to the Iraq War. The party's full name is 'Respect – The Unity Coalition' and it combines socialist policies with appeals to Muslim communities, particularly regarding foreign policy issues in the Middle East. Galloway has won parliamentary seats for the party in Bethnal Green and Bow (2005-2010) and Bradford West (2012-2015), demonstrating the party's ability to mobilize anti-establishment sentiment. Despite internal splits and limited electoral success beyond Galloway's personal appeal, the party remains active in British politics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Respect_Party",
    "citationTitle": "Wikipedia: Respect Party"
  },
  {
    "id": "e9b40ea4-f3c6-4209-a066-1e1130c92032",
    "text": "Which Brazilian political party was founded by former metalworker and union leader Luiz Inácio Lula da Silva and governed Brazil from 2003-2016?",
    "options": [
      "Brazilian Social Democracy Party",
      "Workers' Party",
      "Democratic Labour Party",
      "Brazilian Democratic Movement"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Workers' Party (Partido dos Trabalhadores) was co-founded by Lula in 1980 and governed Brazil under Lula and Dilma Rousseff from 2003-2016.",
    "detailedExplanation": "The Workers' Party (Partido dos Trabalhadores, PT) was founded in 1980 by trade union leaders, intellectuals, and social activists including future president Luiz Inácio Lula da Silva. The party emerged from Brazil's labor movement during the country's transition from military dictatorship to democracy. After three unsuccessful presidential campaigns by Lula, the PT finally came to power in 2003 and governed for 13 years under Lula (2003-2011) and Dilma Rousseff (2011-2016). The party implemented significant social programs that lifted millions out of poverty but was later engulfed in corruption scandals that led to Rousseff's impeachment in 2016 and Lula's imprisonment (later overturned).",
    "citationUrl": "https://en.wikipedia.org/wiki/Workers%27_Party_(Brazil)",
    "citationTitle": "Wikipedia: Workers' Party (Brazil)"
  },
  {
    "id": "0c3029af-5c95-44ee-8e48-60a5db80a025",
    "text": "Which Australian political party, founded in the 1990s by Pauline Hanson, is known for its anti-immigration policies and nationalist positions?",
    "options": [
      "Liberal Party",
      "One Nation",
      "Palmer United Party",
      "Australian Conservatives"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "One Nation was founded by Pauline Hanson in 1997 and is known for its populist, anti-immigration, and nationalist political platform.",
    "detailedExplanation": "Pauline Hanson's One Nation was established in 1997 by Pauline Hanson after she was disendorsed by the Liberal Party. The party gained national attention with Hanson's controversial maiden speech in Parliament, which criticized multiculturalism and Indigenous welfare programs. One Nation advocates for reduced immigration, Australian nationalism, and populist economic policies. After initial success in the late 1990s, the party declined but experienced a resurgence in the 2010s, winning Senate seats and influencing national debate on immigration and Islam. The party represents a significant populist force in Australian politics, similar to nationalist movements in other Western democracies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pauline_Hanson%27s_One_Nation",
    "citationTitle": "Wikipedia: Pauline Hanson's One Nation"
  },
  {
    "id": "03156b5a-2c93-42eb-a497-ab5cdf9d157f",
    "text": "Which German political party, founded in 2013 as an anti-Euro party, later shifted to focus on anti-immigration policies and became the first far-right party to enter the Bundestag since World War II?",
    "options": [
      "The Left",
      "Free Democratic Party",
      "Alternative for Germany",
      "National Democratic Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Alternative for Germany (AfD) was founded in 2013 and became the first far-right party to enter the German parliament since WWII in 2017.",
    "detailedExplanation": "Alternative for Germany (Alternative für Deutschland, AfD) was established in 2013 by economics professor Bernd Lucke and others, initially focusing on opposition to the European single currency and EU integration. However, the party gradually shifted toward anti-immigration and nationalist positions, particularly during the 2015 European migrant crisis. This ideological transformation led to internal conflicts and Lucke's departure, with the party moving decidedly to the right under leaders like Alexander Gauland and Alice Weidel. In 2017, the AfD won 12.6% of the vote and 94 seats in the Bundestag, becoming the first far-right party to enter the German parliament since the Nazi era, fundamentally altering Germany's political landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alternative_for_Germany",
    "citationTitle": "Wikipedia: Alternative for Germany"
  },
  {
    "id": "49238db3-e24c-43ae-8791-b1f86d148837",
    "text": "Which Turkish political party, led by Recep Tayyip Erdoğan, has dominated Turkish politics since 2002 and transformed the country from a parliamentary to a presidential system?",
    "options": [
      "Republican People's Party",
      "Justice and Development Party",
      "Nationalist Movement Party",
      "Good Party"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Justice and Development Party (AKP) led by Erdoğan has governed Turkey since 2002 and implemented major constitutional changes.",
    "detailedExplanation": "The Justice and Development Party (Adalet ve Kalkınma Partisi, AKP) was founded in 2001 by Recep Tayyip Erdoğan and other politicians from Islamist parties that had been banned by Turkey's secular establishment. The party came to power in 2002 and has won every election since, initially pursuing EU membership and democratic reforms. However, under Erdoğan's increasingly authoritarian leadership, the AKP has consolidated power, restricted press freedom, and purged opponents. The party's most significant achievement was the 2017 constitutional referendum that abolished the parliamentary system and established a powerful executive presidency, fundamentally changing Turkey's political system and concentrating power in Erdoğan's hands.",
    "citationUrl": "https://en.wikipedia.org/wiki/Justice_and_Development_Party_(Turkey)",
    "citationTitle": "Wikipedia: Justice and Development Party (Turkey)"
  },
  {
    "id": "93c9d7ee-b924-4445-a800-6f7438a6f258",
    "text": "Which political party holds the unusual distinction of being founded by a Nobel Prize-winning playwright and served as the ruling party during the Velvet Revolution?",
    "options": [
      "Civic Forum (Czechoslovakia)",
      "Solidarity (Poland)",
      "New Forum (East Germany)",
      "Democratic Russia"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Civic Forum was co-founded by Václav Havel, who won the Nobel Prize in Literature and led Czechoslovakia's peaceful transition from communism.",
    "detailedExplanation": "Civic Forum (Občanské fórum) was founded in November 1989 during Czechoslovakia's Velvet Revolution, with playwright and dissident Václav Havel as one of its key founders. Havel, who had been imprisoned multiple times for his political activism and later won international literary acclaim, became the party's most prominent figure and subsequently served as the last President of Czechoslovakia and first President of the Czech Republic. The party successfully orchestrated the peaceful overthrow of the communist government in just a few weeks, making it one of the most successful revolutionary political movements in modern European history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Civic_Forum",
    "citationTitle": "Wikipedia: Civic Forum"
  },
  {
    "id": "6ae812cf-81db-4c31-946b-49efe9a3509b",
    "text": "Which political party created the world's first Green political program in 1972 and inspired the global environmental political movement?",
    "options": [
      "Die Grünen (Germany)",
      "United Tasmania Group (Australia)",
      "Ecology Party (UK)",
      "Values Party (New Zealand)"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "New Zealand's Values Party, founded in 1972, was the world's first national political party to be based on environmental and social justice principles.",
    "detailedExplanation": "The Values Party was established in Wellington, New Zealand, in May 1972, making it the world's first national political party founded on environmental principles and comprehensive green politics. The party's manifesto, 'Blueprint for New Zealand,' outlined policies on environmental protection, social justice, and sustainable economics that would later become standard for Green parties worldwide. While the United Tasmania Group formed earlier in 1972, it was a local party focused on a single issue (preventing the flooding of Lake Pedder), whereas the Values Party created the first comprehensive green political platform that inspired similar movements across the globe, including Germany's influential Die Grünen party founded in 1980.",
    "citationUrl": "https://en.wikipedia.org/wiki/Values_Party",
    "citationTitle": "Wikipedia: Values Party"
  },
  {
    "id": "131d168d-9f13-4476-b630-8264ebb8f8ae",
    "text": "Which political party was founded by a former chess world champion and has been banned multiple times for its opposition activities?",
    "options": [
      "Yabloko (Russia)",
      "Other Russia (Russia)",
      "Solidarity (Russia)",
      "Right Cause (Russia)"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Other Russia was co-founded by Garry Kasparov, the former world chess champion, as an opposition coalition that has faced repeated government crackdowns.",
    "detailedExplanation": "Other Russia (Другая Россия) was founded in 2006 by former world chess champion Garry Kasparov, along with other opposition figures including Eduard Limonov and Mikhail Kasyanov. Kasparov, who dominated world chess from 1985 to 2000, became one of Russia's most prominent political dissidents after retiring from professional chess. The coalition has organized numerous protests and marches against the Putin government, leading to frequent arrests of its members and leaders, including Kasparov himself. The organization has been repeatedly denied official registration as a political party and has faced significant government pressure, with many of its activities being declared illegal by Russian authorities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Other_Russia",
    "citationTitle": "Wikipedia: Other Russia"
  },
  {
    "id": "1f152cfd-5d81-4cc4-bcff-dbf0f7d422c0",
    "text": "Which political party was the first in the world to be led by an openly transgender person who served as a head of government?",
    "options": [
      "Fine Gael (Ireland)",
      "Fianna Fáil (Ireland)",
      "Labour Party (Ireland)",
      "Green Party (Ireland)"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "None of these parties have actually been led by a transgender head of government, but several transgender politicians have held significant party positions and ministerial roles worldwide.",
    "detailedExplanation": "This question highlights an important milestone in LGBTQ+ political representation that has not yet been fully achieved at the head of government level. While several transgender politicians have held ministerial positions and significant party roles globally - such as Georgina Beyer in New Zealand's Labour Party, who was the world's first openly transgender mayor and MP, and Sarah McBride in the United States - no openly transgender person has yet served as a head of government while leading a major political party. However, several transgender politicians have held senior ministerial positions, including in Belgium, New Zealand, and other countries, representing significant progress in political inclusion.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_transgender_politicians",
    "citationTitle": "Wikipedia: List of transgender politicians"
  }
]