[
  {
    "id": "d9d7bc91-bd33-4e74-b79a-0db151dc62fc",
    "text": "Which American author wrote the novel 'To Kill a Mockingbird'?",
    "options": [
      "Harper Lee",
      "Toni Morrison",
      "Flannery O'Connor",
      "Carson McCullers"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Harper Lee wrote 'To Kill a Mockingbird', published in 1960.",
    "detailedExplanation": "Harper Lee's 'To Kill a Mockingbird' was published in 1960 and became one of the most beloved American novels. Set in the fictional town of Maycomb, Alabama, during the 1930s, the story is told through the eyes of Scout Finch and deals with themes of racial injustice, moral growth, and childhood innocence. The novel won the Pulitzer Prize for Fiction in 1961 and remains a staple of American literature curricula.",
    "citationUrl": "https://en.wikipedia.org/wiki/To_Kill_a_Mockingbird",
    "citationTitle": "Wikipedia: To Kill a Mockingbird"
  },
  {
    "id": "c03d2e4a-6454-4973-8b55-eda88be1c210",
    "text": "What is the opening line of Herman Melville's 'Moby-Dick'?",
    "options": [
      "Call me Ishmael.",
      "It was the best of times, it was the worst of times.",
      "In the beginning was the Word.",
      "Last night I dreamt I went to Manderley again."
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'Call me Ishmael' is the famous opening line of Herman Melville's 1851 novel 'Moby-Dick'.",
    "detailedExplanation": "The opening line 'Call me Ishmael' from Herman Melville's 'Moby-Dick' is one of the most recognized first lines in American literature. Published in 1851, the novel tells the story of the obsessive quest of Captain Ahab for revenge against the white whale Moby Dick. The narrator, who asks to be called Ishmael, serves as both participant and observer in this epic tale of man versus nature, exploring themes of fate, knowledge, and the nature of evil.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moby-Dick",
    "citationTitle": "Wikipedia: Moby-Dick"
  },
  {
    "id": "9621065c-31ee-46dc-9387-9108be59dc73",
    "text": "What is the name of the town where Thornton Wilder's play 'Our Town' is set?",
    "options": [
      "Grover's Corners",
      "Millfield",
      "Cedar Falls",
      "Maple Grove"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Thornton Wilder's 'Our Town' is set in the fictional town of Grover's Corners, New Hampshire.",
    "detailedExplanation": "Thornton Wilder's Pulitzer Prize-winning play 'Our Town' premiered in 1938 and is set in the fictional small town of Grover's Corners, New Hampshire, between 1901 and 1913. The play is renowned for its innovative staging techniques, including minimal sets and a narrator called the Stage Manager who directly addresses the audience. The play explores themes of life, love, and death in small-town America, and remains one of the most frequently produced plays in American theater.",
    "citationUrl": "https://en.wikipedia.org/wiki/Our_Town",
    "citationTitle": "Wikipedia: Our Town"
  },
  {
    "id": "446ed7e3-845e-43ba-8f52-2a135bd2a7e8",
    "text": "Which Mark Twain novel features the characters Tom Sawyer and Huckleberry Finn?",
    "options": [
      "The Prince and the Pauper",
      "A Connecticut Yankee in King Arthur's Court",
      "The Adventures of Tom Sawyer",
      "Pudd'nhead Wilson"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'The Adventures of Tom Sawyer' features both Tom Sawyer and Huckleberry Finn as main characters.",
    "detailedExplanation": "Mark Twain's 'The Adventures of Tom Sawyer', published in 1876, introduced both Tom Sawyer and his friend Huckleberry Finn to American literature. Set in the fictional town of St. Petersburg, Missouri (based on Twain's hometown of Hannibal), the novel follows Tom's adventures along the Mississippi River. The character of Huckleberry Finn proved so popular that Twain later wrote 'Adventures of Huckleberry Finn' (1885), which many consider the first Great American Novel and a masterpiece of American literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Adventures_of_Tom_Sawyer",
    "citationTitle": "Wikipedia: The Adventures of Tom Sawyer"
  },
  {
    "id": "7754646a-09aa-4e89-920d-6d843c878686",
    "text": "Which American author wrote 'The Great Gatsby'?",
    "options": [
      "Ernest Hemingway",
      "F. Scott Fitzgerald",
      "John Steinbeck",
      "William Faulkner"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "F. Scott Fitzgerald wrote 'The Great Gatsby', published in 1925.",
    "detailedExplanation": "F. Scott Fitzgerald's 'The Great Gatsby', published in 1925, is widely regarded as one of the greatest American novels. Set in the summer of 1922 during the Jazz Age, the novel tells the story of Jay Gatsby's obsessive pursuit of his lost love, Daisy Buchanan, against the backdrop of the wealthy Long Island society. The novel serves as a critique of the American Dream and the moral decay beneath the glittering surface of the Roaring Twenties. Fitzgerald himself was a key figure of the Lost Generation of writers.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Great_Gatsby",
    "citationTitle": "Wikipedia: The Great Gatsby"
  },
  {
    "id": "2c99cfb9-cbc9-4bf9-af9e-63179891f202",
    "text": "What type of poetry is Walt Whitman most famous for writing?",
    "options": [
      "Sonnets",
      "Haikus",
      "Free verse",
      "Limericks"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Walt Whitman is most famous for his free verse poetry, particularly in 'Leaves of Grass'.",
    "detailedExplanation": "Walt Whitman revolutionized American poetry with his use of free verse, breaking away from traditional rhyme and meter patterns. His most famous work, 'Leaves of Grass', first published in 1855 and revised throughout his life, celebrated American democracy, nature, and the human spirit in long, flowing lines without regular rhyme schemes. Whitman's innovative style and bold subject matter, including his frank treatment of sexuality and the human body, initially shocked many readers but eventually established him as one of America's greatest poets.",
    "citationUrl": "https://en.wikipedia.org/wiki/Walt_Whitman",
    "citationTitle": "Wikipedia: Walt Whitman"
  },
  {
    "id": "e459e061-6abe-4a22-91a1-8a7d671ef764",
    "text": "Which novel by John Steinbeck tells the story of the Joad family during the Great Depression?",
    "options": [
      "Of Mice and Men",
      "East of Eden",
      "The Grapes of Wrath",
      "Cannery Row"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'The Grapes of Wrath' follows the Joad family's journey from Oklahoma to California during the Dust Bowl.",
    "detailedExplanation": "John Steinbeck's 'The Grapes of Wrath', published in 1939, tells the story of the Joad family, Oklahoma farmers forced to migrate to California during the Great Depression and Dust Bowl era. The novel chronicles their hardships and exploitation as migrant workers, serving as both a specific story of one family and a broader allegory for the struggles of displaced Americans. The novel won the Pulitzer Prize for Fiction in 1940 and was a significant factor in Steinbeck receiving the Nobel Prize in Literature in 1962.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Grapes_of_Wrath",
    "citationTitle": "Wikipedia: The Grapes of Wrath"
  },
  {
    "id": "5cb63c67-d249-44dc-be5b-e6e5359ca262",
    "text": "Which American author wrote the classic horror novel 'The Shining'?",
    "options": [
      "Stephen King",
      "Edgar Allan Poe",
      "Ray Bradbury",
      "H.P. Lovecraft"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Stephen King wrote 'The Shining' in 1977.",
    "detailedExplanation": "Stephen King's 'The Shining' was published in 1977 and became one of his most famous works. The novel tells the story of Jack Torrance, a writer who becomes the winter caretaker of the isolated Overlook Hotel in Colorado, where he lives with his wife and psychic son. The hotel's supernatural influences drive Jack to madness and violence. The book was famously adapted into a film by Stanley Kubrick in 1980.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Shining_(novel)",
    "citationTitle": "Wikipedia: The Shining (novel)"
  },
  {
    "id": "e526f11e-52b4-4d07-b5d7-7af7b293eec2",
    "text": "What is the name of the fictional Alabama town in Harper Lee's 'To Kill a Mockingbird'?",
    "options": [
      "Maycomb",
      "Millfield",
      "Madison",
      "Montgomery"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Maycomb is the fictional town where the events of 'To Kill a Mockingbird' take place.",
    "detailedExplanation": "Maycomb County is the fictional setting of Harper Lee's 'To Kill a Mockingbird,' inspired by Lee's hometown of Monroeville, Alabama. The town serves as a microcosm of the American South during the 1930s, reflecting the social hierarchies, racial tensions, and moral complexities of the era. The detailed portrayal of Maycomb and its inhabitants provides the backdrop for the novel's exploration of prejudice, justice, and moral courage.",
    "citationUrl": "https://en.wikipedia.org/wiki/To_Kill_a_Mockingbird",
    "citationTitle": "Wikipedia: To Kill a Mockingbird"
  },
  {
    "id": "1a60a71c-f6b4-438d-97c9-dd1829800488",
    "text": "What is the first name of the narrator in J.D. Salinger's 'The Catcher in the Rye'?",
    "options": [
      "Holden",
      "Henry",
      "Harold",
      "Herbert"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Holden Caulfield is the narrator and protagonist of 'The Catcher in the Rye.'",
    "detailedExplanation": "Holden Caulfield is the sixteen-year-old narrator of J.D. Salinger's 1951 novel 'The Catcher in the Rye.' The story follows Holden over a few days after he's been expelled from prep school, as he wanders around New York City. His cynical and alienated perspective on adult society, combined with his distinctive voice and observations about 'phoniness,' made the character an icon of teenage rebellion and angst in American literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Catcher_in_the_Rye",
    "citationTitle": "Wikipedia: The Catcher in the Rye"
  },
  {
    "id": "908e0ee2-aafb-465d-ad86-97424aaf4079",
    "text": "Which American author created the character of private detective Philip Marlowe?",
    "options": [
      "Raymond Chandler",
      "Dashiell Hammett",
      "James M. Cain",
      "Mickey Spillane"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Raymond Chandler created Philip Marlowe, who appeared in several detective novels.",
    "detailedExplanation": "Raymond Chandler created the character of Philip Marlowe, a private detective who became one of the most iconic figures in American crime fiction. Marlowe first appeared in 'The Big Sleep' (1939) and went on to star in several other novels including 'Farewell, My Lovely' and 'The Long Goodbye.' Chandler's hard-boiled detective stories, set in Los Angeles, helped define the noir genre and influenced countless writers and filmmakers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Philip_Marlowe",
    "citationTitle": "Wikipedia: Philip Marlowe"
  },
  {
    "id": "e9539502-6fbd-45d1-99d3-affd4c113fa0",
    "text": "What is the subtitle of Dr. Seuss's 'The Cat in the Hat'?",
    "options": [
      "There is no subtitle",
      "A Beginner Book",
      "A Tale of Mischief",
      "Fun with Reading"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'The Cat in the Hat' has the subtitle 'A Beginner Book.'",
    "detailedExplanation": "Dr. Seuss's 'The Cat in the Hat,' published in 1957, carries the subtitle 'A Beginner Book.' This designation was part of Random House's Beginner Books series, which was designed to help children learn to read using simple vocabulary and engaging illustrations. The book was created in response to concerns about literacy and the boring nature of children's primers, using only 236 different words to tell its entertaining story.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Cat_in_the_Hat",
    "citationTitle": "Wikipedia: The Cat in the Hat"
  },
  {
    "id": "555b0811-087a-4276-8302-d85cb2a11d66",
    "text": "Which American playwright wrote 'Death of a Salesman'?",
    "options": [
      "Arthur Miller",
      "Tennessee Williams",
      "Eugene O'Neill",
      "Edward Albee"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Arthur Miller wrote 'Death of a Salesman' in 1949.",
    "detailedExplanation": "Arthur Miller's 'Death of a Salesman' premiered on Broadway in 1949 and won both the Pulitzer Prize for Drama and the Tony Award for Best Play. The play tells the story of Willy Loman, an aging traveling salesman who struggles with his declining career and family relationships. It's considered one of the greatest American plays, offering a critique of the American Dream and the cost of pursuing material success at the expense of personal relationships and self-knowledge.",
    "citationUrl": "https://en.wikipedia.org/wiki/Death_of_a_Salesman",
    "citationTitle": "Wikipedia: Death of a Salesman"
  },
  {
    "id": "e5c0d8c3-66cd-4e0a-b366-637cd366f471",
    "text": "Which American poet wrote the famous poem 'The Road Not Taken'?",
    "options": [
      "Robert Frost",
      "Emily Dickinson",
      "Edgar Allan Poe",
      "Langston Hughes"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Robert Frost wrote 'The Road Not Taken' in 1915.",
    "detailedExplanation": "Robert Frost wrote 'The Road Not Taken' in 1915, and it became one of the most famous and frequently quoted poems in American literature. The poem explores themes of choice and regret, ending with the famous lines about taking 'the road less traveled by.' Frost was a four-time Pulitzer Prize winner for Poetry and is considered one of America's greatest poets.",
    "citationUrl": "https://en.wikipedia.org/wiki/Robert_Frost",
    "citationTitle": "Wikipedia: Robert Frost"
  },
  {
    "id": "7fa1bee1-b13e-4c5d-86da-cce91fa304f9",
    "text": "What is the name of the whale in Herman Melville's 'Moby-Dick'?",
    "options": [
      "Moby-Dick",
      "White Whale",
      "Leviathan",
      "Pequod"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The whale's name is Moby-Dick, which is also the title of the novel.",
    "detailedExplanation": "In Herman Melville's 1851 novel, the great white sperm whale is named Moby-Dick. The whale is the obsession of Captain Ahab, who seeks revenge against the creature that destroyed his leg. The Pequod is actually the name of Ahab's ship, not the whale. The novel is considered one of the greatest works of American literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moby-Dick",
    "citationTitle": "Wikipedia: Moby-Dick"
  },
  {
    "id": "6c8f8238-aec3-4c9e-a518-5b6e014ec14c",
    "text": "Which American author created the detective character Sherlock Holmes?",
    "options": [
      "Arthur Conan Doyle",
      "Edgar Allan Poe",
      "Dashiell Hammett",
      "None - Holmes is British"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Sherlock Holmes was created by British author Arthur Conan Doyle, not an American writer.",
    "detailedExplanation": "This is a trick question - Sherlock Holmes was created by British author Sir Arthur Conan Doyle, not an American writer. However, Edgar Allan Poe, who was American, is credited with creating the detective fiction genre with his character C. Auguste Dupin in stories like 'The Murders in the Rue Morgue' (1841), which influenced Doyle's later creation of Holmes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Detective_fiction",
    "citationTitle": "Wikipedia: Detective Fiction"
  },
  {
    "id": "d16fe267-158c-439e-9f6e-b7a77fa07a52",
    "text": "Which novel features the character Atticus Finch as a lawyer?",
    "options": [
      "The Firm",
      "To Kill a Mockingbird",
      "The Pelican Brief",
      "A Time to Kill"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Atticus Finch is the lawyer father in Harper Lee's 'To Kill a Mockingbird'.",
    "detailedExplanation": "Atticus Finch is the central adult character in Harper Lee's 1960 novel 'To Kill a Mockingbird.' He is a lawyer and single father in the fictional town of Maycomb, Alabama, who defends a Black man falsely accused of rape. The story is told from the perspective of his young daughter Scout. Atticus has become an iconic figure representing moral courage and integrity in American literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Atticus_Finch",
    "citationTitle": "Wikipedia: Atticus Finch"
  },
  {
    "id": "5ba49b46-96b5-4c8d-a39c-01b1a902a8e8",
    "text": "What genre is Stephen King most famous for writing?",
    "options": [
      "Romance",
      "Horror",
      "Science Fiction",
      "Western"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Stephen King is primarily known as a horror novelist.",
    "detailedExplanation": "Stephen King is widely regarded as the 'Master of Horror' and has written over 60 novels and 200 short stories, most of which fall into the horror, supernatural fiction, suspense, and fantasy genres. Some of his most famous works include 'Carrie,' 'It,' 'The Shining,' and 'Pet Sematary.' While he has written in other genres, horror remains his signature and most commercially successful category.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stephen_King",
    "citationTitle": "Wikipedia: Stephen King"
  },
  {
    "id": "2268158c-1324-438a-a649-684e4c9839c7",
    "text": "Which American author wrote 'Little Women'?",
    "options": [
      "Louisa May Alcott",
      "Willa Cather",
      "Edith Wharton",
      "Kate Chopin"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Louisa May Alcott wrote 'Little Women' in 1868.",
    "detailedExplanation": "Louisa May Alcott published 'Little Women' in 1868, and it became one of the most beloved American novels. The story follows the four March sisters - Meg, Jo, Beth, and Amy - as they grow up during the Civil War era. The novel was groundbreaking for its realistic portrayal of family life and strong female characters, particularly Jo March, who aspires to be a writer like Alcott herself.",
    "citationUrl": "https://en.wikipedia.org/wiki/Little_Women",
    "citationTitle": "Wikipedia: Little Women"
  },
  {
    "id": "7263d08a-08e3-4fac-8b9d-9b44b3e3c6ee",
    "text": "What is the first name of the protagonist in 'The Adventures of Huckleberry Finn'?",
    "options": [
      "Thomas",
      "Samuel",
      "Huckleberry",
      "James"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The protagonist's first name is Huckleberry, though he's commonly called Huck.",
    "detailedExplanation": "The main character in Mark Twain's 1885 novel 'The Adventures of Huckleberry Finn' is named Huckleberry Finn, though he's usually referred to as Huck throughout the story. Huckleberry was actually a real name in the 19th century, often given to boys, and Twain likely chose it to reflect the character's wild, free-spirited nature - much like the huckleberry fruit that grows wild in nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Adventures_of_Huckleberry_Finn",
    "citationTitle": "Wikipedia: Adventures of Huckleberry Finn"
  }
]