[
  {
    "id": "2f6d9937-0ebe-4bbd-b60b-a74d286fd4ce",
    "text": "Which American author wrote the novel 'Blood Meridian,' often considered one of the most violent and philosophical westerns in literature?",
    "options": [
      "Cormac McCarthy",
      "Larry McMurtry",
      "Annie Proulx",
      "Thomas Pynchon"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Cormac McCarthy wrote 'Blood Meridian' in 1985, a brutal western novel based on historical events along the Texas-Mexico border.",
    "detailedExplanation": "Cormac McCarthy's 'Blood Meridian or the Evening Redness in the West' (1985) is widely regarded as his masterpiece and one of the greatest American novels of the late 20th century. The novel follows a teenage runaway known only as 'the kid' who joins a gang of Indian-hunters led by the mysterious and terrifying Judge Holden. Based on historical accounts from Samuel Chamberlain's memoir, the novel is notorious for its unflinching depiction of violence and its philosophical meditations on war, fate, and human nature. Despite its critical acclaim, it remains one of the most challenging and controversial works in American literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blood_Meridian",
    "citationTitle": "Wikipedia: Blood Meridian"
  },
  {
    "id": "b525a208-92c1-4c4b-8ab2-802a5c5c1af1",
    "text": "What is the name of the reclusive salesman protagonist in Arthur Miller's 'Death of a Salesman'?",
    "options": [
      "George Wilson",
      "Willy Loman",
      "Eddie Carbone",
      "John Proctor"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Willy Loman is the tragic protagonist of Arthur Miller's 1949 Pulitzer Prize-winning play 'Death of a Salesman.'",
    "detailedExplanation": "Willy Loman represents the failed American Dream in Arthur Miller's seminal 1949 play 'Death of a Salesman.' The aging traveling salesman struggles with delusions about his own success and his sons' potential, ultimately leading to his tragic downfall. Miller created Loman as an everyman figure whose surname suggests he is a 'low man' in society's hierarchy. The play won both the Pulitzer Prize for Drama and the Tony Award for Best Play, and Willy Loman has become an iconic character in American theater, representing the dark side of capitalism and the pursuit of success at any cost.",
    "citationUrl": "https://en.wikipedia.org/wiki/Death_of_a_Salesman",
    "citationTitle": "Wikipedia: Death of a Salesman"
  },
  {
    "id": "5d23ec8b-3138-4804-9a00-59f653c6d54c",
    "text": "Which Zora Neale Hurston novel features the protagonist Janie Crawford and her journey through three marriages?",
    "options": [
      "Dust Tracks on a Road",
      "Jonah's Gourd Vine",
      "Their Eyes Were Watching God",
      "Seraph on the Suwanee"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "'Their Eyes Were Watching God' (1937) follows Janie Crawford's quest for independence and love through her three marriages in rural Florida.",
    "detailedExplanation": "Zora Neale Hurston's 'Their Eyes Were Watching God' (1937) is now considered a masterpiece of American literature and a cornerstone of both African American and women's literature. The novel tells the story of Janie Crawford, a strong-willed African American woman in the early 20th century South, as she navigates three very different marriages in her quest for independence, love, and self-realization. Initially overlooked and criticized by some contemporary reviewers for its focus on folk culture rather than racial protest, the novel was rediscovered in the 1970s and championed by writers like Alice Walker. It's celebrated for its rich use of dialect, its portrayal of African American rural life, and its pioneering feminist themes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Their_Eyes_Were_Watching_God",
    "citationTitle": "Wikipedia: Their Eyes Were Watching God"
  },
  {
    "id": "3359b01a-3895-4375-a66d-e8b1adc6ad69",
    "text": "Which Beat Generation author wrote 'Naked Lunch,' a controversial novel that faced obscenity trials in the 1960s?",
    "options": [
      "Jack Kerouac",
      "Allen Ginsberg",
      "William S. Burroughs",
      "Gary Snyder"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "William S. Burroughs wrote 'Naked Lunch' (1959), an experimental novel that became the subject of landmark obscenity trials.",
    "detailedExplanation": "William S. Burroughs' 'Naked Lunch' (1959) is one of the most controversial and influential novels of the Beat Generation. Written using Burroughs' 'cut-up technique' and drawing from his experiences with drug addiction, the fragmented, surreal narrative defied conventional storytelling and shocked readers with its graphic content. The book faced obscenity trials in Boston and other cities throughout the 1960s, with the Massachusetts Supreme Court ultimately ruling it was not obscene in 1966. These trials were significant in establishing literary merit as a defense against obscenity charges. The novel's experimental style and unflinching examination of addiction, sexuality, and social control influenced countless writers and helped establish postmodern literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Naked_Lunch",
    "citationTitle": "Wikipedia: Naked Lunch"
  },
  {
    "id": "9d24a7a1-8359-47a3-a1a0-f4cc0321382d",
    "text": "What is the actual name of the 'monster' narrator in Edgar Allan Poe's 'The Tell-Tale Heart'?",
    "options": [
      "Roderick Usher",
      "William Wilson",
      "The narrator is never named",
      "Montresor"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Poe deliberately never names the narrator of 'The Tell-Tale Heart,' maintaining the character's anonymity to enhance the story's psychological impact.",
    "detailedExplanation": "Edgar Allan Poe's 'The Tell-Tale Heart' (1843) is famous for its unnamed, unreliable narrator who insists on their sanity while describing the murder of an old man. Poe's decision to leave the narrator nameless is a deliberate literary technique that serves multiple purposes: it makes the character more universal and allows readers to focus entirely on the psychological deterioration rather than individual identity. The story is told in first person, with the narrator addressing the reader directly, creating an intimate yet disturbing confession. This anonymity also reinforces the theme of dehumanization and madness, as the narrator becomes less a person than a voice of guilt and paranoia. The technique became influential in psychological horror literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Tell-Tale_Heart",
    "citationTitle": "Wikipedia: The Tell-Tale Heart"
  },
  {
    "id": "fe1479a1-d69a-425e-9085-f383959a0593",
    "text": "Which Toni Morrison novel won the Pulitzer Prize for Fiction in 1988 and deals with the legacy of slavery through a supernatural narrative?",
    "options": [
      "Song of Solomon",
      "The Bluest Eye",
      "Beloved",
      "Jazz"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "'Beloved' won the 1988 Pulitzer Prize for Fiction and tells the haunting story of Sethe and the ghost of her deceased daughter.",
    "detailedExplanation": "Toni Morrison's 'Beloved' (1987) won the Pulitzer Prize for Fiction in 1988 and is widely considered her masterpiece. The novel tells the story of Sethe, a former enslaved woman living in post-Civil War Ohio, who is haunted by the ghost of her baby daughter, whom she killed rather than allow her to be returned to slavery. Inspired by the true story of Margaret Garner, the novel uses magical realism to explore the psychological trauma of slavery and its lasting effects on individuals and communities. The book's innovative narrative structure, powerful prose, and unflinching examination of America's history of slavery helped establish Morrison as one of the most important American writers of the 20th century and contributed to her winning the Nobel Prize in Literature in 1993.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beloved_(novel)",
    "citationTitle": "Wikipedia: Beloved (novel)"
  },
  {
    "id": "51ecd799-4737-44b2-a163-3cc9d935610f",
    "text": "In Don DeLillo's 'White Noise,' what is the name of the toxic chemical cloud that forces the Gladney family to evacuate?",
    "options": [
      "Nyodene D",
      "Dylar",
      "Compound X",
      "Toxic Event Alpha"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The 'Airborne Toxic Event' in 'White Noise' is caused by a spill of the fictional chemical Nyodene D, forcing mass evacuation.",
    "detailedExplanation": "Don DeLillo's 'White Noise' (1985) features the 'Airborne Toxic Event,' a central plot point involving the spill of a fictional industrial chemical called Nyodene D. This environmental disaster forces protagonist Jack Gladney and his family to evacuate their suburban home, serving as a metaphor for the invisible dangers of modern industrial society. The novel, which won the National Book Award, is a satirical exploration of American consumer culture, media saturation, and death anxiety in the 1980s. DeLillo uses the toxic cloud as both a literal plot device and a symbol for the pervasive but often unseen threats of contemporary life, from chemical contamination to information overload. The novel is considered a masterwork of postmodern American literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/White_Noise_(novel)",
    "citationTitle": "Wikipedia: White Noise (novel)"
  },
  {
    "id": "eaad1bbb-0383-41a4-b950-17cdfacf4572",
    "text": "Which American poet wrote 'The Bridge,' an epic poem attempting to create a mythic vision of America using the Brooklyn Bridge as its central symbol?",
    "options": [
      "Wallace Stevens",
      "Hart Crane",
      "William Carlos Williams",
      "Robert Frost"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Hart Crane wrote 'The Bridge' (1930), an ambitious modernist epic poem celebrating American technology and spirituality through the Brooklyn Bridge.",
    "detailedExplanation": "Hart Crane's 'The Bridge' (1930) is one of the most ambitious epic poems in American literature, using the Brooklyn Bridge as a central symbol to explore American history, technology, and spiritual possibility. Crane conceived the work as a response to T.S. Eliot's pessimistic 'The Waste Land,' attempting to create a more optimistic vision of modern America. The poem consists of eight sections that move through different periods of American history, from Columbus's voyage to contemporary urban life. Despite mixed critical reception initially, 'The Bridge' is now recognized as a masterpiece of American modernist poetry. Tragically, Crane completed the poem just two years before his death by suicide at age 32, jumping from a ship in the Gulf of Mexico in 1932.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bridge_(long_poem)",
    "citationTitle": "Wikipedia: The Bridge (long poem)"
  },
  {
    "id": "fa878e8d-8f9a-4d8e-89be-a583246766ad",
    "text": "Which American author wrote under multiple pseudonyms including Richard Bachman and published 'The Running Man' and 'Thinner' under this alternate identity?",
    "options": [
      "Stephen King",
      "Dean Koontz",
      "Clive Barker",
      "Peter Straub"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Stephen King used the pseudonym Richard Bachman for several novels to test if his success was due to his name or writing ability.",
    "detailedExplanation": "Stephen King adopted the pseudonym Richard Bachman in the late 1970s as a way to publish more books than his publishers thought the market could bear under his real name, and to test whether his success was due to his reputation or his writing talent. Under the Bachman name, he published 'Rage' (1977), 'The Long Walk' (1979), 'Roadwork' (1981), 'The Running Man' (1982), and 'Thinner' (1984). The pseudonym was eventually discovered by a bookstore clerk in 1985, leading King to 'kill off' the Bachman persona, though he occasionally revived it for later works.",
    "citationUrl": "https://en.wikipedia.org/wiki/Richard_Bachman",
    "citationTitle": "Wikipedia: Richard Bachman"
  },
  {
    "id": "38b9b36c-3597-47a0-a313-4357afb58138",
    "text": "In which Thomas Pynchon novel does the mysterious Tristero postal conspiracy serve as a central plot element?",
    "options": [
      "Gravity's Rainbow",
      "The Crying of Lot 49",
      "Mason & Dixon",
      "Against the Day"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Crying of Lot 49 features protagonist Oedipa Maas investigating the Tristero, an underground postal system conspiracy.",
    "detailedExplanation": "Published in 1966, 'The Crying of Lot 49' is Thomas Pynchon's shortest novel and follows Oedipa Maas as she attempts to execute the estate of her former lover, Pierce Inverarity. During this process, she discovers what appears to be evidence of the Tristero, a centuries-old underground postal system that may be a vast conspiracy or possibly a delusion. The novel explores themes of communication, paranoia, and the search for meaning in postmodern America, with the Tristero serving as both a literal plot device and a metaphor for hidden systems of power and alternative forms of connection.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Crying_of_Lot_49",
    "citationTitle": "Wikipedia: The Crying of Lot 49"
  },
  {
    "id": "802fb577-ac9e-4396-8e7b-811367aa4032",
    "text": "Which American poet served as Poet Laureate and wrote the epic poem 'Paterson,' named after the New Jersey industrial city?",
    "options": [
      "Ezra Pound",
      "William Carlos Williams",
      "Wallace Stevens",
      "Robert Frost"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "William Carlos Williams wrote 'Paterson,' a five-book epic poem about the New Jersey city where he practiced medicine.",
    "detailedExplanation": "William Carlos Williams, a physician-poet from Rutherford, New Jersey, wrote 'Paterson' between 1946 and 1958. This modernist epic poem uses the city of Paterson, New Jersey, and its Great Falls as both setting and metaphor for American industrial life and the search for a uniquely American poetic language. Williams incorporated historical documents, letters, and newspaper clippings into the poem's structure, creating a collage-like work that captures the complexity of urban American experience. The poem reflects Williams' belief that poetry should emerge from local, everyday American speech and experience rather than European literary traditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paterson_(poem)",
    "citationTitle": "Wikipedia: Paterson (poem)"
  },
  {
    "id": "65ca1b24-628a-49a2-8836-736c5c550f15",
    "text": "What is the name of the fictional town in Sherwood Anderson's interconnected short story collection that depicts small-town American life?",
    "options": [
      "Spoon River",
      "Winesburg",
      "Gopher Prairie",
      "Jefferson"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Winesburg, Ohio is the setting for Anderson's influential 1919 collection exploring the psychological lives of small-town residents.",
    "detailedExplanation": "Published in 1919, 'Winesburg, Ohio' by Sherwood Anderson is a collection of interrelated short stories set in the fictional town of Winesburg, Ohio. The stories are unified by the character of George Willard, a young reporter who serves as confidant to various townspeople who reveal their inner lives and psychological struggles. Anderson's work was groundbreaking for its psychological realism and its portrayal of the loneliness and alienation beneath the surface of small-town American life. The book influenced many later American writers, including Ernest Hemingway and William Faulkner, and helped establish the tradition of the American short story cycle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Winesburg,_Ohio",
    "citationTitle": "Wikipedia: Winesburg, Ohio"
  },
  {
    "id": "9c6c610a-6193-4fb2-b31e-478bdf718d0a",
    "text": "Which controversial American author wrote 'American Psycho' and was part of the literary 'Brat Pack' of the 1980s?",
    "options": [
      "Jay McInerney",
      "Bret Easton Ellis",
      "Tama Janowitz",
      "Douglas Coupland"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Bret Easton Ellis wrote the satirical horror novel 'American Psycho' (1991) about Wall Street executive Patrick Bateman.",
    "detailedExplanation": "Bret Easton Ellis published 'American Psycho' in 1991, a satirical novel that follows Patrick Bateman, a wealthy Manhattan investment banker who leads a double life as a serial killer. The book was highly controversial for its graphic depictions of violence and was initially rejected by Ellis's original publisher. Critics and readers debated whether the novel was a brilliant satire of 1980s yuppie culture and consumer capitalism or simply gratuitous violence. Ellis was associated with the literary 'Brat Pack,' a group of young American authors in the 1980s who wrote about affluent, disaffected youth and urban life, alongside writers like Jay McInerney and Tama Janowitz.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_Psycho",
    "citationTitle": "Wikipedia: American Psycho"
  },
  {
    "id": "c38be214-1826-4eb0-9ca6-85fde1b1bcb6",
    "text": "In Flannery O'Connor's short story 'A Good Man Is Hard to Find,' what is the nickname of the escaped convict who encounters the family?",
    "options": [
      "The Misfit",
      "The Drifter",
      "The Stranger",
      "The Visitor"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Misfit is the escaped prisoner who becomes the central antagonist in O'Connor's famous Southern Gothic story.",
    "detailedExplanation": "In Flannery O'Connor's 1953 short story 'A Good Man Is Hard to Find,' The Misfit is an escaped convict who encounters a family after their car accident in rural Georgia. The story builds to a climactic confrontation between The Misfit and the grandmother, where theological questions about good, evil, and redemption are explored through their dialogue. The Misfit represents O'Connor's exploration of grace, violence, and spiritual crisis in the American South. The character's name reflects his sense of not fitting into the moral and social order, and his philosophical discussions about Jesus and punishment reveal O'Connor's deep Catholic concerns about faith and salvation.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Good_Man_Is_Hard_to_Find_(short_story)",
    "citationTitle": "Wikipedia: A Good Man Is Hard to Find"
  },
  {
    "id": "d722ed03-555f-4c85-883d-3716af55697f",
    "text": "Which American author wrote 'The Age of Innocence,' for which she became the first woman to win the Pulitzer Prize for Fiction?",
    "options": [
      "Willa Cather",
      "Edith Wharton",
      "Ellen Glasgow",
      "Zona Gale"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Edith Wharton won the 1921 Pulitzer Prize for Fiction for 'The Age of Innocence,' making her the first woman to receive this honor.",
    "detailedExplanation": "Edith Wharton's novel 'The Age of Innocence,' published in 1920, won the Pulitzer Prize for Fiction in 1921, making her the first woman to receive this prestigious literary award. The novel is set in upper-class New York society during the 1870s and follows Newland Archer, who is torn between his engagement to the conventional May Welland and his passion for her unconventional cousin, Countess Ellen Olenska. Wharton's intimate knowledge of New York's social elite allowed her to create a detailed critique of the rigid social codes and moral hypocrisy of Gilded Age society. The novel explores themes of duty versus desire, social conformity, and the price of maintaining respectability.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Age_of_Innocence",
    "citationTitle": "Wikipedia: The Age of Innocence"
  },
  {
    "id": "ad58921b-f2ea-4082-b579-1d744a7f25b6",
    "text": "What is the name of the whaling ship in Herman Melville's 'Moby Dick'?",
    "options": [
      "The Rachel",
      "The Samuel Enderby",
      "The Pequod",
      "The Jeroboam"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Pequod is Captain Ahab's whaling ship from which the crew hunts the white whale Moby Dick.",
    "detailedExplanation": "In Herman Melville's 1851 masterpiece 'Moby-Dick,' the Pequod serves as the primary setting for most of the novel's action. Named after the Pequot tribe of Native Americans, the ship becomes a microcosm of American society as Ishmael describes its diverse crew and their relationships. The Pequod is ultimately destroyed by Moby Dick in the novel's climax, with Ishmael being the sole survivor. Melville's choice of name is significant, as the Pequot tribe was decimated in colonial wars, foreshadowing the ship's doom. The other ships mentioned in the options—The Rachel, The Samuel Enderby, and The Jeroboam—are also whaling vessels that the Pequod encounters during its voyage, each providing news or warnings about the white whale.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moby-Dick",
    "citationTitle": "Wikipedia: Moby-Dick"
  },
  {
    "id": "0b980088-a2ba-4aea-8043-35035ae9b5bd",
    "text": "Which American author wrote 'The Sound and the Fury' using multiple narrative perspectives, including the stream-of-consciousness technique from the mentally disabled character Benjy Compson?",
    "options": [
      "William Faulkner",
      "Ernest Hemingway",
      "John Steinbeck",
      "F. Scott Fitzgerald"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "William Faulkner wrote 'The Sound and the Fury,' famous for its experimental narrative structure including Benjy's stream-of-consciousness.",
    "detailedExplanation": "Published in 1929, 'The Sound and the Fury' is William Faulkner's fourth novel and is widely considered one of the greatest American novels of the 20th century. The novel is divided into four sections, with the first told from the perspective of Benjy Compson, a cognitively disabled man whose stream-of-consciousness narrative jumps between different time periods. Faulkner's innovative use of multiple perspectives and experimental narrative techniques helped establish him as a master of modernist literature and contributed to his Nobel Prize in Literature in 1949.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Sound_and_the_Fury",
    "citationTitle": "Wikipedia: The Sound and the Fury"
  },
  {
    "id": "eafb90d4-97b4-4bae-8265-89937617d5ff",
    "text": "What is the name of the protagonist in Jack Kerouac's 'On the Road' who is based on the real-life Beat Generation figure Neal Cassady?",
    "options": [
      "Sal Paradise",
      "Dean Moriarty",
      "Carlo Marx",
      "Old Bull Lee"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Dean Moriarty is the character based on Neal Cassady, while Sal Paradise (based on Kerouac himself) is the narrator.",
    "detailedExplanation": "In Jack Kerouac's seminal Beat Generation novel 'On the Road' (1957), Dean Moriarty is the charismatic, free-spirited character based on Kerouac's real-life friend Neal Cassady. Moriarty serves as the catalyst for the cross-country adventures that form the novel's plot, embodying the restless, seeking spirit of the Beat movement. The novel is narrated by Sal Paradise, Kerouac's alter ego, who chronicles their travels across America. Cassady was a central figure in the Beat Generation and influenced both Kerouac and Allen Ginsberg with his spontaneous, energetic personality and his own experimental writing style.",
    "citationUrl": "https://en.wikipedia.org/wiki/On_the_Road",
    "citationTitle": "Wikipedia: On the Road"
  },
  {
    "id": "6b28f8de-b807-4937-995b-fd11c7dbae69",
    "text": "Which American playwright wrote 'Long Day's Journey Into Night,' an autobiographical drama about his own family that wasn't performed until after his death?",
    "options": [
      "Tennessee Williams",
      "Arthur Miller",
      "Eugene O'Neill",
      "Edward Albee"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Eugene O'Neill wrote 'Long Day's Journey Into Night,' which premiered posthumously in 1956 and won the Pulitzer Prize.",
    "detailedExplanation": "Eugene O'Neill completed 'Long Day's Journey Into Night' in 1942 but requested it not be published or performed until 25 years after his death due to its intensely personal and painful portrayal of his own family. The play depicts one day in the life of the Tyrone family, closely based on O'Neill's own dysfunctional family, dealing with addiction, illness, and emotional trauma. Despite O'Neill's wishes, his widow allowed its production in 1956, three years after his death. The play won the Pulitzer Prize for Drama and is considered O'Neill's masterpiece, cementing his reputation as America's greatest playwright.",
    "citationUrl": "https://en.wikipedia.org/wiki/Long_Day%27s_Journey_Into_Night",
    "citationTitle": "Wikipedia: Long Day's Journey Into Night"
  },
  {
    "id": "9599f8a3-6c82-493f-ba2e-123b19ba95f5",
    "text": "In Ralph Ellison's 'Invisible Man,' what object does the unnamed protagonist keep in his underground hideout that he has filled with 1,369 light bulbs?",
    "options": [
      "A coal cellar",
      "A subway tunnel",
      "A basement room",
      "A sewer chamber"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The protagonist lives in a coal cellar that he has illuminated with 1,369 light bulbs, symbolizing his quest for visibility and enlightenment.",
    "detailedExplanation": "In Ralph Ellison's groundbreaking 1952 novel 'Invisible Man,' the unnamed African American protagonist retreats to an underground coal cellar where he lives as a recluse, having stolen electricity to power 1,369 light bulbs throughout his space. This brilliant illumination serves as a powerful metaphor for his desire to be seen and acknowledged in a society that renders him socially invisible due to his race. The excessive lighting represents his attempt to make himself visible and his rejection of the darkness that others would impose upon him. The novel explores themes of identity, racism, and social invisibility in mid-20th century America, earning Ellison the National Book Award.",
    "citationUrl": "https://en.wikipedia.org/wiki/Invisible_Man",
    "citationTitle": "Wikipedia: Invisible Man"
  }
]