[
  {
    "id": "c82ee651-1c12-4c12-a7c1-196b2176f724",
    "text": "Which American novel begins with the famous line 'Call me Ishmael'?",
    "options": [
      "The Great Gatsby",
      "Moby Dick",
      "The Catcher in the Rye",
      "To Kill a Mockingbird"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Moby Dick by Herman Melville opens with this iconic line.",
    "detailedExplanation": "Herman Melville's 1851 novel 'Moby Dick' begins with one of the most recognizable opening lines in American literature: 'Call me Ishmael.' The narrator introduces himself with this simple yet mysterious statement, setting the tone for the epic tale of Captain Ahab's obsessive quest for the white whale. This opening line has become synonymous with American literary tradition and is frequently quoted and referenced in popular culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moby-Dick",
    "citationTitle": "Wikipedia: Moby-Dick"
  },
  {
    "id": "e69a4b55-1192-4218-a924-7c2413822f7b",
    "text": "Maya Angelou's acclaimed autobiography that deals with her childhood experiences is titled what?",
    "options": [
      "Gather Together in My Name",
      "I Know Why the Caged Bird Sings",
      "Singin' and Swingin' and Gettin' Merry Like Christmas",
      "The Heart of a Woman"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'I Know Why the Caged Bird Sings' is Maya Angelou's groundbreaking first autobiography.",
    "detailedExplanation": "Published in 1969, 'I Know Why the Caged Bird Sings' is Maya Angelou's first and most famous autobiography, covering her early years from age 3 to 17. The book deals with themes of racism, trauma, and resilience, and became a landmark work in American literature for its honest portrayal of African American experience. The title comes from Paul Laurence Dunbar's poem 'Sympathy,' and the book was nominated for a National Book Award and spent two years on the New York Times bestseller list.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Know_Why_the_Caged_Bird_Sings",
    "citationTitle": "Wikipedia: I Know Why the Caged Bird Sings"
  },
  {
    "id": "2ac1175f-4937-4c03-86c3-4997cfd7bf5d",
    "text": "Which Beat Generation writer authored 'On the Road'?",
    "options": [
      "Allen Ginsberg",
      "William S. Burroughs",
      "Jack Kerouac",
      "Gary Snyder"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jack Kerouac wrote 'On the Road,' a defining novel of the Beat Generation.",
    "detailedExplanation": "Jack Kerouac's 'On the Road,' published in 1957, became the defining novel of the Beat Generation movement. Written in a spontaneous, stream-of-consciousness style that Kerouac called 'spontaneous prose,' the novel was famously typed on a continuous 120-foot scroll of paper. The book chronicles the cross-country travels of the narrator Sal Paradise and his friend Dean Moriarty, and became a cultural touchstone for the counterculture movement of the 1960s, inspiring countless young Americans to hit the road in search of authentic experience.",
    "citationUrl": "https://en.wikipedia.org/wiki/On_the_Road",
    "citationTitle": "Wikipedia: On the Road"
  },
  {
    "id": "330812a3-f137-4327-aaec-377244eb66dd",
    "text": "Toni Morrison won the Pulitzer Prize for Fiction in 1988 for which novel?",
    "options": [
      "Song of Solomon",
      "Beloved",
      "The Bluest Eye",
      "Jazz"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Beloved' won Morrison the 1988 Pulitzer Prize for Fiction.",
    "detailedExplanation": "Toni Morrison's 1987 novel 'Beloved' won the Pulitzer Prize for Fiction in 1988, cementing her status as one of America's greatest writers. The novel tells the story of a former slave haunted by the ghost of her deceased daughter, exploring themes of slavery, trauma, and memory. 'Beloved' was inspired by the true story of Margaret Garner, an escaped slave who killed her own child rather than see her returned to slavery. Morrison later became the first African American woman to win the Nobel Prize in Literature in 1993.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beloved_(novel)",
    "citationTitle": "Wikipedia: Beloved (novel)"
  },
  {
    "id": "ea3e2eac-9956-4077-b7ab-9c373628f4c0",
    "text": "What is the setting of Harper Lee's 'To Kill a Mockingbird'?",
    "options": [
      "A fictional town in Mississippi",
      "A fictional town in Alabama",
      "A real town in Georgia",
      "A fictional town in South Carolina"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The novel is set in the fictional town of Maycomb, Alabama.",
    "detailedExplanation": "Harper Lee's 'To Kill a Mockingbird' is set in the fictional town of Maycomb, Alabama, during the 1930s. The setting is based on Lee's hometown of Monroeville, Alabama, where she grew up. The small Southern town setting is crucial to the novel's exploration of racial prejudice, social class, and moral development during the Great Depression era. The fictional Maycomb serves as a microcosm of the American South, allowing Lee to examine the complexities of race relations and social justice in a deeply segregated society.",
    "citationUrl": "https://en.wikipedia.org/wiki/To_Kill_a_Mockingbird",
    "citationTitle": "Wikipedia: To Kill a Mockingbird"
  },
  {
    "id": "be62d536-c3d7-489f-ba88-d79bd94404fb",
    "text": "Which American author created the detective character Philip Marlowe?",
    "options": [
      "Dashiell Hammett",
      "Raymond Chandler",
      "Ross Macdonald",
      "James M. Cain"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Raymond Chandler created the iconic private detective Philip Marlowe.",
    "detailedExplanation": "Raymond Chandler created Philip Marlowe, one of the most influential private detectives in American crime fiction. Marlowe first appeared in Chandler's 1939 novel 'The Big Sleep' and went on to star in six more novels. Set in Los Angeles, the Marlowe stories helped define the hard-boiled detective genre with their cynical worldview, sharp dialogue, and atmospheric descriptions of urban corruption. Chandler's work has had a lasting impact on both literature and film noir, with Marlowe being portrayed by actors like Humphrey Bogart and Robert Mitchum in movie adaptations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Philip_Marlowe",
    "citationTitle": "Wikipedia: Philip Marlowe"
  },
  {
    "id": "cc28b3d0-52d2-4d1e-8466-c7e1ee0869b2",
    "text": "What major theme does John Steinbeck explore in 'The Grapes of Wrath'?",
    "options": [
      "The American Civil War",
      "The Great Depression and Dust Bowl migration",
      "World War II",
      "The California Gold Rush"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The novel follows the Joad family's migration from Oklahoma during the Dust Bowl era.",
    "detailedExplanation": "'The Grapes of Wrath,' published in 1939, chronicles the journey of the Joad family as they migrate from Oklahoma to California during the Great Depression, driven by the ecological disaster known as the Dust Bowl. Steinbeck's novel explores themes of poverty, social injustice, and the struggle for dignity in the face of economic hardship. The book won the Pulitzer Prize for Fiction in 1940 and contributed to Steinbeck receiving the Nobel Prize in Literature in 1962. It remains a powerful indictment of economic inequality and a testament to human resilience during one of America's darkest periods.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Grapes_of_Wrath",
    "citationTitle": "Wikipedia: The Grapes of Wrath"
  },
  {
    "id": "39d37c73-9d1d-4def-8d7d-a7031ced470c",
    "text": "Which American author wrote the short story 'The Lottery', famous for its shocking ending about a small town ritual?",
    "options": [
      "Shirley Jackson",
      "Flannery O'Connor",
      "Eudora Welty",
      "Joyce Carol Oates"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Shirley Jackson wrote 'The Lottery' in 1948.",
    "detailedExplanation": "Shirley Jackson's 'The Lottery' was first published in The New Yorker in 1948 and became one of the most famous and controversial short stories in American literature. The story depicts a seemingly normal small town that holds an annual lottery with a horrifying twist ending. The story generated massive reader response and controversy when first published, with many readers canceling their New Yorker subscriptions in protest.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Lottery",
    "citationTitle": "Wikipedia: The Lottery"
  },
  {
    "id": "32607ff7-5dfe-4d2c-89d7-340a8a0ab108",
    "text": "Which Tennessee Williams play features the characters Blanche DuBois and Stanley Kowalski?",
    "options": [
      "Cat on a Hot Tin Roof",
      "The Glass Menagerie",
      "A Streetcar Named Desire",
      "Summer and Smoke"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'A Streetcar Named Desire' features Blanche DuBois and Stanley Kowalski as central characters.",
    "detailedExplanation": "Tennessee Williams' 'A Streetcar Named Desire' premiered on Broadway in 1947 and won the Pulitzer Prize for Drama in 1948. The play centers on the conflict between Blanche DuBois, a fading Southern belle with a troubled past, and her brutish brother-in-law Stanley Kowalski. The play is considered one of the greatest American dramas and was adapted into a famous 1951 film starring Marlon Brando and Vivien Leigh.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Streetcar_Named_Desire",
    "citationTitle": "Wikipedia: A Streetcar Named Desire"
  },
  {
    "id": "5ca64517-8ce1-4d66-a683-2f87d5d4777d",
    "text": "What pen name did Samuel Clemens use for his famous novels including 'The Adventures of Tom Sawyer'?",
    "options": [
      "O. Henry",
      "Mark Twain",
      "Washington Irving",
      "Bret Harte"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Samuel Clemens wrote under the pen name Mark Twain.",
    "detailedExplanation": "Samuel Langhorne Clemens adopted the pen name Mark Twain, derived from riverboat terminology meaning 'two fathoms deep' or safe water for navigation. Under this pseudonym, he became one of America's most beloved authors, writing classics like 'The Adventures of Tom Sawyer' (1876) and 'Adventures of Huckleberry Finn' (1884). Twain's works are celebrated for their wit, social commentary, and authentic portrayal of American life along the Mississippi River.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mark_Twain",
    "citationTitle": "Wikipedia: Mark Twain"
  },
  {
    "id": "d21cf9d2-f5f1-484a-8f50-76f6b3de3986",
    "text": "Which American poet wrote 'The Road Not Taken', one of the most frequently quoted poems in American literature?",
    "options": [
      "Walt Whitman",
      "Robert Frost",
      "Emily Dickinson",
      "Langston Hughes"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Robert Frost wrote 'The Road Not Taken' in 1915.",
    "detailedExplanation": "Robert Frost's 'The Road Not Taken' was first published in 1916 in his collection 'Mountain Interval'. The poem, famous for its closing lines about taking 'the road less traveled by', is often misinterpreted as advocating nonconformity, though Frost intended it as a more complex meditation on choices and their consequences. Frost won four Pulitzer Prizes for Poetry and is considered one of America's greatest poets, known for his depictions of rural New England life.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Road_Not_Taken",
    "citationTitle": "Wikipedia: The Road Not Taken"
  },
  {
    "id": "5b334b86-f5bb-4cc1-b8b5-6cc499b55c80",
    "text": "What is the title of Zora Neale Hurston's most famous novel, set in rural Florida during the early 20th century?",
    "options": [
      "Their Eyes Were Watching God",
      "Seraph on the Suwanee",
      "Jonah's Gourd Vine",
      "Dust Tracks on a Road"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Their Eyes Were Watching God' is Hurston's most celebrated novel.",
    "detailedExplanation": "Zora Neale Hurston's 'Their Eyes Were Watching God', published in 1937, is considered a masterpiece of the Harlem Renaissance and African American literature. The novel tells the story of Janie Crawford, a Black woman in rural Florida searching for love and self-fulfillment. Initially overlooked, the novel was rediscovered in the 1970s and is now widely taught as a classic, praised for its lyrical prose and authentic portrayal of African American dialect and culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Their_Eyes_Were_Watching_God",
    "citationTitle": "Wikipedia: Their Eyes Were Watching God"
  },
  {
    "id": "591de71f-771f-4064-a626-1560cf29ca8c",
    "text": "Which American author wrote 'Slaughterhouse-Five', a darkly comic novel about World War II and time travel?",
    "options": [
      "Joseph Heller",
      "Norman Mailer",
      "Kurt Vonnegut",
      "Thomas Pynchon"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Kurt Vonnegut wrote 'Slaughterhouse-Five' in 1969.",
    "detailedExplanation": "Kurt Vonnegut's 'Slaughterhouse-Five', published in 1969, is a semi-autobiographical anti-war novel that blends dark humor with science fiction elements. The story follows Billy Pilgrim, who becomes 'unstuck in time' and experiences the Dresden bombing during World War II, which Vonnegut himself witnessed as a prisoner of war. The novel's famous refrain 'So it goes' appears after every mention of death, highlighting the absurdity and inevitability of mortality during wartime.",
    "citationUrl": "https://en.wikipedia.org/wiki/Slaughterhouse-Five",
    "citationTitle": "Wikipedia: Slaughterhouse-Five"
  },
  {
    "id": "e6d0fc12-83cf-4b11-9aae-5f090886d429",
    "text": "What is the name of the tragic protagonist in Arthur Miller's play 'Death of a Salesman'?",
    "options": [
      "Tom Wingfield",
      "Willy Loman",
      "Eddie Carbone",
      "John Proctor"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Willy Loman is the tragic salesman in Arthur Miller's play.",
    "detailedExplanation": "Willy Loman is the central character in Arthur Miller's 'Death of a Salesman' (1949), which won the Pulitzer Prize for Drama and is considered one of the greatest American plays. Loman is a failing traveling salesman who clings to false hopes and illusions about success and the American Dream. The play explores themes of family dysfunction, capitalism's failures, and the pursuit of an increasingly elusive American Dream through Willy's tragic downfall.",
    "citationUrl": "https://en.wikipedia.org/wiki/Death_of_a_Salesman",
    "citationTitle": "Wikipedia: Death of a Salesman"
  },
  {
    "id": "853e4bc0-bbfe-4553-93c7-e9615d00d563",
    "text": "Which American author created the fictional town of Yoknapatawpha County as the setting for many of his novels?",
    "options": [
      "William Faulkner",
      "Flannery O'Connor",
      "Carson McCullers",
      "Eudora Welty"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "William Faulkner created Yoknapatawpha County as a fictional setting for his works.",
    "detailedExplanation": "William Faulkner created the fictional Yoknapatawpha County, Mississippi, as the setting for most of his major novels and short stories, including 'The Sound and the Fury', 'As I Lay Dying', and 'Absalom, Absalom!'. This imaginary county was based on Lafayette County, Mississippi, where Faulkner lived. The interconnected stories and recurring characters across multiple works created a complex fictional universe that explored themes of Southern history, family, race, and social change. Faulkner won the Nobel Prize in Literature in 1949.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yoknapatawpha_County",
    "citationTitle": "Wikipedia: Yoknapatawpha County"
  },
  {
    "id": "f376586f-b3d6-440e-80d2-65318f4512c4",
    "text": "Which American author wrote the dystopian novel 'The Handmaid's Tale', depicting a totalitarian society called Gilead?",
    "options": [
      "Margaret Atwood",
      "Ursula K. Le Guin",
      "Octavia Butler",
      "Joyce Carol Oates"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Margaret Atwood wrote 'The Handmaid's Tale' in 1985.",
    "detailedExplanation": "Margaret Atwood, though Canadian-born, is often included in American literature discussions due to her significant influence and residence in North America. 'The Handmaid's Tale' (1985) is set in a near-future New England and depicts the Republic of Gilead, a totalitarian theocratic state that has overthrown the United States government. The novel explores themes of women's rights, religious fundamentalism, and political oppression, and has become increasingly relevant in contemporary discussions about reproductive rights and authoritarianism.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale",
    "citationTitle": "Wikipedia: The Handmaid's Tale"
  },
  {
    "id": "ce642ea6-8ada-4b77-b0c4-70451f0fbdb8",
    "text": "What is the name of the wealthy title character in F. Scott Fitzgerald's famous novel about the Jazz Age?",
    "options": [
      "Tom Buchanan",
      "Nick Carraway",
      "Jay Gatsby",
      "George Wilson"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jay Gatsby is the titular character of F. Scott Fitzgerald's 'The Great Gatsby'.",
    "detailedExplanation": "Jay Gatsby is the enigmatic millionaire protagonist of F. Scott Fitzgerald's 1925 masterpiece 'The Great Gatsby'. Born James Gatz, he reinvents himself as the wealthy Jay Gatsby in pursuit of his lost love, Daisy Buchanan. The novel, narrated by Nick Carraway, serves as a critique of the American Dream and the excess of the Jazz Age, with Gatsby's tragic pursuit of an idealized past representing the hollowness beneath the glittering surface of 1920s prosperity.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Great_Gatsby",
    "citationTitle": "Wikipedia: The Great Gatsby"
  },
  {
    "id": "ae9d1882-1748-487d-8726-3da5bbb91f76",
    "text": "Which American poet is known for her unconventional use of capitalization and punctuation, and wrote nearly 1,800 poems including 'Because I could not stop for Death'?",
    "options": [
      "Elizabeth Bishop",
      "Sylvia Plath",
      "Emily Dickinson",
      "Anne Sexton"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Emily Dickinson was known for her unique punctuation style and wrote 'Because I could not stop for Death'.",
    "detailedExplanation": "Emily Dickinson (1830-1886) was one of America's most important poets, though only a handful of her nearly 1,800 poems were published during her lifetime. She lived most of her life in seclusion in Amherst, Massachusetts, developing a highly distinctive poetic voice characterized by unconventional capitalization, extensive use of dashes, slant rhyme, and compressed language. Her poem 'Because I could not stop for Death' is one of her most famous works, personifying death as a courteous carriage driver taking the speaker on a journey toward eternity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Emily_Dickinson",
    "citationTitle": "Wikipedia: Emily Dickinson"
  },
  {
    "id": "a8e3da03-abad-4b4d-bc4b-16b8c6c1a6ae",
    "text": "Which Edgar Allan Poe short story features a narrator who believes he can hear his victim's heart beating beneath the floorboards?",
    "options": [
      "The Fall of the House of Usher",
      "The Tell-Tale Heart",
      "The Black Cat",
      "The Cask of Amontillado"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'The Tell-Tale Heart' features the narrator hearing the victim's heartbeat under the floorboards.",
    "detailedExplanation": "'The Tell-Tale Heart' (1843) is one of Edgar Allan Poe's most famous short stories, told by an unnamed narrator who insists on his sanity while describing how he murdered an old man because of his 'vulture eye.' After dismembering the body and hiding it beneath the floorboards, the narrator becomes convinced he can hear the dead man's heart still beating. The psychological horror builds as the sound drives him to confess his crime to visiting police officers, illustrating Poe's mastery of exploring guilt, paranoia, and the unreliable narrator.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Tell-Tale_Heart",
    "citationTitle": "Wikipedia: The Tell-Tale Heart"
  },
  {
    "id": "9f8b1308-254a-4ace-ae17-a011c5f84e0d",
    "text": "Which American author wrote 'Invisible Man', a novel about African American identity that begins with the protagonist living underground in a basement?",
    "options": [
      "James Baldwin",
      "Ralph Ellison",
      "Richard Wright",
      "Langston Hughes"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ralph Ellison wrote 'Invisible Man', which won the National Book Award in 1953.",
    "detailedExplanation": "Ralph Ellison's 'Invisible Man' (1952) is a groundbreaking novel that explores themes of identity, racism, and social invisibility in mid-20th century America. The unnamed African American narrator tells his story from an underground location illuminated by 1,369 light bulbs, explaining how he became 'invisible' to society. The novel traces his journey from the South to Harlem, through college, and his involvement with a political organization resembling the Communist Party. Ellison's masterwork won the National Book Award and is widely considered one of the most important American novels of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Invisible_Man",
    "citationTitle": "Wikipedia: Invisible Man"
  }
]