[
  {
    "id": "2a58a057-1a5b-4086-80b6-357ecc0804b2",
    "text": "What is widely considered to be the first commercially successful video game?",
    "options": [
      "Pac-Man",
      "Pong",
      "Space Invaders",
      "Asteroids"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Pong was released by Atari in 1972 and became the first commercially successful video game.",
    "detailedExplanation": "Pong, released by Atari in 1972, is widely recognized as the first commercially successful video game. Created by Allan Alcorn, this simple tennis-like game featured two paddles and a ball, and became a cultural phenomenon that launched the video game industry. While earlier games existed, Pong was the first to achieve widespread commercial success and establish video games as a viable entertainment medium.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pong",
    "citationTitle": "Wikipedia: Pong"
  },
  {
    "id": "92be97fc-ee17-4262-91d0-86f7014c7728",
    "text": "Which company created the Nintendo Entertainment System (NES)?",
    "options": [
      "Sega",
      "Nintendo",
      "Sony",
      "Atari"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The Nintendo Entertainment System was created by Nintendo and released in 1985.",
    "detailedExplanation": "The Nintendo Entertainment System (NES) was developed and manufactured by Nintendo, originally released in Japan as the Family Computer (Famicom) in 1983, then launched in North America in 1985. The NES revitalized the video game industry after the 1983 crash and introduced iconic franchises like Super Mario Bros., The Legend of Zelda, and Metroid. Nintendo's strict quality control and licensing system helped establish industry standards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nintendo_Entertainment_System",
    "citationTitle": "Wikipedia: Nintendo Entertainment System"
  },
  {
    "id": "8605ea42-5333-4a58-9c21-164c6a94b00a",
    "text": "In what decade did the famous 'Video Game Crash' occur in North America?",
    "options": [
      "1970s",
      "1980s",
      "1990s",
      "2000s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The North American video game crash occurred in 1983, during the 1980s.",
    "detailedExplanation": "The North American video game crash of 1983 was a major recession in the video game industry that lasted from 1983 to 1985. It was caused by oversaturation of the market with low-quality games, lack of consumer confidence, and competition from personal computers. The crash led to the bankruptcy of several companies and nearly killed the home console market in North America until Nintendo's successful introduction of the NES in 1985.",
    "citationUrl": "https://en.wikipedia.org/wiki/Video_game_crash_of_1983",
    "citationTitle": "Wikipedia: Video game crash of 1983"
  },
  {
    "id": "f50dc6df-21dd-4bd7-8471-a29098f064fe",
    "text": "Which character was originally known as 'Jumpman' before getting his famous name?",
    "options": [
      "Sonic the Hedgehog",
      "Mario",
      "Link",
      "Pac-Man"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Mario was originally called 'Jumpman' in the 1981 arcade game Donkey Kong.",
    "detailedExplanation": "Mario, Nintendo's iconic plumber mascot, was originally named 'Jumpman' when he first appeared in the 1981 arcade game Donkey Kong. Created by Shigeru Miyamoto, the character was later renamed Mario after Mario Segale, the landlord of Nintendo's American warehouse. The character's design was influenced by technical limitations of the time, with his mustache, hat, and overalls chosen to make his features more distinguishable in low-resolution graphics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mario",
    "citationTitle": "Wikipedia: Mario"
  },
  {
    "id": "03ff9221-eb4a-4f5f-b3f5-23f3e7b1d66b",
    "text": "What was the first home video game console?",
    "options": [
      "Atari 2600",
      "Magnavox Odyssey",
      "Intellivision",
      "ColecoVision"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The Magnavox Odyssey, released in 1972, was the first home video game console.",
    "detailedExplanation": "The Magnavox Odyssey was the first commercial home video game console, released in 1972. Designed by Ralph Baer, often called the 'Father of Video Games,' the Odyssey was a simple system that used analog circuits and plastic overlays on the TV screen to simulate different games. While primitive by today's standards, it laid the groundwork for the entire home gaming industry and inspired the creation of Pong and other early arcade games.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magnavox_Odyssey",
    "citationTitle": "Wikipedia: Magnavox Odyssey"
  },
  {
    "id": "1e9ad69d-5f54-40e1-8729-d4f230d365da",
    "text": "Which gaming company introduced the first handheld gaming device with interchangeable cartridges?",
    "options": [
      "Nintendo",
      "Sega",
      "Atari",
      "Milton Bradley"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Nintendo introduced the Game Boy in 1989, the first successful handheld with interchangeable cartridges.",
    "detailedExplanation": "Nintendo revolutionized portable gaming with the Game Boy in 1989, which became the first widely successful handheld gaming device with interchangeable cartridges. While other companies had attempted handheld systems before, the Game Boy's long battery life, durable design, and strong game library (including Tetris) made it a massive success. It established Nintendo's dominance in the handheld market for decades to come.",
    "citationUrl": "https://en.wikipedia.org/wiki/Game_Boy",
    "citationTitle": "Wikipedia: Game Boy"
  },
  {
    "id": "eb9ee9b5-b055-4767-a990-c9886e76d219",
    "text": "What was the best-selling video game of the 1980s?",
    "options": [
      "Super Mario Bros.",
      "Pac-Man",
      "Donkey Kong",
      "Space Invaders"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Super Mario Bros., released in 1985, became the best-selling game of the 1980s.",
    "detailedExplanation": "Super Mario Bros., released for the Nintendo Entertainment System in 1985, became the best-selling video game of the 1980s with over 40 million copies sold. Created by Shigeru Miyamoto, the game established many conventions of the platformer genre and helped revive the video game industry after the 1983 crash. Its success was crucial to the NES's dominance and established Mario as Nintendo's mascot and one of gaming's most recognizable characters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Mario_Bros.",
    "citationTitle": "Wikipedia: Super Mario Bros."
  },
  {
    "id": "f6f37427-f95c-4301-a809-7eef8d3bec40",
    "text": "Which arcade game is credited with starting the 'Golden Age of Arcade Games'?",
    "options": [
      "Pac-Man",
      "Space Invaders",
      "Asteroids",
      "Centipede"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Space Invaders, released in 1978, is credited with beginning the Golden Age of Arcade Games.",
    "detailedExplanation": "Space Invaders, created by Tomohiro Nishikado and released by Taito in 1978, is widely credited with launching the 'Golden Age of Arcade Games' that lasted from the late 1970s to the mid-1980s. The game's unprecedented popularity caused coin shortages in Japan and established the template for many future arcade games. Its success demonstrated the commercial viability of video games and inspired countless imitators and innovations in the arcade industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Space_Invaders",
    "citationTitle": "Wikipedia: Space Invaders"
  },
  {
    "id": "1f73168d-dca0-451f-87e0-732302a0f245",
    "text": "Which Japanese company released the first PlayStation console in 1994?",
    "options": [
      "Nintendo",
      "Sega",
      "Sony",
      "Atari"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Sony released the original PlayStation in Japan in December 1994.",
    "detailedExplanation": "Sony entered the video game console market with the PlayStation in 1994, originally developed as a collaboration with Nintendo that fell through. The PlayStation became one of the most successful gaming consoles ever, selling over 100 million units worldwide and establishing Sony as a major player in the gaming industry alongside Nintendo and Sega.",
    "citationUrl": "https://en.wikipedia.org/wiki/PlayStation_(console)",
    "citationTitle": "Wikipedia: PlayStation (console)"
  },
  {
    "id": "b1a38165-2257-425d-8a8a-03201844b299",
    "text": "What was the name of Sega's 16-bit home console released to compete with Nintendo in the late 1980s?",
    "options": [
      "Sega Saturn",
      "Sega Dreamcast",
      "Sega Genesis",
      "Sega Master System"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The Sega Genesis (known as Mega Drive outside North America) was Sega's 16-bit console.",
    "detailedExplanation": "The Sega Genesis, released in 1988 in Japan as the Mega Drive, was Sega's answer to Nintendo's dominance in the home console market. It featured superior graphics and sound capabilities compared to the 8-bit NES, and helped establish the famous 'Console Wars' of the early 1990s with iconic games like Sonic the Hedgehog serving as Sega's mascot to rival Nintendo's Mario.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sega_Genesis",
    "citationTitle": "Wikipedia: Sega Genesis"
  },
  {
    "id": "07e31d07-54d7-4a2f-b8b2-1c934298b430",
    "text": "Which arcade company created the classic games Pac-Man and Galaga?",
    "options": [
      "Atari",
      "Namco",
      "Capcom",
      "Konami"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Namco developed both Pac-Man (1980) and Galaga (1981).",
    "detailedExplanation": "Namco was one of the pioneering arcade game companies, creating some of the most iconic games in video game history. Pac-Man, released in 1980, became a cultural phenomenon and one of the highest-grossing arcade games of all time. Galaga, released in 1981, became equally beloved as a classic fixed shooter game, cementing Namco's reputation as a premier arcade game developer.",
    "citationUrl": "https://en.wikipedia.org/wiki/Namco",
    "citationTitle": "Wikipedia: Namco"
  },
  {
    "id": "5f4e4a8f-696c-49d5-a9c3-959d1efb7ff9",
    "text": "What was the first video game to feature a high score save system?",
    "options": [
      "Space Invaders",
      "Asteroids",
      "Centipede",
      "Defender"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Space Invaders was the first arcade game to track and save high scores.",
    "detailedExplanation": "Released by Taito in 1978, Space Invaders revolutionized arcade gaming by introducing the concept of recording high scores, allowing players to enter their initials and compete for lasting recognition. This feature became a standard in arcade games and was crucial in creating the competitive gaming culture that drives much of modern gaming today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Space_Invaders",
    "citationTitle": "Wikipedia: Space Invaders"
  },
  {
    "id": "a899cc5c-e1b1-440e-a312-4b0ab7a5174c",
    "text": "Which gaming platform introduced achievements/trophies as a standard feature across all games?",
    "options": [
      "PlayStation 2",
      "Xbox 360",
      "Nintendo Wii",
      "PC Gaming"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Xbox 360 was the first console to implement a system-wide achievement system in 2005.",
    "detailedExplanation": "Microsoft's Xbox 360, launched in 2005, introduced the 'Achievement' system that awarded points called 'Gamerscore' for completing specific tasks in games. This feature proved so popular that Sony later implemented a similar 'Trophy' system on PlayStation 3, and achievements have since become a standard feature across most gaming platforms, fundamentally changing how players engage with games.",
    "citationUrl": "https://en.wikipedia.org/wiki/Xbox_360",
    "citationTitle": "Wikipedia: Xbox 360"
  },
  {
    "id": "d8d1f6c3-e3ac-4466-b92a-94a2383f5ffc",
    "text": "Which company developed the Game Boy, the most successful handheld console of the 1990s?",
    "options": [
      "Sega",
      "Atari",
      "Nintendo",
      "Sony"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Nintendo released the Game Boy in 1989, which became incredibly successful.",
    "detailedExplanation": "Nintendo's Game Boy, released in 1989, dominated the handheld gaming market for over a decade. Despite having a monochrome screen and simple graphics, it outsold more technologically advanced competitors like Sega's Game Gear due to its excellent battery life, durability, and strong game library including Tetris, which came bundled with the system. The Game Boy sold over 118 million units worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Game_Boy",
    "citationTitle": "Wikipedia: Game Boy"
  },
  {
    "id": "3b9b438e-bca9-4328-b91e-c835daf75513",
    "text": "What was the first video game to use 3D polygon graphics?",
    "options": [
      "Battlezone",
      "3D Monster Maze",
      "Elite",
      "I, Robot"
    ],
    "correctIndex": 3,
    "category": "science",
    "difficulty": "easy",
    "explanation": "I, Robot by Atari in 1984 was the first arcade game to use 3D filled polygon graphics.",
    "detailedExplanation": "Atari's 'I, Robot' released in 1984 was groundbreaking as the first commercial video game to use real-time 3D filled polygon graphics. While earlier games like Battlezone used wireframe 3D graphics, I, Robot featured solid 3D shapes and was far ahead of its time technologically. Unfortunately, it was not commercially successful, partly because arcade audiences weren't ready for such advanced graphics and complex gameplay.",
    "citationUrl": "https://en.wikipedia.org/wiki/I,_Robot_(video_game)",
    "citationTitle": "Wikipedia: I, Robot (video game)"
  },
  {
    "id": "9c71687d-4a7f-4cd6-9ac3-a1bc37226a40",
    "text": "Which was the first video game console to use CD-ROMs instead of cartridges?",
    "options": [
      "Sega Saturn",
      "Sony PlayStation",
      "TurboGrafx-16",
      "Neo Geo CD"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The TurboGrafx-16 CD (PC Engine CD) was the first successful CD-ROM console add-on in 1988.",
    "detailedExplanation": "The TurboGrafx-16 CD, known as the PC Engine CD-ROM² in Japan, was released in 1988 as an add-on to the TurboGrafx-16 console. It was the first successful home gaming system to use CD-ROMs, offering much larger storage capacity than cartridges, which allowed for CD-quality audio, voice acting, and more complex games. This technology paved the way for later CD-based consoles like the PlayStation and Sega Saturn.",
    "citationUrl": "https://en.wikipedia.org/wiki/TurboGrafx-16",
    "citationTitle": "Wikipedia: TurboGrafx-16"
  },
  {
    "id": "954d9c2f-4638-4c6a-9603-0035488495b1",
    "text": "Which video game company was founded by Nolan Bushnell and is considered one of the pioneers of the arcade video game industry?",
    "options": [
      "Atari",
      "Activision",
      "Electronic Arts",
      "Midway"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Atari was founded by Nolan Bushnell in 1972 and became one of the most influential early video game companies.",
    "detailedExplanation": "Atari was founded by Nolan Bushnell and Ted Dabney in 1972, becoming one of the first and most influential video game companies. The company was responsible for creating Pong, one of the first commercially successful arcade games, and later developed the Atari 2600 home console. Bushnell is often called the 'father of the video game industry' for his pioneering role in establishing the commercial video game market.",
    "citationUrl": "https://en.wikipedia.org/wiki/Atari",
    "citationTitle": "Wikipedia: Atari"
  },
  {
    "id": "d0cbb96a-51b3-4eaa-8a4f-e828556881b7",
    "text": "What was the maximum number of colors that the original Game Boy could display on screen?",
    "options": [
      "4 shades of green",
      "16 colors",
      "2 colors only",
      "8 colors"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The original Game Boy could only display 4 shades of green on its monochrome LCD screen.",
    "detailedExplanation": "The original Nintendo Game Boy, released in 1989, featured a monochrome LCD screen that could display 4 different shades of green (technically grayscale but with a green tint). This limitation was actually one of the reasons for its success, as it allowed for longer battery life compared to color handheld systems. The Game Boy Color, released in 1998, was the first Game Boy model to support full color graphics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Game_Boy",
    "citationTitle": "Wikipedia: Game Boy"
  },
  {
    "id": "5e308801-8dd4-433c-9827-db9b0d44188c",
    "text": "Which classic arcade game was originally called 'Puck Man' in Japan but renamed for its Western release?",
    "options": [
      "Pac-Man",
      "Frogger",
      "Centipede",
      "Asteroids"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Pac-Man was originally called 'Puck Man' in Japan but was renamed to prevent vandalism of arcade cabinets.",
    "detailedExplanation": "The iconic arcade game we know as Pac-Man was originally released in Japan in 1980 under the name 'Puck Man,' derived from the Japanese phrase 'paku-paku' which describes the sound of eating. However, when Midway brought the game to North America, they changed the name to 'Pac-Man' because they were concerned that vandals might alter the 'P' in 'Puck' to create an offensive word on the arcade cabinets.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pac-Man",
    "citationTitle": "Wikipedia: Pac-Man"
  },
  {
    "id": "2ad86e53-8001-4230-b22b-7e2f845a9775",
    "text": "Which was the first video game console to introduce shoulder buttons on its controller?",
    "options": [
      "Super Nintendo Entertainment System",
      "Sega Genesis",
      "Nintendo Entertainment System",
      "Atari 7800"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The Super Nintendo Entertainment System (SNES) introduced the first shoulder buttons (L and R) on a game controller in 1990.",
    "detailedExplanation": "The Super Nintendo Entertainment System, released in 1990 in Japan and 1991 in North America, was the first gaming console to feature shoulder buttons on its controller. The SNES controller included L and R shoulder buttons positioned on the top edge of the controller, which became a standard feature that influenced all future controller designs. These buttons provided additional input options for games and became particularly important for racing games and other genres requiring analog-like control.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Nintendo_Entertainment_System",
    "citationTitle": "Wikipedia: Super Nintendo Entertainment System"
  }
]