[
  {
    "id": "558355f7-17f8-49e6-be75-780cdb4bed11",
    "text": "Which arcade game, released in 1980, was the first to feature a cutscene between levels?",
    "options": [
      "Pac-Man",
      "Donkey Kong",
      "Space Invaders",
      "Asteroids"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Pac-Man was the first arcade game to include cutscenes, featuring brief animated sequences between certain levels.",
    "detailedExplanation": "Pac-Man, released by Namco in 1980, revolutionized arcade gaming not just through its non-violent gameplay and iconic character, but also by being the first arcade game to feature cutscenes. These brief animated sequences, showing Pac-Man being chased by ghosts in humorous situations, appeared between certain levels and helped establish narrative elements in arcade games. This innovation influenced countless future games and demonstrated that arcade games could be more than just repetitive action.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pac-Man",
    "citationTitle": "Wikipedia: Pac-Man"
  },
  {
    "id": "28579691-eef6-452a-aae1-e0ea4d897cb3",
    "text": "What was the name of the failed Atari console that contributed to the video game crash of 1983?",
    "options": [
      "Atari 5200",
      "Atari Jaguar",
      "Atari 7800",
      "Atari Lynx"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "The Atari 5200, released in 1982, was a commercial failure that contributed to the video game crash of 1983.",
    "detailedExplanation": "The Atari 5200 SuperSystem was released in November 1982 as Atari's answer to the Intellivision and ColecoVision consoles. However, it suffered from numerous problems including non-centering analog controllers that frequently broke, lack of backward compatibility with the popular Atari 2600 library, and a high price point. The console's failure, combined with an oversaturated market and poor-quality games, contributed significantly to the North American video game crash of 1983, which nearly destroyed the video game industry in the region.",
    "citationUrl": "https://en.wikipedia.org/wiki/Atari_5200",
    "citationTitle": "Wikipedia: Atari 5200"
  },
  {
    "id": "68210256-ebbe-4130-ad2b-2f708561300a",
    "text": "Which company created the first successful handheld gaming device with interchangeable cartridges?",
    "options": [
      "Nintendo",
      "Sega",
      "Mattel",
      "Atari"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Nintendo's Game Boy, released in 1989, was the first truly successful handheld gaming device with interchangeable cartridges.",
    "detailedExplanation": "While Mattel released the Intellivision handheld and other companies made attempts at portable gaming, Nintendo's Game Boy, released in April 1989, was the first handheld gaming device with interchangeable cartridges to achieve massive commercial success. Designed by Gunpei Yokoi, the Game Boy featured a monochrome LCD screen, excellent battery life, and launched with Tetris as a pack-in game. It sold over 118 million units worldwide and established Nintendo's dominance in the handheld gaming market for decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Game_Boy",
    "citationTitle": "Wikipedia: Game Boy"
  },
  {
    "id": "d9ac7d3c-dc30-4d77-8341-2cfd2ccfc5ea",
    "text": "What was the first video game to be played in space?",
    "options": [
      "Tetris",
      "Pac-Man",
      "Space Invaders",
      "Pong"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Tetris was the first video game played in space when cosmonaut Aleksandr Serebrov brought a Game Boy aboard the Mir space station in 1993.",
    "detailedExplanation": "In 1993, Russian cosmonaut Aleksandr Serebrov made gaming history by bringing a Nintendo Game Boy loaded with Tetris aboard the Mir space station, making Tetris the first video game to be played in space. The Game Boy traveled to space and back, and was later sold at auction. This event highlighted the global cultural impact of both Tetris and portable gaming, as the puzzle game had become so universally appealing that it followed humanity beyond Earth's atmosphere.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tetris",
    "citationTitle": "Wikipedia: Tetris"
  },
  {
    "id": "5a4ad457-da85-4c15-99c1-12f548139926",
    "text": "Which fighting game series introduced the six-button control scheme that became standard for the genre?",
    "options": [
      "Street Fighter",
      "Mortal Kombat",
      "King of Fighters",
      "Tekken"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Street Fighter II introduced the six-button control scheme (three punches and three kicks of varying strength) that became the standard for fighting games.",
    "detailedExplanation": "Street Fighter II, released by Capcom in 1991, revolutionized the fighting game genre and established many conventions still used today. One of its most significant contributions was the six-button control scheme, featuring three punch buttons and three kick buttons of varying strengths (light, medium, and heavy). This system allowed for much more complex and varied combat than previous fighting games and became the template that most subsequent fighting games would follow, influencing everything from Mortal Kombat to modern fighters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Street_Fighter_II",
    "citationTitle": "Wikipedia: Street Fighter II"
  },
  {
    "id": "7d0fbbc1-3143-42d1-b73f-bd7cd54e94dc",
    "text": "Which was the first video game console to use optical discs as its primary storage medium?",
    "options": [
      "PC Engine CD",
      "Sega CD",
      "3DO Interactive Multiplayer",
      "Phillips CD-i"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "The PC Engine CD (TurboGrafx-CD in North America), released in 1988, was the first game console to use CD-ROM as its primary storage medium.",
    "detailedExplanation": "The PC Engine CD-ROM² System, known as the TurboGrafx-CD in North America, was released in Japan in December 1988 as an add-on for the PC Engine console. It was the first gaming system designed to use compact discs as its primary storage medium, offering much larger storage capacity than cartridges of the time. This allowed for games with CD-quality audio, voice acting, and full-motion video sequences. While the system had limited commercial success outside Japan, it pioneered the transition to optical media that would become standard in the gaming industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/TurboGrafx-16",
    "citationTitle": "Wikipedia: TurboGrafx-16"
  },
  {
    "id": "efff9c4c-450d-4416-9063-316f489091d0",
    "text": "What was the first massively multiplayer online role-playing game (MMORPG) to reach over one million subscribers?",
    "options": [
      "Ultima Online",
      "EverQuest",
      "World of Warcraft",
      "Lineage"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "EverQuest was the first MMORPG to surpass one million subscribers, reaching this milestone in the early 2000s.",
    "detailedExplanation": "EverQuest, developed by Verant Interactive and published by Sony Online Entertainment in 1999, became the first MMORPG to reach the milestone of one million subscribers. The game built upon the foundation laid by earlier online games like Ultima Online and Meridian 59, but achieved unprecedented mainstream success with its 3D graphics, extensive character progression systems, and persistent fantasy world. EverQuest's success proved the commercial viability of subscription-based MMORPGs and paved the way for future games like World of Warcraft, which would later dwarf its subscriber numbers.",
    "citationUrl": "https://en.wikipedia.org/wiki/EverQuest",
    "citationTitle": "Wikipedia: EverQuest"
  },
  {
    "id": "cae588ec-d358-418f-974f-4e1f6271e783",
    "text": "Which video game is credited as the first commercially successful arcade video game, released in 1972?",
    "options": [
      "Pong",
      "Space Invaders",
      "Asteroids",
      "Pac-Man"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Pong was the first commercially successful arcade video game, created by Atari in 1972.",
    "detailedExplanation": "Pong, developed by Allan Alcorn at Atari, was released in November 1972 and became the first commercially successful arcade video game. The simple tennis-like game consisted of two paddles and a bouncing ball, and its success helped establish the video game industry. While earlier games like Computer Space existed, Pong was the first to achieve widespread commercial success and public recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pong",
    "citationTitle": "Wikipedia: Pong"
  },
  {
    "id": "78bf7247-bc4b-4ac6-a5ec-c099345e1e9e",
    "text": "What revolutionary gaming feature did Super Mario 64 introduce to the platformer genre in 1996?",
    "options": [
      "Full 3D movement and camera control",
      "Voice acting",
      "Multiplayer co-op",
      "Save files"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Super Mario 64 introduced full 3D movement and analog camera control to platformers, revolutionizing the genre.",
    "detailedExplanation": "Super Mario 64, launched with the Nintendo 64 in 1996, was groundbreaking for introducing full 3D movement and analog camera control to the platformer genre. Players could move Mario in any direction using the analog stick, and the camera could be controlled independently. This represented a massive shift from the 2D side-scrolling platformers that had dominated the genre, setting the template for 3D platformers that followed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Mario_64",
    "citationTitle": "Wikipedia: Super Mario 64"
  },
  {
    "id": "9178ca7f-9c96-45c5-9496-644ed441bbfd",
    "text": "Which company developed the first graphics processing unit (GPU) specifically designed for gaming in 1999?",
    "options": [
      "NVIDIA",
      "ATI",
      "3dfx",
      "Intel"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "NVIDIA released the GeForce 256 in 1999, which they marketed as the world's first GPU.",
    "detailedExplanation": "NVIDIA released the GeForce 256 in October 1999, which they coined as the world's first Graphics Processing Unit (GPU). This chip was specifically designed to handle the complex mathematical calculations required for 3D graphics rendering, taking this workload off the main CPU. The GeForce 256 featured hardware transform and lighting capabilities, marking a significant advancement in gaming graphics technology and establishing NVIDIA as a major player in the gaming hardware market.",
    "citationUrl": "https://en.wikipedia.org/wiki/GeForce_256",
    "citationTitle": "Wikipedia: GeForce 256"
  },
  {
    "id": "b8fc513f-5b43-491d-b233-20829afea33c",
    "text": "What was the first video game to feature a high score save system, released in 1976?",
    "options": [
      "Star Fire",
      "Asteroids",
      "Galaga",
      "Centipede"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Star Fire was the first arcade game to allow players to save their high scores with their initials in 1979.",
    "detailedExplanation": "Star Fire, released by Exidy in 1979, was the first arcade game to feature a high score save system that allowed players to enter their initials and have their scores permanently saved. This innovation created a lasting competitive element in arcade gaming, encouraging players to return and try to beat previous records. The high score system became a standard feature in arcade games and was crucial in building the competitive gaming culture of the early 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Star_Fire",
    "citationTitle": "Wikipedia: Star Fire"
  },
  {
    "id": "77ea0399-c939-416a-85a1-cc00bd3c0f1d",
    "text": "Which game engine, first released in 1996, became one of the most influential in first-person shooter development?",
    "options": [
      "id Tech 1 (Doom engine)",
      "Unreal Engine",
      "CryEngine",
      "Source Engine"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "The id Tech 1 engine, also known as the Doom engine, was released in 1993 and became highly influential in FPS development.",
    "detailedExplanation": "The id Tech 1 engine, commonly called the Doom engine, was developed by id Software for the game Doom in 1993. This engine became one of the most influential in gaming history, particularly for first-person shooters. It introduced advanced features like texture mapping, dynamic lighting effects, and efficient rendering techniques. The engine was later open-sourced, leading to countless modifications and ports, and its influence can be seen in many subsequent FPS games and engines.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doom_engine",
    "citationTitle": "Wikipedia: Doom engine"
  },
  {
    "id": "f8d46a79-d196-469e-8148-c238a8f6d54b",
    "text": "What was the first video game console to support online gaming out of the box?",
    "options": [
      "Sega Dreamcast",
      "PlayStation 2",
      "Xbox",
      "GameCube"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "The Sega Dreamcast was the first console with built-in online capabilities, featuring a built-in modem.",
    "detailedExplanation": "The Sega Dreamcast, released in 1998 in Japan and 1999 in North America, was the first video game console to feature built-in online gaming capabilities. It included a 56k modem as standard equipment, allowing players to connect to the internet and play games online through the SegaNet service. Games like Phantasy Star Online and Quake III Arena took advantage of this connectivity, pioneering console-based online gaming years before other manufacturers adopted similar features.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dreamcast",
    "citationTitle": "Wikipedia: Dreamcast"
  },
  {
    "id": "9bb88740-6aa0-43fc-b5de-4b34b59a509d",
    "text": "Which gaming peripheral, released in 1989, was the first successful motion-controlled gaming device?",
    "options": [
      "Nintendo Power Glove",
      "Sega Activator",
      "Atari Mindlink",
      "Nintendo Wii Remote"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "The Nintendo Power Glove was released in 1989 as the first motion-controlled gaming peripheral, though it was not very successful.",
    "detailedExplanation": "The Nintendo Power Glove, released in 1989 for the NES, was the first commercially available motion-controlled gaming peripheral. Developed by Mattel in partnership with Nintendo, it used ultrasonic sensors to detect hand movements and finger positions. While innovative for its time, the Power Glove suffered from poor accuracy and limited game compatibility, making it more of a novelty than a practical gaming device. Despite its commercial failure, it paved the way for future motion-control technologies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Power_Glove",
    "citationTitle": "Wikipedia: Power Glove"
  },
  {
    "id": "c56ad5d2-b262-40db-9a12-c0f45bab42e3",
    "text": "Which programming language was specifically created for game development and first used in the Quake series?",
    "options": [
      "QuakeC",
      "UnrealScript",
      "Lua",
      "JavaScript"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "QuakeC was a programming language created by id Software specifically for scripting game logic in Quake.",
    "detailedExplanation": "QuakeC was a programming language developed by John Carmack at id Software specifically for the 1996 game Quake. It was designed to handle game logic, weapon behavior, and AI routines while keeping them separate from the core engine code. This separation allowed for easier modification and the creation of user-generated content. QuakeC became highly influential in the modding community and inspired similar scripting languages in other game engines, contributing to the growth of game modification culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/QuakeC",
    "citationTitle": "Wikipedia: QuakeC"
  },
  {
    "id": "1a4dc143-0871-48b3-b380-c7eddc1789f6",
    "text": "Which video game company was originally founded as a playing card manufacturer in 1889?",
    "options": [
      "Sega",
      "Nintendo",
      "Capcom",
      "Konami"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Nintendo was founded in 1889 by Fusajiro Yamauchi as a playing card company called Nintendo Koppai.",
    "detailedExplanation": "Nintendo has one of the most unique origins in gaming history. Founded by Fusajiro Yamauchi in Kyoto, Japan in 1889, the company originally produced handmade hanafuda playing cards. For decades, Nintendo remained primarily a card and toy company, experimenting with various ventures including taxi services and love hotels before entering the video game industry in the 1970s. This long history gave Nintendo a strong foundation in entertainment and game mechanics that would serve them well when they became one of the most influential video game companies in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nintendo",
    "citationTitle": "Wikipedia: Nintendo"
  },
  {
    "id": "b4cb51f2-8ea6-4cdc-8b8a-bdb0e0441e93",
    "text": "What was the first home video game console to sell over 100 million units worldwide?",
    "options": [
      "Nintendo Entertainment System",
      "Sony PlayStation",
      "Super Nintendo",
      "Sega Genesis"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "The original Sony PlayStation was the first home console to break the 100 million sales milestone.",
    "detailedExplanation": "Released in 1994, the original Sony PlayStation revolutionized the gaming industry and became the first home console to sell over 100 million units worldwide, eventually reaching 102.49 million sales. This milestone was achieved through Sony's strategic use of CD-ROM technology, which allowed for larger games with full-motion video and CD-quality audio, aggressive pricing, and strong third-party developer support. The PlayStation's success established Sony as a major player in the console market and demonstrated the massive commercial potential of video game hardware.",
    "citationUrl": "https://en.wikipedia.org/wiki/PlayStation_(console)",
    "citationTitle": "Wikipedia: PlayStation (console)"
  },
  {
    "id": "d8941761-bdb9-4990-92d2-fa791aeacc9b",
    "text": "Which classic arcade game was originally going to be called 'Puck Man' but was changed for its Western release?",
    "options": [
      "Pac-Man",
      "Galaga",
      "Centipede",
      "Frogger"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Pac-Man was originally called 'Puck Man' in Japan but was renamed to prevent vandalism of arcade cabinets.",
    "detailedExplanation": "When Namco's 'Puck Man' was brought to North America by Midway in 1980, the name was changed to 'Pac-Man' due to concerns about potential vandalism. The worry was that arcade operators feared people would scratch off part of the 'P' in 'Puck' to create an offensive word. This name change proved to be fortuitous, as Pac-Man became one of the most recognizable video game characters in history and spawned a cultural phenomenon that extended far beyond arcade games into television, music, and merchandise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pac-Man",
    "citationTitle": "Wikipedia: Pac-Man"
  },
  {
    "id": "4e8c3882-86ab-4f41-95e5-37dc334ce57c",
    "text": "What was the first video game to be inducted into the Smithsonian's National Museum of American History?",
    "options": [
      "Pong",
      "Space Invaders",
      "Tetris",
      "Pac-Man"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Pong was the first video game to be inducted into the Smithsonian's collection in 1989.",
    "detailedExplanation": "In 1989, the Smithsonian Institution's National Museum of American History acquired the original Pong arcade cabinet, making it the first video game to be inducted into their permanent collection. This recognition acknowledged Pong's pivotal role in launching the commercial video game industry when it was released by Atari in 1972. The Smithsonian's acquisition of Pong represented the first formal recognition by a major cultural institution that video games were significant artifacts of American technological and cultural history, paving the way for video games to be taken seriously as both art and historical documents.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pong",
    "citationTitle": "Wikipedia: Pong"
  },
  {
    "id": "2bb701fb-2690-4f9d-82ad-f86a59a77269",
    "text": "Which video game designer is often called the 'father of the first-person shooter' for creating Wolfenstein 3D and Doom?",
    "options": [
      "Shigeru Miyamoto",
      "John Carmack",
      "Hideo Kojima",
      "Will Wright"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "John Carmack co-created the engines for Wolfenstein 3D and Doom, pioneering the FPS genre.",
    "detailedExplanation": "John Carmack, co-founder of id Software, is widely regarded as the father of the modern first-person shooter genre for his groundbreaking work on the game engines that powered Wolfenstein 3D (1992) and Doom (1993). His innovative programming techniques, including ray casting and binary space partitioning, made fast-paced 3D action games possible on personal computers of the early 1990s. Carmack's engines not only defined the FPS genre but also established many of the technical foundations that modern 3D games still build upon today, making him one of the most influential programmers in video game history.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Carmack",
    "citationTitle": "Wikipedia: John Carmack"
  }
]