[
  {
    "id": "b12e9f73-d8a6-4894-af7a-7435ebe05afa",
    "text": "Which painting became the most expensive artwork ever sold at auction when it fetched $450.3 million at Christie's in 2017?",
    "options": [
      "Leonardo da Vinci's 'Salvator Mundi'",
      "Paul Cézanne's 'The Card Players'",
      "Willem de Kooning's 'Interchange'",
      "Paul Gauguin's 'When Will You Marry?'"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Leonardo da Vinci's 'Salvator Mundi' holds the record at $450.3 million.",
    "detailedExplanation": "Leonardo da Vinci's 'Salvator Mundi' shattered all previous auction records when it sold for $450.3 million at Christie's New York in November 2017. The painting, depicting Jesus Christ as 'Savior of the World,' was long attributed to a da Vinci follower before being authenticated as a work by the master himself. The sale made it not only the most expensive painting ever sold at auction but the most expensive artwork of any kind ever sold publicly.",
    "citationUrl": "https://en.wikipedia.org/wiki/Salvator_Mundi_(Leonardo_da_Vinci)",
    "citationTitle": "Wikipedia: Salvator Mundi (Leonardo da Vinci)"
  },
  {
    "id": "1173c0c5-0b71-4a0f-8b8a-3f76935ceadb",
    "text": "Before 'Salvator Mundi', which Paul Cézanne painting held the previous auction record when it sold for $300 million in 2011?",
    "options": [
      "The Basket of Apples",
      "The Card Players",
      "Mont Sainte-Victoire",
      "The Bathers"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "'The Card Players' was sold privately for around $300 million in 2011.",
    "detailedExplanation": "Paul Cézanne's 'The Card Players' was reportedly sold in a private sale for between $250-300 million in 2011 to the Royal Family of Qatar, making it the most expensive painting ever sold at that time. The painting is one of five works in Cézanne's Card Players series, painted during the 1890s. While this was a private sale rather than a public auction, it set the benchmark for record-breaking art sales in the modern era and paved the way for even higher prices at public auctions.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Card_Players",
    "citationTitle": "Wikipedia: The Card Players"
  },
  {
    "id": "fc7884fe-415e-4ef1-b916-e88be55d56d7",
    "text": "Which auction house achieved the highest single-sale total in art auction history with their November 2022 sale of works from the Paul G. Allen Collection?",
    "options": [
      "Sotheby's",
      "Christie's",
      "Phillips",
      "Bonhams"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Christie's achieved a record $1.62 billion total with the Paul G. Allen Collection sale.",
    "detailedExplanation": "Christie's achieved the highest single-sale total in auction history when they sold works from the Paul G. Allen Collection across two sessions in November 2022, totaling $1.622 billion. The Microsoft co-founder's collection included masterpieces by Cézanne, van Gogh, Gauguin, and Seurat. The sale broke multiple records, with Georges Seurat's 'Les Poseuses, Ensemble' becoming the most expensive work by the artist ever sold at auction at $149.2 million, and Paul Cézanne's 'La Montagne Sainte-Victoire' selling for $137.8 million.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paul_Allen",
    "citationTitle": "Wikipedia: Paul Allen"
  },
  {
    "id": "b2eb9c2c-15f4-4420-a05b-b4c3ec5cc863",
    "text": "Jean-Michel Basquiat's 'Untitled' became the most expensive work by an American artist at auction in 2017. What was the sale price?",
    "options": [
      "$57.3 million",
      "$110.5 million",
      "$93.1 million",
      "$81.9 million"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Basquiat's 'Untitled' sold for $110.5 million at Sotheby's in 2017.",
    "detailedExplanation": "Jean-Michel Basquiat's 'Untitled' (1982), featuring a skull-like head, sold for $110.5 million at Sotheby's New York in May 2017, making it the most expensive work ever sold at auction by an American artist. The painting also set a record for any work created after 1980. The sale highlighted the growing market recognition for Basquiat's work and marked a significant moment for contemporary American art at auction. The painting had been estimated to sell for around $60 million, making the final price a substantial surprise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Michel_Basquiat",
    "citationTitle": "Wikipedia: Jean-Michel Basquiat"
  },
  {
    "id": "300d0ce1-7646-4a29-938b-7430f1cf0557",
    "text": "Which Andy Warhol work holds the record as the most expensive piece by the artist ever sold at auction?",
    "options": [
      "Campbell's Soup Cans",
      "Shot Sage Blue Marilyn",
      "Silver Car Crash (Double Disaster)",
      "Eight Elvises"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "'Shot Sage Blue Marilyn' sold for $195 million in 2022.",
    "detailedExplanation": "Andy Warhol's 'Shot Sage Blue Marilyn' became the most expensive work by the artist and the most expensive 20th-century artwork ever sold at auction when it fetched $195 million at Christie's New York in May 2022. The 1964 silkscreen portrait of Marilyn Monroe is part of Warhol's famous 'Shot Marilyns' series. The sale broke the previous record for a Warhol work, which was held by 'Silver Car Crash (Double Disaster)' that sold for $105.4 million in 2013. The painting's sale demonstrated the continued strong market for Pop Art masterpieces.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shot_Marilyns",
    "citationTitle": "Wikipedia: Shot Marilyns"
  },
  {
    "id": "f0a533cd-d196-417b-b1d9-ecf8ea15760c",
    "text": "Which sculpture holds the record as the most expensive sculpture ever sold at auction?",
    "options": [
      "Alberto Giacometti's 'L'Homme au doigt'",
      "Alberto Giacometti's 'Walking Man I'",
      "Constantin Brâncuși's 'Bird in Space'",
      "Henry Moore's 'Reclining Figure'"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Giacometti's 'L'Homme au doigt' sold for $141.3 million in 2015.",
    "detailedExplanation": "Alberto Giacometti's bronze sculpture 'L'Homme au doigt' (Pointing Man) set the record for the most expensive sculpture ever sold at auction when it fetched $141.3 million at Christie's New York in May 2015. The 1947 sculpture, standing nearly six feet tall, exemplifies Giacometti's distinctive elongated figural style developed after World War II. The sale price far exceeded its pre-sale estimate of $130 million and broke the previous sculpture record held by another Giacometti work, 'Walking Man I,' which had sold for $104.3 million in 2010.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alberto_Giacometti",
    "citationTitle": "Wikipedia: Alberto Giacometti"
  },
  {
    "id": "4d876c88-0d72-47b2-a656-273a60f631ff",
    "text": "What was unprecedented about the 1990 auction of van Gogh's 'Portrait of Dr. Gachet' that sold for $82.5 million?",
    "options": [
      "It was the first painting to sell for over $50 million",
      "It was sold online",
      "It was the first auction broadcast live on television",
      "It broke the $80 million barrier for the first time"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "It was the first painting to break the $80 million barrier at auction.",
    "detailedExplanation": "Vincent van Gogh's 'Portrait of Dr. Gachet' made auction history when it sold for $82.5 million at Christie's New York in May 1990, becoming the first painting to break the $80 million barrier. The sale to Japanese businessman Ryoei Saito was particularly significant as it demonstrated the peak of the late 1980s/early 1990s art market boom, largely driven by Japanese collectors. The painting held the record as the most expensive artwork ever sold at auction for several years and represented a watershed moment when art prices reached previously unimaginable heights, setting the stage for today's ultra-high-value art market.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Portrait_of_Dr._Gachet",
    "citationTitle": "Wikipedia: The Portrait of Dr. Gachet"
  },
  {
    "id": "6d6d77c1-8585-4c37-ac26-b980f8c06728",
    "text": "Which artist holds the record for having the most works in the top 100 most expensive paintings ever sold at auction?",
    "options": [
      "Pablo Picasso",
      "Claude Monet",
      "Paul Cézanne",
      "Francis Bacon"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Pablo Picasso holds this record with multiple works in the top 100 most expensive auction sales.",
    "detailedExplanation": "Pablo Picasso dominates the highest echelons of art auction records, with more paintings in the top 100 most expensive sales than any other artist. His works consistently achieve astronomical prices, with pieces like 'Les Femmes d'Alger (Version 'O')' selling for $179.4 million in 2015. The Spanish master's prolific output combined with his revolutionary artistic innovations across multiple periods has made his works among the most sought-after and valuable in the auction market.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_most_expensive_paintings",
    "citationTitle": "Wikipedia: List of most expensive paintings"
  },
  {
    "id": "6a6f6926-ded7-4742-b298-8d7c1280f133",
    "text": "Which painting by Willem de Kooning set the record as the most expensive post-war artwork when it sold privately for $300 million in 2015?",
    "options": [
      "Woman I",
      "Interchange",
      "Woman III",
      "Excavation"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "De Kooning's 'Interchange' sold for $300 million in a private sale facilitated by dealer Larry Gagosian.",
    "detailedExplanation": "'Interchange' by Willem de Kooning, painted in 1955, became one of the most expensive artworks ever sold when it changed hands for $300 million in 2015. The abstract expressionist masterpiece was sold privately by entertainment mogul David Geffen to billionaire Kenneth C. Griffin. This sale, along with a simultaneous purchase of a Paul Gauguin work for $300 million, represented one of the largest art transactions in history and highlighted the astronomical values that post-war American art can command.",
    "citationUrl": "https://en.wikipedia.org/wiki/Interchange_(de_Kooning)",
    "citationTitle": "Wikipedia: Interchange (de Kooning)"
  },
  {
    "id": "bd595750-d428-4ad7-8707-17ce684618ba",
    "text": "What was significant about the 2008 auction market that led to a dramatic shift in art auction records?",
    "options": [
      "Introduction of online bidding",
      "The global financial crisis caused prices to plummet",
      "New export restrictions were implemented",
      "Auction houses began accepting cryptocurrency"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The 2008 global financial crisis caused art auction prices to drop significantly, disrupting the previous trend of record-breaking sales.",
    "detailedExplanation": "The 2008 global financial crisis had a profound impact on the art auction market, causing a dramatic decline in prices and sales volumes. Many works failed to meet their reserve prices, and auction totals fell significantly compared to the boom years of 2006-2007. This period marked a clear dividing line in auction records, with many price records set before 2008 not being surpassed until the market recovered several years later. The crisis demonstrated the art market's sensitivity to broader economic conditions and changed how collectors and investors viewed art as an asset class.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_auction",
    "citationTitle": "Wikipedia: Art auction"
  },
  {
    "id": "2ed8743e-fa25-413e-adf1-ff2d7cbf8cfa",
    "text": "Which auction house holds the record for the highest total sales in a single calendar year?",
    "options": [
      "Sotheby's",
      "Christie's",
      "Phillips",
      "Bonhams"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Christie's achieved the highest annual sales total, surpassing $8 billion in their record year.",
    "detailedExplanation": "Christie's holds the record for the highest total sales by an auction house in a single calendar year, achieving over $8 billion in sales during their peak performance year. This milestone was reached through a combination of exceptional consignments, strong market conditions, and successful sales across all categories including Impressionist, Modern, Contemporary, and Post-War art. The record reflects Christie's position as one of the world's leading auction houses and demonstrates the enormous scale of the global art market.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christie%27s",
    "citationTitle": "Wikipedia: Christie's"
  },
  {
    "id": "3db7e602-923a-4a90-adba-edc2b5846f58",
    "text": "Which factor primarily drove the explosion in Contemporary art auction prices during the 2000s?",
    "options": [
      "New museum acquisitions policies",
      "Emergence of wealthy collectors from developing economies",
      "Changes in art authentication technology",
      "Introduction of art investment funds"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Wealthy collectors from China, Russia, and other developing economies significantly expanded the buyer pool for Contemporary art.",
    "detailedExplanation": "The dramatic increase in Contemporary art auction prices during the 2000s was primarily driven by the emergence of wealthy collectors from developing economies, particularly China, Russia, India, and the Middle East. These new market participants brought fresh capital and different aesthetic preferences, creating intense competition for blue-chip Contemporary works. This global expansion of the collector base, combined with limited supply of museum-quality pieces, created the conditions for record-breaking sales that transformed the art market landscape and established Contemporary art as a major auction category.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_market",
    "citationTitle": "Wikipedia: Art market"
  },
  {
    "id": "3d681866-a27f-45af-b079-55b9bdfd5d29",
    "text": "Which artist's work was the first painting to break the $100 million barrier at public auction?",
    "options": [
      "Jackson Pollock",
      "Pablo Picasso",
      "Francis Bacon",
      "Paul Gauguin"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Picasso's 'Garçon à la pipe' was the first painting to sell for over $100 million at public auction in 2004.",
    "detailedExplanation": "Pablo Picasso's 'Garçon à la pipe' (Boy with a Pipe) made auction history in May 2004 when it became the first painting to break the $100 million barrier at public auction, selling for $104.2 million at Sotheby's New York. This Rose Period masterpiece from 1905 had been in the same private collection for decades before coming to market. The sale marked a psychological milestone in the art market and demonstrated that nine-figure prices were achievable at public auction, paving the way for even higher record sales in subsequent years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gar%C3%A7on_%C3%A0_la_pipe",
    "citationTitle": "Wikipedia: Garçon à la pipe"
  },
  {
    "id": "80f1d282-5f8a-45a3-aa2e-0455dc68b51a",
    "text": "What unique bidding situation occurred during the record-breaking sale of Monet's 'Meules' series painting in 2019?",
    "options": [
      "It was bid on entirely by phone bidders",
      "The winning bid came from an AI bidding algorithm",
      "It sold to a museum consortium",
      "Bidding lasted over 45 minutes"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The sale of Monet's 'Meules' for $110.7 million involved only telephone bidders, with no bidders present in the auction room.",
    "detailedExplanation": "When Claude Monet's 'Meules' (Haystacks) sold for $110.7 million at Sotheby's in May 2019, setting a new auction record for the artist, the bidding was conducted entirely through telephone bidders with no participants physically present in the auction room. This unusual situation highlighted the increasingly global and remote nature of high-end art collecting, where the most serious bidders often prefer the privacy and strategic advantage of telephone bidding. The sale established a new benchmark for Impressionist art and demonstrated how traditional auction room dynamics have evolved in the digital age.",
    "citationUrl": "https://en.wikipedia.org/wiki/Water_Lilies_(Monet_series)",
    "citationTitle": "Wikipedia: Water Lilies (Monet series)"
  },
  {
    "id": "15190b14-e0b7-4f02-b973-8716102b3a79",
    "text": "Which auction innovation first introduced in the 21st century significantly impacted how auction records are achieved?",
    "options": [
      "Irrevocable bids (third-party guarantees)",
      "Live streaming of auctions",
      "Digital catalogs",
      "Extended payment terms"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Irrevocable bids, where third parties guarantee minimum prices, have enabled consigners to take greater risks with high estimates.",
    "detailedExplanation": "The introduction of irrevocable bids (also known as third-party guarantees) revolutionized the high-end auction market and contributed significantly to record-breaking sales. This mechanism allows outside parties to guarantee a minimum price for a lot before the auction, providing security to consigners while enabling auction houses to set ambitious estimates. These guarantees reduce the risk of expensive works failing to sell and have encouraged consigners to bring exceptional pieces to market that might otherwise remain private. The system has been instrumental in facilitating many of the highest-value auction sales of the 21st century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_auction",
    "citationTitle": "Wikipedia: Art auction"
  },
  {
    "id": "9c6f44dd-34d1-4fa4-afb7-cb6963d9330d",
    "text": "Which Francis Bacon triptych set the record for the most expensive artwork sold at auction in 2013, before being surpassed by 'Salvator Mundi'?",
    "options": [
      "Three Studies of Lucian Freud",
      "Three Studies for Figures at the Base of a Crucifixion",
      "Triptych – In Memory of George Dyer",
      "Three Studies for a Portrait of Henrietta Moraes"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Francis Bacon's 'Three Studies of Lucian Freud' sold for $142.4 million in 2013.",
    "detailedExplanation": "Francis Bacon's 'Three Studies of Lucian Freud' (1969) became the most expensive artwork ever sold at auction when it fetched $142.4 million at Christie's New York in November 2013. This triptych depicting the artist's friend and fellow painter Lucian Freud held the auction record for four years until Leonardo da Vinci's 'Salvator Mundi' surpassed it in 2017. The work's record price reflected both Bacon's market strength and the rarity of his triptychs appearing at auction.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_most_expensive_paintings",
    "citationTitle": "Wikipedia: List of most expensive paintings"
  },
  {
    "id": "4d39b3b6-5188-406f-a509-88c17f3a84a3",
    "text": "Which Alberto Giacometti sculpture became the most expensive sculpture ever sold when it achieved a record price at Sotheby's in 2015?",
    "options": [
      "Walking Man I",
      "Pointing Man",
      "L'Homme au doigt",
      "Grande Femme Debout I"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Giacometti's 'L'Homme au doigt' (Pointing Man) sold for $141.3 million in 2015.",
    "detailedExplanation": "Alberto Giacometti's bronze sculpture 'L'Homme au doigt' (Pointing Man) set the record as the most expensive sculpture ever sold at auction when it achieved $141.3 million at Sotheby's New York in May 2015. Created in 1947, this iconic elongated figure exemplifies Giacometti's distinctive post-war style. The sculpture's record price reflected the extreme rarity of Giacometti's works at auction and the growing appreciation for post-war sculpture among collectors.",
    "citationUrl": "https://en.wikipedia.org/wiki/L%27Homme_au_doigt",
    "citationTitle": "Wikipedia: L'Homme au doigt"
  },
  {
    "id": "1a9ce71c-0feb-4926-adbb-fe6cb6479024",
    "text": "What was the final hammer price that made Qi Baishi's 'Twelve Landscape Screens' the most expensive Chinese artwork ever sold at auction in 2017?",
    "options": [
      "$140.8 million",
      "$125.7 million",
      "$98.5 million",
      "$165.2 million"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Qi Baishi's 'Twelve Landscape Screens' sold for $140.8 million at Beijing Poly Auction in 2017.",
    "detailedExplanation": "Qi Baishi's 'Twelve Landscape Screens' achieved $140.8 million at Beijing Poly Auction in December 2017, setting the record as the most expensive Chinese artwork ever sold at auction. This set of twelve hanging scrolls, created between 1925-1931, represents different landscapes in Qi Baishi's distinctive style. The record price reflected the growing strength of the Chinese art market and the cultural significance of Qi Baishi, one of China's most celebrated modern painters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Qi_Baishi",
    "citationTitle": "Wikipedia: Qi Baishi"
  },
  {
    "id": "88eef826-477f-4d03-a65f-b87073d3f64f",
    "text": "Which Roy Lichtenstein painting became the most expensive work by a living American artist when it sold in 1988?",
    "options": [
      "Whaam!",
      "Nurse",
      "False Start",
      "Kiss II"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Lichtenstein's 'Nurse' sold for $1.7 million in 1988, setting a record for a living American artist at the time.",
    "detailedExplanation": "Roy Lichtenstein's 'Nurse' (1964) became the most expensive work by a living American artist when it sold for $1.7 million at auction in 1988. This iconic pop art painting, featuring Lichtenstein's signature Ben-Day dots and comic book aesthetic, represented a significant milestone in establishing contemporary American art values. The price, while modest by today's standards, was groundbreaking at the time and helped establish the commercial viability of Pop Art in the auction market.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roy_Lichtenstein",
    "citationTitle": "Wikipedia: Roy Lichtenstein"
  },
  {
    "id": "9345c2dd-d15a-48bf-8854-0da394dcdbd3",
    "text": "Which artist's work holds the record for the most expensive Old Master painting sold at auction in the 21st century (excluding 'Salvator Mundi')?",
    "options": [
      "Peter Paul Rubens",
      "Rembrandt van Rijn",
      "Johannes Vermeer",
      "Caravaggio"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Rubens' 'The Massacre of the Innocents' sold for $76.7 million in 2002.",
    "detailedExplanation": "Peter Paul Rubens holds this record with 'The Massacre of the Innocents,' which sold for $76.7 million at Sotheby's London in July 2002. This large-scale Baroque masterpiece from around 1611 was rediscovered and reattributed to Rubens after being thought lost for centuries. The sale price reflected both the rarity of Rubens works at auction and the painting's art historical importance, establishing it as the most expensive Old Master work of the modern auction era, excluding the controversial Leonardo attribution.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Massacre_of_the_Innocents_(Rubens)",
    "citationTitle": "Wikipedia: The Massacre of the Innocents (Rubens)"
  }
]