[
  {
    "id": "3071f385-4975-4d09-a0a2-5d05b4cbf973",
    "text": "Which Leonardo da Vinci painting holds the record as the most expensive artwork ever sold at auction, fetching over $450 million in 2017?",
    "options": [
      "Mona Lisa",
      "The Last Supper",
      "Salvator Mundi",
      "Lady with an Ermine"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Salvator Mundi sold for $450.3 million at Christie's in 2017.",
    "detailedExplanation": "Leonardo da Vinci's Salvator Mundi became the most expensive painting ever sold at auction when it was purchased for $450.3 million at Christie's New York in November 2017. The painting, dating from around 1500, depicts Jesus Christ as Savior of the World and was long thought to be by a follower of da Vinci before being authenticated as a work by the master himself. The sale shattered all previous auction records and sparked considerable debate about art market valuations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Salvator_Mundi_(Leonardo)",
    "citationTitle": "Wikipedia: Salvator Mundi (Leonardo)"
  },
  {
    "id": "65b2698a-55ae-434b-9077-0631bf552245",
    "text": "Which auction house traditionally holds the record for the most expensive artwork sales, including many of the top 10 highest prices ever achieved?",
    "options": [
      "Sotheby's",
      "Christie's",
      "Phillips",
      "Bonhams"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Christie's has facilitated many of the highest-value art sales in auction history.",
    "detailedExplanation": "Christie's, founded in 1766, has consistently achieved some of the highest prices in art auction history and holds the record for several of the most expensive artworks ever sold. The auction house has sold numerous works for over $100 million, including da Vinci's Salvator Mundi and works by Picasso, Monet, and other masters. Christie's rivalry with Sotheby's has driven innovation in the auction market, but Christie's has edged ahead in terms of record-breaking sales in recent decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christie%27s",
    "citationTitle": "Wikipedia: Christie's"
  },
  {
    "id": "d9fc28ea-6919-41f9-afac-d6a63f4f2ef9",
    "text": "Paul Cézanne's 'The Card Players' was sold in a private sale for an estimated $250-300 million, but which of his works holds the auction record for the artist?",
    "options": [
      "Mont Sainte-Victoire",
      "The Basket of Apples",
      "Rideau, Cruchon et Compotier",
      "Boy in a Red Waistcoat"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Rideau, Cruchon et Compotier sold for $60.5 million in 1999, setting Cézanne's auction record.",
    "detailedExplanation": "While Paul Cézanne's 'The Card Players' achieved one of the highest private sale prices in art history, his auction record is held by 'Rideau, Cruchon et Compotier' (Curtain, Jug and Fruit Bowl), which sold for $60.5 million at Sotheby's New York in May 1999. This still life painting from 1893-1894 demonstrates Cézanne's revolutionary approach to form and color that would influence generations of modern artists. The sale price was remarkable for its time and demonstrated the market's appreciation for Cézanne's pivotal role in art history.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_most_expensive_paintings",
    "citationTitle": "Wikipedia: List of most expensive paintings"
  },
  {
    "id": "4e9bcc9d-d77e-4530-bb9f-5aba6a700920",
    "text": "Which Pablo Picasso painting became the first artwork to sell for over $100 million at auction in 2004?",
    "options": [
      "Les Demoiselles d'Avignon",
      "Garçon à la pipe",
      "Guernica",
      "The Weeping Woman"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Garçon à la pipe sold for $104.1 million at Sotheby's in 2004, breaking the $100 million barrier.",
    "detailedExplanation": "Pablo Picasso's 'Garçon à la pipe' (Boy with a Pipe) made auction history when it sold for $104.1 million at Sotheby's New York in May 2004, becoming the first painting to exceed $100 million at auction. Painted in 1905 during Picasso's Rose Period, the work depicts a Parisian boy holding a pipe and wearing a garland of flowers. The sale marked a significant milestone in the art market and demonstrated the extraordinary value placed on major works by Picasso, paving the way for even higher prices in subsequent years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gar%C3%A7on_%C3%A0_la_pipe",
    "citationTitle": "Wikipedia: Garçon à la pipe"
  },
  {
    "id": "f3c20389-2c48-4605-836f-a006336f05c2",
    "text": "Which abstract expressionist painter holds the record for the most expensive American artwork sold at auction with 'Interchange' (though it was later sold privately)?",
    "options": [
      "Jackson Pollock",
      "Willem de Kooning",
      "Mark Rothko",
      "Barnett Newman"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Willem de Kooning's 'Interchange' set records before being sold privately for an estimated $300 million.",
    "detailedExplanation": "Willem de Kooning's 'Interchange' from 1955 held significant auction records for American art before being involved in one of the most expensive private art deals in history. The painting, along with Gauguin's 'When Will You Marry?', was reportedly sold by billionaire Kenneth C. Griffin for approximately $300 million each in 2016. De Kooning's abstract expressionist masterpiece exemplifies the artist's vigorous brushwork and bold use of color that made him one of the most influential American artists of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Interchange_(de_Kooning)",
    "citationTitle": "Wikipedia: Interchange (de Kooning)"
  },
  {
    "id": "d1c41d8d-6d39-4db9-b433-c774609b9456",
    "text": "Vincent van Gogh's 'Portrait of Dr. Gachet' held the auction record for many years. In which decade was it sold for what was then a record-breaking price?",
    "options": [
      "1980s",
      "1990s",
      "2000s",
      "2010s"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The painting sold for $82.5 million in 1990, setting a new world record at the time.",
    "detailedExplanation": "Vincent van Gogh's 'Portrait of Dr. Gachet' was sold at Christie's New York in May 1990 for $82.5 million, setting a new world record for the most expensive painting ever sold at auction at that time. The painting, completed just weeks before van Gogh's death in 1890, depicts the physician who cared for the artist during his final days in Auvers-sur-Oise. The sale to Japanese businessman Ryoei Saito generated enormous media attention and marked a peak in the art market boom of the late 1980s and early 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Portrait_of_Dr._Gachet",
    "citationTitle": "Wikipedia: The Portrait of Dr. Gachet"
  },
  {
    "id": "b0255ae4-0dd9-4f90-9e61-2f941727ac11",
    "text": "Which contemporary artist holds multiple records in the auction market, including the highest price for a work by a living artist at the time of sale?",
    "options": [
      "Jeff Koons",
      "Damien Hirst",
      "David Hockney",
      "Gerhard Richter"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Jeff Koons has set multiple records, including his 'Rabbit' sculpture selling for $91.1 million in 2019.",
    "detailedExplanation": "Jeff Koons has dominated contemporary art auction records, with his stainless steel sculpture 'Rabbit' (1986) selling for $91.1 million at Christie's in May 2019, setting the record for the most expensive work by a living artist at auction. Koons has achieved numerous other high prices, including his 'Balloon Dog (Orange)' which sold for $58.4 million in 2013. His pop art sculptures and installations, often featuring everyday objects transformed into luxury art pieces, have consistently commanded premium prices in the contemporary art market.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jeff_Koons",
    "citationTitle": "Wikipedia: Jeff Koons"
  },
  {
    "id": "55749b6a-4320-461f-b326-1cbba3aa63cc",
    "text": "What milestone did Claude Monet's 'Meules' (Haystacks) achieve when it sold at Sotheby's in 2019?",
    "options": [
      "First Impressionist work to sell for over $100 million",
      "Most expensive landscape painting ever sold",
      "Highest price achieved for a Monet painting",
      "First painting to sell for over $110 million"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "'Meules' sold for $110.7 million, becoming the first Impressionist painting to exceed $100 million at auction.",
    "detailedExplanation": "Claude Monet's 'Meules' from his famous Haystacks series made art history when it sold for $110.7 million at Sotheby's New York in May 2019, becoming the first Impressionist painting to surpass $100 million at auction. The 1890 painting captures Monet's revolutionary approach to light and color, showing the same haystack subject under different atmospheric conditions. This sale not only set a new record for Monet but also demonstrated the enduring appeal and market strength of Impressionist masterpieces more than a century after their creation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Haystacks_(Monet_series)",
    "citationTitle": "Wikipedia: Haystacks (Monet series)"
  },
  {
    "id": "e77adfb7-84ce-42cd-9def-222fd596babe",
    "text": "Which year saw the first artwork sell for over $1 million at auction, marking a historic milestone in the art market?",
    "options": [
      "1961",
      "1968",
      "1970",
      "1973"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "1968 was the first year an artwork sold for over $1 million at auction.",
    "detailedExplanation": "The art auction market reached a historic milestone in 1968 when the first artwork sold for over $1 million. This breakthrough sale marked the beginning of the modern era of high-value art auctions and set the stage for the exponential growth in art prices that would follow in subsequent decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_most_expensive_paintings",
    "citationTitle": "Wikipedia: List of most expensive paintings"
  },
  {
    "id": "6a6f0024-b029-40f0-be40-8ceff8d44a0a",
    "text": "Which Francis Bacon triptych became the most expensive artwork sold at auction in 2013, breaking previous records?",
    "options": [
      "Three Studies of Lucian Freud",
      "Three Studies for Figures at the Base of a Crucifixion",
      "Triptych 1976",
      "Three Figures in a Room"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Three Studies of Lucian Freud sold for $142.4 million in 2013, setting a new auction record.",
    "detailedExplanation": "Francis Bacon's 'Three Studies of Lucian Freud' made auction history in November 2013 when it sold at Christie's New York for $142.4 million, making it the most expensive artwork ever sold at auction at that time. The triptych, painted in 1969, depicts Bacon's friend and fellow artist Lucian Freud in three panels and held the record until it was surpassed by subsequent sales.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three_Studies_of_Lucian_Freud",
    "citationTitle": "Wikipedia: Three Studies of Lucian Freud"
  },
  {
    "id": "b7419ea1-c960-4df1-b2ac-c2b9896a7868",
    "text": "What percentage commission do major auction houses typically charge sellers for high-value artworks?",
    "options": [
      "5-8%",
      "10-15%",
      "18-25%",
      "30-35%"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Major auction houses typically charge sellers 10-15% commission on high-value lots.",
    "detailedExplanation": "Major auction houses like Christie's and Sotheby's typically charge sellers a commission of 10-15% on high-value artworks, with the percentage often decreasing as the value increases. This is in addition to the buyer's premium charged to purchasers, which can range from 12-25% depending on the sale price. These commissions are the primary revenue source for auction houses and help fund their operations, marketing, and guarantees.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_auction",
    "citationTitle": "Wikipedia: Art auction"
  },
  {
    "id": "a743963a-a25a-49e4-b9c1-417b70a88e21",
    "text": "Which Andy Warhol artwork holds the record as the most expensive work by the artist sold at auction?",
    "options": [
      "Campbell's Soup Cans",
      "Shot Sage Blue Marilyn",
      "Silver Car Crash",
      "Eight Elvises"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Shot Sage Blue Marilyn sold for $195 million in 2022, setting Warhol's auction record.",
    "detailedExplanation": "Andy Warhol's 'Shot Sage Blue Marilyn' became the most expensive work by the artist ever sold at auction when it fetched $195 million at Christie's New York in May 2022. The 1964 silkscreen portrait of Marilyn Monroe broke multiple records, becoming not only Warhol's highest-selling work but also the most expensive 20th-century artwork ever sold at auction at that time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shot_Marilyns",
    "citationTitle": "Wikipedia: Shot Marilyns"
  },
  {
    "id": "74a77580-5b09-4727-8fa3-78639a17b09e",
    "text": "In which city do the highest-value art auctions typically take place during the spring and fall auction seasons?",
    "options": [
      "London",
      "Paris",
      "New York",
      "Hong Kong"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "New York hosts the most high-value art auctions during the major seasonal sales.",
    "detailedExplanation": "New York City serves as the primary hub for the highest-value art auctions, particularly during the spring (May) and fall (November) auction seasons when Christie's and Sotheby's hold their major contemporary and impressionist sales. While London, Hong Kong, and Paris also host significant auctions, New York consistently generates the highest total sales and is where most record-breaking prices are achieved.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_auction",
    "citationTitle": "Wikipedia: Art auction"
  },
  {
    "id": "b2fa4a1c-289a-40cc-badf-461432de53ef",
    "text": "Which Willem de Kooning painting set the record for the highest price achieved for the artist at auction?",
    "options": [
      "Woman I",
      "Interchange",
      "Woman III",
      "Untitled XXV"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Untitled XXV sold for $66.3 million in 2016, setting de Kooning's auction record.",
    "detailedExplanation": "Willem de Kooning's 'Untitled XXV' from 1977 holds the auction record for the artist, selling for $66.3 million at Christie's New York in November 2016. This abstract work from de Kooning's late period surpassed his previous auction records and demonstrated the continued strong market demand for the Dutch-American abstract expressionist's work, particularly pieces from his mature period.",
    "citationUrl": "https://en.wikipedia.org/wiki/Willem_de_Kooning",
    "citationTitle": "Wikipedia: Willem de Kooning"
  },
  {
    "id": "52b5e557-4af1-40b8-a325-44a154d1a556",
    "text": "What is the term for the minimum price an artwork must reach at auction before it can be sold?",
    "options": [
      "Reserve price",
      "Hammer price",
      "Estimate range",
      "Starting bid"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The reserve price is the confidential minimum price below which an artwork will not be sold.",
    "detailedExplanation": "The reserve price is a confidential minimum price set by the seller below which an artwork will not be sold at auction. Typically set at or below the low estimate, the reserve protects sellers from having their valuable works sell for unexpectedly low prices. If bidding doesn't reach the reserve, the lot is 'bought in' or withdrawn from sale. Reserve prices are a crucial component of the auction process and risk management for consigners.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reserve_price",
    "citationTitle": "Wikipedia: Reserve price"
  },
  {
    "id": "8b4f3d1a-5464-4cf7-a635-04f43c44e284",
    "text": "Which Jean-Michel Basquiat painting achieved the highest auction price for the artist, selling for over $110 million?",
    "options": [
      "Hollywood Africans",
      "Untitled (Skull)",
      "Irony of Negro Policeman",
      "Untitled"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Untitled (Skull) from 1982 sold for $110.5 million in 2017, setting Basquiat's record.",
    "detailedExplanation": "Jean-Michel Basquiat's 'Untitled (Skull)' from 1982 became the most expensive work by the artist when it sold for $110.5 million at Sotheby's New York in May 2017. The painting, featuring Basquiat's iconic skull motif, set a new record not only for the artist but also became the most expensive work by an American artist sold at auction at that time, highlighting the extraordinary posthumous market recognition of Basquiat's work.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Michel_Basquiat",
    "citationTitle": "Wikipedia: Jean-Michel Basquiat"
  },
  {
    "id": "266de5c8-06de-4f93-b54a-95776a866172",
    "text": "Which painter's work 'When Will You Marry?' became one of the most expensive paintings ever sold when it was privately sold for an estimated $300 million in 2015?",
    "options": [
      "Paul Gauguin",
      "Henri Matisse",
      "Edgar Degas",
      "Pierre-Auguste Renoir"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Paul Gauguin's 'When Will You Marry?' (Nafea Faa Ipoipo) was sold privately for around $300 million.",
    "detailedExplanation": "Paul Gauguin's 'When Will You Marry?' (Nafea Faa Ipoipo), painted in 1892 during his time in Tahiti, was sold in a private sale in 2015 for an estimated $300 million to the Qatar Museums. This transaction made it one of the most expensive paintings ever sold, though it was not sold at public auction. The Post-Impressionist masterpiece depicts two Tahitian women and exemplifies Gauguin's distinctive style developed during his Pacific period.",
    "citationUrl": "https://en.wikipedia.org/wiki/When_Will_You_Marry%3F",
    "citationTitle": "Wikipedia: When Will You Marry?"
  },
  {
    "id": "81548ea1-5988-4931-ac2d-5aa1e32c355b",
    "text": "What is the name of the phenomenon where auction prices for certain artists' works dramatically increase following their death?",
    "options": [
      "Death effect",
      "Posthumous premium",
      "Legacy lift",
      "Memorial markup"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The 'death effect' refers to the significant increase in auction prices that often occurs after an artist's death.",
    "detailedExplanation": "The 'death effect' is a well-documented phenomenon in art auction markets where the prices of an artist's works tend to increase substantially following their death. This occurs due to several factors: the fixed supply of works (no new pieces can be created), increased media attention and public interest, museum retrospectives, and collectors' desire to own works by deceased masters. Studies have shown that prices can increase by 50% or more in the years immediately following an artist's death, making it a significant factor in art market dynamics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_market",
    "citationTitle": "Wikipedia: Art market"
  },
  {
    "id": "93e8ff56-8e3d-4afc-b4fe-4d059a2add5c",
    "text": "Which Georgia O'Keeffe painting set the record for the highest price paid for a work by a female artist at auction when it sold for $44.4 million in 2014?",
    "options": [
      "Black Iris III",
      "Jimson Weed/White Flower No. 1",
      "Red Canna",
      "Sky Above Clouds IV"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "'Jimson Weed/White Flower No. 1' by Georgia O'Keeffe sold for $44.4 million, setting the female artist auction record.",
    "detailedExplanation": "Georgia O'Keeffe's 'Jimson Weed/White Flower No. 1', painted in 1932, sold at Sotheby's New York in November 2014 for $44.4 million, setting a new world record for the highest price paid for a work by a female artist at auction. The large-scale flower painting, measuring 48 by 40 inches, exemplifies O'Keeffe's iconic style of magnified botanical subjects. This record stood for several years and highlighted the significant gender disparity in art auction prices, as well as the exceptional market value of O'Keeffe's work among female artists.",
    "citationUrl": "https://en.wikipedia.org/wiki/Georgia_O%27Keeffe",
    "citationTitle": "Wikipedia: Georgia O'Keeffe"
  },
  {
    "id": "a5426385-0595-4122-a46f-e2fc0074ff4a",
    "text": "Christie's auction house was founded in which year, making it one of the world's oldest fine art auctioneers?",
    "options": [
      "1744",
      "1766",
      "1778",
      "1792"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Christie's was founded by James Christie in London in 1766, making it one of the world's oldest auction houses.",
    "detailedExplanation": "Christie's was founded by James Christie in London in 1766, making it one of the world's oldest and most prestigious fine art auction houses. The company began when James Christie conducted his first sale on December 5, 1766, at rooms in Pall Mall. Over its more than 250-year history, Christie's has handled many of the world's most important art collections and has been responsible for numerous auction records. Today, along with Sotheby's, Christie's dominates the high-end art auction market and has salesrooms in major cities worldwide, regularly achieving some of the highest prices ever paid for artworks at auction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christie%27s",
    "citationTitle": "Wikipedia: Christie's"
  }
]