[
  {
    "id": "b1344a6e-6222-472d-83e4-5a9b2c8e955e",
    "text": "Which mystery author created the detective character Adam Dalgliesh and is known as the 'Queen of Crime'?",
    "options": [
      "Ruth Rendell",
      "P.D. James",
      "Dorothy L. Sayers",
      "Agatha Christie"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "P.D. James created Detective Chief Inspector Adam Dalgliesh and was widely regarded as the 'Queen of Crime'.",
    "detailedExplanation": "P.D. James (1920-2014) was a British crime writer who created the sophisticated detective Adam Dalgliesh, a published poet who worked for New Scotland Yard. She wrote 14 Dalgliesh novels over her career and was often called the 'Queen of Crime' for her elegant prose style and complex psychological mysteries. She was made a life peer as Baroness James of Holland Park in 1991.",
    "citationUrl": "https://en.wikipedia.org/wiki/P._D._James",
    "citationTitle": "Wikipedia: P. D. James"
  },
  {
    "id": "8f175e2f-351c-43d6-b387-5e266bc264e2",
    "text": "What is the real name of the thriller author who writes under the pseudonym John le Carré?",
    "options": [
      "David John Moore Cornwell",
      "Michael John Smith",
      "Graham Robert Greene",
      "Anthony Charles Parker"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "John le Carré is the pen name of David John Moore Cornwell, famous for spy novels like 'The Spy Who Came in from the Cold'.",
    "detailedExplanation": "David John Moore Cornwell (1931-2020) wrote under the pseudonym John le Carré because he was working for the British intelligence services MI5 and MI6 when he began writing. His employers didn't want him publishing under his real name. He became one of the most acclaimed spy novelists, with works like 'Tinker Tailor Soldier Spy' and 'The Night Manager' being adapted for television and film.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_le_Carr%C3%A9",
    "citationTitle": "Wikipedia: John le Carré"
  },
  {
    "id": "425a0d1f-6005-486f-b5ef-46e18eac757e",
    "text": "Which Scandinavian crime writing duo created the Martin Beck detective series, helping launch the Nordic noir movement?",
    "options": [
      "Stieg Larsson and Eva Gabrielsson",
      "Henning Mankell and Håkan Nesser",
      "Maj Sjöwall and Per Wahlöö",
      "Camilla Läckberg and Mons Kallentoft"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Maj Sjöwall and Per Wahlöö created the Martin Beck series, which pioneered Scandinavian crime fiction in the 1960s-70s.",
    "detailedExplanation": "Swedish authors Maj Sjöwall and Per Wahlöö collaborated on ten Martin Beck novels between 1965 and 1975, creating what they called 'The Story of a Crime' series. Their realistic, socially conscious crime novels featuring Stockholm detective Martin Beck are credited with establishing the template for Nordic noir and influencing generations of Scandinavian crime writers who followed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maj_Sj%C3%B6wall",
    "citationTitle": "Wikipedia: Maj Sjöwall"
  },
  {
    "id": "029614c0-919b-4a1e-a1ba-7ed91201bcdf",
    "text": "What was unusual about the publication of Harper Lee's mystery novel 'Go Set a Watchman'?",
    "options": [
      "It was published posthumously",
      "It was her second published novel after 55 years",
      "She wrote it under a pseudonym",
      "It was originally published in a magazine"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Go Set a Watchman' was published in 2015, 55 years after 'To Kill a Mockingbird', making it Lee's second published novel.",
    "detailedExplanation": "Harper Lee published 'To Kill a Mockingbird' in 1960 and then didn't publish another book for 55 years, despite being one of America's most celebrated authors. 'Go Set a Watchman' was published in 2015 when Lee was 89 years old. The novel was actually written before 'To Kill a Mockingbird' and features an adult Scout Finch returning to Alabama, though it generated controversy for its portrayal of Atticus Finch.",
    "citationUrl": "https://en.wikipedia.org/wiki/Go_Set_a_Watchman",
    "citationTitle": "Wikipedia: Go Set a Watchman"
  },
  {
    "id": "37cc1eee-bfa2-427c-a91d-931bb5c34888",
    "text": "What was the original profession of thriller author Michael Crichton before he became a full-time writer?",
    "options": [
      "Lawyer",
      "Journalist",
      "Doctor",
      "Engineer"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Michael Crichton was a medical doctor who graduated from Harvard Medical School before becoming a bestselling thriller author.",
    "detailedExplanation": "Michael Crichton (1942-2008) earned his medical degree from Harvard Medical School in 1969 and briefly practiced medicine before pursuing writing full-time. His medical background informed many of his techno-thrillers, including 'The Andromeda Strain' and later novels that dealt with scientific and medical themes. He also created the medical drama TV series 'ER', drawing on his medical knowledge and experience.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Crichton",
    "citationTitle": "Wikipedia: Michael Crichton"
  },
  {
    "id": "b03c81df-0120-4463-acb9-3f93a50cdb81",
    "text": "Which mystery author disappeared in 1926 for 11 days, creating a real-life mystery that remains unsolved?",
    "options": [
      "Dorothy L. Sayers",
      "Agatha Christie",
      "Margery Allingham",
      "Ngaio Marsh"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Agatha Christie disappeared for 11 days in December 1926, sparking a massive manhunt and media frenzy.",
    "detailedExplanation": "In December 1926, Agatha Christie's car was found abandoned near a lake, leading to one of the largest manhunts in British history. She was found 11 days later registered at a hotel under an assumed name, claiming amnesia. The incident occurred during personal turmoil - her husband had asked for a divorce to marry his mistress. Christie never publicly explained what happened during those 11 days, making it one of literature's most famous unsolved mysteries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Agatha_Christie",
    "citationTitle": "Wikipedia: Agatha Christie"
  },
  {
    "id": "7959cc0c-b822-44e8-af69-2b0b1e2f8f88",
    "text": "Which psychological thriller author wrote 'Gone Girl' and 'Sharp Objects'?",
    "options": [
      "Tana French",
      "Gillian Flynn",
      "Kate Atkinson",
      "Louise Penny"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Gillian Flynn wrote both 'Gone Girl' (2012) and 'Sharp Objects' (2006), establishing her as a major voice in psychological thrillers.",
    "detailedExplanation": "Gillian Flynn is an American author who gained widespread recognition for her dark psychological thrillers featuring complex, often unreliable female narrators. 'Sharp Objects' was her debut novel, followed by 'Dark Places' (2009) and 'Gone Girl' (2012). 'Gone Girl' became a cultural phenomenon and was adapted into a successful film directed by David Fincher, with Flynn writing the screenplay adaptation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gillian_Flynn",
    "citationTitle": "Wikipedia: Gillian Flynn"
  },
  {
    "id": "a4487da2-f9c6-4f13-9b82-9d14da57d140",
    "text": "Which mystery author created the fictional detective Hercule Poirot, who appeared in 33 novels and 2 plays?",
    "options": [
      "Dorothy L. Sayers",
      "Agatha Christie",
      "Margery Allingham",
      "Ngaio Marsh"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Agatha Christie created the Belgian detective Hercule Poirot, featuring him in 33 novels and 2 plays.",
    "detailedExplanation": "Agatha Christie introduced Hercule Poirot in her first novel 'The Mysterious Affair at Styles' in 1920. The fastidious Belgian detective with his distinctive moustache and 'little grey cells' became one of literature's most famous fictional detectives, appearing in numerous novels including 'Murder on the Orient Express' and 'The Murder of Roger Ackroyd'. Christie eventually grew tired of the character but continued writing Poirot stories due to public demand.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hercule_Poirot",
    "citationTitle": "Wikipedia: Hercule Poirot"
  },
  {
    "id": "4486864e-03a8-43a1-b9ff-e1c183726166",
    "text": "Which American author wrote 'The Big Sleep' and is credited with creating the hard-boiled detective fiction genre?",
    "options": [
      "Dashiell Hammett",
      "Raymond Chandler",
      "James M. Cain",
      "Mickey Spillane"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Raymond Chandler wrote 'The Big Sleep' and created detective Philip Marlowe, defining the hard-boiled detective genre.",
    "detailedExplanation": "Raymond Chandler published 'The Big Sleep' in 1939, introducing private detective Philip Marlowe to the world. Chandler's work epitomized the hard-boiled detective fiction genre with its cynical tone, urban setting, and morally ambiguous characters. His influence on crime fiction and film noir was enormous, with many of his works adapted into classic Hollywood films. Chandler's writing style combined literary quality with pulp fiction sensibilities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Raymond_Chandler",
    "citationTitle": "Wikipedia: Raymond Chandler"
  },
  {
    "id": "a8525cd5-5d5c-4fa6-8692-ba3b194b8e7a",
    "text": "What is the pen name of the British author who created the Inspector Rebus series set in Edinburgh?",
    "options": [
      "Ian Rankin",
      "Val McDermid",
      "Denise Mina",
      "Stuart MacBride"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ian Rankin is the author who created Detective Inspector John Rebus in a long-running series of crime novels set in Edinburgh.",
    "detailedExplanation": "Ian Rankin began writing the Inspector Rebus series in 1987 with 'Knots and Crosses.' The series follows the complex character of John Rebus, a detective inspector working in Edinburgh's darker corners. Rankin's detailed portrayal of Edinburgh's geography and social issues has made the series internationally successful, with over 20 books featuring Rebus. The character officially retired in 'Exit Music' but has appeared in subsequent novels in different capacities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ian_Rankin",
    "citationTitle": "Wikipedia: Ian Rankin"
  },
  {
    "id": "8d206567-3089-49cb-82a7-22132919527d",
    "text": "Which Italian author wrote 'The Name of the Rose,' a medieval mystery novel that became an international bestseller?",
    "options": [
      "Italo Calvino",
      "Umberto Eco",
      "Alberto Moravia",
      "Cesare Pavese"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Umberto Eco wrote 'The Name of the Rose,' a complex medieval mystery that combined detective fiction with philosophical themes.",
    "detailedExplanation": "Umberto Eco, primarily known as a semiotician and philosopher, published 'The Name of the Rose' in 1980. The novel is set in a 14th-century Italian monastery and follows the Franciscan friar William of Baskerville as he investigates a series of murders. The book became a surprise international bestseller, combining elements of detective fiction, historical fiction, and philosophical discourse. It was later adapted into a successful film starring Sean Connery.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Name_of_the_Rose",
    "citationTitle": "Wikipedia: The Name of the Rose"
  },
  {
    "id": "3b89b6ac-542e-4eba-a10d-e0dfd1a18b7a",
    "text": "Which thriller author created the character Jack Ryan, who appears in novels like 'The Hunt for Red October'?",
    "options": [
      "John Grisham",
      "Tom Clancy",
      "Frederick Forsyth",
      "Robert Ludlum"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Tom Clancy created CIA analyst Jack Ryan, who first appeared in 'The Hunt for Red October' and became the protagonist of many techno-thrillers.",
    "detailedExplanation": "Tom Clancy introduced Jack Ryan in his 1984 debut novel 'The Hunt for Red October.' Ryan, initially a CIA analyst and later CIA director and U.S. President, became the central character in many of Clancy's techno-thrillers. These novels, known for their detailed military and political scenarios, helped define the techno-thriller genre. The Jack Ryan character has been portrayed by several actors in film adaptations, including Alec Baldwin, Harrison Ford, and Ben Affleck.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jack_Ryan_(character)",
    "citationTitle": "Wikipedia: Jack Ryan (character)"
  },
  {
    "id": "f12ee2d8-4e4e-401c-9a5d-ac34983086b7",
    "text": "Which Swedish author wrote the Millennium trilogy, beginning with 'The Girl with the Dragon Tattoo'?",
    "options": [
      "Henning Mankell",
      "Stieg Larsson",
      "Camilla Läckberg",
      "Arne Dahl"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Stieg Larsson wrote the Millennium trilogy, starting with 'The Girl with the Dragon Tattoo,' though he died before seeing its international success.",
    "detailedExplanation": "Stieg Larsson completed the Millennium trilogy before his death in 2004, but the books weren't published until afterward. The series, featuring journalist Mikael Blomkvist and hacker Lisbeth Salander, became a global phenomenon and helped popularize Scandinavian crime fiction worldwide. Larsson was a journalist and left-wing activist who drew on his knowledge of Swedish politics and social issues. The success of his posthumously published trilogy sparked international interest in Nordic noir fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stieg_Larsson",
    "citationTitle": "Wikipedia: Stieg Larsson"
  },
  {
    "id": "dcf2c2b2-ad50-4d3b-b89c-258ad92b0734",
    "text": "Which American author wrote 'In Cold Blood,' pioneering the non-fiction novel genre by documenting a real murder case?",
    "options": [
      "Norman Mailer",
      "Truman Capote",
      "Joan Didion",
      "Gay Talese"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Truman Capote wrote 'In Cold Blood,' spending six years researching the 1959 murder of the Clutter family in Kansas.",
    "detailedExplanation": "Truman Capote published 'In Cold Blood' in 1966 after extensively researching the brutal murder of the Clutter family in Holcomb, Kansas. Capote interviewed the killers, witnesses, and investigators, creating what he called a 'non-fiction novel' that read like fiction while maintaining journalistic accuracy. The book established a new literary genre and remains one of the most influential works of creative non-fiction. Capote's relationship with killer Perry Smith became the subject of later books and films.",
    "citationUrl": "https://en.wikipedia.org/wiki/In_Cold_Blood",
    "citationTitle": "Wikipedia: In Cold Blood"
  },
  {
    "id": "2ea24667-05ef-4e14-a161-75c33ed96c3b",
    "text": "Which mystery author created the elderly amateur detective Miss Jane Marple, who solved crimes in the village of St. Mary Mead?",
    "options": [
      "Dorothy L. Sayers",
      "Margery Allingham",
      "Agatha Christie",
      "Josephine Tey"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Agatha Christie created Miss Jane Marple, the shrewd elderly spinster who solved murders using her knowledge of human nature.",
    "detailedExplanation": "Agatha Christie introduced Miss Jane Marple in the short story 'The Tuesday Night Club' in 1927, and she first appeared in a novel in 'The Murder at the Vicarage' in 1930. Unlike Christie's other famous detective Hercule Poirot, Miss Marple was an amateur detective who solved crimes through her understanding of human nature, often drawing parallels between criminal behavior and village gossip. The character appeared in 12 novels and 20 short stories, representing a different approach to detective fiction that emphasized psychological insight over forensic evidence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Miss_Marple",
    "citationTitle": "Wikipedia: Miss Marple"
  },
  {
    "id": "812b8e09-ca15-4f4e-9e5b-1b6db9abba89",
    "text": "Which mystery author created the fictional forensic anthropologist Dr. Temperance Brennan, who inspired the TV series 'Bones'?",
    "options": [
      "Kathy Reichs",
      "Tess Gerritsen",
      "Patricia Cornwell",
      "Lisa Gardner"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Kathy Reichs created Dr. Temperance Brennan and worked as a forensic anthropologist herself.",
    "detailedExplanation": "Kathy Reichs is both a forensic anthropologist and bestselling crime novelist who created the character Dr. Temperance Brennan. Reichs draws on her real-world experience in forensic anthropology to bring authenticity to her novels. The character became widely known through the long-running Fox television series 'Bones,' where Brennan was portrayed by Emily Deschanel. Reichs has written over 20 novels featuring Brennan and has served as a producer on the TV adaptation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kathy_Reichs",
    "citationTitle": "Wikipedia: Kathy Reichs"
  },
  {
    "id": "f0c5780b-a87c-46ed-8cc9-043d00d37052",
    "text": "Which thriller author wrote 'The Silence of the Lambs' and created the iconic character Dr. Hannibal Lecter?",
    "options": [
      "Dean Koontz",
      "Thomas Harris",
      "Stephen King",
      "Clive Barker"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Thomas Harris created Dr. Hannibal Lecter and wrote 'The Silence of the Lambs' in 1988.",
    "detailedExplanation": "Thomas Harris is an American author best known for creating the sophisticated cannibal psychiatrist Dr. Hannibal Lecter. While Lecter first appeared in Harris's 1981 novel 'Red Dragon,' he became a cultural icon through 'The Silence of the Lambs' (1988), which won the Bram Stoker Award. The character gained even more fame through Anthony Hopkins's Oscar-winning portrayal in the 1991 film adaptation. Harris has written five novels featuring Lecter, with the character becoming one of the most memorable villains in thriller literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thomas_Harris",
    "citationTitle": "Wikipedia: Thomas Harris"
  },
  {
    "id": "58e79034-cbec-4e31-a1ba-5ebcc97164c1",
    "text": "Which British mystery author created the aristocratic detective Lord Peter Wimsey in the 1920s?",
    "options": [
      "Margery Allingham",
      "Ngaio Marsh",
      "Dorothy L. Sayers",
      "Josephine Tey"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Dorothy L. Sayers created Lord Peter Wimsey, who first appeared in 'Whose Body?' in 1923.",
    "detailedExplanation": "Dorothy L. Sayers was a prominent British crime writer and one of the first women to be awarded an honorary doctorate in divinity at Durham University. She created the sophisticated amateur detective Lord Peter Wimsey, who appeared in 11 novels and numerous short stories between 1923 and 1939. Wimsey was notable for being an aristocratic sleuth with a complex personality, dealing with shell shock from World War I. Sayers was also a member of the Detection Club alongside Agatha Christie and was instrumental in establishing the 'Golden Age' of detective fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dorothy_L._Sayers",
    "citationTitle": "Wikipedia: Dorothy L. Sayers"
  },
  {
    "id": "7d093bf0-e39f-42d8-800e-b5faa9190e4b",
    "text": "Which American author wrote 'The Maltese Falcon' and helped define the hard-boiled detective genre alongside Raymond Chandler?",
    "options": [
      "James M. Cain",
      "Dashiell Hammett",
      "Mickey Spillane",
      "Ross Macdonald"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Dashiell Hammett wrote 'The Maltese Falcon' and created detective Sam Spade.",
    "detailedExplanation": "Dashiell Hammett was a pioneering American author who, along with Raymond Chandler, helped establish the hard-boiled detective fiction genre. His 1930 novel 'The Maltese Falcon' introduced the cynical private detective Sam Spade and became a classic of the genre, later adapted into the famous 1941 film starring Humphrey Bogart. Hammett drew on his experience as a Pinkerton detective to bring realism to his writing. He also created the detective couple Nick and Nora Charles in 'The Thin Man' series, which became popular both in books and films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dashiell_Hammett",
    "citationTitle": "Wikipedia: Dashiell Hammett"
  },
  {
    "id": "dbad0576-6945-432b-adc0-1f252716e347",
    "text": "Which contemporary thriller author wrote 'The Girl on the Train' and 'Into the Water'?",
    "options": [
      "Ruth Ware",
      "Paula Hawkins",
      "Louise Penny",
      "Liane Moriarty"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Paula Hawkins wrote the bestselling psychological thriller 'The Girl on the Train' in 2015.",
    "detailedExplanation": "Paula Hawkins is a British author who achieved international success with her 2015 psychological thriller 'The Girl on the Train.' The novel became a global phenomenon, spending months on bestseller lists and being adapted into a 2016 film starring Emily Blunt. Before writing thrillers, Hawkins worked as a journalist and wrote romantic fiction under a pseudonym. Her follow-up novel 'Into the Water' (2017) also became a bestseller. Hawkins is known for her unreliable narrators and exploration of themes like alcoholism, domestic violence, and psychological manipulation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paula_Hawkins",
    "citationTitle": "Wikipedia: Paula Hawkins"
  }
]