[
  {
    "id": "ba816f0f-03e0-419e-bb77-9a7e571c779a",
    "text": "In the James Bond film 'Goldfinger' (1964), what is the exact code number that disarms Goldfinger's atomic bomb with just 007 seconds remaining?",
    "options": [
      "003",
      "007",
      "000",
      "001"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The bomb is disarmed at 007 seconds showing '000' on the timer.",
    "detailedExplanation": "In one of cinema's most famous countdown sequences, Goldfinger's atomic bomb at Fort Knox is dramatically disarmed by an expert just as the timer reaches 007 seconds, displaying '000' when stopped. This clever visual reference to Bond's agent number became an iconic moment in the franchise, though Bond himself doesn't actually disarm the device - it's done by an atomic specialist.",
    "citationUrl": "https://en.wikipedia.org/wiki/Goldfinger_(film)",
    "citationTitle": "Wikipedia: Goldfinger (film)"
  },
  {
    "id": "141aa0d7-9cf5-4d3d-a34f-a36e478b727e",
    "text": "Which James Bond actor served the longest consecutive period in the role before taking a break or retiring?",
    "options": [
      "Sean Connery",
      "Roger Moore",
      "Pierce Brosnan",
      "Daniel Craig"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Roger Moore played Bond for 12 consecutive years from 1973-1985.",
    "detailedExplanation": "Roger Moore holds the record for the longest uninterrupted tenure as James Bond, playing the character for 12 consecutive years from 'Live and Let Die' (1973) to 'A View to a Kill' (1985). During this period, he appeared in seven Bond films. While Sean Connery appeared in more films initially, he took a break after 'You Only Live Twice' before returning, making Moore's run the longest continuous portrayal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roger_Moore",
    "citationTitle": "Wikipedia: Roger Moore"
  },
  {
    "id": "2b541c84-64d9-4db3-a905-a503f8c43162",
    "text": "In Ian Fleming's original novels, what is the name of James Bond's Scottish housekeeper?",
    "options": [
      "May Maxwell",
      "Mary Goodnight",
      "Loelia Ponsonby",
      "May Ponsonby"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "May Maxwell is Bond's devoted Scottish housekeeper in Fleming's novels.",
    "detailedExplanation": "May Maxwell appears in several of Ian Fleming's original James Bond novels as Bond's loyal Scottish housekeeper who looks after his flat. She's described as a treasure who takes excellent care of Bond and worries about his dangerous lifestyle. This character detail from the books rarely appears in the films, making it a challenging piece of Bond literary trivia that tests knowledge beyond the cinematic franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_James_Bond_characters",
    "citationTitle": "Wikipedia: List of James Bond characters"
  },
  {
    "id": "4a65ef45-7acc-4e1a-aff0-45e22186bde5",
    "text": "What was the working title of the James Bond film that eventually became 'Quantum of Solace' (2008)?",
    "options": [
      "Bond 22",
      "Risico",
      "The Property of a Lady",
      "The Hildebrand Rarity"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The film was simply known as 'Bond 22' during production before the official title was announced.",
    "detailedExplanation": "During the lengthy pre-production and filming process, the 22nd official James Bond film was referred to by the working title 'Bond 22' because the producers were struggling to find an appropriate title. The eventual title 'Quantum of Solace' was taken from a Fleming short story, but the decision wasn't made until well into production, making this one of the few Bond films to go so long without an official title.",
    "citationUrl": "https://en.wikipedia.org/wiki/Quantum_of_Solace",
    "citationTitle": "Wikipedia: Quantum of Solace"
  },
  {
    "id": "773df517-5f91-47b9-86af-8e61c16338f4",
    "text": "Which composer created the distinctive 'James Bond Theme' that has been used throughout the franchise?",
    "options": [
      "John Barry",
      "Monty Norman",
      "David Arnold",
      "George Martin"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Monty Norman composed the original James Bond Theme, though John Barry arranged it.",
    "detailedExplanation": "Monty Norman is officially credited as the composer of the iconic James Bond Theme, having adapted it from a piece he wrote for an unproduced musical called 'A House for Mr. Biswas.' However, John Barry, who arranged and conducted the version used in 'Dr. No,' long claimed he essentially rewrote the theme. This led to legal disputes, but Norman's authorship has been upheld in court, making this a complex but important piece of Bond history.",
    "citationUrl": "https://en.wikipedia.org/wiki/James_Bond_Theme",
    "citationTitle": "Wikipedia: James Bond Theme"
  },
  {
    "id": "42951daf-9057-42ba-820d-a659e0e0d477",
    "text": "In 'From Russia with Love' (1963), what type of encryption device is the central MacGuffin that both sides are trying to obtain?",
    "options": [
      "The Solex Agitator",
      "The ATAC system",
      "The Lektor decoder",
      "The GoldenEye satellite"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Lektor decoder is the Soviet encryption device that drives the plot of 'From Russia with Love.'",
    "detailedExplanation": "The Lektor decoder (called the Lector in Fleming's novel) is a Soviet cryptographic device that can decode secret messages. In the film, it serves as the bait in SPECTRE's elaborate revenge plot against Bond, with the promise of the decoder being used to lure both Bond and the Soviet cryptographer Tatiana Romanova into their trap. This MacGuffin was one of the more realistic spy gadgets in the early Bond films.",
    "citationUrl": "https://en.wikipedia.org/wiki/From_Russia_with_Love_(film)",
    "citationTitle": "Wikipedia: From Russia with Love (film)"
  },
  {
    "id": "55391cf1-21d1-411c-b0a7-5c95ad2fc8c4",
    "text": "Which Bond film was the first to be shot entirely in IMAX format?",
    "options": [
      "Skyfall",
      "Spectre",
      "No Time to Die",
      "None - no Bond film has been shot entirely in IMAX"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "No James Bond film has been shot entirely in IMAX format, only select sequences.",
    "detailedExplanation": "While several recent James Bond films have featured sequences shot with IMAX cameras - including parts of 'Skyfall,' 'Spectre,' and 'No Time to Die' - no Bond film has been shot entirely in the IMAX format. The IMAX sequences are typically reserved for major action scenes to enhance the visual spectacle, but the majority of each film is still shot with traditional cameras due to the size, weight, and noise limitations of IMAX equipment during dialogue scenes.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_James_Bond_films",
    "citationTitle": "Wikipedia: List of James Bond films"
  },
  {
    "id": "218b45ce-6b62-4505-adab-e78aa6007dd5",
    "text": "In the opening sequence of 'The Spy Who Loved Me' (1977), Bond skis off a cliff and deploys a parachute featuring which design?",
    "options": [
      "The Union Jack",
      "The 007 logo",
      "A plain white parachute",
      "The MI6 insignia"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bond's parachute displays the British Union Jack flag in this famous stunt sequence.",
    "detailedExplanation": "The pre-credits sequence of 'The Spy Who Loved Me' features one of the most spectacular stunts in Bond film history, where Bond skis off the edge of a cliff and deploys a parachute emblazoned with the Union Jack. This stunt was performed by Rick Sylvester at Mount Asgard in Canada and took several attempts to capture. The Union Jack parachute became an iconic image representing British sophistication and Bond's patriotic nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Spy_Who_Loved_Me_(film)",
    "citationTitle": "Wikipedia: The Spy Who Loved Me (film)"
  },
  {
    "id": "3b52f4d8-6f25-404a-a53c-b86f8507b89f",
    "text": "In which James Bond film does the character of Jaws first appear?",
    "options": [
      "Moonraker",
      "The Spy Who Loved Me",
      "For Your Eyes Only",
      "Octopussy"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Jaws first appeared in The Spy Who Loved Me (1977), then returned in Moonraker (1979).",
    "detailedExplanation": "The iconic steel-toothed henchman Jaws, played by Richard Kiel, made his debut in The Spy Who Loved Me (1977) as the primary antagonist working for Karl Stromberg. His memorable appearance and survival of seemingly impossible situations made him so popular with audiences that he was brought back for the following film, Moonraker (1979), making him one of the few Bond villains to appear in multiple films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jaws_(James_Bond)",
    "citationTitle": "Wikipedia: Jaws (James Bond)"
  },
  {
    "id": "e9e23fae-0f01-4a46-8331-9171876c8f5a",
    "text": "What is the real name of the author who created James Bond?",
    "options": [
      "Ian Lancaster Fleming",
      "John Gardner Fleming",
      "Raymond Benson Fleming",
      "Sebastian Faulks Fleming"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Ian Lancaster Fleming was the full name of James Bond's creator, born in 1908.",
    "detailedExplanation": "Ian Lancaster Fleming (1908-1964) was a British author, journalist, and naval intelligence officer who created the James Bond series. Fleming drew upon his wartime experience in naval intelligence and his knowledge of international affairs to create the world's most famous fictional spy. He wrote 12 Bond novels and two short story collections between 1953 and 1966, with Casino Royale being his first Bond novel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ian_Fleming",
    "citationTitle": "Wikipedia: Ian Fleming"
  },
  {
    "id": "c33311a0-2693-43c6-9de6-dc7c760fe12f",
    "text": "In Casino Royale (2006), what specific hand does Bond hold to win the final poker game?",
    "options": [
      "Royal flush",
      "Straight flush",
      "Four of a kind",
      "Full house"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bond wins with a straight flush (4, 5, 6, 7, 8 of spades) against Le Chiffre's full house.",
    "detailedExplanation": "In the climactic poker scene of Casino Royale (2006), James Bond defeats Le Chiffre with a straight flush in spades (4-5-6-7-8), which beats Le Chiffre's full house (aces over sixes). This scene was notable for changing the card game from baccarat in Fleming's original novel to Texas Hold'em poker, reflecting the popularity of poker in the 2000s. The hand was carefully chosen by the filmmakers to create maximum dramatic tension.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casino_Royale_(2006_film)",
    "citationTitle": "Wikipedia: Casino Royale (2006 film)"
  },
  {
    "id": "69f60267-e224-442d-bc0c-4c8213d92ed6",
    "text": "Which composer wrote the music for the most James Bond films?",
    "options": [
      "Thomas Newman",
      "David Arnold",
      "John Barry",
      "Bill Conti"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "John Barry composed the music for 11 Bond films, more than any other composer in the franchise.",
    "detailedExplanation": "John Barry composed the music for 11 James Bond films between 1963 and 1987, starting with From Russia with Love and ending with The Living Daylights. Barry was responsible for creating the distinctive James Bond musical style, including the famous '007 Theme' and orchestrating Monty Norman's original Bond theme. He also composed several Bond theme songs, including 'Goldfinger' and 'Diamonds Are Forever,' establishing the template for the grand, orchestral Bond sound that continues to influence the franchise today.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Barry_(composer)",
    "citationTitle": "Wikipedia: John Barry (composer)"
  },
  {
    "id": "d8377f46-5e19-41d6-b5df-3378b1b0fe04",
    "text": "In which Bond film does 007 first drive an Aston Martin DB5?",
    "options": [
      "Dr. No",
      "From Russia with Love",
      "Goldfinger",
      "Thunderball"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Aston Martin DB5 made its first appearance in Goldfinger (1964), complete with ejector seat and other gadgets.",
    "detailedExplanation": "The Aston Martin DB5 first appeared in Goldfinger (1964), driven by Sean Connery's Bond. This car became iconic for its array of gadgets designed by Q Branch, including an ejector passenger seat, rotating number plates, bulletproof windows, and machine guns. The DB5 was chosen over Bond's literary Bentley to appeal to a more modern audience, and the partnership between Aston Martin and the Bond franchise has continued intermittently ever since, making it one of cinema's most famous car-character relationships.",
    "citationUrl": "https://en.wikipedia.org/wiki/Goldfinger_(film)",
    "citationTitle": "Wikipedia: Goldfinger (film)"
  },
  {
    "id": "449d8d21-82f2-4f2f-be31-ff0e8b26e894",
    "text": "What was the original working title for the film that became 'Skyfall'?",
    "options": [
      "Silver Falcon",
      "Once Upon a Spy",
      "Shadow Fall",
      "Property of a Lady"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Skyfall was originally titled 'Once Upon a Spy' during early development and production.",
    "detailedExplanation": "During the early stages of development and production, Skyfall (2012) was known by the working title 'Once Upon a Spy.' Working titles are commonly used in film production to maintain secrecy around major projects and prevent unwanted attention during filming. The title 'Skyfall' was eventually chosen as it relates to Bond's childhood home in Scotland and the emotional journey of the character in the film. The movie became one of the most successful Bond films, grossing over $1 billion worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Skyfall",
    "citationTitle": "Wikipedia: Skyfall"
  },
  {
    "id": "a1b31fdc-68c2-4b56-9e92-ae292e1e34d7",
    "text": "Which actor was originally cast as James Bond in Dr. No before Sean Connery?",
    "options": [
      "Roger Moore",
      "Cary Grant",
      "David Niven",
      "Patrick McGoohan"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Cary Grant was initially approached but declined, wanting only a one-film contract, leading to Connery's casting.",
    "detailedExplanation": "Cary Grant was the producers' first choice for James Bond in Dr. No, but he declined the role because he was only willing to commit to one film, while the producers wanted someone for multiple pictures. Other actors considered included Patrick McGoohan, who turned it down feeling the character was too promiscuous, and David Niven, who was considered too old at the time (though he would later play Bond in the 1967 Casino Royale spoof). Sean Connery was ultimately cast after a screen test impressed producer Cubby Broccoli, despite being relatively unknown at the time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dr._No_(film)",
    "citationTitle": "Wikipedia: Dr. No (film)"
  },
  {
    "id": "b4505303-e431-491b-a7f7-412c1595f7be",
    "text": "In Licence to Kill, what is the name of the drug lord that Bond pursues for revenge?",
    "options": [
      "Emilio Largo",
      "Franz Sanchez",
      "Aristotle Kristatos",
      "Max Zorin"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Franz Sanchez, played by Robert Davi, is the main antagonist in Licence to Kill (1989).",
    "detailedExplanation": "Franz Sanchez, portrayed by Robert Davi, is the primary villain in Licence to Kill (1989). Sanchez is a Latin American drug lord who severely injures Bond's friend Felix Leiter and kills Leiter's wife, prompting Bond to go rogue and pursue personal vengeance outside of his official MI6 duties. This film marked a notably darker and more violent tone for the Bond franchise, and was Timothy Dalton's second and final performance as 007. The character of Sanchez was created specifically for the film and represents the shift toward more contemporary, realistic villains in the late 1980s Bond films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Licence_to_Kill",
    "citationTitle": "Wikipedia: Licence to Kill"
  },
  {
    "id": "5d532023-3f50-430b-9b1f-9f2244acc767",
    "text": "In which James Bond film does Bond use a jetpack in the opening sequence?",
    "options": [
      "Goldfinger",
      "Thunderball",
      "You Only Live Twice",
      "Diamonds Are Forever"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The jetpack sequence appears in the opening of Thunderball (1965).",
    "detailedExplanation": "The famous jetpack sequence occurs in the pre-credits opening of Thunderball (1965), where Sean Connery's Bond uses a Bell Rocket Belt to escape after a fight at a château. This was a real functioning jetpack provided by Bell Aerosystems, and the sequence was filmed at Château d'Anet in France. The jetpack had a flight time of only about 20 seconds, requiring careful choreography and multiple takes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thunderball_(film)",
    "citationTitle": "Wikipedia: Thunderball (film)"
  },
  {
    "id": "90cdfe71-5632-41cf-b900-7d0e434c55e2",
    "text": "What is the real name of the character known as 'Jaws' in The Spy Who Loved Me and Moonraker?",
    "options": [
      "Richard Kiel",
      "Karl Stromberg",
      "Hugo Drax",
      "His real name is never revealed"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The character Jaws' real name is never revealed in either film.",
    "detailedExplanation": "Despite being one of the most memorable Bond villains, appearing in both The Spy Who Loved Me (1977) and Moonraker (1979), the steel-toothed assassin known as 'Jaws' is never given a real name in either film. He is only ever referred to as 'Jaws' throughout both movies. The character was portrayed by 7'2\" actor Richard Kiel, but that is the actor's name, not the character's. This anonymity adds to the character's mystique as a seemingly unstoppable force of nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jaws_(James_Bond)",
    "citationTitle": "Wikipedia: Jaws (James Bond)"
  },
  {
    "id": "dcd3f553-ae32-4f05-b56d-33045eeb4f9d",
    "text": "Which composer wrote the score for On Her Majesty's Secret Service, the only Bond film not to feature a traditional opening theme song?",
    "options": [
      "John Barry",
      "Monty Norman",
      "George Martin",
      "Michel Legrand"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "John Barry composed the score and the instrumental theme for On Her Majesty's Secret Service.",
    "detailedExplanation": "John Barry composed the score for On Her Majesty's Secret Service (1969), creating 'We Have All the Time in the World' as a love theme and an instrumental version for the opening credits. This was the only Bond film not to feature a traditional pop song over the opening credits, instead using Barry's instrumental arrangement of the main theme. The decision was reportedly made because the producers wanted to establish George Lazenby as the new Bond without the distraction of a vocal theme, focusing instead on the visual montage and Barry's orchestral score.",
    "citationUrl": "https://en.wikipedia.org/wiki/On_Her_Majesty%27s_Secret_Service_(film)",
    "citationTitle": "Wikipedia: On Her Majesty's Secret Service (film)"
  },
  {
    "id": "892ebd04-e49f-4c07-b552-c52d5fbc29e5",
    "text": "In Casino Royale (2006), what specific hand does Bond hold to win the final poker game against Le Chiffre?",
    "options": [
      "Royal flush in spades",
      "Straight flush, five to nine of spades",
      "Four aces",
      "Full house, aces over eights"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bond wins with a straight flush, five through nine of spades.",
    "detailedExplanation": "In the climactic poker scene of Casino Royale (2006), James Bond defeats Le Chiffre with a straight flush, five through nine of spades. This beats Le Chiffre's full house (aces full of sixes), another player's flush, and a third player's full house (eights full of aces). The scene was carefully choreographed to show the escalating tension as each player reveals increasingly strong hands, with Bond's straight flush being the ultimate winner. This specific hand was chosen by the filmmakers to create maximum dramatic impact while remaining mathematically plausible.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casino_Royale_(2006_film)",
    "citationTitle": "Wikipedia: Casino Royale (2006 film)"
  }
]