[
  {
    "id": "60f4d0bd-db4b-4b62-bf73-cb918e736313",
    "text": "What is the name of James Bond's boss, the head of MI6?",
    "options": [
      "Q",
      "M",
      "Moneypenny",
      "Felix"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "M is the codename for Bond's superior and head of the British Secret Intelligence Service.",
    "detailedExplanation": "M is the fictional head of MI6 in the James Bond series, serving as Bond's superior throughout the franchise. The character has been portrayed by several actors including Bernard Lee, Robert Brown, Judi Dench, and Ralph Fiennes. The letter 'M' stands for 'Miles' in some interpretations, though the character's real name varies depending on the actor and era. Q is the quartermaster who provides Bond with gadgets, while Moneypenny is M's secretary.",
    "citationUrl": "https://en.wikipedia.org/wiki/M_(James_Bond)",
    "citationTitle": "Wikipedia: M (James Bond)"
  },
  {
    "id": "218570f6-4e8c-4d46-851f-6da83d321a5a",
    "text": "In which Bond film does the character Jaws first appear?",
    "options": [
      "Moonraker",
      "The Spy Who Loved Me",
      "For Your Eyes Only",
      "Octopussy"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jaws, the metal-toothed henchman, first appeared in The Spy Who Loved Me (1977).",
    "detailedExplanation": "Jaws, played by Richard Kiel, made his debut in The Spy Who Loved Me (1977) as one of the most memorable Bond villains. Standing at 7'2\" with distinctive metal teeth, the character was so popular that he returned in the following film, Moonraker (1979). Jaws was known for his incredible strength and seeming indestructibility, surviving numerous apparent deaths throughout both films. He remains one of the few Bond henchmen to appear in multiple movies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jaws_(James_Bond)",
    "citationTitle": "Wikipedia: Jaws (James Bond)"
  },
  {
    "id": "79fe423e-75b2-4cd3-92df-37e05fef24f5",
    "text": "Which car manufacturer is most famously associated with James Bond vehicles?",
    "options": [
      "Ferrari",
      "Porsche",
      "Aston Martin",
      "BMW"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Aston Martin has been Bond's primary car brand since Goldfinger (1964).",
    "detailedExplanation": "Aston Martin became synonymous with James Bond starting with the iconic DB5 in Goldfinger (1964), complete with ejector seat and various Q-branch modifications. The partnership has continued throughout the franchise with models including the V8, DB10, DBS, and DB11 appearing in subsequent films. While Bond has occasionally driven BMWs (in the 1990s) and other vehicles, Aston Martin remains the most iconic and frequently featured automotive brand in the series, representing British luxury and sophistication.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_James_Bond_vehicles",
    "citationTitle": "Wikipedia: List of James Bond vehicles"
  },
  {
    "id": "cfdd9e44-a295-4923-909f-c34d34a96a48",
    "text": "What was the first James Bond film to win an Academy Award?",
    "options": [
      "Dr. No",
      "Goldfinger",
      "Thunderball",
      "You Only Live Twice"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Thunderball (1965) won the Academy Award for Best Visual Effects.",
    "detailedExplanation": "Thunderball (1965) was the first James Bond film to win an Academy Award, taking home the Oscar for Best Visual Effects. The film's underwater sequences and special effects work were groundbreaking for their time. Thunderball was also notable for being one of the highest-grossing Bond films and featured extensive underwater action sequences in the Bahamas. The visual effects team's work on the underwater scenes and action sequences set new standards for action filmmaking in the mid-1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thunderball_(film)",
    "citationTitle": "Wikipedia: Thunderball (film)"
  },
  {
    "id": "82ffcca8-aeb1-4a9b-9491-1f9b4089dcb0",
    "text": "Which Bond theme song was performed by Adele?",
    "options": [
      "Quantum of Solace",
      "Skyfall",
      "Spectre",
      "No Time to Die"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Adele performed the theme song for Skyfall (2012), which won an Academy Award.",
    "detailedExplanation": "Adele co-wrote and performed the theme song for Skyfall (2012), marking one of the most successful Bond themes in the franchise's history. The song reached number one in multiple countries and won the Academy Award for Best Original Song, a Golden Globe, and a BRIT Award. It was the first Bond theme to win an Oscar in 47 years. The song's powerful vocals and orchestral arrangement perfectly complemented the film's themes and became an instant classic in the Bond canon.",
    "citationUrl": "https://en.wikipedia.org/wiki/Skyfall_(Adele_song)",
    "citationTitle": "Wikipedia: Skyfall (Adele song)"
  },
  {
    "id": "cf8245d2-7477-4323-9a4c-c348961237c0",
    "text": "In Casino Royale (2006), what card game does Bond play against Le Chiffre?",
    "options": [
      "Baccarat",
      "Blackjack",
      "Texas Hold'em Poker",
      "Bridge"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The 2006 version changed the game from baccarat (in the novel) to Texas Hold'em poker.",
    "detailedExplanation": "In Casino Royale (2006), the filmmakers updated the card game from baccarat (as featured in Ian Fleming's original novel) to Texas Hold'em poker to reflect modern gambling preferences and make the game more accessible to contemporary audiences. The high-stakes poker tournament at the Casino Royale in Montenegro serves as the central plot device, with Bond playing against Le Chiffre to bankrupt the villain and force him to seek asylum with MI6 in exchange for information about his terrorist contacts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casino_Royale_(2006_film)",
    "citationTitle": "Wikipedia: Casino Royale (2006 film)"
  },
  {
    "id": "3fad5b65-78e3-4760-aeca-71d5688eedf2",
    "text": "Which Bond film features the villain Auric Goldfinger?",
    "options": [
      "From Russia with Love",
      "Goldfinger",
      "Thunderball",
      "Dr. No"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Auric Goldfinger is the titular villain in Goldfinger (1964), played by Gert Fröbe.",
    "detailedExplanation": "Auric Goldfinger, played by German actor Gert Fröbe, is the main antagonist in Goldfinger (1964), the third official James Bond film. The character is obsessed with gold and plans 'Operation Grand Slam' to contaminate the gold reserves at Fort Knox, making his own gold more valuable. Goldfinger is famous for several iconic moments, including the phrase 'No, Mr. Bond, I expect you to die!' and the attempted murder of Bond with a laser. The film also introduced the deadly Oddjob and Bond's legendary Aston Martin DB5.",
    "citationUrl": "https://en.wikipedia.org/wiki/Goldfinger_(film)",
    "citationTitle": "Wikipedia: Goldfinger (film)"
  },
  {
    "id": "f196e5e7-ca1c-4b85-9e65-f7a0523c3199",
    "text": "What is the name of James Bond's car manufacturer of choice?",
    "options": [
      "Ferrari",
      "Aston Martin",
      "Porsche",
      "Jaguar"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Aston Martin is Bond's signature car brand, first appearing in Goldfinger (1964).",
    "detailedExplanation": "Aston Martin has been synonymous with James Bond since the DB5 first appeared in Goldfinger (1964), equipped with ejector seats and various gadgets by Q Branch. The partnership between Bond and Aston Martin has continued throughout the franchise, with various models including the V8 Vantage, Vanquish, DBS, and DB10 appearing in subsequent films. While Bond has driven other luxury cars, Aston Martin remains his most iconic and frequently used vehicle brand.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aston_Martin_in_James_Bond_films",
    "citationTitle": "Wikipedia: Aston Martin in James Bond films"
  },
  {
    "id": "bbaecd65-9116-4ad6-9714-ae048478a2b3",
    "text": "In which James Bond film does the villain Ernst Stavro Blofeld first appear on screen?",
    "options": [
      "From Russia with Love",
      "Thunderball",
      "You Only Live Twice",
      "On Her Majesty's Secret Service"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Blofeld first appears on screen in You Only Live Twice (1967), played by Donald Pleasence.",
    "detailedExplanation": "Ernst Stavro Blofeld, the head of SPECTRE and Bond's arch-nemesis, first appeared physically on screen in You Only Live Twice (1967), portrayed by Donald Pleasence. While Blofeld's voice and hands were featured in earlier films like From Russia with Love and Thunderball, his face was never shown. The character became iconic with his white Persian cat, facial scar, and volcanic lair headquarters, establishing many of the classic Bond villain tropes that influenced popular culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ernst_Stavro_Blofeld",
    "citationTitle": "Wikipedia: Ernst Stavro Blofeld"
  },
  {
    "id": "b4cc43ac-0c2b-4a1a-a1ca-2278ba74769e",
    "text": "What does the 'Q' stand for in Q Branch, the department that supplies Bond with gadgets?",
    "options": [
      "Quality",
      "Quantum",
      "Quartermaster",
      "Quick"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Q stands for Quartermaster, the military term for the person responsible for supplies and equipment.",
    "detailedExplanation": "In the James Bond universe, Q Branch is short for Quartermaster Branch, reflecting the military origins of the term. A quartermaster is traditionally responsible for supplies, equipment, and logistics in military organizations. The character of Q, who heads this department, provides Bond with his innovative gadgets and weapons. The role was most memorably portrayed by Desmond Llewelyn from 1963 to 1999, who appeared in 17 Bond films and became beloved for his paternal yet exasperated relationship with the gadget-destroying secret agent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Q_(James_Bond)",
    "citationTitle": "Wikipedia: Q (James Bond)"
  },
  {
    "id": "b3b53133-56be-4df2-94db-0c6d116b17b8",
    "text": "Which Bond theme song won the Academy Award for Best Original Song?",
    "options": [
      "Live and Let Die",
      "Nobody Does It Better",
      "Skyfall",
      "Goldfinger"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Adele's 'Skyfall' won the Oscar for Best Original Song in 2013.",
    "detailedExplanation": "Adele's 'Skyfall' made history as the first James Bond theme song to win the Academy Award for Best Original Song in 2013. The song, co-written with producer Paul Epworth, also won the Golden Globe and BAFTA for Best Original Song. While several other Bond themes were nominated for Oscars, including 'Live and Let Die' by Paul McCartney and Wings, and 'For Your Eyes Only' by Sheena Easton, 'Skyfall' was the first to actually win the prestigious award.",
    "citationUrl": "https://en.wikipedia.org/wiki/Skyfall_(song)",
    "citationTitle": "Wikipedia: Skyfall (song)"
  },
  {
    "id": "b7b40fe6-fb4d-4169-ba19-cb38905baf4c",
    "text": "Which James Bond actor was knighted by Queen Elizabeth II?",
    "options": [
      "Sean Connery",
      "Roger Moore",
      "Timothy Dalton",
      "Pierce Brosnan"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sean Connery was knighted by Queen Elizabeth II in 2000 for services to film drama.",
    "detailedExplanation": "Sean Connery was knighted by Queen Elizabeth II in 2000 at the age of 69, receiving the honor for his services to film drama. The knighthood ceremony took place at Holyrood Palace in Edinburgh, Scotland. Interestingly, Connery was a vocal supporter of Scottish independence throughout his life, which reportedly delayed his knighthood for many years. Roger Moore received a different honor, being made a Commander of the Order of the British Empire (CBE) in 1999, but was never knighted.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sean_Connery",
    "citationTitle": "Wikipedia: Sean Connery"
  },
  {
    "id": "f48c73f9-a0bd-46b7-b77e-f625f8d2018c",
    "text": "What is the name of the criminal organization that serves as Bond's primary enemy in the early films?",
    "options": [
      "QUANTUM",
      "SPECTRE",
      "SMERSH",
      "Janus"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "SPECTRE (Special Executive for Counter-intelligence, Terrorism, Revenge and Extortion) was Bond's main adversary.",
    "detailedExplanation": "SPECTRE, which stands for Special Executive for Counter-intelligence, Terrorism, Revenge and Extortion, was the primary criminal organization opposing James Bond in many of the early films. Created by Ian Fleming for the Thunderball novel, SPECTRE was led by Ernst Stavro Blofeld and featured in films from Dr. No through Diamonds Are Forever. Due to legal disputes over the rights to SPECTRE and Blofeld, the organization was absent from Bond films for decades before returning in the Daniel Craig era with Spectre (2015).",
    "citationUrl": "https://en.wikipedia.org/wiki/SPECTRE",
    "citationTitle": "Wikipedia: SPECTRE"
  },
  {
    "id": "b713529b-f52e-4c23-b435-7c6867959d6d",
    "text": "Which actor played James Bond in the most official EON Productions films?",
    "options": [
      "Sean Connery",
      "Roger Moore",
      "Pierce Brosnan",
      "Daniel Craig"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Roger Moore played Bond in seven official films from 1973 to 1985.",
    "detailedExplanation": "Roger Moore holds the record for playing James Bond in the most official EON Productions films, starring in seven movies: Live and Let Die (1973), The Man with the Golden Gun (1974), The Spy Who Loved Me (1977), Moonraker (1979), For Your Eyes Only (1981), Octopussy (1983), and A View to a Kill (1985). Sean Connery appeared in six official films, while Pierce Brosnan and Daniel Craig each starred in four.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roger_Moore",
    "citationTitle": "Wikipedia: Roger Moore"
  },
  {
    "id": "4112e756-de81-47a4-98b4-07740862e082",
    "text": "What is the name of the fictional intelligence agency that James Bond works for?",
    "options": [
      "MI5",
      "MI6",
      "CIA",
      "SIS"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "James Bond works for MI6, also known as the Secret Intelligence Service.",
    "detailedExplanation": "In the James Bond franchise, 007 works for MI6 (Military Intelligence, Section 6), which is the foreign intelligence service of the United Kingdom. While MI6 and SIS (Secret Intelligence Service) are technically the same organization in real life, in the Bond universe it's consistently referred to as MI6. MI5 handles domestic security, while the CIA is the American intelligence agency that Bond sometimes collaborates with.",
    "citationUrl": "https://en.wikipedia.org/wiki/MI6_in_James_Bond",
    "citationTitle": "Wikipedia: MI6 in James Bond"
  },
  {
    "id": "591815ec-792c-424f-a6f5-2ae441c3bfd0",
    "text": "Which James Bond theme song won the Academy Award for Best Original Song?",
    "options": [
      "Goldfinger",
      "Skyfall",
      "Live and Let Die",
      "Nobody Does It Better"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Adele's 'Skyfall' won the Oscar for Best Original Song in 2013.",
    "detailedExplanation": "Adele's theme song for 'Skyfall' (2012) became the first James Bond theme to win the Academy Award for Best Original Song. While other Bond themes like 'Live and Let Die' by Paul McCartney and Wings, and 'Nobody Does It Better' by Carly Simon were nominated for Oscars, they didn't win. The song also won a Golden Globe and a BRIT Award, making it one of the most successful Bond themes ever.",
    "citationUrl": "https://en.wikipedia.org/wiki/Skyfall_(Adele_song)",
    "citationTitle": "Wikipedia: Skyfall (Adele song)"
  },
  {
    "id": "d16242d5-d512-454c-b48d-675a98ad0cc9",
    "text": "In which country is the opening scene of 'Casino Royale' (2006) set?",
    "options": [
      "Czech Republic",
      "Madagascar",
      "Uganda",
      "Montenegro"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The opening black-and-white sequence takes place in Uganda, showing Bond's first two kills.",
    "detailedExplanation": "The 2006 film 'Casino Royale' opens with a black-and-white sequence set in Uganda, where we see James Bond earning his '00' status by completing his first two kills. The scene shows Bond confronting a corrupt MI6 section chief in a public restroom in Uganda, which is one of the two kills needed to become a '00' agent. While much of the main plot later takes place in Madagascar, the Bahamas, and Montenegro, the crucial opening sequence establishing Bond's credentials occurs in Uganda.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casino_Royale_(2006_film)",
    "citationTitle": "Wikipedia: Casino Royale (2006 film)"
  },
  {
    "id": "a851e3af-b3b5-4d55-b2ab-bfa4b276dde9",
    "text": "What is the real name of the character known as 'M' in the Pierce Brosnan and Daniel Craig Bond films?",
    "options": [
      "Miles Messervy",
      "Olivia Mansfield",
      "Gareth Mallory",
      "Barbara Mawdsley"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Judi Dench's M character was named Olivia Mansfield, revealed in 'Skyfall'.",
    "detailedExplanation": "In the James Bond films starring Pierce Brosnan and Daniel Craig, M was played by Judi Dench, and her character's real name was revealed to be Olivia Mansfield in 'Skyfall' (2012). This was shown on her obituary and personal effects after her death in the film. Miles Messervy was the name of the original M from the earlier films, while Gareth Mallory (played by Ralph Fiennes) became the new M after Mansfield's death. Barbara Mawdsley is not a character from the Bond franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/M_(James_Bond)",
    "citationTitle": "Wikipedia: M (James Bond)"
  },
  {
    "id": "221ad623-7b63-4cbe-aa79-9e8b1f02a35b",
    "text": "Which James Bond film features the villain Auric Goldfinger?",
    "options": [
      "From Russia with Love",
      "Goldfinger",
      "Thunderball",
      "You Only Live Twice"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Auric Goldfinger is the main antagonist in the 1964 film 'Goldfinger'.",
    "detailedExplanation": "Auric Goldfinger, played by Gert Fröbe, is the titular villain in the 1964 James Bond film 'Goldfinger'. He is a wealthy businessman obsessed with gold who plans to contaminate the gold supply at Fort Knox to increase the value of his own gold reserves. The film also features iconic elements like the Aston Martin DB5, the character Oddjob with his steel-rimmed hat, and Shirley Eaton as Jill Masterson, who meets her fate covered in gold paint. 'Goldfinger' is often considered one of the definitive Bond films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Goldfinger_(film)",
    "citationTitle": "Wikipedia: Goldfinger (film)"
  },
  {
    "id": "5eb5ffe8-7622-4dc2-b255-404b84b93f1e",
    "text": "What type of car does James Bond famously drive, particularly associated with the franchise?",
    "options": [
      "Ferrari",
      "Aston Martin",
      "Porsche",
      "Lotus"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Aston Martin is the car brand most closely associated with James Bond throughout the franchise.",
    "detailedExplanation": "Aston Martin has been James Bond's signature car brand since 'Goldfinger' (1964), when he first drove the iconic DB5. The relationship between Bond and Aston Martin has continued throughout most of the franchise, with various models appearing including the DB5, V8 Vantage, DB10, and DBS. While Bond has occasionally driven other luxury cars like Lotus (notably the submarine Esprit in 'The Spy Who Loved Me') and BMW in some 1990s films, Aston Martin remains the brand most closely associated with 007.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_James_Bond_vehicles",
    "citationTitle": "Wikipedia: List of James Bond vehicles"
  }
]