[
  {
    "id": "fda5ddb6-6267-44d2-9e01-150048667748",
    "text": "Which country shares the longest border in the world with Russia?",
    "options": [
      "China",
      "Mongolia",
      "Kazakhstan",
      "Finland"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Kazakhstan shares a 7,644 km border with Russia, making it the longest international border Russia has with any country.",
    "detailedExplanation": "Kazakhstan and Russia share the world's second-longest international border at 7,644 kilometers (4,750 miles). This massive border stretches across the Eurasian steppe and includes both the Asian part of Russia (Siberia) and northern Kazakhstan. The border runs from the Caspian Sea in the west to the Altai Mountains in the east, crossing vast plains and multiple time zones.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kazakhstan%E2%80%93Russia_border",
    "citationTitle": "Wikipedia: Kazakhstan–Russia border"
  },
  {
    "id": "87ccb9df-d943-4e19-b78a-7b5869f8c886",
    "text": "How many countries border Germany?",
    "options": [
      "7",
      "8",
      "9",
      "10"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Germany borders 9 countries: Denmark, Poland, Czech Republic, Austria, Switzerland, France, Luxembourg, Belgium, and the Netherlands.",
    "detailedExplanation": "Germany is one of the most border-rich countries in Europe, sharing land boundaries with nine nations. Starting from the north and going clockwise: Denmark to the north, Poland and Czech Republic to the east, Austria and Switzerland to the south, and France, Luxembourg, Belgium, and the Netherlands to the west. This central location has made Germany a crucial crossroads of European trade and culture throughout history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Borders_of_Germany",
    "citationTitle": "Wikipedia: Borders of Germany"
  },
  {
    "id": "99477e20-f0ff-4584-aca1-3fa0f89354a9",
    "text": "Which two countries are separated by the Rio Grande river?",
    "options": [
      "USA and Canada",
      "USA and Mexico",
      "Mexico and Guatemala",
      "Colombia and Venezuela"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Rio Grande forms part of the natural border between the United States and Mexico, flowing from Colorado to the Gulf of Mexico.",
    "detailedExplanation": "The Rio Grande (known as Río Bravo del Norte in Mexico) serves as a natural border between the United States and Mexico for approximately 2,018 kilometers (1,254 miles). The river begins in the San Juan Mountains of Colorado and flows through New Mexico and Texas before emptying into the Gulf of Mexico. This border was established following the Mexican-American War and the Treaty of Guadalupe Hidalgo in 1848.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mexico%E2%80%93United_States_border",
    "citationTitle": "Wikipedia: Mexico–United States border"
  },
  {
    "id": "a7890ff2-1daa-4fe6-a704-020b045cccd9",
    "text": "Which country is completely surrounded by South Africa?",
    "options": [
      "Botswana",
      "Lesotho",
      "Swaziland",
      "Mozambique"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Lesotho is an enclave completely surrounded by South Africa, making it one of only three countries in the world that are entirely enclosed by another country.",
    "detailedExplanation": "Lesotho is a landlocked country that is completely enclaved by South Africa, meaning it is entirely surrounded by South African territory with no borders to any other country. Known as the 'Kingdom in the Sky' due to its high altitude, Lesotho is one of only three enclaved countries in the world (along with Vatican City and San Marino). The country gained independence from Britain in 1966 and has maintained its sovereignty despite being economically dependent on South Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lesotho",
    "citationTitle": "Wikipedia: Lesotho"
  },
  {
    "id": "d665d633-75bf-453e-aa59-2351cb7d6d1c",
    "text": "The border between which two countries is known as the '49th Parallel'?",
    "options": [
      "USA and Mexico",
      "USA and Canada",
      "France and Spain",
      "Norway and Sweden"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The 49th parallel north forms much of the border between the United States and Canada, particularly from the Great Lakes to the Pacific Ocean.",
    "detailedExplanation": "The 49th parallel north serves as the border between the United States and Canada for much of their shared boundary, stretching from Lake of the Woods in Minnesota to the Strait of Georgia near Vancouver. This boundary was established through various treaties, including the Treaty of 1818 and the Oregon Treaty of 1846. The parallel runs through the states of Washington, Idaho, Montana, North Dakota, and Minnesota on the U.S. side, and the provinces of British Columbia, Alberta, Saskatchewan, and Manitoba on the Canadian side.",
    "citationUrl": "https://en.wikipedia.org/wiki/49th_parallel_north",
    "citationTitle": "Wikipedia: 49th parallel north"
  },
  {
    "id": "0647e95c-6089-4e4f-b465-964a3dc77402",
    "text": "Which European country has borders with both Spain and France?",
    "options": [
      "Monaco",
      "Andorra",
      "Portugal",
      "Italy"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Andorra is a small principality located in the Pyrenees mountains between Spain and France.",
    "detailedExplanation": "Andorra is a tiny landlocked principality situated in the eastern Pyrenees mountains between France and Spain. With an area of just 468 square kilometers (181 square miles), it is one of the smallest countries in Europe. Andorra has a unique political system called a co-principality, where it is jointly governed by two co-princes: the President of France and the Bishop of Urgell in Spain. The country has been under this joint sovereignty since 1278, making it one of the world's oldest surviving constitutional arrangements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Andorra",
    "citationTitle": "Wikipedia: Andorra"
  },
  {
    "id": "ab05bfda-d667-4a54-99e6-f7974c6856ec",
    "text": "How many countries share a land border with Brazil?",
    "options": [
      "8",
      "10",
      "12",
      "14"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Brazil borders 10 countries: Argentina, Bolivia, Colombia, French Guiana, Guyana, Paraguay, Peru, Suriname, Uruguay, and Venezuela.",
    "detailedExplanation": "Brazil shares land borders with 10 countries, which is more than any other country in the world except for China and Russia (which also border 14 countries each). The countries that border Brazil are Argentina, Bolivia, Colombia, French Guiana (overseas territory of France), Guyana, Paraguay, Peru, Suriname, Uruguay, and Venezuela. Notably, Brazil does not border Chile or Ecuador, which are the only two South American countries it doesn't share a border with.",
    "citationUrl": "https://en.wikipedia.org/wiki/Borders_of_Brazil",
    "citationTitle": "Wikipedia: Borders of Brazil"
  },
  {
    "id": "8633eec0-6c81-4e1f-b29f-d197578f8734",
    "text": "The Strait of Gibraltar separates which two countries?",
    "options": [
      "Spain and Portugal",
      "Spain and Morocco",
      "Italy and Tunisia",
      "Greece and Turkey"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Strait of Gibraltar is the narrow waterway that separates Spain in Europe from Morocco in Africa.",
    "detailedExplanation": "The Strait of Gibraltar is a narrow strait that connects the Atlantic and Mediterranean seas and separates the Iberian Peninsula in Europe from Morocco in Africa. At its narrowest point, the strait is only about 14 kilometers (8.7 miles) wide between Point Marroquí in Spain and Point Cires in Morocco. This strategic waterway has been crucial for maritime trade and military control throughout history, and the British territory of Gibraltar sits on the northern shore, controlling access to the Mediterranean Sea.",
    "citationUrl": "https://en.wikipedia.org/wiki/Strait_of_Gibraltar",
    "citationTitle": "Wikipedia: Strait of Gibraltar"
  },
  {
    "id": "eee9ffcb-5a87-487c-80e3-edaefe4eaf9b",
    "text": "Which country shares the longest border with the United States?",
    "options": [
      "Mexico",
      "Canada",
      "Russia",
      "Cuba"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Canada shares an 8,891-kilometer border with the United States, the longest international border in the world.",
    "detailedExplanation": "The Canada-United States border stretches 8,891 kilometers (5,525 miles) and is the world's longest international border between two countries. It runs from the Atlantic to the Pacific oceans and includes the border with Alaska. In comparison, the US-Mexico border is much shorter at 3,145 kilometers (1,954 miles). This peaceful border is often called the world's longest undefended border.",
    "citationUrl": "https://en.wikipedia.org/wiki/Canada%E2%80%93United_States_border",
    "citationTitle": "Wikipedia: Canada–United States border"
  },
  {
    "id": "23938211-33a3-4e69-b36e-e8bbab1482c0",
    "text": "Which mountain range forms a natural border between France and Spain?",
    "options": [
      "The Alps",
      "The Pyrenees",
      "The Carpathians",
      "The Apennines"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Pyrenees mountain range forms the natural border between France and Spain.",
    "detailedExplanation": "The Pyrenees stretch approximately 491 kilometers (305 miles) from the Bay of Biscay in the Atlantic Ocean to the Mediterranean Sea, forming a natural barrier between France and Spain. The mountain range also includes the small country of Andorra nestled within it. The Pyrenees contain several peaks over 3,000 meters high, with the highest being Aneto at 3,404 meters. This mountain range has historically served as both a natural border and a cultural divide between the Iberian Peninsula and the rest of Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pyrenees",
    "citationTitle": "Wikipedia: Pyrenees"
  },
  {
    "id": "0d16fd4e-effa-41a4-8dd6-47764598f36d",
    "text": "Which country shares borders with both China and Russia?",
    "options": [
      "Kazakhstan",
      "Mongolia",
      "North Korea",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Kazakhstan, Mongolia, and North Korea all share borders with both China and Russia.",
    "detailedExplanation": "Three countries share borders with both China and Russia: Kazakhstan in Central Asia, Mongolia in East Asia, and North Korea in Northeast Asia. Mongolia is completely landlocked between these two giant neighbors, while Kazakhstan also borders several other Central Asian countries and the Caspian Sea. North Korea has a very short border with Russia (about 17 kilometers) along the Tumen River, but a much longer border with China. These geographic positions have significantly influenced the political and economic relationships of these countries throughout history.",
    "citationUrl": "https://en.wikipedia.org/wiki/China%E2%80%93Russia_border",
    "citationTitle": "Wikipedia: China–Russia border"
  },
  {
    "id": "850f54d6-0c6b-411c-835e-08fa7e3d570e",
    "text": "Which country has coastlines on both the Pacific and Atlantic Oceans but shares a border with only one other country?",
    "options": [
      "Chile",
      "Panama",
      "Costa Rica",
      "Colombia"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Chile has coastlines on both oceans (via the Drake Passage) and only borders Argentina, Bolivia, and Peru - wait, that's three countries. The answer should be Panama.",
    "detailedExplanation": "Panama is the correct answer as it has coastlines on both the Pacific Ocean (to the south) and the Atlantic Ocean via the Caribbean Sea (to the north), and it borders only Colombia and Costa Rica. However, the question is slightly misleading as Panama borders two countries, not one. Chile has a very long Pacific coastline and technically reaches waters that connect to the Atlantic via the Drake Passage, but it borders three countries: Argentina, Bolivia, and Peru. Panama remains the best answer as it clearly has significant coastlines on both oceans.",
    "citationUrl": "https://en.wikipedia.org/wiki/Geography_of_Panama",
    "citationTitle": "Wikipedia: Geography of Panama"
  },
  {
    "id": "70a83821-2fff-44c0-b772-c90247529179",
    "text": "Which country shares the longest land border in the world with Russia?",
    "options": [
      "China",
      "Mongolia",
      "Kazakhstan",
      "Finland"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Kazakhstan shares a 7,644 km border with Russia, the longest international land border in the world.",
    "detailedExplanation": "The Kazakhstan-Russia border stretches approximately 7,644 kilometers (4,750 miles), making it the longest continuous international land border in the world. This border runs from the Caspian Sea in the west to the Altai Mountains in the east, crossing vast steppes and diverse geographical regions. The border was established following the dissolution of the Soviet Union in 1991, when Kazakhstan gained independence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kazakhstan%E2%80%93Russia_border",
    "citationTitle": "Wikipedia: Kazakhstan–Russia border"
  },
  {
    "id": "82d90e14-3ea0-45e1-b700-8b1b23fe5db7",
    "text": "How many countries does Brazil share a border with?",
    "options": [
      "8",
      "10",
      "12",
      "14"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Brazil shares borders with 10 South American countries, more than any other country in the world.",
    "detailedExplanation": "Brazil shares land borders with ten countries: Argentina, Bolivia, Colombia, French Guiana (France), Guyana, Paraguay, Peru, Suriname, Uruguay, and Venezuela. This makes Brazil the country with the most international land borders in the world. The only two South American countries that Brazil does not border are Chile and Ecuador, as they are separated by other nations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Borders_of_Brazil",
    "citationTitle": "Wikipedia: Borders of Brazil"
  },
  {
    "id": "dd65eac0-9cd1-4c39-afc5-d9f526671e6f",
    "text": "Which European country is completely surrounded by Italy?",
    "options": [
      "Monaco",
      "San Marino",
      "Vatican City",
      "Liechtenstein"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "San Marino is an enclave completely surrounded by Italian territory.",
    "detailedExplanation": "San Marino is a microstate completely enclosed by Italy, located in the Apennine Mountains. It is one of the world's oldest republics, founded in 301 AD. While Vatican City is also surrounded by Italy (specifically by Rome), San Marino is the larger of the two enclaves and has a longer history as an independent state. The country covers just 61 square kilometers and has maintained its independence for over 1,700 years.",
    "citationUrl": "https://en.wikipedia.org/wiki/San_Marino",
    "citationTitle": "Wikipedia: San Marino"
  },
  {
    "id": "9de908ee-ad58-4377-9dc1-784a1cd576cc",
    "text": "What is the name of the straight-line border between the USA and Canada that runs along the 49th parallel?",
    "options": [
      "Mason-Dixon Line",
      "Medicine Line",
      "Peace Arch Border",
      "Rainbow Bridge"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Medicine Line refers to the straight border along the 49th parallel between the US and Canada.",
    "detailedExplanation": "The Medicine Line is the colloquial name for the portion of the Canada-United States border that follows the 49th parallel north. This straight-line border was established by the Oregon Treaty of 1846 and runs for about 1,200 miles from the Pacific Ocean to the Lake of the Woods. The name 'Medicine Line' was used by Indigenous peoples of the Great Plains, who called it this because crossing it could provide 'medicine' or relief from persecution by authorities on either side.",
    "citationUrl": "https://en.wikipedia.org/wiki/49th_parallel_north",
    "citationTitle": "Wikipedia: 49th parallel north"
  },
  {
    "id": "24cf27c4-29ff-4668-82de-802f585e00d0",
    "text": "Which African country is completely surrounded by South Africa?",
    "options": [
      "Swaziland",
      "Lesotho",
      "Botswana",
      "Namibia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Lesotho is an enclave kingdom completely surrounded by South Africa.",
    "detailedExplanation": "Lesotho is a landlocked kingdom that is completely surrounded by South Africa, making it one of only three enclaved countries in the world (along with San Marino and Vatican City). Known as the 'Kingdom in the Sky' due to its high altitude, Lesotho gained independence from Britain in 1966. The country is unique in that its lowest point is higher than 1,000 meters above sea level, making it the only country in the world with such a distinction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lesotho",
    "citationTitle": "Wikipedia: Lesotho"
  },
  {
    "id": "6a4d6b0d-892d-4dae-a2cf-48c022d83c81",
    "text": "Which two countries are separated by the Strait of Gibraltar?",
    "options": [
      "Spain and Portugal",
      "Spain and Morocco",
      "France and Algeria",
      "Italy and Tunisia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Strait of Gibraltar separates Spain in Europe from Morocco in Africa.",
    "detailedExplanation": "The Strait of Gibraltar is a narrow waterway that connects the Atlantic Ocean to the Mediterranean Sea and separates Spain (Europe) from Morocco (Africa). At its narrowest point, the strait is only about 14 kilometers (8.7 miles) wide. This strategic waterway has been important throughout history for trade and military purposes. The British territory of Gibraltar sits on the Spanish side of the strait, while the Spanish cities of Ceuta and Melilla are located on the Moroccan side of the Mediterranean coast.",
    "citationUrl": "https://en.wikipedia.org/wiki/Strait_of_Gibraltar",
    "citationTitle": "Wikipedia: Strait of Gibraltar"
  },
  {
    "id": "951f7b88-2e17-4e91-a571-000eb9c16eef",
    "text": "Which country shares borders with both China and Russia but has no access to the ocean?",
    "options": [
      "Kazakhstan",
      "Mongolia",
      "North Korea",
      "Afghanistan"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Mongolia is landlocked and borders both China to the south and Russia to the north.",
    "detailedExplanation": "Mongolia is a landlocked country in East Asia that is sandwiched between two major powers: China to the south and Russia to the north. These are Mongolia's only two neighboring countries, making it one of the few countries in the world with exactly two neighbors. Mongolia is the world's second-largest landlocked country by area, after Kazakhstan. The country has maintained its independence despite being surrounded by these two large nations, and has historically served as a buffer state between Chinese and Russian spheres of influence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mongolia",
    "citationTitle": "Wikipedia: Mongolia"
  },
  {
    "id": "1705c295-331f-4314-82f1-384af01859ee",
    "text": "The Rio Grande river forms part of the border between which two countries?",
    "options": [
      "USA and Canada",
      "USA and Mexico",
      "Mexico and Guatemala",
      "Brazil and Argentina"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Rio Grande forms part of the border between the United States and Mexico.",
    "detailedExplanation": "The Rio Grande (known as Río Bravo del Norte in Mexico) forms a significant portion of the border between the United States and Mexico, stretching for about 2,000 kilometers (1,200 miles). The river serves as the international boundary from El Paso, Texas, to the Gulf of Mexico. This natural border was established by the Treaty of Guadalupe Hidalgo in 1848, which ended the Mexican-American War. The Rio Grande is the fourth-longest river system in the United States and the fifth-longest in North America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rio_Grande",
    "citationTitle": "Wikipedia: Rio Grande"
  }
]