[
  {
    "id": "b56a10ed-f447-431c-9585-817cc06c235f",
    "text": "The tripoint where Argentina, Brazil, and Paraguay meet is located at which landmark?",
    "options": [
      "Iguazu Falls",
      "Triple Frontier",
      "Itaipu Dam",
      "Marco das Três Fronteiras"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Marco das Três Fronteiras (Three Borders Landmark) marks the exact tripoint of these three nations.",
    "detailedExplanation": "The Marco das Três Fronteiras is an obelisk that marks the tripoint where Argentina, Brazil, and Paraguay meet, located at the confluence of the Iguazu and Paraná rivers. Each country has erected a monument on their side of the border, with the Brazilian monument featuring the colors of all three flags. This area is near the famous Iguazu Falls but the tripoint itself is specifically marked by these border monuments.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three_Frontiers",
    "citationTitle": "Wikipedia: Three Frontiers"
  },
  {
    "id": "c19521b2-9e8d-4b9f-b657-40ad3ba50270",
    "text": "Which African country is completely surrounded by South Africa except for a short border with the Indian Ocean?",
    "options": [
      "Lesotho",
      "Eswatini",
      "Botswana",
      "Mozambique"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Eswatini (formerly Swaziland) is almost entirely surrounded by South Africa with only a short eastern border with Mozambique.",
    "detailedExplanation": "Eswatini, formerly known as Swaziland, is a small landlocked kingdom that is nearly completely surrounded by South Africa, except for its eastern border with Mozambique. This makes it one of only a few countries that are almost entirely enclaved by another nation. The country is about 200 kilometers long and 130 kilometers wide, and its border with Mozambique provides access to the Indian Ocean through Mozambican territory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eswatini",
    "citationTitle": "Wikipedia: Eswatini"
  },
  {
    "id": "24d0d5c6-9a0f-458b-8d8d-22aebaaa964d",
    "text": "The Wakhan Corridor, a narrow strip of land, connects which country to China?",
    "options": [
      "Pakistan",
      "Tajikistan",
      "Afghanistan",
      "Kyrgyzstan"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Wakhan Corridor is Afghanistan's narrow panhandle that provides its only border with China.",
    "detailedExplanation": "The Wakhan Corridor is a narrow strip of territory in northeastern Afghanistan that extends eastward to form a border with China. This corridor is about 350 kilometers long and between 13-65 kilometers wide. It was created as a buffer zone between the Russian and British empires in the 19th century during the 'Great Game.' The corridor separates Tajikistan from Pakistan and provides Afghanistan with its only direct border with China, though it's largely unpopulated and extremely mountainous.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wakhan_Corridor",
    "citationTitle": "Wikipedia: Wakhan Corridor"
  },
  {
    "id": "1fcfe7ee-9d6e-4394-879b-71f708572e42",
    "text": "Which European country has borders with exactly nine other countries?",
    "options": [
      "France",
      "Germany",
      "Austria",
      "Switzerland"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Germany borders nine countries: Denmark, Poland, Czech Republic, Austria, Switzerland, France, Luxembourg, Belgium, and the Netherlands.",
    "detailedExplanation": "Germany shares land borders with nine countries, making it tied for the most borders of any European country. Moving clockwise from the north, Germany borders Denmark, Poland, Czech Republic, Austria, Switzerland, France, Luxembourg, Belgium, and the Netherlands. This central position in Europe has significantly influenced German history, culture, and politics throughout the centuries, making it a crucial crossroads of European civilization.",
    "citationUrl": "https://en.wikipedia.org/wiki/Borders_of_Germany",
    "citationTitle": "Wikipedia: Borders of Germany"
  },
  {
    "id": "af565dd8-f03a-4a21-8e5d-2d770163b69d",
    "text": "The shortest international border in the world, at only 150 meters long, is between which two countries?",
    "options": [
      "Vatican City and Italy",
      "Monaco and France",
      "Spain and Morocco (Peñón de Vélez de la Gomera)",
      "Botswana and Zambia"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Botswana and Zambia share the world's shortest border at approximately 150 meters where they meet at the Zambezi River.",
    "detailedExplanation": "The border between Botswana and Zambia is considered the shortest international border in the world, measuring approximately 150 meters (500 feet) at the point where the two countries meet along the Zambezi River. This tiny border exists because of the unique geography where Botswana, Zambia, Zimbabwe, and Namibia all converge near the Zambezi River. The short border has been the subject of some geographical debate, but it's generally recognized as a legitimate international boundary between the two nations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Botswana%E2%80%93Zambia_border",
    "citationTitle": "Wikipedia: Botswana–Zambia border"
  },
  {
    "id": "2026c8a5-8ba2-44a4-9c49-40d03cc8876d",
    "text": "Which South American country borders both the Atlantic and Pacific Oceans but shares a land border with only one other country?",
    "options": [
      "Colombia",
      "Chile",
      "Panama",
      "Ecuador"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Colombia borders both oceans and shares land borders with five countries: Venezuela, Brazil, Peru, Ecuador, and Panama.",
    "detailedExplanation": "This is a trick question - no South American country fits this exact description. Colombia does border both the Pacific and Atlantic (Caribbean Sea) but borders five countries: Panama, Venezuela, Brazil, Peru, and Ecuador. Chile has the longest Pacific coastline but only borders Argentina, Bolivia, and Peru, and doesn't reach the Atlantic. The question highlights the complexity of South American geography and how continental countries are interconnected through multiple borders.",
    "citationUrl": "https://en.wikipedia.org/wiki/Geography_of_South_America",
    "citationTitle": "Wikipedia: Geography of South America"
  },
  {
    "id": "f91f8695-2506-4b0a-abc7-11da6daa1957",
    "text": "The only place where four countries meet at a single point is the intersection of which nations?",
    "options": [
      "Botswana, Namibia, Zambia, and Zimbabwe",
      "Chad, Libya, Niger, and Sudan",
      "Austria, Czech Republic, Germany, and Slovakia",
      "There is no true quadripoint of countries"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "There are no confirmed quadripoints where four countries meet at a single point, though several locations come very close.",
    "detailedExplanation": "Despite common belief, there are no internationally recognized quadripoints where exactly four countries meet at a single geographic point. The closest examples include the area where Botswana, Namibia, Zambia, and Zimbabwe nearly meet (but Botswana and Zambia only share a very short border), and various locations in Africa and Europe where borders come very close but don't form exact quadripoints. International border surveys have found that what appear to be quadripoints are actually close approaches or involve disputed territories.",
    "citationUrl": "https://en.wikipedia.org/wiki/Quadripoint",
    "citationTitle": "Wikipedia: Quadripoint"
  },
  {
    "id": "8632582e-9b57-40a6-868b-2718bec72ec0",
    "text": "The Wakhan Corridor creates a narrow border between which two countries that would otherwise not share a land boundary?",
    "options": [
      "Afghanistan and China",
      "Pakistan and Tajikistan",
      "India and Afghanistan",
      "Iran and Turkmenistan"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Wakhan Corridor is a narrow strip of Afghan territory that creates a border between Afghanistan and China.",
    "detailedExplanation": "The Wakhan Corridor is a narrow panhandle of Afghanistan that extends eastward to touch China's western border. This 220-mile-long corridor was created in the late 19th century as a buffer zone between the Russian Empire and British India. Without this corridor, Afghanistan and China would have no direct land border, as they would be separated by Pakistan and Tajikistan.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wakhan_Corridor",
    "citationTitle": "Wikipedia: Wakhan Corridor"
  },
  {
    "id": "74b1a389-4d6e-4d2e-9f12-7422b497a13a",
    "text": "Which African country is completely surrounded by just one other country?",
    "options": [
      "Swaziland",
      "Lesotho",
      "Gambia",
      "Djibouti"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Lesotho is completely surrounded by South Africa, making it an enclave.",
    "detailedExplanation": "Lesotho is one of only three countries in the world that are completely surrounded by just one other country (the others being Vatican City and San Marino, both surrounded by Italy). Lesotho is entirely enclosed by South Africa and has no coastline or borders with any other nation. This makes it a true enclave, covering about 30,355 square kilometers within South African territory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lesotho",
    "citationTitle": "Wikipedia: Lesotho"
  },
  {
    "id": "ff5ac610-abc6-49a4-a7df-7d605c0ce68e",
    "text": "At the Treriksröset cairn, which three countries meet at a single point?",
    "options": [
      "Sweden, Norway, Finland",
      "Germany, Poland, Czech Republic",
      "France, Switzerland, Italy",
      "Austria, Hungary, Slovakia"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Treriksröset is the tripoint where Sweden, Norway, and Finland meet.",
    "detailedExplanation": "Treriksröset (meaning 'Three-Country Cairn' in Swedish) is located in the Scandinavian Mountains where the borders of Sweden, Norway, and Finland converge. This tripoint is marked by a yellow concrete cairn and is a popular hiking destination. The point is situated at approximately 69°03′37″N 20°32′20″E, making it one of the northernmost tripoints in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treriksr%C3%B6set",
    "citationTitle": "Wikipedia: Treriksröset"
  },
  {
    "id": "4f3cf5b2-4de5-48d7-aabd-b70cdfcbf888",
    "text": "The Caprivi Strip gives which landlocked country access to the Zambezi River and a border with Zambia?",
    "options": [
      "Botswana",
      "Namibia",
      "Zimbabwe",
      "Angola"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Caprivi Strip is a narrow panhandle of Namibian territory extending eastward.",
    "detailedExplanation": "The Caprivi Strip (now officially called the Zambezi Region) is a narrow corridor of Namibian territory that extends about 450 kilometers eastward from the main body of the country. This panhandle was created through colonial agreements and gives Namibia access to the Zambezi River and borders with Zambia and Zimbabwe. Without this strip, Namibia would only border Angola, Botswana, and South Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zambezi_Region",
    "citationTitle": "Wikipedia: Zambezi Region"
  },
  {
    "id": "77be853c-4169-41bf-bd83-4887189ce2dc",
    "text": "Which country has land borders with both Turkey and Armenia?",
    "options": [
      "Azerbaijan",
      "Georgia",
      "Iran",
      "Syria"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Georgia borders both Turkey to the south and Armenia to the south.",
    "detailedExplanation": "Georgia is strategically located in the South Caucasus region and shares land borders with four countries: Russia to the north, Turkey to the southwest, Armenia to the south, and Azerbaijan to the southeast. This positioning makes Georgia a crucial crossroads between Europe and Asia, and historically it has been an important transit route along the ancient Silk Road.",
    "citationUrl": "https://en.wikipedia.org/wiki/Geography_of_Georgia_(country)",
    "citationTitle": "Wikipedia: Geography of Georgia (country)"
  },
  {
    "id": "265f5b7d-f667-4b46-8bfc-1dbd86db6344",
    "text": "Which South American country borders the most other South American countries?",
    "options": [
      "Argentina",
      "Colombia",
      "Brazil",
      "Peru"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Brazil borders 10 out of 12 South American countries.",
    "detailedExplanation": "Brazil shares land borders with 10 of the 12 South American countries: Argentina, Bolivia, Colombia, French Guiana (overseas territory of France), Guyana, Paraguay, Peru, Suriname, Uruguay, and Venezuela. The only South American countries that Brazil does not border are Chile and Ecuador. This extensive border network totals approximately 16,885 kilometers, making Brazil's land borders among the longest in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Borders_of_Brazil",
    "citationTitle": "Wikipedia: Borders of Brazil"
  },
  {
    "id": "7727078d-f464-44a8-a1cd-d4c3ddbc59e2",
    "text": "Which country has the most international land borders in the world?",
    "options": [
      "Russia",
      "China",
      "Brazil",
      "Germany"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "China borders 14 countries, making it the nation with the most international land borders.",
    "detailedExplanation": "China shares land borders with 14 countries: Russia, Mongolia, Kazakhstan, Kyrgyzstan, Tajikistan, Afghanistan, Pakistan, India, Nepal, Bhutan, Myanmar, Laos, Vietnam, and North Korea. This exceeds Russia's 13 land borders, making China the country with the most international land boundaries in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Borders_of_China",
    "citationTitle": "Wikipedia: Borders of China"
  },
  {
    "id": "0e714e42-6fab-4f16-8225-e21a8abdab6d",
    "text": "The Wakhan Corridor is a narrow strip of territory that prevents which two countries from sharing a border?",
    "options": [
      "Pakistan and Tajikistan",
      "China and Pakistan",
      "Russia and China",
      "Afghanistan and India"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Wakhan Corridor in Afghanistan separates Pakistan from Tajikistan, preventing them from sharing a direct border.",
    "detailedExplanation": "The Wakhan Corridor is a narrow panhandle of Afghanistan that extends between Tajikistan to the north and Pakistan to the south. This strategic strip of land, created during the Great Game period in the 19th century, serves as a buffer zone and prevents Pakistan and Tajikistan from sharing a direct border. The corridor is only about 350km long and varies from 13-65km in width.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wakhan_Corridor",
    "citationTitle": "Wikipedia: Wakhan Corridor"
  },
  {
    "id": "750f4f04-cde2-4d8a-a321-f35ff360ef14",
    "text": "Which European country is completely surrounded by just one other country?",
    "options": [
      "Monaco",
      "San Marino",
      "Vatican City",
      "Liechtenstein"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "San Marino is completely surrounded by Italy, making it one of only three countries entirely enclosed by another nation.",
    "detailedExplanation": "San Marino is completely surrounded by Italy and has no coastline or borders with any other country. While Vatican City is also surrounded by Italy, Monaco borders both France and the Mediterranean Sea, and Liechtenstein borders both Austria and Switzerland. San Marino, along with Vatican City and Lesotho (surrounded by South Africa), is one of only three countries in the world that are entirely enclosed by another single country.",
    "citationUrl": "https://en.wikipedia.org/wiki/San_Marino",
    "citationTitle": "Wikipedia: San Marino"
  },
  {
    "id": "bff3f4cd-5454-4f10-b711-b780ff37b7e4",
    "text": "The Caprivi Strip was designed to give which country access to which river?",
    "options": [
      "Botswana to the Okavango River",
      "Namibia to the Zambezi River",
      "Angola to the Cunene River",
      "South Africa to the Orange River"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Caprivi Strip gives Namibia access to the Zambezi River, originally intended to provide German South West Africa with river access to the east.",
    "detailedExplanation": "The Caprivi Strip is a narrow panhandle of Namibian territory that extends eastward for about 450km between Botswana to the south and Angola and Zambia to the north. It was created in 1890 through the Heligoland-Zanzibar Treaty between Britain and Germany to give German South West Africa (now Namibia) access to the Zambezi River. The Germans believed this would provide a route to their East African colonies, though the Victoria Falls made this impractical.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zambezi_Region",
    "citationTitle": "Wikipedia: Zambezi Region"
  },
  {
    "id": "1afe818d-bbdc-4b48-9721-e78b2e052964",
    "text": "Which pair of countries shares the longest undefended border in the world?",
    "options": [
      "United States and Mexico",
      "Canada and United States",
      "Russia and Kazakhstan",
      "Argentina and Chile"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Canada-United States border stretches 8,891 kilometers and is famously undefended along its entire length.",
    "detailedExplanation": "The border between Canada and the United States is 8,891 kilometers (5,525 miles) long, making it not only the longest undefended border but also the longest international border in the world. This includes the main border between the contiguous United States and Canada (6,416 km) and the border between Alaska and Canada (2,475 km). The border has been largely undefended since the Treaty of Ghent in 1814, with only immigration checkpoints and no military fortifications.",
    "citationUrl": "https://en.wikipedia.org/wiki/Canada%E2%80%93United_States_border",
    "citationTitle": "Wikipedia: Canada–United States border"
  },
  {
    "id": "d81a99ab-d660-4a21-9ac6-f7f2b5697a0d",
    "text": "The Point Roberts exclave belongs to which country, despite being physically separated from it?",
    "options": [
      "Canada",
      "United States",
      "Russia",
      "Denmark"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Point Roberts is a U.S. exclave in Washington state, accessible by land only through Canada due to the 49th parallel border.",
    "detailedExplanation": "Point Roberts is a 5-square-mile exclave of the United States located at the southern tip of the Tsawwassen Peninsula in British Columbia, Canada. This unusual situation arose because the 49th parallel was established as the border between the U.S. and Canada in 1846, but the small peninsula extends south of this line. Residents must travel through Canada to reach the rest of the United States by land, making it one of the most accessible yet isolated parts of America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Point_Roberts,_Washington",
    "citationTitle": "Wikipedia: Point Roberts, Washington"
  },
  {
    "id": "bad3bbd7-03e0-472e-a991-800fc7068af8",
    "text": "Which three countries meet at the tripoint known as the 'Dreiländereck' in the Rhine River?",
    "options": [
      "Germany, France, and Switzerland",
      "Germany, Austria, and Switzerland",
      "France, Switzerland, and Italy",
      "Germany, Netherlands, and Belgium"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Dreiländereck is where Germany, France, and Switzerland meet in the Rhine River near Basel.",
    "detailedExplanation": "The Dreiländereck (Three Countries Corner) is a tripoint where the borders of Germany, France, and Switzerland converge in the Rhine River near the city of Basel. This point is marked by a monument and is accessible from all three countries. The exact location has shifted slightly over time due to engineering works on the Rhine, but it remains a symbolic meeting point of these three nations and is a popular tourist attraction in the Basel metropolitan area.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dreil%C3%A4ndereck",
    "citationTitle": "Wikipedia: Dreiländereck"
  }
]