[
  {
    "id": "96cfcc72-a074-4e8c-9bd4-9728316a12f7",
    "text": "How many landlocked countries does South America have?",
    "options": [
      "1",
      "2",
      "3",
      "4"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "South America has two landlocked countries: Bolivia and Paraguay.",
    "detailedExplanation": "Bolivia and Paraguay are the only two landlocked countries in South America. Bolivia lost its coastline to Chile during the War of the Pacific (1879-1884), while Paraguay has been landlocked throughout its history. Both countries rely on river systems and neighboring countries' ports for international maritime trade.",
    "citationUrl": "https://en.wikipedia.org/wiki/Landlocked_country",
    "citationTitle": "Wikipedia: Landlocked country"
  },
  {
    "id": "5d0fbee9-c1cb-4acc-95d2-4f124b6024fc",
    "text": "Which Central Asian country is 'doubly landlocked' (surrounded only by other landlocked countries)?",
    "options": [
      "Kazakhstan",
      "Kyrgyzstan",
      "Tajikistan",
      "Uzbekistan"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Uzbekistan is doubly landlocked, surrounded only by other landlocked countries.",
    "detailedExplanation": "Uzbekistan is one of only two doubly landlocked countries in the world (the other being Liechtenstein). This means it is surrounded entirely by landlocked countries - Kazakhstan, Kyrgyzstan, Tajikistan, Afghanistan, and Turkmenistan. To reach the ocean from Uzbekistan, one must cross at least two international borders.",
    "citationUrl": "https://en.wikipedia.org/wiki/Uzbekistan",
    "citationTitle": "Wikipedia: Uzbekistan"
  },
  {
    "id": "1cf3d716-bf0b-46c4-a9c9-e897cfd5da50",
    "text": "Which landlocked African country was formerly known as Upper Volta?",
    "options": [
      "Mali",
      "Niger",
      "Burkina Faso",
      "Chad"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Burkina Faso was formerly called Upper Volta until 1984.",
    "detailedExplanation": "Burkina Faso changed its name from Upper Volta in 1984 under the leadership of Thomas Sankara. The name 'Burkina Faso' combines words from the country's main languages: 'Burkina' means 'honest' in Mooré, and 'Faso' means 'homeland' in Dioula. The country is landlocked in West Africa, bordered by six countries including Mali, Niger, and Ghana.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burkina_Faso",
    "citationTitle": "Wikipedia: Burkina Faso"
  },
  {
    "id": "91dc3a62-0601-4ff9-ab80-7e8a1012b549",
    "text": "Which European landlocked country is famous for its banking sector and is smaller than 25 kilometers in length?",
    "options": [
      "Luxembourg",
      "Liechtenstein",
      "Andorra",
      "San Marino"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Liechtenstein is a tiny doubly landlocked principality known for banking and is only 25 km long.",
    "detailedExplanation": "Liechtenstein is a microstate nestled between Austria and Switzerland, measuring just 25 kilometers from north to south and 6 kilometers from east to west. Despite its small size of only 160 square kilometers, it has developed into a major financial center with a sophisticated banking sector. It's one of only two doubly landlocked countries in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Liechtenstein",
    "citationTitle": "Wikipedia: Liechtenstein"
  },
  {
    "id": "9bef605c-a98b-4e4a-b37e-081464366027",
    "text": "Which landlocked country in Asia is home to Mount Everest's north face and base camp?",
    "options": [
      "Nepal",
      "Bhutan",
      "Mongolia",
      "Tibet (China)"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Tibet, as part of China, contains Mount Everest's north face and the northern base camp.",
    "detailedExplanation": "While Mount Everest straddles the border between Nepal and Tibet (part of China), the northern approach and base camp are located in Tibet. Tibet itself is a landlocked region within China. The northern route to Everest is generally considered more accessible by vehicle, though the southern route through Nepal is more popular with international climbers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mount_Everest",
    "citationTitle": "Wikipedia: Mount Everest"
  },
  {
    "id": "6c949a0c-37ce-41e6-82c1-3d8ae0b0747e",
    "text": "Which landlocked country has the largest population in the world?",
    "options": [
      "Kazakhstan",
      "Afghanistan",
      "Ethiopia",
      "Uganda"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Ethiopia is the most populous landlocked country with over 120 million people.",
    "detailedExplanation": "Ethiopia, located in the Horn of Africa, is the most populous landlocked country in the world with a population exceeding 120 million people. The country lost its coastline when Eritrea gained independence in 1993, making Ethiopia landlocked. Despite this challenge, Ethiopia has maintained significant economic growth and serves as the headquarters for the African Union.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ethiopia",
    "citationTitle": "Wikipedia: Ethiopia"
  },
  {
    "id": "798d251a-9d22-41a5-8113-331f308ebdb6",
    "text": "Which landlocked country in Europe is known as the 'Heart of Europe' and was split into two countries in 1993?",
    "options": [
      "Hungary",
      "Czech Republic",
      "Slovakia",
      "Austria"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "The Czech Republic, often called the 'Heart of Europe', became landlocked when Czechoslovakia split in 1993.",
    "detailedExplanation": "The Czech Republic emerged as an independent landlocked country in 1993 following the peaceful dissolution of Czechoslovakia, known as the Velvet Divorce. The country is often referred to as the 'Heart of Europe' due to its central location in the continent. Its capital, Prague, is situated in the geographic center of Europe, and the country borders Germany, Austria, Slovakia, and Poland.",
    "citationUrl": "https://en.wikipedia.org/wiki/Czech_Republic",
    "citationTitle": "Wikipedia: Czech Republic"
  },
  {
    "id": "4cdb524e-3298-4f6e-9610-423c626b897c",
    "text": "Which landlocked country is completely surrounded by just one other country?",
    "options": [
      "Vatican City",
      "San Marino",
      "Lesotho",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Vatican City, San Marino, and Lesotho are all enclaves - completely surrounded by one country.",
    "detailedExplanation": "There are only three countries in the world that are completely surrounded by just one other nation, making them enclaves. Vatican City and San Marino are both entirely surrounded by Italy, while Lesotho is completely surrounded by South Africa. These unique geographical situations create interesting political and economic dependencies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Enclave_and_exclave",
    "citationTitle": "Wikipedia: Enclave and exclave"
  },
  {
    "id": "5fb4813d-6f4b-40b2-ab10-4ee5efd5907b",
    "text": "Kazakhstan is the world's largest landlocked country. Which country ranks second?",
    "options": [
      "Mongolia",
      "Chad",
      "Niger",
      "Afghanistan"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Mongolia is the second-largest landlocked country by area after Kazakhstan.",
    "detailedExplanation": "Kazakhstan covers approximately 2.7 million square kilometers, making it the largest landlocked country. Mongolia follows as the second-largest landlocked nation with about 1.6 million square kilometers. Both countries are located in Central Asia and share historical connections through the Silk Road trade routes.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_area",
    "citationTitle": "Wikipedia: List of countries and dependencies by area"
  },
  {
    "id": "a8ae9fd2-a39b-478d-b52d-d0c2a59c1f87",
    "text": "Which European landlocked country is famous for being 'doubly landlocked' - surrounded only by other landlocked countries?",
    "options": [
      "Switzerland",
      "Austria",
      "Liechtenstein",
      "Luxembourg"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Liechtenstein is doubly landlocked, surrounded only by Switzerland and Austria, both landlocked countries.",
    "detailedExplanation": "A doubly landlocked country is one that is surrounded entirely by landlocked countries, meaning you must cross at least two borders to reach the ocean. Only two countries have this distinction: Liechtenstein in Europe (surrounded by Switzerland and Austria) and Uzbekistan in Central Asia. This geographical situation creates unique challenges for international trade and transportation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Landlocked_country",
    "citationTitle": "Wikipedia: Landlocked country"
  },
  {
    "id": "3c074a24-eaf1-41ee-9acc-68cdf1b55f09",
    "text": "Which Central Asian country is known for the 'Door to Hell' - a natural gas crater that has been burning since 1971?",
    "options": [
      "Kazakhstan",
      "Uzbekistan",
      "Turkmenistan",
      "Kyrgyzstan"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "The Darvaza gas crater, known as the 'Door to Hell,' is located in Turkmenistan's Karakum Desert.",
    "detailedExplanation": "The Darvaza gas crater in Turkmenistan was created in 1971 when Soviet engineers were drilling for natural gas deposits and the ground collapsed, forming a large hole. To prevent the spread of methane gas, geologists decided to burn it off, expecting it would stop in a few days. However, the crater has been burning continuously for over 50 years, becoming a unique tourist attraction in this landlocked Central Asian nation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Darvaza_gas_crater",
    "citationTitle": "Wikipedia: Darvaza gas crater"
  },
  {
    "id": "d531d25e-2cb6-47ff-8eb5-2534f7e53b34",
    "text": "Which landlocked country in the Himalayas measures its success using 'Gross National Happiness' instead of GDP?",
    "options": [
      "Nepal",
      "Bhutan",
      "Tibet",
      "Sikkim"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Bhutan uses Gross National Happiness as an alternative measure to Gross Domestic Product.",
    "detailedExplanation": "Bhutan, a small landlocked kingdom in the Eastern Himalayas, pioneered the concept of Gross National Happiness (GNH) in the 1970s under King Jigme Singye Wangchuck. This philosophy prioritizes sustainable development, environmental conservation, cultural preservation, and good governance over pure economic growth. Bhutan is sandwiched between China and India and is known for being carbon-negative and requiring tourists to pay a daily fee.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gross_National_Happiness",
    "citationTitle": "Wikipedia: Gross National Happiness"
  },
  {
    "id": "443ebcc0-e94d-4e75-8139-a7ab4700f24b",
    "text": "Which landlocked European country has four official languages: German, French, Italian, and Romansh?",
    "options": [
      "Austria",
      "Switzerland",
      "Luxembourg",
      "Belgium"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Switzerland has four official languages, with Romansh being spoken by less than 1% of the population.",
    "detailedExplanation": "Switzerland is unique among European nations for having four official languages. German is spoken by about 63% of the population, French by 23%, Italian by 8%, and Romansh by less than 1%. Romansh is a Romance language primarily spoken in the canton of Grisons. Despite being landlocked, Switzerland has historically been a major trading hub due to its strategic location in the heart of Europe and its excellent transportation infrastructure through the Alps.",
    "citationUrl": "https://en.wikipedia.org/wiki/Languages_of_Switzerland",
    "citationTitle": "Wikipedia: Languages of Switzerland"
  },
  {
    "id": "c3b43ec9-bb89-4386-bd06-f1994a0d6b5a",
    "text": "Which landlocked country is completely surrounded by only one other country?",
    "options": [
      "Vatican City",
      "San Marino",
      "Lesotho",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Vatican City, San Marino, and Lesotho are all enclaves - landlocked countries completely surrounded by a single other nation.",
    "detailedExplanation": "These three countries are unique examples of enclaves, where the entire territory is completely surrounded by another single country. Vatican City and San Marino are both entirely surrounded by Italy, while Lesotho is completely enclosed by South Africa. This makes them not just landlocked, but also dependent on their surrounding nation for access to the outside world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Enclave_and_exclave",
    "citationTitle": "Wikipedia: Enclave and exclave"
  },
  {
    "id": "8170ddcf-f609-4d05-8846-574df0349685",
    "text": "Kazakhstan is the world's largest landlocked country by area. Which country is the second largest?",
    "options": [
      "Mongolia",
      "Chad",
      "Niger",
      "Afghanistan"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Mongolia is the second largest landlocked country by area, covering approximately 1.56 million square kilometers.",
    "detailedExplanation": "After Kazakhstan's massive 2.72 million square kilometers, Mongolia ranks as the second largest landlocked country with about 1.56 million square kilometers. This vast nation in Central Asia is bordered by Russia to the north and China to the south, and despite its enormous size, it has one of the lowest population densities in the world with only about 3.3 million inhabitants.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_area",
    "citationTitle": "Wikipedia: List of countries and dependencies by area"
  },
  {
    "id": "3fea41ef-f730-4383-ad9c-c4b091d5e5a4",
    "text": "Which landlocked European country has THREE official languages?",
    "options": [
      "Austria",
      "Switzerland",
      "Luxembourg",
      "Czech Republic"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Luxembourg has three official languages: Luxembourgish, French, and German.",
    "detailedExplanation": "Luxembourg, despite being one of Europe's smallest countries, officially recognizes three languages. Luxembourgish serves as the national language and is used in parliament, French is primarily used for legislation and judicial purposes, while German is commonly used in media and education. This trilingual nature reflects the country's position between French and German-speaking regions and its complex historical influences from both cultures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Languages_of_Luxembourg",
    "citationTitle": "Wikipedia: Languages of Luxembourg"
  },
  {
    "id": "a6afbfb4-74e3-4ba4-96b4-c8db6c30782f",
    "text": "Which of these landlocked countries was formerly known as Upper Volta?",
    "options": [
      "Mali",
      "Burkina Faso",
      "Chad",
      "Central African Republic"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Burkina Faso was called Upper Volta during French colonial rule and retained this name until 1984.",
    "detailedExplanation": "Upper Volta was the colonial name given to this West African territory by the French, named after the Volta River system that flows through the region. In 1984, four years after gaining independence, the country was renamed Burkina Faso by President Thomas Sankara. The new name combines words from the local Mooré and Dioula languages, meaning 'Land of Upright People' or 'Land of Honest Men,' reflecting a desire to establish a distinctly African identity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burkina_Faso",
    "citationTitle": "Wikipedia: Burkina Faso"
  },
  {
    "id": "7370d8af-f005-40c8-b7dd-4d9461b27e3f",
    "text": "Which landlocked country in South America is named after a liberator who fought for independence from Spanish rule?",
    "options": [
      "Paraguay",
      "Bolivia",
      "Uruguay",
      "Ecuador"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Bolivia is named after Simón Bolívar, the Venezuelan military and political leader who led much of South America's independence movement.",
    "detailedExplanation": "Bolivia was named in honor of Simón Bolívar, known as 'El Libertador' (The Liberator), who played a crucial role in Latin America's struggle for independence from Spanish colonial rule in the early 19th century. Although Bolívar was Venezuelan, his military campaigns and political influence extended across much of northern and western South America. The country was originally part of a larger territory called the Republic of Bolívar, which was later renamed Bolivia in 1825.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bolivia",
    "citationTitle": "Wikipedia: Bolivia"
  },
  {
    "id": "5c3c95ce-06e3-46e2-a467-b04f889ed5f8",
    "text": "Which landlocked Asian country is known as the 'Land of the Thunder Dragon'?",
    "options": [
      "Nepal",
      "Bhutan",
      "Laos",
      "Afghanistan"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Bhutan is traditionally known as 'Druk Yul' in the local language, which translates to 'Land of the Thunder Dragon.'",
    "detailedExplanation": "Bhutan's traditional name 'Druk Yul' comes from the Drukpa sect of Buddhism that is dominant in the country, with 'druk' meaning dragon and referring specifically to the thunder dragon of Tibetan and Bhutanese mythology. This Himalayan kingdom, nestled between China and India, has maintained much of its traditional culture and is famous for measuring Gross National Happiness rather than just economic indicators. The dragon also features prominently on Bhutan's national flag.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bhutan",
    "citationTitle": "Wikipedia: Bhutan"
  },
  {
    "id": "57a09d43-3ac1-4cd0-8cea-4aa0e5108766",
    "text": "How many landlocked countries are there in Africa?",
    "options": [
      "14",
      "16",
      "18",
      "20"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "There are 16 landlocked countries in Africa, more than any other continent.",
    "detailedExplanation": "Africa has 16 landlocked countries: Botswana, Burkina Faso, Burundi, Central African Republic, Chad, Eswatini (formerly Swaziland), Ethiopia, Lesotho, Malawi, Mali, Niger, Rwanda, South Sudan, Uganda, Zambia, and Zimbabwe. This represents about 30% of all African nations and more landlocked countries than any other continent. Many of these countries face significant economic challenges due to their lack of direct access to seaports, making international trade more expensive and complex.",
    "citationUrl": "https://en.wikipedia.org/wiki/Landlocked_country",
    "citationTitle": "Wikipedia: Landlocked country"
  }
]