[
  {
    "id": "7f5c87a4-d2ea-4fbe-b092-82c36e4a0900",
    "text": "Which capital city was purpose-built in the 1960s to replace the former coastal capital, featuring a distinctive airplane-shaped urban design?",
    "options": [
      "Canberra",
      "Brasília",
      "Islamabad",
      "Abuja"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Brasília was built in the 1960s with an airplane-shaped design to replace Rio de Janeiro as Brazil's capital.",
    "detailedExplanation": "Brasília was constructed between 1956-1960 under President Juscelino Kubitschek to replace Rio de Janeiro as Brazil's capital. Designed by urban planner Lúcio Costa and architect Oscar Niemeyer, the city's layout resembles an airplane when viewed from above, with government buildings in the 'cockpit' area and residential areas in the 'wings.' The city was designated a UNESCO World Heritage Site for its modernist architecture and urban planning.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bras%C3%ADlia",
    "citationTitle": "Wikipedia: Brasília"
  },
  {
    "id": "1535fcfd-e53a-4f39-810d-5be879e57617",
    "text": "The capital of which country shares its name with a type of hat and is located over 3,500 meters above sea level?",
    "options": [
      "Ecuador",
      "Bolivia",
      "Peru",
      "Colombia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "La Paz, Bolivia's administrative capital, shares its name with the Panama hat style and sits at 3,500+ meters elevation.",
    "detailedExplanation": "La Paz is Bolivia's administrative capital and seat of government, situated at approximately 3,515 meters (11,535 feet) above sea level, making it one of the world's highest capital cities. The city's name 'La Paz' means 'The Peace' in Spanish, and it coincidentally shares this name with a style of Panama hat. While Sucre is Bolivia's constitutional capital, La Paz serves as the de facto capital where the government operates.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_Paz",
    "citationTitle": "Wikipedia: La Paz"
  },
  {
    "id": "0934e0b2-1ad5-47b9-906b-9009f5b2998a",
    "text": "Which European capital city is built on 14 islands connected by over 50 bridges and is known as the 'Venice of the North'?",
    "options": [
      "Amsterdam",
      "Stockholm",
      "Copenhagen",
      "Helsinki"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Stockholm is built on 14 islands in the archipelago, connected by 57 bridges, earning it the nickname 'Venice of the North.'",
    "detailedExplanation": "Stockholm, Sweden's capital, is uniquely constructed across 14 islands in the Stockholm archipelago, where Lake Mälaren flows into the Baltic Sea. The city is connected by 57 bridges, creating a distinctive waterway network that has earned it comparisons to Venice. The historic Gamla Stan (Old Town) occupies the central island of Stadsholmen, while modern Stockholm has expanded across the surrounding islands and mainland areas.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stockholm",
    "citationTitle": "Wikipedia: Stockholm"
  },
  {
    "id": "8f741632-e4a4-48b7-9d24-9a66fba8a15e",
    "text": "What is the capital of the landlocked country that was formerly known as Northern Rhodesia?",
    "options": [
      "Lusaka",
      "Harare",
      "Gaborone",
      "Lilongwe"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Lusaka is the capital of Zambia, which was formerly the British colony of Northern Rhodesia until independence in 1964.",
    "detailedExplanation": "Lusaka became the capital of Zambia when the country gained independence from Britain in 1964. Zambia was previously known as Northern Rhodesia, named after British businessman Cecil Rhodes. The country is completely landlocked, bordered by eight nations including the Democratic Republic of Congo, Tanzania, and Zimbabwe (formerly Southern Rhodesia). Lusaka was chosen as capital due to its central location and railway connections.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lusaka",
    "citationTitle": "Wikipedia: Lusaka"
  },
  {
    "id": "f7cf2ae1-2b63-4389-ac02-cfe9a7fa0d1d",
    "text": "Which capital city was built in the shadow of a dormant volcano called Mount Ararat and has been continuously inhabited for over 2,800 years?",
    "options": [
      "Tbilisi",
      "Baku",
      "Yerevan",
      "Tehran"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Yerevan, Armenia's capital, sits near Mount Ararat and is one of the world's oldest continuously inhabited cities, founded in 782 BCE.",
    "detailedExplanation": "Yerevan, the capital of Armenia, was founded in 782 BCE by King Argishti I, making it older than Rome and one of the world's oldest continuously inhabited cities. The city is dramatically situated with views of the biblical Mount Ararat, a dormant volcanic massif that, while now located in Turkey, remains Armenia's national symbol. The mountain's twin peaks are visible from Yerevan on clear days, creating an iconic backdrop for the 'Pink City' named for its distinctive rose-colored volcanic stone architecture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yerevan",
    "citationTitle": "Wikipedia: Yerevan"
  },
  {
    "id": "f9ba939f-eead-43d1-9bc3-7f2fd8f0623b",
    "text": "The capital of which Pacific island nation consists of settlements on 33 coral atolls and was formerly known as Pleasant Island?",
    "options": [
      "Kiribati",
      "Tuvalu",
      "Nauru",
      "Marshall Islands"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "South Tarawa is the capital of Kiribati, spread across coral atolls, though Nauru was formerly called Pleasant Island.",
    "detailedExplanation": "South Tarawa serves as the capital of Kiribati, a nation consisting of 33 coral atolls scattered across 3.5 million square kilometers of the Pacific Ocean. The country straddles the equator and the International Date Line, making it one of the most geographically dispersed nations on Earth. While Nauru was indeed formerly known as Pleasant Island, it is a separate nation. Kiribati faces severe challenges from climate change and rising sea levels that threaten the low-lying atolls.",
    "citationUrl": "https://en.wikipedia.org/wiki/South_Tarawa",
    "citationTitle": "Wikipedia: South Tarawa"
  },
  {
    "id": "03cf3919-b4e4-4836-bdd9-5edcc8b74714",
    "text": "Which capital city houses the world's largest palace complex by area, covering 720,000 square meters?",
    "options": [
      "Beijing",
      "Bangkok",
      "Brunei",
      "Tehran"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Beijing's Forbidden City is the world's largest palace complex, covering 720,000 square meters in China's capital.",
    "detailedExplanation": "Beijing, China's capital, is home to the Forbidden City (now called the Palace Museum), which holds the Guinness World Record as the world's largest palace complex by area. Covering 720,000 square meters (178 acres), this Ming and Qing dynasty imperial palace complex contains 9,999 rooms and was the Chinese imperial palace for nearly 500 years. Built between 1406-1420, it served as the home of emperors and their households and was the ceremonial and political center of Chinese government.",
    "citationUrl": "https://en.wikipedia.org/wiki/Forbidden_City",
    "citationTitle": "Wikipedia: Forbidden City"
  },
  {
    "id": "a342674e-c605-4bee-9bc5-00dbdd9ce916",
    "text": "What is the only national capital that is completely surrounded by another country and lies entirely below sea level?",
    "options": [
      "Monaco-Ville",
      "Vatican City",
      "Amsterdam",
      "Baku"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Amsterdam is entirely below sea level and completely surrounded by the Netherlands, making it unique among world capitals.",
    "detailedExplanation": "Amsterdam, the constitutional capital of the Netherlands, is uniquely positioned entirely below sea level (averaging 2 meters below) and is completely surrounded by Dutch territory, with no international borders of its own touching the city. The city is protected by an elaborate system of dikes, pumps, and canals. While Monaco-Ville and Vatican City are small enclaved capitals, they are not below sea level. The Hague serves as the seat of government, but Amsterdam remains the official constitutional capital.",
    "citationUrl": "https://en.wikipedia.org/wiki/Amsterdam",
    "citationTitle": "Wikipedia: Amsterdam"
  },
  {
    "id": "53f7a9f9-4838-4849-8183-6954c732f5a3",
    "text": "Which world capital was originally built on 14 islands and is known as the 'Venice of the North'?",
    "options": [
      "Helsinki",
      "Stockholm",
      "Copenhagen",
      "Amsterdam"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Stockholm is built on 14 islands connected by 57 bridges.",
    "detailedExplanation": "Stockholm, the capital of Sweden, is uniquely constructed across 14 islands in the central-eastern part of Sweden, where Lake Mälaren flows into the Baltic Sea. The city's archipelago setting and numerous waterways have earned it the nickname 'Venice of the North.' The islands are connected by 57 bridges, making Stockholm one of the most water-rich capitals in the world. This geographical feature has been central to Stockholm's development since its founding in the 13th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stockholm",
    "citationTitle": "Wikipedia: Stockholm"
  },
  {
    "id": "95d7f9bf-6a1b-45d4-b2a7-bb58c55bbb7c",
    "text": "Which capital city was completely planned and built in the 1960s to replace the former capital located on the coast?",
    "options": [
      "Canberra, Australia",
      "Brasília, Brazil",
      "Islamabad, Pakistan",
      "Abuja, Nigeria"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Brasília was built from 1956-1960 to replace Rio de Janeiro as Brazil's capital.",
    "detailedExplanation": "Brasília was constructed from scratch between 1956 and 1960 under the direction of President Juscelino Kubitschek to replace Rio de Janeiro as Brazil's capital. The city was designed by urban planner Lúcio Costa and architect Oscar Niemeyer, featuring modernist architecture and a distinctive airplane-shaped layout. The decision to build a new capital was driven by the desire to promote development of Brazil's interior and reduce the concentration of power in the coastal regions. Brasília was designated a UNESCO World Heritage Site in 1987.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bras%C3%ADlia",
    "citationTitle": "Wikipedia: Brasília"
  },
  {
    "id": "0b847686-45b0-419f-8941-885f4328fc8a",
    "text": "Which European capital city is divided by a river that flows backwards due to human engineering?",
    "options": [
      "Budapest, Hungary",
      "Prague, Czech Republic",
      "Chicago, USA",
      "None - this is impossible"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The Chicago River was permanently reversed in 1900, though Chicago is not a national capital.",
    "detailedExplanation": "This is a trick question as Chicago is not a national capital, despite being a major city where the Chicago River was famously reversed. The Chicago River's flow was permanently reversed in 1900 through an engineering project to prevent sewage from flowing into Lake Michigan, the city's drinking water source. Among actual European capitals, none have rivers that flow backwards due to engineering. The question tests knowledge of both geography and the distinction between major cities and actual capital cities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chicago_River",
    "citationTitle": "Wikipedia: Chicago River"
  },
  {
    "id": "bb4b6655-681a-4f79-ba07-b4cd7a3bbb80",
    "text": "Which world capital sits at the confluence of the Blue and White Nile rivers?",
    "options": [
      "Cairo, Egypt",
      "Khartoum, Sudan",
      "Juba, South Sudan",
      "Kampala, Uganda"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Khartoum is located where the Blue and White Nile rivers meet to form the main Nile.",
    "detailedExplanation": "Khartoum, the capital of Sudan, is strategically located at the confluence of the Blue Nile, flowing from Ethiopia, and the White Nile, flowing from Uganda. These two major tributaries meet in Khartoum to form the main Nile River, which then flows northward through Egypt to the Mediterranean Sea. This geographical position has made Khartoum historically significant as a trading center and has contributed to its development as Sudan's political and economic center since the city's founding in 1821.",
    "citationUrl": "https://en.wikipedia.org/wiki/Khartoum",
    "citationTitle": "Wikipedia: Khartoum"
  },
  {
    "id": "ec908bdb-3c95-45fa-a2cd-8ff6301563e4",
    "text": "Which capital city is built around seven hills, like Rome, but is located on a different continent?",
    "options": [
      "Lisbon, Portugal",
      "San Francisco, USA",
      "Istanbul, Turkey",
      "Kampala, Uganda"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Istanbul is famously built on seven hills, though San Francisco also has seven hills but isn't a national capital.",
    "detailedExplanation": "Istanbul, while not currently a national capital, was historically built on seven hills like Rome when it served as the capital of the Byzantine and Ottoman empires. However, among current capitals, Lisbon, Portugal also claims to be built on seven hills. The question's phrasing about 'different continent' makes it somewhat ambiguous, but Istanbul's historical significance as a capital and its famous seven hills (including sites where the Hagia Sophia and Topkapi Palace stand) make it the most notable example of this geographical parallel with Rome.",
    "citationUrl": "https://en.wikipedia.org/wiki/Seven_hills_of_Istanbul",
    "citationTitle": "Wikipedia: Seven hills of Istanbul"
  },
  {
    "id": "85cd1b9e-4e46-4d88-bed3-dadbee81cfe0",
    "text": "Which national capital is closest to the Antarctic Circle?",
    "options": [
      "Wellington, New Zealand",
      "Canberra, Australia",
      "Santiago, Chile",
      "Buenos Aires, Argentina"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Wellington is the southernmost national capital at 41°17′S latitude.",
    "detailedExplanation": "Wellington, New Zealand, is the southernmost national capital in the world, located at 41°17′S latitude. This makes it the closest national capital to the Antarctic Circle, which is located at approximately 66°33′S. Wellington's position at the southern tip of New Zealand's North Island gives it this distinction, and the city experiences strong winds due to its location in the 'Roaring Forties' latitude band. The next closest capitals are Canberra and then the South American capitals of Santiago and Buenos Aires.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wellington",
    "citationTitle": "Wikipedia: Wellington"
  },
  {
    "id": "0c9ff56d-bd88-4b69-a901-1075a979f0cb",
    "text": "Which Asian capital city was formerly known as Batavia during colonial times?",
    "options": [
      "Bangkok, Thailand",
      "Jakarta, Indonesia",
      "Manila, Philippines",
      "Kuala Lumpur, Malaysia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Jakarta was called Batavia by Dutch colonizers from 1619 to 1942.",
    "detailedExplanation": "Jakarta, the capital of Indonesia, was known as Batavia during Dutch colonial rule from 1619 to 1942. The Dutch East India Company established the city as their administrative center in the Indonesian archipelago, naming it after the Batavi, a Germanic tribe from the Netherlands. The city reverted to its original Javanese name, Jakarta (derived from 'Jayakarta' meaning 'victorious deed'), after Indonesian independence. This colonial history reflects the broader Dutch influence in Southeast Asia and the eventual decolonization of the region in the mid-20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jakarta",
    "citationTitle": "Wikipedia: Jakarta"
  },
  {
    "id": "0df663f5-fbd1-4861-9c4f-f0a38a2a6b15",
    "text": "Which world capital city is located at the highest altitude above sea level?",
    "options": [
      "Quito, Ecuador",
      "La Paz, Bolivia",
      "Bogotá, Colombia",
      "Addis Ababa, Ethiopia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "La Paz, Bolivia sits at approximately 3,500-4,150 meters (11,500-13,615 feet) above sea level.",
    "detailedExplanation": "La Paz is widely considered the world's highest capital city, though Bolivia's constitutional capital is actually Sucre. The city sits in a bowl-shaped valley surrounded by the Altiplano plateau and snow-capped peaks of the Cordillera Real. Its extreme altitude affects everything from cooking times to athletic performance, and visitors often experience altitude sickness. The thin air contains about 40% less oxygen than at sea level.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_Paz",
    "citationTitle": "Wikipedia: La Paz"
  },
  {
    "id": "039ddfce-14e8-4ee5-96b8-6ec84f8daf27",
    "text": "Before gaining independence, which current world capital was formerly known as Leopoldville?",
    "options": [
      "Brazzaville, Republic of the Congo",
      "Kinshasa, Democratic Republic of the Congo",
      "Libreville, Gabon",
      "Bangui, Central African Republic"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Kinshasa was called Leopoldville during Belgian colonial rule, named after King Leopold II of Belgium.",
    "detailedExplanation": "Kinshasa, the capital of the Democratic Republic of the Congo, was renamed from Leopoldville when the country gained independence in 1960. The colonial name honored King Leopold II of Belgium, who personally controlled the Congo Free State before it became a Belgian colony. Today, Kinshasa is one of Africa's largest cities and sits directly across the Congo River from Brazzaville, making these two capitals among the closest in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kinshasa",
    "citationTitle": "Wikipedia: Kinshasa"
  },
  {
    "id": "1f65f2ca-765c-472f-8518-08070b19ab6c",
    "text": "Which capital city was specifically built in the 1960s to replace the former coastal capital and is known for its distinctive modernist architecture?",
    "options": [
      "Canberra, Australia",
      "Brasília, Brazil",
      "Islamabad, Pakistan",
      "Abuja, Nigeria"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Brasília was constructed in the 1960s to replace Rio de Janeiro as Brazil's capital, featuring unique modernist urban planning.",
    "detailedExplanation": "Brasília was inaugurated in 1960 as Brazil's new capital, replacing Rio de Janeiro. Designed by urban planner Lúcio Costa and architect Oscar Niemeyer, the city was built from scratch in just four years in Brazil's interior. Its distinctive modernist architecture and urban design, resembling an airplane from above, earned it UNESCO World Heritage status. The project aimed to promote development of Brazil's interior and create a symbol of the country's progress and modernization.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bras%C3%ADlia",
    "citationTitle": "Wikipedia: Brasília"
  },
  {
    "id": "739d40ed-86de-423d-88a0-e6495da70793",
    "text": "What is the only national capital that is completely surrounded by another country's territory?",
    "options": [
      "Vatican City",
      "San Marino City",
      "Vaduz, Liechtenstein",
      "Rome, Italy"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Vatican City is entirely enclosed within Rome, Italy, making it the only capital completely surrounded by another nation.",
    "detailedExplanation": "Vatican City, the world's smallest sovereign state at just 0.17 square miles, is entirely surrounded by Rome, Italy. As the spiritual and administrative headquarters of the Roman Catholic Church, it serves as the capital of the Vatican City State. The Vatican is enclosed by medieval and Renaissance-era walls, except for the southeast at St. Peter's Square. While other small nations like San Marino are landlocked, they still border multiple municipalities, making Vatican City unique in being completely enclaved within a single foreign capital.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vatican_City",
    "citationTitle": "Wikipedia: Vatican City"
  },
  {
    "id": "6224d4a5-daf4-41ca-b5e1-8972065c9a1a",
    "text": "Which Asian capital city was originally built on seven hills and shares this geographical feature with Rome?",
    "options": [
      "Kathmandu, Nepal",
      "Amman, Jordan",
      "Yerevan, Armenia",
      "Lisbon, Portugal"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Amman, Jordan's capital, was historically built on seven hills, earning it the nickname 'Rome of the East.'",
    "detailedExplanation": "Amman, the capital of Jordan, was traditionally said to be built on seven hills, similar to Rome's famous seven hills. The ancient city of Philadelphia (as it was known in Roman times) expanded across these hills: Jabal al-Qal'a (Citadel Hill), Jabal Amman, Jabal al-Weibdeh, Jabal al-Lweibdeh, Jabal al-Taj, Jabal al-Nazha, and Jabal al-Ashrafiyeh. Modern Amman has grown far beyond these original seven hills, but the historical parallel with Rome reflects the city's ancient heritage and strategic importance in the region.",
    "citationUrl": "https://en.wikipedia.org/wiki/Amman",
    "citationTitle": "Wikipedia: Amman"
  }
]