[
  {
    "id": "b6ac958a-4b7b-446f-859b-e0638eb9b8f1",
    "text": "What is the primary mechanism responsible for the generation of Earth's magnetic field?",
    "options": [
      "Permanent magnetization of iron in the core",
      "Solar wind interaction",
      "Geodynamo effect from convection in the outer core",
      "Radioactive decay in the mantle"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Earth's magnetic field is generated by the geodynamo - convective motion of conducting fluid in the outer core.",
    "detailedExplanation": "Earth's magnetic field is generated by the geodynamo, a complex process involving convective motion of electrically conducting molten iron and nickel in the outer core. Heat from the inner core boundary and cooling at the core-mantle boundary drive convection currents, while Earth's rotation organizes these flows through the Coriolis effect. The moving conductive fluid acts like a self-sustaining dynamo, converting kinetic energy into magnetic energy. This process explains both the existence of the magnetic field and phenomena like magnetic reversals throughout geological history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dynamo_theory",
    "citationTitle": "Wikipedia: Dynamo Theory"
  },
  {
    "id": "d640416f-03af-4c9c-a926-3dcd1caaa52a",
    "text": "What is the approximate number of base pairs in the human genome?",
    "options": [
      "1.2 billion",
      "3.2 billion",
      "6.4 billion",
      "9.1 billion"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "The human genome contains approximately 3.2 billion base pairs of DNA.",
    "detailedExplanation": "The Human Genome Project determined that the human genome consists of approximately 3.2 billion base pairs of DNA spread across 23 pairs of chromosomes. This massive amount of genetic information contains roughly 20,000-25,000 protein-coding genes, though this represents only about 1-2% of the entire genome. The remaining DNA includes regulatory sequences, introns, and other non-coding regions that play important roles in gene expression and cellular function.",
    "citationUrl": "https://en.wikipedia.org/wiki/Human_genome",
    "citationTitle": "Wikipedia: Human genome"
  },
  {
    "id": "f993ad57-e918-4b12-a4f5-849dfb54fa23",
    "text": "Which enzyme is responsible for unwinding the DNA double helix during replication?",
    "options": [
      "DNA polymerase",
      "DNA ligase",
      "Helicase",
      "Primase"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Helicase is the enzyme that unwinds the DNA double helix by breaking hydrogen bonds between base pairs.",
    "detailedExplanation": "During DNA replication, helicase enzymes play a crucial role by unwinding the double-stranded DNA molecule. They accomplish this by breaking the hydrogen bonds between complementary base pairs, creating a replication fork where the two strands separate. This unwinding is essential because it provides access for other replication enzymes like DNA polymerase to synthesize new complementary strands. The process requires energy in the form of ATP, and different types of helicases work at various stages of replication.",
    "citationUrl": "https://en.wikipedia.org/wiki/Helicase",
    "citationTitle": "Wikipedia: Helicase"
  },
  {
    "id": "7fd00f38-7d6c-43b6-8a66-53a6450d7ab8",
    "text": "What genetic phenomenon explains why calico cats are almost always female?",
    "options": [
      "Genomic imprinting",
      "X-inactivation",
      "Mitochondrial inheritance",
      "Epistasis"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "X-inactivation causes random silencing of one X chromosome in female cells, creating the patchy color pattern in calico cats.",
    "detailedExplanation": "Calico cats display their distinctive patched coat pattern due to X-inactivation, also known as lyonization. The genes for orange and black fur colors are located on the X chromosome. Female cats have two X chromosomes (XX), while males have one X and one Y chromosome (XY). During early development in female cats, one X chromosome is randomly inactivated in each cell. This creates patches of cells expressing either the orange or black color gene, resulting in the characteristic calico pattern. Male calico cats are extremely rare and typically have chromosomal abnormalities like XXY.",
    "citationUrl": "https://en.wikipedia.org/wiki/X-inactivation",
    "citationTitle": "Wikipedia: X-inactivation"
  },
  {
    "id": "78974ce5-b34c-44dc-9666-742b8d9fc1bf",
    "text": "Which type of RNA editing involves the conversion of cytosine to uracil?",
    "options": [
      "A-to-I editing",
      "C-to-U editing",
      "Pseudouridylation",
      "Base methylation"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "C-to-U editing converts cytosine residues to uracil in RNA molecules, changing the genetic code.",
    "detailedExplanation": "C-to-U RNA editing is a post-transcriptional modification where cytosine residues in RNA are deaminated to form uracil. This process is catalyzed by enzymes called cytidine deaminases and effectively changes the genetic code read during translation, as uracil pairs with adenine instead of guanine. A well-known example occurs in apolipoprotein B mRNA, where C-to-U editing creates a stop codon, resulting in a shorter protein variant. This mechanism allows cells to increase protein diversity from a single gene and is particularly important in certain tissues and developmental stages.",
    "citationUrl": "https://en.wikipedia.org/wiki/RNA_editing",
    "citationTitle": "Wikipedia: RNA editing"
  },
  {
    "id": "d063125d-d4f9-4d8e-b8cf-2ae29cfde6d5",
    "text": "What is the term for DNA sequences that can move from one location to another within the genome?",
    "options": [
      "Telomeres",
      "Transposons",
      "Centromeres",
      "Histones"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Transposons are mobile genetic elements that can move or copy themselves to new positions within the genome.",
    "detailedExplanation": "Transposons, also known as 'jumping genes,' are DNA sequences capable of moving from one location to another within a genome. Discovered by Barbara McClintock, these mobile genetic elements can either move directly (cut-and-paste transposition) or copy themselves to new locations (replicative transposition). Transposons make up a significant portion of many genomes - approximately 45% of the human genome consists of transposable elements or their remnants. They play important roles in genome evolution, genetic diversity, and can sometimes cause mutations when they insert into functional genes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Transposable_element",
    "citationTitle": "Wikipedia: Transposable element"
  },
  {
    "id": "c7d070fe-77ba-4269-bfd1-3e54bce5d9cc",
    "text": "In which phase of mitosis do chromosomes align at the cell's equatorial plane?",
    "options": [
      "Prophase",
      "Metaphase",
      "Anaphase",
      "Telophase"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "During metaphase, chromosomes align at the metaphase plate (cell's equatorial plane) before separation.",
    "detailedExplanation": "Metaphase is the stage of mitosis where chromosomes align along the cell's equatorial plane, forming what's called the metaphase plate. This alignment is crucial for ensuring that each daughter cell receives exactly one copy of each chromosome. The chromosomes are held in place by spindle fibers attached to their kinetochores, and the cell has checkpoint mechanisms that prevent progression to anaphase until all chromosomes are properly attached and aligned. This precise organization is essential for accurate chromosome segregation and maintaining genomic stability in daughter cells.",
    "citationUrl": "https://en.wikipedia.org/wiki/Metaphase",
    "citationTitle": "Wikipedia: Metaphase"
  },
  {
    "id": "d58ba410-61d1-442a-b605-2ea9213d47cf",
    "text": "What is the name of the technique used to amplify specific DNA sequences using repeated heating and cooling cycles?",
    "options": [
      "Southern blotting",
      "Gel electrophoresis",
      "Polymerase chain reaction",
      "DNA sequencing"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Polymerase Chain Reaction (PCR) uses thermal cycling to exponentially amplify specific DNA sequences.",
    "detailedExplanation": "Polymerase Chain Reaction (PCR) is a revolutionary molecular biology technique that amplifies specific DNA sequences through repeated cycles of heating and cooling. Each cycle consists of three steps: denaturation (heating to separate DNA strands), annealing (cooling to allow primers to bind), and extension (DNA polymerase synthesizes new strands). Developed by Kary Mullis in the 1980s, PCR can produce millions of copies of a target DNA sequence from just a few initial molecules. This technique has transformed fields ranging from medical diagnostics and forensic science to evolutionary biology and genetic engineering.",
    "citationUrl": "https://en.wikipedia.org/wiki/Polymerase_chain_reaction",
    "citationTitle": "Wikipedia: Polymerase chain reaction"
  },
  {
    "id": "e6ca55b7-bf88-43e0-9ed7-af5c54663060",
    "text": "Which epigenetic modification is associated with gene silencing and involves the addition of methyl groups to cytosine bases?",
    "options": [
      "Histone acetylation",
      "DNA methylation",
      "Chromatin remodeling",
      "Histone ubiquitination"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "DNA methylation involves adding methyl groups to cytosine bases and is typically associated with gene silencing.",
    "detailedExplanation": "DNA methylation is a crucial epigenetic modification where methyl groups are added to cytosine bases, typically in CpG dinucleotides (cytosine-guanine sequences). This modification is generally associated with gene silencing and plays vital roles in development, genomic imprinting, and X-chromosome inactivation. DNA methyltransferases (DNMTs) catalyze this process, and the methylation patterns can be inherited through cell divisions. Abnormal DNA methylation patterns are implicated in various diseases, including cancer, where tumor suppressor genes may be silenced through hypermethylation of their promoter regions.",
    "citationUrl": "https://en.wikipedia.org/wiki/DNA_methylation",
    "citationTitle": "Wikipedia: DNA methylation"
  },
  {
    "id": "de1149ca-1584-43d0-8ca0-9d5947a7bc64",
    "text": "What percentage of human DNA is shared with bananas?",
    "options": [
      "25%",
      "40%",
      "50%",
      "60%"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Humans share approximately 50% of their DNA with bananas due to fundamental cellular processes.",
    "detailedExplanation": "Despite the obvious differences between humans and bananas, we share about 50% of our DNA with these fruits. This surprising similarity exists because all living organisms evolved from common ancestors and share fundamental cellular processes like metabolism, DNA replication, and protein synthesis. The genes responsible for these basic life functions have been conserved throughout evolution, which explains why even distantly related species maintain genetic similarities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Human_genome",
    "citationTitle": "Wikipedia: Human genome"
  },
  {
    "id": "016d440a-4f6c-4a93-b32f-d29aad85ec63",
    "text": "Which genetic condition is caused by having an extra copy of chromosome 21?",
    "options": [
      "Turner syndrome",
      "Klinefelter syndrome",
      "Down syndrome",
      "Edwards syndrome"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Down syndrome results from trisomy 21, meaning three copies of chromosome 21 instead of two.",
    "detailedExplanation": "Down syndrome is a genetic disorder caused by the presence of all or part of a third copy of chromosome 21, a condition known as trisomy 21. This chromosomal abnormality occurs in approximately 1 in 700 births and leads to intellectual disability, distinctive facial features, and increased risk of certain medical conditions. The condition was first described by John Langdon Down in 1866, though the chromosomal basis wasn't discovered until 1959 by Jérôme Lejeune.",
    "citationUrl": "https://en.wikipedia.org/wiki/Down_syndrome",
    "citationTitle": "Wikipedia: Down syndrome"
  },
  {
    "id": "ad5a1667-e3e2-486b-a2b9-da0c4c7a20e0",
    "text": "What is the name of the enzyme responsible for unwinding the DNA double helix during replication?",
    "options": [
      "DNA polymerase",
      "DNA ligase",
      "DNA helicase",
      "DNA primase"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "DNA helicase unwinds the double helix by breaking hydrogen bonds between base pairs.",
    "detailedExplanation": "DNA helicase is a crucial enzyme in DNA replication that unwinds the double-stranded DNA helix by breaking the hydrogen bonds between complementary base pairs. This unwinding creates a replication fork, allowing other enzymes access to the DNA strands for copying. The helicase moves along the DNA molecule using ATP energy, creating single-stranded templates that DNA polymerase can then use to synthesize new complementary strands. Without helicase, the tightly wound DNA structure would remain inaccessible for replication.",
    "citationUrl": "https://en.wikipedia.org/wiki/Helicase",
    "citationTitle": "Wikipedia: Helicase"
  },
  {
    "id": "9794a069-63d6-4b1a-88b7-e4e7ae88f6d5",
    "text": "Which scientist used X-ray crystallography to produce 'Photo 51', crucial evidence for DNA's double helix structure?",
    "options": [
      "Maurice Wilkins",
      "Rosalind Franklin",
      "Linus Pauling",
      "Erwin Chargaff"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Rosalind Franklin's X-ray crystallography work, particularly Photo 51, provided key evidence for DNA's helical structure.",
    "detailedExplanation": "Rosalind Franklin, a British chemist, used X-ray crystallography to study the structure of DNA at King's College London. Her famous 'Photo 51', taken in 1952, clearly showed the helical structure of DNA and provided crucial measurements that Watson and Crick used to determine the correct model of the double helix. Franklin's meticulous work revealed the antiparallel nature of DNA strands and the positioning of phosphate groups on the outside of the molecule. Unfortunately, she died in 1958 before the Nobel Prize was awarded for the discovery of DNA structure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rosalind_Franklin",
    "citationTitle": "Wikipedia: Rosalind Franklin"
  },
  {
    "id": "4bae7f8d-2dd2-4227-8b3c-4e41a92eff6b",
    "text": "What is the term for genes that are located on the same chromosome and tend to be inherited together?",
    "options": [
      "Alleles",
      "Linked genes",
      "Homologous genes",
      "Epistatic genes"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Linked genes are located close together on the same chromosome and are usually inherited as a unit.",
    "detailedExplanation": "Linked genes are genes that are located close to each other on the same chromosome and therefore tend to be inherited together during sexual reproduction. This phenomenon violates Mendel's law of independent assortment, which assumes genes assort independently. The closer two genes are on a chromosome, the less likely they are to be separated by crossing over during meiosis. The frequency of recombination between linked genes is used to create genetic maps, with distances measured in map units or centimorgans (cM), where 1 cM represents a 1% recombination frequency.",
    "citationUrl": "https://en.wikipedia.org/wiki/Genetic_linkage",
    "citationTitle": "Wikipedia: Genetic linkage"
  },
  {
    "id": "7534aaf0-01d1-4bfd-b1a3-f2490ceb38b4",
    "text": "Which technique involves amplifying specific DNA sequences using repeated cycles of heating and cooling?",
    "options": [
      "Gel electrophoresis",
      "Southern blotting",
      "Polymerase chain reaction (PCR)",
      "DNA sequencing"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "PCR uses thermal cycling to repeatedly denature DNA and amplify specific sequences exponentially.",
    "detailedExplanation": "Polymerase Chain Reaction (PCR) is a revolutionary molecular biology technique developed by Kary Mullis in 1983, for which he won the Nobel Prize. PCR amplifies specific DNA sequences through repeated cycles of three temperature-controlled steps: denaturation (95°C) to separate DNA strands, annealing (50-65°C) for primers to bind to target sequences, and extension (72°C) for DNA polymerase to synthesize new strands. This process can produce millions of copies of a target DNA sequence in just a few hours, making it invaluable for research, medical diagnostics, and forensic science.",
    "citationUrl": "https://en.wikipedia.org/wiki/Polymerase_chain_reaction",
    "citationTitle": "Wikipedia: Polymerase chain reaction"
  },
  {
    "id": "65e2645c-ea19-430c-b79b-f3d3c5fa6b50",
    "text": "What is the maximum number of amino acids that can be coded by a single gene in the human genome?",
    "options": [
      "2,000",
      "8,000",
      "26,000",
      "34,000"
    ],
    "correctIndex": 3,
    "category": "science",
    "difficulty": "hard",
    "explanation": "The titin gene codes for approximately 34,000 amino acids, making it the largest known protein.",
    "detailedExplanation": "The TTN gene, which codes for the protein titin, contains the longest known coding sequence in the human genome, producing a protein of approximately 34,350 amino acids. Titin is found in muscle tissue and acts as a molecular spring, contributing to muscle elasticity and passive tension. The gene itself spans about 281,000 base pairs and contains 363 exons. Due to alternative splicing, different isoforms of titin can be produced with varying lengths, but the largest cardiac isoform reaches the maximum length, making titin the largest known protein in the human body.",
    "citationUrl": "https://en.wikipedia.org/wiki/Titin",
    "citationTitle": "Wikipedia: Titin"
  },
  {
    "id": "2d7d4793-d5ea-424c-bc58-36394158a92d",
    "text": "Which epigenetic modification involves the addition of methyl groups to cytosine bases in DNA?",
    "options": [
      "Histone acetylation",
      "DNA methylation",
      "Chromatin remodeling",
      "RNA interference"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "DNA methylation adds methyl groups to cytosine bases, typically silencing gene expression.",
    "detailedExplanation": "DNA methylation is a crucial epigenetic modification where methyl groups (CH₃) are added to cytosine bases, particularly in CpG dinucleotides (cytosine-guanine sequences). This modification typically occurs at the 5-carbon position of cytosine, creating 5-methylcytosine. DNA methylation generally leads to gene silencing and plays important roles in development, genomic imprinting, X-chromosome inactivation, and suppression of repetitive elements. Abnormal methylation patterns are associated with various diseases, including cancer, where tumor suppressor genes may become hypermethylated and silenced.",
    "citationUrl": "https://en.wikipedia.org/wiki/DNA_methylation",
    "citationTitle": "Wikipedia: DNA methylation"
  },
  {
    "id": "296a94b9-a5e5-427a-b658-a6b33c720878",
    "text": "Which genetic phenomenon explains why calico cats are almost always female?",
    "options": [
      "Genomic imprinting",
      "X-inactivation",
      "Mitochondrial inheritance",
      "Haploinsufficiency"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "X-inactivation causes random silencing of one X chromosome in female cells, creating the patchy color pattern in calico cats.",
    "detailedExplanation": "Calico cats are almost exclusively female due to X-inactivation, also known as lyonization. The genes for orange and black fur colors are located on the X chromosome. Female cats have two X chromosomes, while males have only one. During early development in female cats, one X chromosome is randomly inactivated in each cell, creating patches of cells expressing either the orange or black color gene. This results in the distinctive patched pattern of calico cats. Male calico cats are extremely rare and typically have chromosomal abnormalities like XXY.",
    "citationUrl": "https://en.wikipedia.org/wiki/X-inactivation",
    "citationTitle": "Wikipedia: X-inactivation"
  },
  {
    "id": "cb21c448-ee68-4213-b6e7-8b6615cc6c6f",
    "text": "What is the name of the DNA repair mechanism that corrects mismatched base pairs during replication?",
    "options": [
      "Base excision repair",
      "Nucleotide excision repair",
      "Mismatch repair",
      "Homologous recombination"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Mismatch repair (MMR) specifically identifies and corrects incorrectly paired bases that escape DNA polymerase proofreading.",
    "detailedExplanation": "Mismatch repair (MMR) is a crucial DNA repair system that corrects base-pairing errors that escape the proofreading function of DNA polymerase during replication. The MMR system recognizes distortions in the DNA double helix caused by mismatched bases, removes the incorrect nucleotide from the newly synthesized strand, and fills in the gap with the correct base. Defects in MMR genes like MLH1, MSH2, and MSH6 are associated with Lynch syndrome, a hereditary form of colorectal cancer, highlighting the critical importance of this repair mechanism.",
    "citationUrl": "https://en.wikipedia.org/wiki/DNA_mismatch_repair",
    "citationTitle": "Wikipedia: DNA mismatch repair"
  },
  {
    "id": "02591ceb-f9f2-431d-b2ee-dbda38a6b5e6",
    "text": "Which enzyme is responsible for adding telomeres to the ends of chromosomes during DNA replication?",
    "options": [
      "DNA polymerase III",
      "Telomerase",
      "Helicase",
      "Primase"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Telomerase is the enzyme that adds telomeric DNA sequences to chromosome ends.",
    "detailedExplanation": "Telomerase is a specialized ribonucleoprotein enzyme that extends the telomeres at the ends of chromosomes. Unlike regular DNA polymerases, telomerase can add DNA sequences without requiring a pre-existing DNA template, using its own RNA component as a template. This enzyme is crucial for maintaining chromosome stability during cell division, as conventional DNA replication machinery cannot fully replicate the very ends of linear chromosomes. Telomerase activity is high in stem cells and cancer cells but limited in most somatic cells, which contributes to cellular aging.",
    "citationUrl": "https://en.wikipedia.org/wiki/Telomerase",
    "citationTitle": "Wikipedia: Telomerase"
  }
]