[
  {
    "id": "d15d6c43-3797-4e38-abf5-116d5b185d96",
    "text": "What does the term 'BASE' stand for in BASE jumping?",
    "options": [
      "Building, Antenna, Span, Earth",
      "Bungee, Airplane, Sky, Extreme",
      "Bridge, Air, Speed, Energy",
      "Bold, Adventure, Sky, Elevation"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "BASE stands for the four types of fixed objects from which one can jump: Building, Antenna, Span (bridge), and Earth (cliff).",
    "detailedExplanation": "BASE jumping is an extreme sport where participants jump from fixed objects and use a parachute to break their fall. The acronym BASE represents the four categories of fixed objects: Buildings (like skyscrapers), Antennas (radio towers), Spans (bridges), and Earth (cliffs or other natural formations). This sport is considered one of the most dangerous extreme sports due to the low altitude jumps and minimal time for parachute deployment.",
    "citationUrl": "https://en.wikipedia.org/wiki/BASE_jumping",
    "citationTitle": "Wikipedia: BASE jumping"
  },
  {
    "id": "6573d6f1-b6b7-499a-ac0e-8f5d503853b6",
    "text": "Which extreme sport involves riding down a mountain on a single board with both feet strapped in?",
    "options": [
      "Skateboarding",
      "Snowboarding",
      "Surfing",
      "Sandboarding"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Snowboarding involves riding down snow-covered mountains on a single board with both feet secured to the board.",
    "detailedExplanation": "Snowboarding developed in the 1960s and became an Olympic sport in 1998. Unlike skiing where each foot is on a separate ski, snowboarding uses a single board with both feet strapped in using bindings. The rider faces sideways down the mountain, similar to surfing or skateboarding. The sport has evolved to include various disciplines such as halfpipe, slopestyle, and alpine racing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snowboarding",
    "citationTitle": "Wikipedia: Snowboarding"
  },
  {
    "id": "9196e30d-df69-41b3-8bd9-a6d47726fa27",
    "text": "What is the minimum age requirement for tandem skydiving in most countries?",
    "options": [
      "14 years old",
      "16 years old",
      "18 years old",
      "21 years old"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Most countries require participants to be at least 18 years old for tandem skydiving, though some allow 16-year-olds with parental consent.",
    "detailedExplanation": "Tandem skydiving involves a student jumper being attached to an experienced instructor via a harness system. While age requirements can vary by country and drop zone, 18 is the most common minimum age for tandem jumps. Some locations allow 16 or 17-year-olds to participate with written parental consent and additional safety measures. The age requirement exists due to the physical and mental maturity needed to follow safety instructions during this high-risk activity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parachuting",
    "citationTitle": "Wikipedia: Parachuting"
  },
  {
    "id": "8341c3b0-9548-42c6-9c2e-36b1e415a896",
    "text": "In rock climbing, what does the term 'free solo' mean?",
    "options": [
      "Climbing with a partner",
      "Climbing without ropes or safety equipment",
      "Climbing indoors only",
      "Climbing with minimal gear"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Free solo climbing means climbing without ropes, harnesses, or any safety equipment - a fall would likely be fatal.",
    "detailedExplanation": "Free solo climbing is the most dangerous form of rock climbing where climbers ascend without any ropes, harnesses, or protective equipment. Any fall would result in serious injury or death. This differs from 'free climbing' where safety equipment is used for protection but not to aid the climb. Famous free solo climber Alex Honnold's ascent of El Capitan was documented in the film 'Free Solo.' The practice requires exceptional skill, mental control, and intimate knowledge of the climbing route.",
    "citationUrl": "https://en.wikipedia.org/wiki/Free_solo_climbing",
    "citationTitle": "Wikipedia: Free solo climbing"
  },
  {
    "id": "ba9f200f-1837-4643-a872-bf58c218bb1c",
    "text": "Which water sport involves being towed behind a boat while standing on a board and performing tricks?",
    "options": [
      "Water skiing",
      "Wakeboarding",
      "Jet skiing",
      "Kite surfing"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Wakeboarding involves riding a wakeboard while being towed behind a motorboat, using the boat's wake to perform aerial tricks.",
    "detailedExplanation": "Wakeboarding emerged in the 1980s, combining elements of water skiing, snowboarding, and surfing. The rider stands on a wakeboard (similar to a snowboard but designed for water) with both feet secured in bindings, and is towed behind a boat at speeds of 18-25 mph. The boat's wake creates a ramp that allows riders to launch into the air and perform various tricks and rotations. The sport has grown to include cable wakeboarding at wake parks with overhead cables instead of boats.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wakeboarding",
    "citationTitle": "Wikipedia: Wakeboarding"
  },
  {
    "id": "74e3edb2-ddb3-48ae-b72d-afe6cb37e510",
    "text": "What type of vehicle is primarily used in motocross racing?",
    "options": [
      "Street motorcycles",
      "Dirt bikes",
      "ATVs",
      "Go-karts"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Motocross uses specially designed dirt bikes built for off-road racing on closed circuits with jumps and obstacles.",
    "detailedExplanation": "Motocross is a form of off-road motorcycle racing held on enclosed off-road circuits. The motorcycles used are lightweight dirt bikes specifically designed for the sport, featuring long-travel suspension, knobby tires, and minimal bodywork. These bikes are built to handle jumps, tight turns, and rough terrain that characterize motocross tracks. The sport originated from British motorcycle trials events and has evolved into various disciplines including Supercross (indoor arena racing) and freestyle motocross where riders perform aerial stunts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Motocross",
    "citationTitle": "Wikipedia: Motocross"
  },
  {
    "id": "ceb9fe4c-2f4b-418c-95f9-d0655d36b82e",
    "text": "Which extreme sport involves descending a rope in a controlled manner down a cliff or building?",
    "options": [
      "Bungee jumping",
      "Rappelling/Abseiling",
      "Zip lining",
      "Free falling"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Rappelling (also called abseiling) involves descending a vertical surface using a rope and specialized equipment for controlled descent.",
    "detailedExplanation": "Rappelling, known as abseiling in some countries, is a controlled descent down a vertical drop using a rope. Climbers use a rappel device (such as a figure-8 or ATC) attached to their harness to create friction and control their descent speed. This technique is essential in rock climbing, mountaineering, and rescue operations. While it can be an extreme sport in its own right when done on tall cliffs or buildings, it's also a fundamental skill taught to climbers, military personnel, and rescue workers for practical applications.",
    "citationUrl": "https://en.wikipedia.org/wiki/Abseiling",
    "citationTitle": "Wikipedia: Abseiling"
  },
  {
    "id": "ea6acaa4-c4f0-49ad-a1b9-774351a1aa74",
    "text": "What is the typical freefall time for a standard skydive from 12,000 feet?",
    "options": [
      "15 seconds",
      "30 seconds",
      "45 seconds",
      "60 seconds"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "A skydive from 12,000 feet typically provides about 45 seconds of freefall before the parachute must be deployed.",
    "detailedExplanation": "During freefall, a skydiver reaches terminal velocity of approximately 120 mph after about 12 seconds of acceleration. From a typical jump altitude of 12,000 feet, skydivers experience roughly 45 seconds of freefall before deploying their parachute at around 5,000 feet. The remaining altitude is used for the parachute descent, which takes about 5-7 minutes. Higher altitude jumps from 15,000 feet or more can provide up to 60 seconds of freefall, while lower altitude tandem jumps might offer only 30 seconds.",
    "citationUrl": "https://en.wikipedia.org/wiki/Skydiving",
    "citationTitle": "Wikipedia: Skydiving"
  },
  {
    "id": "8082e218-799c-440a-ad49-5226d9b1aa09",
    "text": "What is the name of the extreme sport where participants jump from great heights while attached to a large elastic cord?",
    "options": [
      "Bungee jumping",
      "Zip lining",
      "Paragliding",
      "Wing suiting"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Bungee jumping involves jumping from a high structure while connected to a large elastic cord.",
    "detailedExplanation": "Bungee jumping is an extreme sport that involves jumping from a tall structure while connected to a large elastic cord. The tall structure is usually a fixed object, such as a building, bridge or crane; but it is also possible to jump from a movable object, such as a hot-air balloon or helicopter, that has the capacity to hover above the ground. The thrill comes from the free-falling and the rebound.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bungee_jumping",
    "citationTitle": "Wikipedia: Bungee jumping"
  },
  {
    "id": "fc535493-aa71-4c07-bb5c-21ee86506cad",
    "text": "Which extreme sport is also known as 'freestyle walking' and involves moving through urban environments using only the human body?",
    "options": [
      "Skateboarding",
      "Parkour",
      "Street luge",
      "Urban climbing"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Parkour is the practice of moving through environments using only the human body and is sometimes called freestyle walking.",
    "detailedExplanation": "Parkour is a training discipline where practitioners aim to get from one point to another in a complex environment, without assistive equipment and in the fastest and most efficient way possible. Parkour includes running, climbing, swinging, vaulting, jumping, rolling, quadrupedal movement, and other movements as deemed most suitable for the situation. It was developed in France and has grown into a popular extreme sport worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parkour",
    "citationTitle": "Wikipedia: Parkour"
  },
  {
    "id": "56d235c2-e8ae-4a6c-8faf-56333b655599",
    "text": "In which extreme sport do participants use a large fabric wing to glide through the air after launching from elevated terrain?",
    "options": [
      "Hang gliding",
      "Paragliding",
      "Wingsuit flying",
      "Parasailing"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Paragliding uses a large fabric wing called a paraglider to glide through the air after launching from elevated terrain.",
    "detailedExplanation": "Paragliding is the recreational and competitive adventure sport of flying paragliders: lightweight, free-flying, foot-launched glider aircraft with no rigid primary structure. The pilot sits in a harness suspended below a fabric wing comprising a large number of interconnected baffled cells. Wing shape is maintained by the suspension lines, the pressure of air entering vents in the front of the wing, and the aerodynamic forces of the air flowing over the outside.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paragliding",
    "citationTitle": "Wikipedia: Paragliding"
  },
  {
    "id": "d9ebf1aa-3f91-4545-9318-bb3400b34889",
    "text": "What is the name of the extreme winter sport where athletes ride a small sled down an icy track at high speeds?",
    "options": [
      "Bobsledding",
      "Luge",
      "Skeleton",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Bobsledding, luge, and skeleton are all extreme winter sports involving riding sleds down icy tracks at high speeds.",
    "detailedExplanation": "All three sports involve racing down an ice track at extremely high speeds. Luge involves lying on your back on a small sled, skeleton involves lying face-down on a sled, and bobsledding involves teams of 2-4 people in a larger enclosed sled. These sports are featured in the Winter Olympics and can reach speeds exceeding 140 km/h (87 mph), making them some of the fastest non-motorized sports on Earth.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sliding_sport",
    "citationTitle": "Wikipedia: Sliding sport"
  },
  {
    "id": "7de56f12-857f-4487-9334-00b96f04aae5",
    "text": "Which extreme sport involves riding ocean waves on a board and originated in ancient Polynesia?",
    "options": [
      "Bodyboarding",
      "Surfing",
      "Kitesurfing",
      "Windsurfing"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Surfing involves riding ocean waves on a board and has its origins in ancient Polynesian culture.",
    "detailedExplanation": "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which usually carries the surfer towards the shore. The ancient art of surfing, called he'e nalu in the Hawaiian language, was first described in 1769 by Joseph Banks on the HMS Endeavour during Captain James Cook's first voyage. Surfing was a central part of ancient Polynesian culture and has evolved into a major extreme sport practiced worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Surfing",
    "citationTitle": "Wikipedia: Surfing"
  },
  {
    "id": "00cc8eb8-defa-450a-b252-a177a5365c5e",
    "text": "What protective gear is considered absolutely essential for all extreme sports involving wheels or boards?",
    "options": [
      "Knee pads",
      "Elbow pads",
      "Helmet",
      "Wrist guards"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "A helmet is considered the most essential protective gear for extreme sports involving wheels or boards to protect against head injuries.",
    "detailedExplanation": "While all protective gear is important in extreme sports, helmets are universally considered the most critical piece of safety equipment for sports involving wheels or boards such as skateboarding, BMX, mountain biking, and rollerblading. Head injuries can be life-threatening or cause permanent disability, making helmet use essential. Most organized extreme sports events and many locations require helmet use, and safety experts consistently rank head protection as the top priority for participant safety.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bicycle_helmet",
    "citationTitle": "Wikipedia: Bicycle helmet"
  },
  {
    "id": "7cdae64e-70ca-4595-bab1-3ad138c30bd4",
    "text": "Which extreme sport involves performing aerial tricks while being pulled by a speedboat using a rope and handle?",
    "options": [
      "Water skiing",
      "Wakeboarding",
      "Kneeboarding",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Water skiing, wakeboarding, and kneeboarding all involve being pulled by a speedboat while performing tricks.",
    "detailedExplanation": "All three sports involve being towed behind a motorboat while holding onto a rope and handle, but each uses different equipment and techniques. Water skiing uses skis and focuses on speed and slalom techniques, wakeboarding uses a single board similar to snowboarding and emphasizes aerial tricks off the boat's wake, and kneeboarding involves riding on your knees on a shorter board. Each sport has developed its own culture of extreme tricks and competitions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Water_skiing",
    "citationTitle": "Wikipedia: Water skiing"
  },
  {
    "id": "b5be56dd-093d-4b5b-b0f1-2f076f20b9c4",
    "text": "What is the extreme sport called where participants ride specially designed bicycles on rough terrain, often including jumps and obstacles?",
    "options": [
      "BMX",
      "Mountain biking",
      "Trials biking",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "BMX, mountain biking, and trials biking all involve riding specially designed bicycles on challenging terrain with jumps and obstacles.",
    "detailedExplanation": "All three represent different disciplines of extreme cycling. BMX (Bicycle Motocross) involves racing or performing tricks on small bikes with 20-inch wheels on dirt tracks or street courses. Mountain biking involves riding on off-road trails with various terrain including rocks, roots, and steep descents. Trials biking focuses on navigating obstacles without touching the ground with your feet, requiring precise balance and technique. Each discipline has its own specialized bike design and competitive scene.",
    "citationUrl": "https://en.wikipedia.org/wiki/Extreme_sport",
    "citationTitle": "Wikipedia: Extreme sport"
  },
  {
    "id": "d0033d2a-8a3a-4a13-bfbd-a2a357e437dd",
    "text": "Which extreme sport is performed inside a large transparent ball rolling down hills?",
    "options": [
      "Zorbing",
      "Sphering",
      "Ball rolling",
      "Hamster balling"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Zorbing is the extreme sport where participants are secured inside a large transparent plastic ball and roll down hills.",
    "detailedExplanation": "Zorbing, also known as globe-riding or sphereing, was invented in New Zealand in the 1990s. Participants are strapped inside a large inflatable transparent ball, typically 3 meters in diameter, and roll down hills reaching speeds of up to 50 km/h. The ball has two layers with air cushioning between them for safety, and participants can either be harnessed in place or move freely inside the ball with some water for a 'hydro-zorbing' experience.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zorbing",
    "citationTitle": "Wikipedia: Zorbing"
  },
  {
    "id": "a9352c5d-37ec-45a6-8770-7e12e594d305",
    "text": "What is the name of the extreme sport that combines skiing and parachuting?",
    "options": [
      "Speed flying",
      "Ski jumping",
      "Slope soaring",
      "Alpine gliding"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Speed flying combines skiing with a small parachute wing for controlled flight down mountain slopes.",
    "detailedExplanation": "Speed flying is a hybrid extreme sport that emerged in the French Alps in the early 2000s. It combines the techniques of skiing with a small, high-performance parachute wing (typically 8-12 square meters) that allows the participant to alternate between skiing on snow and flying through the air. Unlike paragliding, speed flying uses much smaller wings and focuses on dynamic flight close to terrain, requiring advanced skills in both skiing and wing control.",
    "citationUrl": "https://en.wikipedia.org/wiki/Speed_flying",
    "citationTitle": "Wikipedia: Speed flying"
  },
  {
    "id": "17032577-acef-4f26-8fd0-315adaebd93d",
    "text": "Which country is widely considered the birthplace of modern whitewater rafting?",
    "options": [
      "United States",
      "New Zealand",
      "Canada",
      "Norway"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The United States is considered the birthplace of modern whitewater rafting, particularly along the Colorado River.",
    "detailedExplanation": "Modern whitewater rafting originated in the United States in the 1960s, with the Colorado River being one of the first locations where commercial rafting operations began. The sport evolved from practical river transportation methods used by explorers and settlers. The Grand Canyon became particularly famous for rafting expeditions, and the classification system for river rapids (Class I through VI) was also developed in the United States and later adopted internationally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rafting",
    "citationTitle": "Wikipedia: Rafting"
  },
  {
    "id": "360a67ca-36c0-4cd6-8b2e-051f45fb3175",
    "text": "In which extreme sport do participants wear special suits with fabric wings between their arms and legs?",
    "options": [
      "Wingsuit flying",
      "Hang gliding",
      "Base jumping",
      "Paragliding"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Wingsuit flying uses specially designed suits with fabric wings between the arms, legs, and torso to create lift and glide through the air.",
    "detailedExplanation": "Wingsuit flying involves wearing a specialized jumpsuit with fabric wings sewn between the legs and between the arms and torso. These wings inflate with air during freefall, creating a wing-like surface that provides lift and allows the flyer to glide horizontally while falling, achieving forward speeds of over 100 mph. The sport requires extensive skydiving experience before attempting, as participants must deploy a parachute to land safely. Modern wingsuits can achieve glide ratios of 3:1, meaning for every 3 feet forward, they fall 1 foot.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wingsuit_flying",
    "citationTitle": "Wikipedia: Wingsuit flying"
  }
]