[
  {
    "id": "f7257576-024c-46b2-920b-018b00183ea1",
    "text": "What is the minimum height required for a BASE jump to be considered legitimate by the BASE jumping community?",
    "options": [
      "200 feet",
      "400 feet",
      "600 feet",
      "800 feet"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "BASE jumps must be from at least 200 feet to allow sufficient time for parachute deployment.",
    "detailedExplanation": "BASE jumping, which stands for Building, Antenna, Span, and Earth, requires jumps from fixed objects rather than aircraft. The minimum height of 200 feet is considered the threshold because it provides just enough time for an experienced jumper to deploy their parachute and land safely. Anything lower significantly increases the risk of ground impact before the parachute can fully open and slow the jumper's descent.",
    "citationUrl": "https://en.wikipedia.org/wiki/BASE_jumping",
    "citationTitle": "Wikipedia: BASE Jumping"
  },
  {
    "id": "fe8ccf28-84c7-4847-84c8-dc1ff87e8941",
    "text": "Which extreme sport was invented by surfer Tony Finn and skier Curt Hess in the 1960s?",
    "options": [
      "Windsurfing",
      "Kitesurfing",
      "Wakeboarding",
      "Sandboarding"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Windsurfing was co-invented by Tony Finn and Curt Hess, combining elements of surfing and sailing.",
    "detailedExplanation": "Windsurfing emerged in the 1960s when California surfer Tony Finn teamed up with skier Curt Hess to create a new water sport. They combined a surfboard with a sail system, allowing riders to harness wind power while standing on the board. Their innovation led to the development of modern windsurfing equipment and techniques, making it one of the most popular water sports worldwide and eventually becoming an Olympic sport in 1984.",
    "citationUrl": "https://en.wikipedia.org/wiki/Windsurfing",
    "citationTitle": "Wikipedia: Windsurfing"
  },
  {
    "id": "b5042f05-5ec2-4b70-843b-6602ec87ff1d",
    "text": "What is the term for the extreme sport of jumping from great heights while attached to a large fabric wing?",
    "options": [
      "Paragliding",
      "Hang gliding",
      "Wingsuit flying",
      "Speed flying"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Wingsuit flying involves jumping with a specialized jumpsuit that creates a fabric wing between the arms, legs, and torso.",
    "detailedExplanation": "Wingsuit flying, also known as wingsuiting, involves jumping from aircraft, cliffs, or other high points while wearing a specialized jumpsuit with fabric membranes between the legs and under the arms. This creates a wing-like surface that allows the flyer to glide through the air at high speeds before deploying a parachute for landing. The sport has gained popularity since the 1990s with improvements in wingsuit design, allowing for longer glide times and more precise control.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wingsuit_flying",
    "citationTitle": "Wikipedia: Wingsuit Flying"
  },
  {
    "id": "4e82d345-ee10-49d1-a5fb-7ab0e4f43dac",
    "text": "In which country did bungee jumping as a commercial extreme sport first begin?",
    "options": [
      "Australia",
      "United States",
      "Switzerland",
      "New Zealand"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Commercial bungee jumping started in New Zealand with AJ Hackett's operations in the 1980s.",
    "detailedExplanation": "While the inspiration for bungee jumping came from the land diving rituals of Vanuatu's Pentecost Island, commercial bungee jumping as we know it today began in New Zealand. AJ Hackett and Henry van Asch started the first commercial bungee jumping operation at the Kawarau Gorge Suspension Bridge near Queenstown in 1988. Hackett had previously gained attention by jumping from the Eiffel Tower in 1987, but New Zealand became the birthplace of the commercial bungee jumping industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bungee_jumping",
    "citationTitle": "Wikipedia: Bungee Jumping"
  },
  {
    "id": "ad4df86e-ee2b-4e3e-a0a9-bfc28ee4fbfb",
    "text": "What is the maximum speed typically reached by street lugers?",
    "options": [
      "45 mph",
      "65 mph",
      "85 mph",
      "105 mph"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Street lugers can reach speeds of up to 85 mph on steep downhill courses.",
    "detailedExplanation": "Street luge involves riders lying on their backs on a wheeled sled-like board, racing down paved roads or specially designed tracks. The sport gained popularity in the 1970s and was even featured in the X Games. Riders can achieve remarkable speeds of up to 85 mph due to their low profile and aerodynamic position, though such speeds are typically only reached on very steep, smooth surfaces. Safety equipment including helmets and leather suits are essential due to the high speeds and proximity to the pavement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Street_luge",
    "citationTitle": "Wikipedia: Street Luge"
  },
  {
    "id": "a01211b4-fba5-4df0-b5da-9ec2cdb6c658",
    "text": "Which extreme sport involves riding ocean waves on a board while being pulled by a kite?",
    "options": [
      "Wakeboarding",
      "Kitesurfing",
      "Windsurfing",
      "Foilboarding"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Kitesurfing uses a large kite to harness wind power while riding waves on a board.",
    "detailedExplanation": "Kitesurfing, also known as kiteboarding, combines aspects of surfing, windsurfing, paragliding, and wakeboarding. The rider stands on a board while holding onto a control bar connected to a large kite, which catches the wind and provides the power for movement across the water. The sport developed in the late 20th century and allows for impressive aerial maneuvers and jumps. The kite's power can launch riders several meters into the air, making it one of the most spectacular water sports to watch.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kitesurfing",
    "citationTitle": "Wikipedia: Kitesurfing"
  },
  {
    "id": "209fa7e9-7c96-4396-a1b6-e28a57abdffb",
    "text": "What is the term for the extreme sport of riding mountain bikes down steep, rough terrain at high speeds?",
    "options": [
      "Cross-country",
      "Downhill mountain biking",
      "BMX racing",
      "Cyclocross"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Downhill mountain biking specifically involves racing down steep, technical terrain at maximum speed.",
    "detailedExplanation": "Downhill mountain biking is a discipline of mountain biking that focuses on descending steep, technical trails as quickly as possible. Riders use specially designed bikes with long-travel suspension, powerful brakes, and aggressive tires to handle the challenging terrain. The sport became popular in the 1970s in Marin County, California, and has evolved into a professional racing discipline with world championships. Riders can reach speeds of over 40 mph while navigating rocks, roots, jumps, and other obstacles.",
    "citationUrl": "https://en.wikipedia.org/wiki/Downhill_mountain_biking",
    "citationTitle": "Wikipedia: Downhill Mountain Biking"
  },
  {
    "id": "f9f73ff4-9df8-4b4e-9b75-8c8d6394d320",
    "text": "Which piece of safety equipment is most critical for whitewater kayaking in Class V rapids?",
    "options": [
      "Wetsuit",
      "Helmet",
      "Life jacket",
      "Throw rope"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "A helmet is essential protection against head injuries from rocks in violent Class V whitewater.",
    "detailedExplanation": "While all safety equipment is important in whitewater kayaking, a helmet becomes absolutely critical in Class V rapids, which represent the most extreme navigable whitewater. Class V rapids feature violent, unpredictable water with complex routes, large drops, and significant hazards including rocks and powerful hydraulics. The risk of head injury from impact with rocks or other obstacles is extremely high, making a properly fitted whitewater helmet the most essential piece of safety gear for survival in these conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Whitewater_kayaking",
    "citationTitle": "Wikipedia: Whitewater Kayaking"
  },
  {
    "id": "cc53b787-7f27-4770-a274-330477d587d0",
    "text": "What does the acronym 'GoPro' originally stand for, relating to its creation for extreme sports documentation?",
    "options": [
      "Go Professional",
      "Go Portable",
      "Go Pro-Active",
      "Go Progressive"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "GoPro stands for 'Go Professional' and was created specifically for extreme sports athletes to capture professional-quality footage.",
    "detailedExplanation": "GoPro was founded in 2002 by Nick Woodman with the goal of helping extreme sports athletes and enthusiasts capture professional-quality photos and videos of their adventures. The name 'GoPro' is short for 'Go Professional,' reflecting the company's mission to provide professional-grade camera equipment in a compact, durable format suitable for extreme conditions. The cameras quickly became essential gear for surfers, snowboarders, skydivers, and other extreme sports participants.",
    "citationUrl": "https://en.wikipedia.org/wiki/GoPro",
    "citationTitle": "Wikipedia: GoPro"
  },
  {
    "id": "82d6d213-343b-4df2-a06c-f70f62f8612a",
    "text": "Which extreme sport holds the Guinness World Record for the fastest non-motorized sport on snow?",
    "options": [
      "Downhill skiing",
      "Speed skiing",
      "Snowboarding",
      "Skeleton"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Speed skiing holds the record at over 250 km/h (155 mph), making it the fastest non-motorized sport on snow.",
    "detailedExplanation": "Speed skiing is recognized by Guinness World Records as the fastest non-motorized sport on snow, with the current world record standing at 254.958 km/h (158.424 mph), set by Italian skier Ivan Origone in 2016. Unlike traditional alpine skiing, speed skiing involves racing straight down steep, specially prepared courses wearing aerodynamic equipment. Skiers reach these incredible speeds by minimizing air resistance through specialized suits, helmets, and skis, while racing down courses that can have gradients of up to 45 degrees.",
    "citationUrl": "https://en.wikipedia.org/wiki/Speed_skiing",
    "citationTitle": "Wikipedia: Speed skiing"
  },
  {
    "id": "4e3b1685-645e-4fb9-b65a-9919ce018ad3",
    "text": "In rock climbing, what does the term 'free soloing' specifically mean?",
    "options": [
      "Climbing alone without a partner",
      "Climbing without any ropes or safety equipment",
      "Climbing outdoors rather than indoors",
      "Climbing without paying for access"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Free soloing means climbing without any ropes, harnesses, or protective equipment - relying solely on skill and strength.",
    "detailedExplanation": "Free soloing is perhaps the most dangerous form of rock climbing, where climbers ascend rock faces without any ropes, harnesses, or protective equipment whatsoever. This extreme discipline relies entirely on the climber's skill, strength, and mental fortitude, as any fall would likely result in serious injury or death. The practice gained widespread attention through climbers like Alex Honnold, who famously free soloed El Capitan in Yosemite National Park. Free soloing differs from free climbing, where ropes are used for safety but not to aid the ascent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Free_solo_climbing",
    "citationTitle": "Wikipedia: Free solo climbing"
  },
  {
    "id": "7b60af31-7460-4a0f-b76d-60a0630777df",
    "text": "Which extreme sport was featured in the 1991 movie 'Point Break' starring Keanu Reeves and Patrick Swayze?",
    "options": [
      "Wingsuit flying",
      "Skydiving",
      "Base jumping",
      "Paragliding"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Point Break prominently featured skydiving scenes, with both actors performing aerial stunts and jumps throughout the film.",
    "detailedExplanation": "The 1991 action film 'Point Break' prominently featured skydiving as a central element of its plot, with memorable scenes of characters jumping from aircraft and performing aerial maneuvers. The movie helped popularize extreme sports in mainstream culture and showcased the adrenaline-fueled world of skydiving to a wide audience. Patrick Swayze's character Bodhi was portrayed as an extreme sports enthusiast who used skydiving as both recreation and escape. The film's skydiving sequences were groundbreaking for their time and helped establish the sport's place in popular culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Point_Break",
    "citationTitle": "Wikipedia: Point Break"
  },
  {
    "id": "9644f0ba-e5f1-4b98-b01e-d1de96205d8d",
    "text": "What is the term for the rotating aerial maneuver performed by snowboarders and skiers in the halfpipe?",
    "options": [
      "McTwist",
      "Corkscrew",
      "Barrel roll",
      "Spin cycle"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "A McTwist is a 540-degree rotational flip performed in the halfpipe, named after skateboarding legend Mike McGill.",
    "detailedExplanation": "The McTwist is a challenging aerial maneuver that involves a 540-degree spin combined with a front or backflip, originally developed in skateboarding by Mike McGill in the 1980s. The move was adapted to snowboarding and skiing in the halfpipe, where athletes launch themselves from the lip of the halfpipe and perform this complex rotation before landing back on the transition. The McTwist requires exceptional spatial awareness, timing, and technical skill, making it one of the more advanced tricks in halfpipe competition. It has become a signature move in extreme sports competitions like the X Games.",
    "citationUrl": "https://en.wikipedia.org/wiki/McTwist",
    "citationTitle": "Wikipedia: McTwist"
  },
  {
    "id": "f9d0d365-ff0d-4d48-8196-dd4dc3369f20",
    "text": "Which extreme sport involves riding waves created by the wake of a motorboat without being directly pulled by the boat?",
    "options": [
      "Wakeboarding",
      "Water skiing",
      "Wakesurfing",
      "Kneeboarding"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Wakesurfing involves riding the boat's wake wave without being attached to the boat, similar to ocean surfing.",
    "detailedExplanation": "Wakesurfing is a water sport where riders surf the wake wave created by a specially designed motorboat. Unlike wakeboarding or water skiing, wakesurfers are not attached to the boat by a rope during the ride. Instead, they use a rope initially to get up on the wave, then release it and ride the continuous wave created by the boat's displacement of water. The sport requires specially weighted boats that create large, surfable waves, and riders use boards similar to small surfboards. Wakesurfing has grown rapidly in popularity as it provides a surfing experience in inland waters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wakesurfing",
    "citationTitle": "Wikipedia: Wakesurfing"
  },
  {
    "id": "e5bf1a1a-723e-4c6c-8a26-824d4f6381bf",
    "text": "In competitive skateboarding, what is the highest score possible in the scoring system used by major competitions?",
    "options": [
      "10.0",
      "100",
      "900",
      "Perfect"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Skateboarding competitions typically use a 10.0 scoring system, with 10.0 being the perfect score.",
    "detailedExplanation": "Most major skateboarding competitions, including those in the Olympics and X Games, use a 10.0 scoring system where judges award points based on technical difficulty, execution, style, and innovation. A perfect score of 10.0 is extremely rare and represents flawless execution of highly technical tricks. Judges typically score in increments of 0.1, and the scoring considers factors such as the difficulty of tricks performed, the smoothness of execution, creativity, and overall flow of the run. This system has been adopted from other judged sports and provides a standardized way to evaluate skateboarding performances across different competitions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Skateboarding",
    "citationTitle": "Wikipedia: Skateboarding"
  },
  {
    "id": "3b5ffd0b-f276-4740-b751-a42141f93be2",
    "text": "Which piece of equipment is essential for the extreme sport of ice climbing that differs from regular rock climbing gear?",
    "options": [
      "Ice axes",
      "Climbing shoes",
      "Chalk bag",
      "Helmet"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Ice axes are specialized tools designed specifically for ice climbing, featuring sharp picks to grip ice surfaces.",
    "detailedExplanation": "Ice axes are the most distinctive and essential piece of equipment for ice climbing that sets it apart from rock climbing. These specialized tools feature sharp metal picks designed to penetrate and grip ice surfaces, along with serrated teeth called 'adze' for chopping steps. Ice climbers typically use two ice axes (called ice tools) for technical climbing, allowing them to ascend vertical or overhanging ice formations. The axes come in various designs optimized for different types of ice climbing, from alpine mountaineering to vertical waterfall ice. Without ice axes, ice climbing would be impossible, as they provide the primary means of upward progress and security on icy surfaces.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ice_climbing",
    "citationTitle": "Wikipedia: Ice climbing"
  },
  {
    "id": "be6737d7-eeba-48e7-a034-9b5b47aeaf87",
    "text": "Which extreme sport originated in New Zealand and involves riding down grassy hills inside a large transparent ball?",
    "options": [
      "Zorbing",
      "Sphereing",
      "Hill rolling",
      "Bubble boarding"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Zorbing is the extreme sport of rolling downhill inside an inflatable transparent ball, invented in New Zealand in the 1990s.",
    "detailedExplanation": "Zorbing, also known as globe-riding, sphereing, or orbing, was invented by Dwane van der Sluis and Andrew Akers in Rotorua, New Zealand in the 1990s. The activity involves being secured inside a large transparent plastic ball, typically 3 meters in diameter, and rolling down a hill. There are two main types: 'harness zorbing' where participants are strapped in, and 'hydro zorbing' where warm water is added to the ball and participants slide around freely inside.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zorbing",
    "citationTitle": "Wikipedia: Zorbing"
  },
  {
    "id": "85eea9be-b60a-40f6-bd55-0c81f906c39c",
    "text": "What is the name of the extreme sport that combines skiing and parachuting, where participants ski off cliffs or steep slopes before deploying a parachute?",
    "options": [
      "Speed flying",
      "Ski BASE",
      "Parachute skiing",
      "Speed riding"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Speed riding combines skiing with a small parachute wing, allowing participants to ski down slopes and take flight intermittently.",
    "detailedExplanation": "Speed riding, also called speed flying when done without skis, is an extreme sport that evolved from paragliding and combines skiing with a small, high-performance parachute wing. Participants use specially designed skis and a wing that's much smaller than a traditional paraglider, allowing them to ski down steep terrain and take short flights. The sport requires advanced skiing ability and paragliding knowledge, as riders must manage both ground and air phases of their descent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Speed_flying",
    "citationTitle": "Wikipedia: Speed flying"
  },
  {
    "id": "eafb0b5e-187e-437b-baec-65baf6e4cf18",
    "text": "In competitive freestyle motocross, what is the name of the trick where the rider does a complete backflip while simultaneously rotating the motorcycle 360 degrees horizontally?",
    "options": [
      "Double grab",
      "Flair",
      "Volt",
      "Superman flip"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Volt is an extremely difficult FMX trick combining a backflip with a full horizontal rotation of the motorcycle.",
    "detailedExplanation": "The Volt is one of the most challenging tricks in freestyle motocross, first successfully performed by Tom Pagès. It combines a backflip with a complete 360-degree horizontal spin of the motorcycle, requiring exceptional timing, strength, and spatial awareness. The trick pushes the boundaries of what's physically possible in FMX and represents the evolution of the sport from simple jumps to complex aerial maneuvers that seem to defy physics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Freestyle_motocross",
    "citationTitle": "Wikipedia: Freestyle motocross"
  },
  {
    "id": "0774835d-0cfa-44c3-9282-70dab727a4c7",
    "text": "What is the extreme sport called where participants jump from helicopters or cliffs wearing skis and attempt to land on steep mountain slopes?",
    "options": [
      "Heli-skiing",
      "Extreme skiing",
      "Cliff skiing",
      "Alpine jumping"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Extreme skiing involves skiing down very steep and dangerous slopes, often accessed by helicopter or requiring cliff jumps to reach the terrain.",
    "detailedExplanation": "Extreme skiing is a discipline of alpine skiing that involves skiing on slopes with gradients of 45 degrees or steeper, often in remote mountain locations. Pioneers like Sylvain Saudan in the 1960s and later athletes have pushed the boundaries by skiing lines that require cliff drops, narrow couloirs, and terrain previously thought impossible to ski. The sport often requires helicopter access to reach remote peaks and demands exceptional technical skill, as falls can be fatal due to the steepness and exposure of the terrain.",
    "citationUrl": "https://en.wikipedia.org/wiki/Extreme_skiing",
    "citationTitle": "Wikipedia: Extreme skiing"
  }
]