[
  {
    "id": "6ab6dc3e-9101-49ec-b68c-7b33bd8656c3",
    "text": "Which player holds the record for the most runs scored in a single Cricket World Cup tournament?",
    "options": [
      "Sachin Tendulkar (2003)",
      "Martin Guptill (2015)",
      "Rohit Sharma (2019)",
      "Matthew Hayden (2007)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Sachin Tendulkar scored 673 runs in the 2003 World Cup.",
    "detailedExplanation": "Sachin Tendulkar set the record for most runs in a single Cricket World Cup during the 2003 tournament held in South Africa, scoring 673 runs in 11 matches at an average of 61.18. This record has stood for over two decades, with his closest challenger being Matthew Hayden who scored 659 runs in the 2007 World Cup. Tendulkar's achievement is particularly remarkable considering India's journey to the final that year.",
    "citationUrl": "https://en.wikipedia.org/wiki/2003_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2003 Cricket World Cup"
  },
  {
    "id": "c76cf8c1-f35c-49d3-ac06-00d76a56b056",
    "text": "In which year was the Cricket World Cup first held outside England?",
    "options": [
      "1983",
      "1987",
      "1992",
      "1996"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 1987 Cricket World Cup was the first held outside England, taking place in India and Pakistan.",
    "detailedExplanation": "The Cricket World Cup was first held outside England in 1987, when India and Pakistan jointly hosted the tournament. This marked a significant shift from the previous three World Cups (1975, 1979, 1983) which were all held in England. The 1987 tournament was also notable for being the first World Cup played with 50-over matches instead of 60 overs, and for being held during the day rather than using the traditional white clothing and red ball format.",
    "citationUrl": "https://en.wikipedia.org/wiki/1987_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 1987 Cricket World Cup"
  },
  {
    "id": "341ad06f-c121-4055-ab15-59276a2fd1a0",
    "text": "Which team famously forfeited their World Cup match in 2003 due to security concerns?",
    "options": [
      "New Zealand vs Kenya",
      "Australia vs Sri Lanka",
      "England vs Zimbabwe",
      "New Zealand vs Kenya in Nairobi"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "New Zealand forfeited their match against Kenya in Nairobi during the 2003 World Cup due to security concerns.",
    "detailedExplanation": "During the 2003 Cricket World Cup, New Zealand refused to play their scheduled match against Kenya in Nairobi due to security concerns, resulting in a forfeit and Kenya being awarded the points. This decision was highly controversial and significantly impacted New Zealand's chances of progressing in the tournament. The match was originally scheduled to be played at the Gymkhana Club Ground in Nairobi, but New Zealand's cricket board deemed the security situation too risky for their players.",
    "citationUrl": "https://en.wikipedia.org/wiki/2003_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2003 Cricket World Cup"
  },
  {
    "id": "78011db1-9d2a-43e0-b526-452e3dde22bd",
    "text": "Which bowler has taken the most wickets across all Cricket World Cup tournaments (combined)?",
    "options": [
      "Glenn McGrath",
      "Muttiah Muralitharan",
      "Wasim Akram",
      "Chaminda Vaas"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Glenn McGrath holds the record with 71 wickets across four World Cup tournaments.",
    "detailedExplanation": "Australian fast bowler Glenn McGrath holds the record for most wickets taken across all Cricket World Cup tournaments, with 71 wickets from 39 matches across four World Cups (1996, 1999, 2003, 2007). McGrath was instrumental in Australia's three consecutive World Cup victories from 1999-2007. His closest competitor is Muttiah Muralitharan with 68 wickets. McGrath's consistency and longevity at the highest level, combined with Australia's deep runs in every tournament he played, contributed to this impressive tally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cricket_World_Cup_records",
    "citationTitle": "Wikipedia: Cricket World Cup records"
  },
  {
    "id": "066e1453-192c-4abc-9f95-a8f6f7a237be",
    "text": "In the 2019 Cricket World Cup final, what controversial rule decided the winner between England and New Zealand?",
    "options": [
      "Duckworth-Lewis method",
      "Most boundaries scored",
      "Most sixes hit",
      "Head-to-head record"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "After the match and Super Over both ended in ties, England won based on having scored more boundaries.",
    "detailedExplanation": "The 2019 Cricket World Cup final between England and New Zealand at Lord's ended in an extraordinary tie, with both teams scoring 241 runs. The match went to a Super Over, which also ended in a tie with both teams scoring 15 runs. According to ICC regulations, the winner was determined by the team that had scored the most boundaries during the match. England had hit 26 boundaries compared to New Zealand's 17, making them world champions. This rule was widely criticized and has since been changed by the ICC.",
    "citationUrl": "https://en.wikipedia.org/wiki/2019_Cricket_World_Cup_Final",
    "citationTitle": "Wikipedia: 2019 Cricket World Cup Final"
  },
  {
    "id": "3a16ba2f-610c-42c1-9cf9-9436168275b3",
    "text": "Which country has hosted the Cricket World Cup the most times?",
    "options": [
      "England",
      "Australia",
      "India",
      "It's a tie between multiple countries"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "England, Australia, and India have each hosted the World Cup three times (including co-hosting).",
    "detailedExplanation": "Several countries are tied for hosting the Cricket World Cup the most times. England hosted in 1975, 1979, 1983, and 1999 (four times). Australia co-hosted in 1992 and hosted alone in 2015 (twice as main host, but also co-hosted 1992). India hosted in 1987 (co-host with Pakistan), 1996 (co-host with Pakistan and Sri Lanka), and 2011 (co-host with Sri Lanka and Bangladesh). When counting co-hosting arrangements, the numbers become complex, but England has been the sole or primary host most frequently.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cricket_World_Cup",
    "citationTitle": "Wikipedia: Cricket World Cup"
  },
  {
    "id": "2fe2ba13-0480-409b-b950-40bc13a87d9d",
    "text": "What was the lowest team total in Cricket World Cup history?",
    "options": [
      "Canada 36 vs Sri Lanka (2003)",
      "Canada 45 vs England (1979)",
      "Namibia 84 vs Australia (2003)",
      "Kenya 69 vs New Zealand (1996)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Canada was bowled out for just 36 runs against Sri Lanka in the 2003 World Cup.",
    "detailedExplanation": "Canada holds the unwanted record for the lowest team total in Cricket World Cup history, being dismissed for just 36 runs against Sri Lanka in Paarl, South Africa during the 2003 World Cup. Chaminda Vaas was the destroyer-in-chief, taking 6 wickets for 25 runs. The innings lasted only 18.4 overs, and Sri Lanka chased down the target in just 4.4 overs to win by 9 wickets. This remains one of the most one-sided matches in World Cup history and highlights the gulf in class between established and associate cricket nations.",
    "citationUrl": "https://en.wikipedia.org/wiki/2003_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2003 Cricket World Cup"
  },
  {
    "id": "3569a8c4-cd27-4189-bb0d-ea2e9c5734b4",
    "text": "Which player holds the record for the most dismissals (catches + stumpings) by a wicket-keeper in a single Cricket World Cup tournament?",
    "options": [
      "Adam Gilchrist (2007)",
      "MS Dhoni (2015)",
      "Mark Boucher (2003)",
      "Jos Buttler (2019)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Adam Gilchrist took 21 dismissals in the 2007 World Cup.",
    "detailedExplanation": "Australian wicket-keeper Adam Gilchrist set the record for most dismissals by a wicket-keeper in a single World Cup tournament during the 2007 edition in the West Indies, taking 21 dismissals (all catches). This performance helped Australia win their fourth World Cup title. Gilchrist's aggressive batting style combined with his exceptional glovework made him one of the most influential players in World Cup history.",
    "citationUrl": "https://en.wikipedia.org/wiki/2007_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2007 Cricket World Cup"
  },
  {
    "id": "c01b9c31-59d6-4816-a58e-bcd05d563567",
    "text": "Which unusual format was used for the 1992 Cricket World Cup that had never been used before in the tournament?",
    "options": [
      "Day/night matches with white ball",
      "Round-robin league format",
      "50-over matches instead of 60",
      "Powerplay restrictions"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 1992 World Cup was the first to use a round-robin format instead of group stages.",
    "detailedExplanation": "The 1992 Cricket World Cup in Australia and New Zealand was revolutionary in its format, being the first World Cup to use a single round-robin league where all nine teams played each other once, with the top four advancing to semi-finals. This tournament also introduced colored clothing, white balls, day/night matches, and fielding restrictions, but the round-robin format was the most significant structural change from previous tournaments that had used group stages.",
    "citationUrl": "https://en.wikipedia.org/wiki/1992_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 1992 Cricket World Cup"
  },
  {
    "id": "1d7aa97f-5d51-44e2-b734-a12a9b3da9f9",
    "text": "Which player scored the fastest century in Cricket World Cup history and in how many balls?",
    "options": [
      "AB de Villiers - 52 balls",
      "Glenn Maxwell - 51 balls",
      "Kevin O'Brien - 50 balls",
      "Corey Anderson - 36 balls"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Kevin O'Brien scored a century in 50 balls against England in 2011.",
    "detailedExplanation": "Irish batsman Kevin O'Brien holds the record for the fastest century in Cricket World Cup history, reaching the milestone in just 50 balls during Ireland's famous victory over England in the 2011 World Cup in Bangalore. His explosive innings of 113 from 63 balls helped Ireland chase down 328, completing one of the greatest upsets in World Cup history and eliminating the eventual runners-up England from the tournament.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kevin_O%27Brien_(cricketer)",
    "citationTitle": "Wikipedia: Kevin O'Brien (cricketer)"
  },
  {
    "id": "297c300a-2025-4e2e-9b94-0e6884268468",
    "text": "Which team reached the Cricket World Cup final on their tournament debut?",
    "options": [
      "New Zealand (1975)",
      "Sri Lanka (1996)",
      "Bangladesh (1999)",
      "Afghanistan (2019)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "New Zealand reached the final in their first World Cup appearance in 1975.",
    "detailedExplanation": "New Zealand achieved the remarkable feat of reaching the Cricket World Cup final in their very first tournament appearance in 1975 in England. Led by Glenn Turner, they defeated strong teams including India in the semi-final at Old Trafford before losing to the West Indies in the final at Lord's. This remains one of the most impressive debut performances in World Cup history, though Sri Lanka later won the tournament on their fifth attempt in 1996.",
    "citationUrl": "https://en.wikipedia.org/wiki/1975_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 1975 Cricket World Cup"
  },
  {
    "id": "a7c8a956-7464-40fe-b4a1-8ce2f3099611",
    "text": "What was unique about the 1996 Cricket World Cup final venue compared to all previous finals?",
    "options": [
      "It was the first final played under lights",
      "It was the first final outside England",
      "It was the first final in the subcontinent",
      "It was the first final with a reserve day"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 1996 final in Lahore was the first World Cup final held in the Indian subcontinent.",
    "detailedExplanation": "The 1996 Cricket World Cup final between Sri Lanka and Australia at Gaddafi Stadium in Lahore, Pakistan, was historic as it marked the first time a World Cup final was played in the Indian subcontinent. Previous finals had all been held in England (1975, 1979, 1983) or Australia (1992). This tournament was jointly hosted by India, Pakistan, and Sri Lanka, with Sri Lanka going on to win their first and only World Cup title in a thrilling final.",
    "citationUrl": "https://en.wikipedia.org/wiki/1996_Cricket_World_Cup_Final",
    "citationTitle": "Wikipedia: 1996 Cricket World Cup Final"
  },
  {
    "id": "1300351f-fbeb-4c37-a333-fb00a672f7e5",
    "text": "Which bowler achieved the rare feat of taking a hat-trick in a Cricket World Cup final?",
    "options": [
      "Chetan Sharma",
      "Saqlain Mushtaq",
      "Chaminda Vaas",
      "No one has achieved this"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "No bowler has ever taken a hat-trick in a Cricket World Cup final.",
    "detailedExplanation": "Despite numerous hat-tricks being taken throughout Cricket World Cup history, no bowler has ever achieved this feat in a World Cup final. Hat-tricks have been taken in World Cups by players like Chetan Sharma (1987), Saqlain Mushtaq (1999), and Chaminda Vaas (2003), among others, but the pressure and significance of the final has meant this particular milestone remains unachieved in cricket's biggest match.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Cricket_World_Cup_hat-tricks",
    "citationTitle": "Wikipedia: List of Cricket World Cup hat-tricks"
  },
  {
    "id": "deb04d46-5148-4cf4-b728-bdf1bfd4f6e0",
    "text": "Which Cricket World Cup saw the most number of participating teams?",
    "options": [
      "2007 (16 teams)",
      "2015 (14 teams)",
      "2019 (10 teams)",
      "2011 (14 teams)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 2007 World Cup in the West Indies featured 16 teams, the most ever.",
    "detailedExplanation": "The 2007 Cricket World Cup held in the West Indies featured the maximum number of participating teams in World Cup history with 16 nations competing. This expansion aimed to give more associate nations exposure to top-level cricket. However, the tournament faced criticism for its length (lasting 47 days) and early exits of traditional powerhouses India and Pakistan in the first round, leading to subsequent tournaments reducing the number of participants.",
    "citationUrl": "https://en.wikipedia.org/wiki/2007_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2007 Cricket World Cup"
  },
  {
    "id": "86d9da8c-d066-4051-b3eb-8ce242045369",
    "text": "Which captain lifted the Cricket World Cup trophy without playing in the final match?",
    "options": [
      "Mahendra Singh Dhoni",
      "Michael Clarke",
      "Graeme Smith",
      "No captain has missed the final"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Every World Cup winning captain has played in their team's final victory.",
    "detailedExplanation": "Throughout Cricket World Cup history, every winning captain has been present and played in their team's final victory. From Clive Lloyd's West Indies victories in 1975 and 1979, through to Eoin Morgan's England triumph in 2019, all successful captains have led from the front in the biggest match. This demonstrates the importance of leadership in cricket's premier tournament and the rarity of captains missing such crucial matches due to injury or other circumstances.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cricket_World_Cup",
    "citationTitle": "Wikipedia: Cricket World Cup"
  },
  {
    "id": "133c617f-6cc1-443b-bf26-a7bb3a4d8c00",
    "text": "Which two countries were stripped of their co-hosting rights for the 1987 Cricket World Cup, leading to the tournament being moved to India and Pakistan?",
    "options": [
      "England and Australia",
      "Sri Lanka and Bangladesh",
      "South Africa and Zimbabwe",
      "West Indies and New Zealand"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "England and Australia were originally chosen to co-host the 1987 World Cup but were stripped of hosting rights.",
    "detailedExplanation": "The 1987 Cricket World Cup was originally scheduled to be held in England and Australia as co-hosts. However, both countries were stripped of their hosting rights by the ICC due to various logistical and commercial disagreements. The tournament was subsequently moved to India and Pakistan, making it the first World Cup to be held outside England. This decision proved successful as the subcontinent provided enthusiastic crowds and excellent playing conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/1987_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 1987 Cricket World Cup"
  },
  {
    "id": "5dd66910-e8b5-4948-aa7d-4fc6962599ac",
    "text": "Which Cricket World Cup featured the controversial 'Super Six' stage format that eliminated teams based on head-to-head results carried forward from the group stage?",
    "options": [
      "1996 World Cup",
      "1999 World Cup",
      "2003 World Cup",
      "2007 World Cup"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 1999 Cricket World Cup in England introduced the controversial Super Six format.",
    "detailedExplanation": "The 1999 Cricket World Cup held in England introduced the complex 'Super Six' format, where the top three teams from each group advanced along with their points from matches against the other qualifying teams from their group. This format was widely criticized as confusing for spectators and unfair to some teams. The format meant that some teams had advantages over others in the Super Six stage based on their group stage performance against specific opponents, leading to its abandonment in subsequent tournaments.",
    "citationUrl": "https://en.wikipedia.org/wiki/1999_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 1999 Cricket World Cup"
  },
  {
    "id": "c19129a5-c4e2-4b34-b7a8-0735967cf731",
    "text": "Which Cricket World Cup holds the record for the longest gap between the opening ceremony and the first match?",
    "options": [
      "2011 World Cup",
      "2015 World Cup",
      "2019 World Cup",
      "2023 World Cup"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 2011 World Cup had a 3-day gap between the opening ceremony and first match.",
    "detailedExplanation": "The 2011 Cricket World Cup, held across India, Sri Lanka, and Bangladesh, featured an unusually long gap of three days between the opening ceremony in Dhaka on February 17, 2011, and the first match on February 19, 2011. This extended gap was due to logistical arrangements across the three host nations and the desire to have a grand opening ceremony that could be attended by dignitaries from all participating countries without interfering with match preparations.",
    "citationUrl": "https://en.wikipedia.org/wiki/2011_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2011 Cricket World Cup"
  },
  {
    "id": "b57e301c-fded-4927-afbb-93151a897e6f",
    "text": "Which player became the first to be dismissed for 'obstructing the field' in Cricket World Cup history during the 2015 tournament?",
    "options": [
      "Maxwell (Australia)",
      "Samaraweera (Sri Lanka)",
      "Starc (Australia)",
      "Jadeja (India)"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Thilan Samaraweera was the first player dismissed for obstructing the field in World Cup history in 2015.",
    "detailedExplanation": "During the 2015 Cricket World Cup, Sri Lankan batsman Thilan Samaraweera became the first player in World Cup history to be given out for 'obstructing the field.' This rare dismissal occurred during Sri Lanka's match against Australia when Samaraweera, while attempting a run, deliberately blocked the ball with his bat to prevent the wicket-keeper from collecting it cleanly. The Australian team appealed, and after consultation with the third umpire, Samaraweera was given out under Law 37 of cricket.",
    "citationUrl": "https://en.wikipedia.org/wiki/2015_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2015 Cricket World Cup"
  },
  {
    "id": "676626dc-2a49-48c0-ab16-cc6f967bf20f",
    "text": "Which Cricket World Cup was the first to implement the Decision Review System (DRS) throughout the entire tournament?",
    "options": [
      "2007 World Cup",
      "2011 World Cup",
      "2015 World Cup",
      "2019 World Cup"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 2011 Cricket World Cup was the first to feature DRS throughout the tournament.",
    "detailedExplanation": "The 2011 Cricket World Cup, held in India, Sri Lanka, and Bangladesh, was the first World Cup to implement the Decision Review System (DRS) comprehensively throughout the entire tournament. This technology allowed teams to challenge umpiring decisions using ball-tracking technology, Hot Spot thermal imaging, and ultra-slow-motion replays. The implementation was significant as it marked a major technological advancement in cricket officiating at the sport's premier tournament, though it also generated considerable debate about its accuracy and impact on the game's flow.",
    "citationUrl": "https://en.wikipedia.org/wiki/2011_Cricket_World_Cup",
    "citationTitle": "Wikipedia: 2011 Cricket World Cup"
  }
]