[
  {
    "id": "825cba9c-d8c9-4677-b67d-1eedf23aef82",
    "text": "The Venus de Milo, one of the most famous ancient Greek sculptures, was originally attributed to which ancient sculptor before modern scholarship questioned this attribution?",
    "options": [
      "Praxiteles",
      "Alexandros of Antioch",
      "Lysippos",
      "Polykleitos"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Modern inscriptions found near the statue identify Alexandros of Antioch as the sculptor.",
    "detailedExplanation": "The Venus de Milo was long thought to be a work of the Classical period, but archaeological evidence including inscribed fragments found near the sculpture in 1820 suggest it was created by Alexandros of Antioch during the Hellenistic period, around 130-100 BCE. This attribution shifted our understanding of the work from the Classical to the later Hellenistic period, though some scholars still debate the exact attribution and dating.",
    "citationUrl": "https://en.wikipedia.org/wiki/Venus_de_Milo",
    "citationTitle": "Wikipedia: Venus de Milo"
  },
  {
    "id": "e49cdc2a-3ff4-4d5d-bc41-1c53efd48810",
    "text": "Which ancient civilization created the first known use of the 'lost-wax' casting technique for creating bronze sculptures?",
    "options": [
      "Ancient Greeks",
      "Mesopotamians",
      "Ancient Egyptians",
      "Indus Valley Civilization"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The lost-wax technique was first developed by Mesopotamian craftsmen around 3500 BCE.",
    "detailedExplanation": "The lost-wax casting technique, also known as cire perdue, was pioneered by Mesopotamian metalworkers as early as 3500 BCE. This sophisticated process involves creating a wax model, covering it with clay, heating it to melt out the wax, then pouring molten bronze into the cavity. This technique allowed for much more detailed and complex bronze sculptures than previous methods and spread throughout the ancient world, becoming essential to Greek, Roman, and other civilizations' bronze-working traditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lost-wax_casting",
    "citationTitle": "Wikipedia: Lost-wax casting"
  },
  {
    "id": "8272fcbe-e6dd-4d8c-ba44-37b6cab6a534",
    "text": "The ancient Roman wall paintings found in Pompeii are classified into four distinct styles. What is the defining characteristic of the 'Fourth Style' (also called the Intricate Style)?",
    "options": [
      "Simple color blocks imitating marble",
      "Architectural illusions with fake windows and columns",
      "Ornate mythological scenes on plain backgrounds",
      "Fantastic architectural fantasies with delicate ornamental details"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Fourth Style combined architectural elements with elaborate decorative details and fantastical designs.",
    "detailedExplanation": "The Fourth Style of Roman wall painting, prevalent from around 50-79 CE until Pompeii's destruction, represented the most elaborate and decorative approach. It combined elements from previous styles but pushed them to fantastical extremes, featuring impossible architectural vistas, intricate ornamental patterns, delicate decorative motifs, and complex spatial illusions. This style often included floating architectural elements, elaborate candelabra-like structures, and highly detailed miniature scenes, creating walls that were essentially decorative fantasies rather than attempts at realistic representation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roman_wall_painting",
    "citationTitle": "Wikipedia: Roman wall painting"
  },
  {
    "id": "b3ea365e-3908-4dce-bfa0-7da712f01d27",
    "text": "The Lamassu, the monumental winged bull sculptures with human heads, were primarily used as guardian figures in which ancient Near Eastern empire?",
    "options": [
      "Babylonian Empire",
      "Assyrian Empire",
      "Persian Empire",
      "Hittite Empire"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Lamassu were most prominently used as palace guardians in the Assyrian Empire, particularly during the Neo-Assyrian period.",
    "detailedExplanation": "Lamassu sculptures reached their most iconic form during the Neo-Assyrian Empire (911-609 BCE), where they served as protective deities guarding the entrances to palaces and important buildings. These massive stone sculptures, combining a bull's body, eagle's wings, and human head, were particularly associated with rulers like Sargon II and Ashurbanipal. The most famous examples come from Assyrian sites like Khorsabad, Nimrud, and Nineveh. While similar protective creatures existed in other Mesopotamian cultures, the classic Lamassu form is distinctly Assyrian.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lamassu",
    "citationTitle": "Wikipedia: Lamassu"
  },
  {
    "id": "9db0edfc-0192-407e-bbe2-08b00584173b",
    "text": "The ancient Greek sculpture known as the 'Kritios Boy' is significant in art history for being the first example of what important development?",
    "options": [
      "Contrapposto stance",
      "Bronze casting technique",
      "Idealized proportions",
      "Emotional expression"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Kritios Boy demonstrates the first use of contrapposto, where the figure's weight shifts to one leg, creating a more naturalistic pose.",
    "detailedExplanation": "Created around 480 BCE, the Kritios Boy marks the transition from the Archaic to the Classical period in Greek sculpture by introducing contrapposto - a pose where the figure's weight rests on one leg while the other is relaxed, creating a subtle S-curve through the body. This was revolutionary because earlier Archaic kouroi stood rigidly with weight equally distributed on both feet. The contrapposto stance made figures appear more lifelike and dynamic, and this innovation became fundamental to Classical and later Western sculpture, influencing artistic representation for millennia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kritios_Boy",
    "citationTitle": "Wikipedia: Kritios Boy"
  },
  {
    "id": "175ecea4-7422-4199-969f-a6aea65051f7",
    "text": "In ancient Egyptian art, the hieratic scale was used to show relative importance of figures. What color was traditionally reserved for depicting the skin of gods and divine pharaohs?",
    "options": [
      "Gold",
      "Blue",
      "Red",
      "Black"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Blue skin indicated divinity in Egyptian art, distinguishing gods and deified pharaohs from mortal humans.",
    "detailedExplanation": "In ancient Egyptian artistic conventions, blue skin was reserved for depicting gods, goddesses, and pharaohs in their divine aspect. This color choice was deeply symbolic - blue represented the heavens, eternity, and the divine realm. Gods like Amun were often shown with blue skin, and pharaohs might be depicted with blue skin when shown in their role as living gods. This was part of the Egyptian color symbolism where different hues carried specific religious and cultural meanings, with red-brown typically used for men's skin, yellow for women's skin, and blue reserved for the divine.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_of_ancient_Egypt",
    "citationTitle": "Wikipedia: Art of ancient Egypt"
  },
  {
    "id": "0287726a-e225-4ad0-b2d1-bda111d47cf5",
    "text": "The ancient Greek red-figure pottery technique, which replaced black-figure pottery, was invented around 530 BCE by which potter?",
    "options": [
      "Exekias",
      "Andokides Painter",
      "Euphronios",
      "Douris"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Andokides Painter is credited with inventing the red-figure technique around 530 BCE.",
    "detailedExplanation": "The red-figure technique revolutionized Greek pottery decoration around 530 BCE and is attributed to an anonymous artist known as the Andokides Painter, named after the potter Andokides whose workshop he worked in. This technique reversed the earlier black-figure method - instead of painting figures in black silhouette on red clay, the background was painted black, leaving figures in the natural red color of the clay. This allowed for much greater detail and more naturalistic representation, as artists could use brush strokes to add internal details rather than having to incise them. The technique quickly gained popularity and dominated Greek pottery for the next two centuries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Red-figure_pottery",
    "citationTitle": "Wikipedia: Red-figure pottery"
  },
  {
    "id": "27ff0810-79f5-498e-b9cb-65ff0981282e",
    "text": "The Ishtar Gate, famous for its brilliant blue glazed bricks and relief sculptures of dragons and bulls, was built in which ancient city?",
    "options": [
      "Persepolis",
      "Babylon",
      "Nineveh",
      "Mari"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Ishtar Gate was built in Babylon during the reign of Nebuchadnezzar II around 575 BCE.",
    "detailedExplanation": "The Ishtar Gate was constructed in ancient Babylon around 575 BCE during the Neo-Babylonian Empire under Nebuchadnezzar II. This magnificent structure served as the main entrance to the inner city of Babylon and was dedicated to the Mesopotamian goddess Ishtar. The gate was famous for its stunning blue glazed bricks decorated with relief sculptures of dragons (representing Marduk), bulls (representing Adad), and lions (representing Ishtar). The gate's sophisticated glazing technique and artistic program represented the height of Neo-Babylonian architectural achievement. Today, a reconstruction can be seen in Berlin's Pergamon Museum.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ishtar_Gate",
    "citationTitle": "Wikipedia: Ishtar Gate"
  },
  {
    "id": "561ede29-91b6-4b89-9175-ac1cb6099a3e",
    "text": "The Standard of Ur, a Sumerian artifact from around 2600-2400 BCE, depicts scenes of war and peace using which distinctive artistic technique?",
    "options": [
      "Mosaic inlay with lapis lazuli and shell",
      "Carved relief in limestone",
      "Bronze casting with gold leaf",
      "Painted fresco on plaster"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Standard of Ur uses mosaic inlay technique with lapis lazuli, shell, and red limestone.",
    "detailedExplanation": "The Standard of Ur, discovered in the Royal Cemetery at Ur by Leonard Woolley, is one of the earliest examples of narrative art from Mesopotamia. The artifact uses an intricate mosaic technique where small pieces of lapis lazuli (for blue areas), shell (for white/light areas), and red limestone are set into a bitumen base. This technique creates vivid scenes showing Sumerian society, with one side depicting a banquet (peace) and the other showing military scenes (war). The use of lapis lazuli, imported from Afghanistan, demonstrates the extensive trade networks of ancient Sumer.",
    "citationUrl": "https://en.wikipedia.org/wiki/Standard_of_Ur",
    "citationTitle": "Wikipedia: Standard of Ur"
  },
  {
    "id": "059bd27c-453c-4848-8f86-605a03721f79",
    "text": "The ancient Greek sculptor Polykleitos created a theoretical treatise called the 'Canon' which established mathematical proportions for the ideal human body. What ratio did he use for the head-to-body proportion?",
    "options": [
      "1:7",
      "1:8",
      "1:6",
      "1:9"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Polykleitos established the ideal head-to-body ratio as 1:7 in his Canon.",
    "detailedExplanation": "Polykleitos of Argos (5th century BCE) developed the 'Canon,' both a theoretical treatise and a sculpture (the Doryphoros or Spear-Bearer) that demonstrated his mathematical approach to human proportions. His system established that the ideal human figure should be seven head-lengths tall, with specific ratios governing all body parts. This canon became fundamental to Classical Greek sculpture and influenced Roman art. The system was based on the principle of symmetria (commensurability), where every part related mathematically to every other part and to the whole, creating what Greeks considered perfect harmony and beauty.",
    "citationUrl": "https://en.wikipedia.org/wiki/Polykleitos",
    "citationTitle": "Wikipedia: Polykleitos"
  },
  {
    "id": "42393fdd-bf3e-4606-84b8-3e3ee3a49d93",
    "text": "The cave paintings at Lascaux, dating to approximately 17,000 years ago, demonstrate sophisticated artistic techniques. Which pigment was NOT used by Paleolithic artists at Lascaux?",
    "options": [
      "Ultramarine blue",
      "Iron oxide red",
      "Manganese black",
      "Yellow ochre"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Ultramarine blue was not available to Paleolithic artists; it was first created in the medieval period.",
    "detailedExplanation": "The Lascaux cave paintings, created during the Upper Paleolithic period, used a limited but effective palette of natural mineral pigments available to prehistoric artists. Iron oxide provided various shades of red and brown, manganese dioxide created blacks, and yellow ochre supplied yellows. Ultramarine blue, however, was first synthesized from lapis lazuli in medieval times and was unknown to Paleolithic artists. The Lascaux artists achieved remarkable effects using these earth pigments, often blown through hollow bones or applied with primitive brushes, creating the stunning animal depictions that make these caves a masterpiece of prehistoric art.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lascaux",
    "citationTitle": "Wikipedia: Lascaux"
  },
  {
    "id": "8be83e2e-6f2d-47f7-a7a3-015d2524e1df",
    "text": "The Parthenon sculptures, also known as the Elgin Marbles, were created under the supervision of which ancient Greek sculptor?",
    "options": [
      "Phidias",
      "Praxiteles",
      "Myron",
      "Lysippos"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Phidias supervised the sculptural decoration of the Parthenon, including the famous frieze and pediment sculptures.",
    "detailedExplanation": "Phidias (c. 480-430 BCE) was the master sculptor who oversaw the artistic program of the Parthenon during Pericles' building campaign in Athens. He supervised the creation of the pediment sculptures, the continuous frieze depicting the Panathenaic procession, and the metopes showing battles between Greeks and their enemies. Phidias also created the massive chryselephantine (gold and ivory) statue of Athena Parthenos that stood inside the temple. His workshop system and artistic vision established the High Classical style that became the pinnacle of ancient Greek sculptural achievement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Phidias",
    "citationTitle": "Wikipedia: Phidias"
  },
  {
    "id": "28c084bc-9f03-46a9-85a4-7cc8451e5fd4",
    "text": "The ancient Persian relief sculptures at Persepolis primarily served what function in the Achaemenid Empire?",
    "options": [
      "To display the tribute-bearing processions of subject nations",
      "To record military victories over Greek city-states",
      "To illustrate Persian religious mythology",
      "To commemorate royal hunting expeditions"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Persepolis reliefs mainly depicted representatives from various nations bringing tribute to the Persian king.",
    "detailedExplanation": "The relief sculptures at Persepolis, built by Darius I and his successors (515-330 BCE), served as a monumental display of Persian imperial power and diversity. The Apadana staircase reliefs show delegations from 23 different nations of the empire bringing tribute gifts to the Persian king during the Nowruz (New Year) celebration. Each delegation is depicted with ethnically distinct clothing, hairstyles, and gifts representative of their region - from Scythian gold vessels to Arabian camels to Indian elephants. These reliefs functioned as both artistic achievement and political propaganda, demonstrating the vast reach and wealth of the Persian Empire to visitors from across the known world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Persepolis",
    "citationTitle": "Wikipedia: Persepolis"
  },
  {
    "id": "5f23a720-b0dc-4486-b287-48c335f8fa41",
    "text": "The ancient Roman technique of opus sectile, used in floor and wall decoration, differs from mosaic in what primary way?",
    "options": [
      "It uses large cut pieces of colored stone rather than small tesserae",
      "It employs only geometric patterns instead of figurative designs",
      "It uses painted plaster instead of stone materials",
      "It creates raised relief surfaces instead of flat ones"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Opus sectile used large, precisely cut pieces of colored marble and stone, unlike the small tesserae of traditional mosaics.",
    "detailedExplanation": "Opus sectile (literally 'cut work') was a luxury decorative technique used in ancient Rome from the 1st century CE onward. Unlike traditional mosaics which used small, uniform tesserae, opus sectile employed large pieces of colored marble, porphyry, and other precious stones cut into specific shapes to create patterns and images. The stones were cut and fitted together like a jigsaw puzzle, often creating sophisticated geometric designs or figurative scenes. This technique required exceptional skill and expensive materials, making it a symbol of wealth and status. Famous examples survive in the Basilica of Junius Bassus and various Roman villas, demonstrating the high level of craftsmanship achieved by Roman artisans.",
    "citationUrl": "https://en.wikipedia.org/wiki/Opus_sectile",
    "citationTitle": "Wikipedia: Opus sectile"
  },
  {
    "id": "983489c6-8d70-4191-97c6-63754e56e1cc",
    "text": "The Cycladic figurines from the Aegean islands (3200-2000 BCE) are characterized by their distinctive style. What is the most common type of these marble sculptures?",
    "options": [
      "Standing female figures with folded arms",
      "Seated male harp players",
      "Reclining warriors with shields",
      "Standing mother and child groups"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The folded-arm female figurines represent about 90% of all known Cycladic sculptures.",
    "detailedExplanation": "Cycladic art from the Bronze Age Aegean is dominated by the distinctive folded-arm female figurines, which constitute roughly 90% of all surviving Cycladic sculptures. These marble figures, ranging from a few inches to life-size, typically show nude female forms with arms folded beneath the breasts, heads tilted back, and highly abstracted features. The purpose of these figurines remains debated - they may have been fertility symbols, goddess figures, or funerary objects. Their stark, minimalist aesthetic profoundly influenced modern artists like Picasso, Modigliani, and Brancusi, who admired their simplified forms and geometric precision.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cycladic_art",
    "citationTitle": "Wikipedia: Cycladic art"
  },
  {
    "id": "84b32657-c74c-4a57-944d-2e21d9c967cb",
    "text": "The ancient Chinese bronze ritual vessels of the Shang Dynasty (c. 1600-1046 BCE) often featured which distinctive decorative motif?",
    "options": [
      "Taotie mask designs",
      "Dragon and phoenix pairs",
      "Bamboo grove patterns",
      "Mountain landscape scenes"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The taotie, a stylized monster mask design, was the most characteristic decorative motif on Shang Dynasty bronzes.",
    "detailedExplanation": "The taotie (literally 'glutton') is a distinctive artistic motif that dominated Shang Dynasty bronze decoration. This stylized mask design features prominent eyes, often bulging or spiral-shaped, with various interpretations of horns, fangs, and other monstrous features. The taotie typically appears as a frontal face that can also be read as two profile dragons facing each other. These designs were cast into ritual bronze vessels like ding (tripod cauldrons) and gui (food containers) used in ancestral worship ceremonies. The taotie motif may have represented protective spirits or mythological creatures, and its complex, symmetrical designs demonstrate the sophisticated bronze-casting techniques developed during the Shang period.",
    "citationUrl": "https://en.wikipedia.org/wiki/Taotie",
    "citationTitle": "Wikipedia: Taotie"
  },
  {
    "id": "66edf995-8c68-42fe-adec-8e76a5112376",
    "text": "The ancient Etruscan bronze sculpture known as the 'Chimera of Arezzo' depicts a mythological creature with the body of a lion, a goat's head on its back, and which distinctive feature as its tail?",
    "options": [
      "A serpent's head",
      "A fish's tail",
      "An eagle's head",
      "A ram's horn"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Chimera of Arezzo has a serpent's head as its tail, completing the three-part mythological beast.",
    "detailedExplanation": "The Chimera of Arezzo, dating to the 4th century BCE, is one of the finest examples of Etruscan bronze work. This mythological creature combines three animals: a lion's body, a goat emerging from its back, and a serpent forming its tail. The sculpture demonstrates the Etruscans' sophisticated metalworking skills and their adoption of Greek mythological themes. The bronze shows remarkable detail in the musculature and fierce expression, and originally had inlaid eyes that would have made it even more lifelike.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chimera_of_Arezzo",
    "citationTitle": "Wikipedia: Chimera of Arezzo"
  },
  {
    "id": "196fd0e8-341d-4dea-9e26-8ddb534d22ca",
    "text": "The ancient Maya developed a unique blue pigment that has proven remarkably resistant to fading over centuries. This 'Maya Blue' was created by combining indigo dye with which specific clay mineral?",
    "options": [
      "Kaolinite",
      "Palygorskite",
      "Montmorillonite",
      "Illite"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Maya Blue was created by combining indigo with palygorskite clay, creating an incredibly stable pigment.",
    "detailedExplanation": "Maya Blue is one of the most remarkable pigments in ancient art history, created by the Maya civilization through a sophisticated process of combining organic indigo dye with palygorskite clay (also known as attapulgite). This unique combination created a hybrid pigment that is extraordinarily resistant to acids, alkalis, and fading - so much so that modern scientists have studied it to understand how ancient peoples achieved such chemical stability. The pigment was used extensively in Maya murals, pottery, and codices, and its durability has allowed many of these artworks to retain their vibrant blue color even after more than a thousand years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maya_blue",
    "citationTitle": "Wikipedia: Maya blue"
  },
  {
    "id": "5ee8d427-b208-48e7-ab00-975f75cec3ed",
    "text": "The colossal Olmec heads found in Mexico, some weighing up to 50 tons, were carved from basalt transported from volcanic sources located how far from their final locations?",
    "options": [
      "5-10 miles",
      "25-50 miles",
      "60-100 miles",
      "150-200 miles"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Olmec transported massive basalt blocks 60-100 miles from volcanic sources to carve their colossal heads.",
    "detailedExplanation": "The Olmec colossal heads, created between 1500-400 BCE, represent one of the most impressive logistical achievements in ancient art. These monumental sculptures, depicting what are believed to be Olmec rulers, were carved from basalt obtained from the Tuxtla Mountains and transported 60-100 miles to sites like La Venta and San Lorenzo. The transportation of these multi-ton blocks across difficult terrain without wheeled vehicles or large domesticated animals demonstrates the Olmec's sophisticated organizational capabilities and the immense cultural importance these sculptures held in their society.",
    "citationUrl": "https://en.wikipedia.org/wiki/Olmec_colossal_heads",
    "citationTitle": "Wikipedia: Olmec colossal heads"
  },
  {
    "id": "bab4a9bf-1599-47c6-9a02-a39a4eac4592",
    "text": "The ancient Indian Buddhist art style that emerged in the Gandhara region showed strong influence from which artistic tradition, resulting in Buddha figures with distinctly non-Indian facial features?",
    "options": [
      "Persian",
      "Hellenistic Greek",
      "Chinese",
      "Scythian"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Gandhara art showed strong Hellenistic Greek influence, creating Buddha images with Mediterranean facial features.",
    "detailedExplanation": "Gandhara art, which flourished from the 1st to 5th centuries CE in present-day Pakistan and Afghanistan, represents a unique fusion of Buddhist religious themes with Hellenistic artistic traditions. This synthesis occurred due to the region's history under Alexander the Great and subsequent Greek kingdoms. Gandhara Buddha sculptures are immediately recognizable for their distinctly Mediterranean features - wavy hair, straight noses, and naturalistic drapery reminiscent of Greek and Roman sculpture. This artistic style spread along trade routes and significantly influenced Buddhist art throughout Central Asia, creating some of the earliest anthropomorphic representations of the Buddha.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gandhara_art",
    "citationTitle": "Wikipedia: Gandhara art"
  }
]