[
  {
    "id": "dbdd48f8-3540-4462-96f3-f45b29069c01",
    "text": "Which German composer wrote the famous 'Ode to Joy' featured in his 9th Symphony?",
    "options": [
      "Ludwig van Beethoven",
      "Johann Sebastian Bach",
      "Wolfgang Amadeus Mozart",
      "Franz Schubert"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Beethoven's 9th Symphony includes 'Ode to Joy' in its final movement.",
    "detailedExplanation": "Ludwig van Beethoven composed his Symphony No. 9 in D minor, Op. 125, between 1822 and 1824. The final movement features the famous 'Ode to Joy' theme, based on Friedrich Schiller's poem. This symphony was groundbreaking as it was the first major symphony to include vocals, with a full choir singing in the finale. The 'Ode to Joy' melody has become one of the most recognizable pieces in classical music and serves as the anthem of the European Union.",
    "citationUrl": "https://en.wikipedia.org/wiki/Symphony_No._9_(Beethoven)",
    "citationTitle": "Wikipedia: Symphony No. 9 (Beethoven)"
  },
  {
    "id": "b3f15c9f-c76b-440d-8b88-4c6e11788661",
    "text": "Which composer is known as 'The King of Waltz'?",
    "options": [
      "Franz Liszt",
      "Johann Strauss II",
      "Frédéric Chopin",
      "Robert Schumann"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Johann Strauss II earned this title for his numerous popular waltzes including 'The Blue Danube'.",
    "detailedExplanation": "Johann Strauss II (1825-1899) was an Austrian composer who became famous throughout Europe for his waltzes, polkas, and operettas. He composed over 500 waltzes, polkas, quadrilles, and other types of dance music, as well as several operettas and a ballet. His most famous waltz, 'An der schönen blauen Donau' (The Blue Danube), composed in 1866, became Austria's unofficial national anthem and one of the most popular pieces of classical music ever written.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johann_Strauss_II",
    "citationTitle": "Wikipedia: Johann Strauss II"
  },
  {
    "id": "8fc36381-ca04-4f5e-83f4-66cf6af4f3ff",
    "text": "At what age did Mozart die?",
    "options": [
      "27",
      "31",
      "35",
      "42"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Wolfgang Amadeus Mozart died in 1791 at the young age of 35.",
    "detailedExplanation": "Wolfgang Amadeus Mozart was born on January 27, 1756, and died on December 5, 1791, making him 35 years old at the time of his death. Despite his short life, Mozart composed over 600 works, including symphonies, concertos, chamber music, and operas. His early death in Vienna remains somewhat mysterious, with various theories about the cause ranging from rheumatic fever to poisoning, though modern medical analysis suggests he likely died from acute rheumatic fever.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wolfgang_Amadeus_Mozart",
    "citationTitle": "Wikipedia: Wolfgang Amadeus Mozart"
  },
  {
    "id": "f73f69aa-2eca-4f57-8d8e-5c7a85ea5f4f",
    "text": "Which composer wrote 'The Four Seasons'?",
    "options": [
      "George Handel",
      "Antonio Vivaldi",
      "Johann Pachelbel",
      "Claudio Monteverdi"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Antonio Vivaldi composed 'The Four Seasons', a set of four violin concertos representing each season.",
    "detailedExplanation": "Antonio Vivaldi (1678-1741) was an Italian Baroque composer who wrote 'Le quattro stagioni' (The Four Seasons) around 1720. This collection consists of four violin concertos, each representing a different season of the year. Each concerto is accompanied by a sonnet, possibly written by Vivaldi himself, describing the scenes depicted in the music. The work is among the most popular pieces in the classical repertoire and showcases Vivaldi's innovative use of the violin and his ability to musically paint vivid natural scenes.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Four_Seasons_(Vivaldi)",
    "citationTitle": "Wikipedia: The Four Seasons (Vivaldi)"
  },
  {
    "id": "0074c118-987e-4ac5-91b5-d8f74973d75e",
    "text": "Which Russian composer wrote the ballet 'Swan Lake'?",
    "options": [
      "Igor Stravinsky",
      "Sergei Rachmaninoff",
      "Pyotr Ilyich Tchaikovsky",
      "Modest Mussorgsky"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tchaikovsky composed the music for the famous ballet 'Swan Lake' in 1875-1876.",
    "detailedExplanation": "Pyotr Ilyich Tchaikovsky (1840-1893) composed the music for 'Swan Lake' in 1875-1876, with the ballet premiering at Moscow's Bolshoi Theatre in 1877. Although initially not well-received, it later became one of the most performed ballets worldwide. Tchaikovsky also composed two other famous ballets, 'The Nutcracker' and 'Sleeping Beauty', establishing himself as one of the greatest ballet composers. The haunting melodies and dramatic orchestration of 'Swan Lake' perfectly capture the tragic story of Odette, the swan princess.",
    "citationUrl": "https://en.wikipedia.org/wiki/Swan_Lake",
    "citationTitle": "Wikipedia: Swan Lake"
  },
  {
    "id": "6933c3e1-324b-4263-af82-f279709863f1",
    "text": "Which composer is famous for his 'Unfinished Symphony'?",
    "options": [
      "Franz Schubert",
      "Johannes Brahms",
      "Anton Dvořák",
      "Gustav Mahler"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Franz Schubert's Symphony No. 8 in B minor is known as the 'Unfinished Symphony'.",
    "detailedExplanation": "Franz Schubert (1797-1828) composed his Symphony No. 8 in B minor, D. 759, in 1822, but left it incomplete with only two movements finished. The symphony remained unknown until 1865, when it was discovered and premiered, 37 years after Schubert's death. The reason why Schubert never completed the symphony remains a mystery, as he lived for six more years after starting it and completed other major works. Despite being unfinished, it is considered one of the greatest symphonies in the classical repertoire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Symphony_No._8_(Schubert)",
    "citationTitle": "Wikipedia: Symphony No. 8 (Schubert)"
  },
  {
    "id": "123de10b-534c-41bc-b53e-76e58680cf17",
    "text": "Which Baroque composer wrote 'The Well-Tempered Clavier'?",
    "options": [
      "Johann Sebastian Bach",
      "Georg Philipp Telemann",
      "Jean-Philippe Rameau",
      "Domenico Scarlatti"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Bach composed 'The Well-Tempered Clavier' as a collection of preludes and fugues in all 24 major and minor keys.",
    "detailedExplanation": "Johann Sebastian Bach (1685-1750) composed 'The Well-Tempered Clavier' in two books: Book I completed in 1722 and Book II in 1742. Each book contains 24 preludes and fugues, one in each of the 12 major and 12 minor keys. This collection was revolutionary as it demonstrated the musical possibilities of well-tempered tuning, allowing keyboard instruments to play in all keys. The work is considered essential study material for serious pianists and has been called the 'Old Testament' of keyboard literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Well-Tempered_Clavier",
    "citationTitle": "Wikipedia: The Well-Tempered Clavier"
  },
  {
    "id": "96ad7519-6ea6-4844-8483-1e9d6ef441b7",
    "text": "Which composer wrote the opera 'The Magic Flute'?",
    "options": [
      "Giuseppe Verdi",
      "Wolfgang Amadeus Mozart",
      "Richard Wagner",
      "Giacomo Puccini"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Mozart composed 'The Magic Flute' (Die Zauberflöte), one of his most popular operas.",
    "detailedExplanation": "Wolfgang Amadeus Mozart composed 'Die Zauberflöte' (The Magic Flute) in 1791, the same year he died. It was one of his last completed works and premiered on September 30, 1791, at the Freihaus-Theater auf der Wieden in Vienna. The opera is a Singspiel (a form of German comic opera) with spoken dialogue interspersed with musical numbers. It combines fairy tale elements with Masonic symbolism and features some of Mozart's most memorable music, including the Queen of the Night's famously challenging coloratura arias.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Magic_Flute",
    "citationTitle": "Wikipedia: The Magic Flute"
  },
  {
    "id": "6a3fc9c4-68a5-4c65-aa4c-df3aac9b7f05",
    "text": "Which composer was known as 'The Piano Poet' and wrote numerous nocturnes and études?",
    "options": [
      "Frédéric Chopin",
      "Franz Liszt",
      "Robert Schumann",
      "Johannes Brahms"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Frédéric Chopin was nicknamed 'The Piano Poet' for his expressive piano compositions.",
    "detailedExplanation": "Frédéric Chopin (1810-1849) was a Polish composer and virtuoso pianist who became known as 'The Piano Poet' due to his deeply expressive and lyrical approach to piano composition. He wrote extensively for the piano, creating masterful nocturnes, études, polonaises, and mazurkas that combined technical brilliance with emotional depth. His works remain central to the piano repertoire and showcase his ability to create poetry through music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fr%C3%A9d%C3%A9ric_Chopin",
    "citationTitle": "Wikipedia: Frédéric Chopin"
  },
  {
    "id": "0b4fc4c5-c8ba-4951-9684-d73bb3cf6e33",
    "text": "Which composer wrote the famous 'Carnival of the Animals'?",
    "options": [
      "Claude Debussy",
      "Camille Saint-Saëns",
      "Gabriel Fauré",
      "Maurice Ravel"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Camille Saint-Saëns composed 'The Carnival of the Animals' as a humorous musical suite.",
    "detailedExplanation": "Camille Saint-Saëns (1835-1921) was a French composer who wrote 'Le Carnaval des animaux' (The Carnival of the Animals) in 1886. This whimsical orchestral suite features 14 movements, each representing different animals through music, including the famous 'Swan' movement. Saint-Saëns originally wrote it as a private musical joke for friends and initially forbade public performance of most movements during his lifetime, fearing it would damage his reputation as a serious composer.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Carnival_of_the_Animals",
    "citationTitle": "Wikipedia: The Carnival of the Animals"
  },
  {
    "id": "181dccfa-112a-491c-a701-5271c284c6ba",
    "text": "Which composer's hearing began to deteriorate when he was in his late twenties?",
    "options": [
      "Johann Sebastian Bach",
      "Ludwig van Beethoven",
      "Wolfgang Amadeus Mozart",
      "Franz Joseph Haydn"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Ludwig van Beethoven began losing his hearing in his late twenties but continued composing.",
    "detailedExplanation": "Ludwig van Beethoven (1770-1827) began experiencing hearing loss around 1798, when he was approximately 28 years old. This progressive deafness was devastating for the composer and performer, leading him to contemplate suicide as expressed in his famous Heiligenstadt Testament. However, he continued to compose some of his greatest works while deaf, including his later symphonies, string quartets, and piano sonatas, demonstrating remarkable resilience and artistic dedication.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ludwig_van_Beethoven",
    "citationTitle": "Wikipedia: Ludwig van Beethoven"
  },
  {
    "id": "4f9dc378-04fa-4a37-b18a-7fce959fdea9",
    "text": "Which Italian composer is famous for his opera 'La Traviata'?",
    "options": [
      "Giacomo Puccini",
      "Gioachino Rossini",
      "Giuseppe Verdi",
      "Gaetano Donizetti"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Giuseppe Verdi composed the popular opera 'La Traviata' in 1853.",
    "detailedExplanation": "Giuseppe Verdi (1813-1901) was an Italian opera composer who wrote 'La Traviata' in 1853. Based on Alexandre Dumas' novel 'La Dame aux Camélias,' the opera tells the tragic love story of Violetta and Alfredo. It premiered at La Fenice in Venice and is now one of the most frequently performed operas worldwide. Verdi was a master of Italian opera, creating emotionally powerful works that combined memorable melodies with dramatic storytelling.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_traviata",
    "citationTitle": "Wikipedia: La traviata"
  },
  {
    "id": "8d9a70dd-5b66-4c76-a483-175a4c205002",
    "text": "Which composer wrote 'Pictures at an Exhibition'?",
    "options": [
      "Modest Mussorgsky",
      "Nikolai Rimsky-Korsakov",
      "Alexander Borodin",
      "César Cui"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Modest Mussorgsky composed 'Pictures at an Exhibition' as a piano suite in 1874.",
    "detailedExplanation": "Modest Mussorgsky (1839-1881) composed 'Pictures at an Exhibition' in 1874 as a suite for solo piano. The work was inspired by an exhibition of artworks by his friend Viktor Hartmann, who had died the previous year. Each movement depicts a different painting or architectural design. The piece is famous for its recurring 'Promenade' theme and has been orchestrated by many composers, most famously by Maurice Ravel in 1922, making it widely known in both piano and orchestral versions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pictures_at_an_Exhibition",
    "citationTitle": "Wikipedia: Pictures at an Exhibition"
  },
  {
    "id": "e21521b4-18a1-44b1-9363-eede70b37137",
    "text": "Which composer was born in Salzburg, Austria in 1756?",
    "options": [
      "Franz Schubert",
      "Wolfgang Amadeus Mozart",
      "Joseph Haydn",
      "Ludwig van Beethoven"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Wolfgang Amadeus Mozart was born in Salzburg in 1756.",
    "detailedExplanation": "Wolfgang Amadeus Mozart (1756-1791) was born in Salzburg, which was then an independent archbishopship within the Holy Roman Empire (now part of Austria). He was born to Leopold Mozart, a composer and music teacher, and Anna Maria Mozart. Salzburg played a significant role in Mozart's early life and career, as he served the Archbishop of Salzburg as a court musician before eventually breaking free to pursue an independent career in Vienna.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wolfgang_Amadeus_Mozart",
    "citationTitle": "Wikipedia: Wolfgang Amadeus Mozart"
  },
  {
    "id": "7edf94e6-e706-46b7-930d-99662e920d97",
    "text": "Which composer wrote the famous 'Ride of the Valkyries'?",
    "options": [
      "Richard Strauss",
      "Richard Wagner",
      "Gustav Mahler",
      "Anton Bruckner"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Richard Wagner composed 'Ride of the Valkyries' as part of his opera 'Die Walküre'.",
    "detailedExplanation": "Richard Wagner (1813-1883) composed 'Ride of the Valkyries' ('Ritt der Walküren' in German) as the prelude to Act III of his opera 'Die Walküre,' which is part of his four-opera cycle 'Der Ring des Nibelungen.' This powerful orchestral piece depicts the Valkyries, warrior maidens from Norse mythology, riding their flying horses to collect fallen heroes from the battlefield. The dramatic and instantly recognizable music has become one of classical music's most famous pieces.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ride_of_the_Valkyries",
    "citationTitle": "Wikipedia: Ride of the Valkyries"
  },
  {
    "id": "cf42e77e-9b01-4899-a447-15cd72afd777",
    "text": "Which Romantic era composer is known for his Hungarian Rhapsodies?",
    "options": [
      "Franz Liszt",
      "Béla Bartók",
      "Zoltán Kodály",
      "Franz Schubert"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Franz Liszt composed 19 Hungarian Rhapsodies, with No. 2 being the most famous.",
    "detailedExplanation": "Franz Liszt (1811-1886) was a Hungarian composer and pianist who wrote 19 Hungarian Rhapsodies between 1846 and 1885. These virtuosic piano pieces were inspired by Hungarian folk music and Romani music that Liszt encountered during his travels. Hungarian Rhapsody No. 2 in C-sharp minor is the most famous and frequently performed. These works showcase Liszt's exceptional pianistic skills and his ability to incorporate folk elements into classical compositions, making them both technically challenging and emotionally stirring.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hungarian_Rhapsodies",
    "citationTitle": "Wikipedia: Hungarian Rhapsodies"
  },
  {
    "id": "bd1cdc57-d28e-423b-8025-e5101b2b2527",
    "text": "Which composer wrote the famous funeral march that is commonly played at state funerals and solemn occasions?",
    "options": [
      "Chopin",
      "Brahms",
      "Mahler",
      "Debussy"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Chopin composed the famous funeral march in his Piano Sonata No. 2 in B-flat minor.",
    "detailedExplanation": "Frédéric Chopin's Piano Sonata No. 2 in B-flat minor, Op. 35, contains one of the most recognizable funeral marches in classical music. The third movement, marked 'Marche funèbre: Lento,' has become synonymous with death and mourning, frequently performed at state funerals and memorial services. The haunting melody in B-flat minor has transcended its original piano setting and been arranged for orchestras and military bands worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Piano_Sonata_No._2_(Chopin)",
    "citationTitle": "Wikipedia: Piano Sonata No. 2 (Chopin)"
  },
  {
    "id": "60d386bf-b052-4821-ad42-64429430634f",
    "text": "Which composer is known for creating the musical form called the 'symphonic poem'?",
    "options": [
      "Richard Strauss",
      "Franz Liszt",
      "Hector Berlioz",
      "César Franck"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Franz Liszt invented and named the symphonic poem, a single-movement orchestral work that tells a story or paints a picture.",
    "detailedExplanation": "Franz Liszt pioneered the symphonic poem (also called tone poem) in the 1850s, creating a new orchestral form that broke away from traditional multi-movement symphonies. These single-movement works were designed to evoke extra-musical ideas, stories, or images through purely instrumental music. Liszt composed 13 symphonic poems, including famous works like 'Les Préludes' and 'Mazeppa,' influencing later composers like Richard Strauss and Bedřich Smetana to adopt and expand upon this innovative form.",
    "citationUrl": "https://en.wikipedia.org/wiki/Symphonic_poem",
    "citationTitle": "Wikipedia: Symphonic poem"
  },
  {
    "id": "bafe8547-bd5c-44ee-88a5-c0089dc62b96",
    "text": "Which Italian Baroque composer is famous for writing over 500 concertos, many featuring unusual solo instruments?",
    "options": [
      "Arcangelo Corelli",
      "Antonio Vivaldi",
      "Domenico Scarlatti",
      "Giovanni Battista Pergolesi"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Antonio Vivaldi composed approximately 500 concertos for a wide variety of instruments during the Baroque period.",
    "detailedExplanation": "Antonio Vivaldi was extraordinarily prolific in writing concertos, composing around 500 during his lifetime. While 'The Four Seasons' is his most famous work, Vivaldi wrote concertos for an remarkable array of solo instruments including mandolin, lute, viola d'amore, recorder, oboe, bassoon, trumpet, and even unusual combinations like multiple violins or mixed ensembles. His innovative approach to the concerto form and his work as a violin teacher at the Ospedale della Pietà in Venice allowed him to experiment with different instrumental colors and virtuosic techniques.",
    "citationUrl": "https://en.wikipedia.org/wiki/Antonio_Vivaldi",
    "citationTitle": "Wikipedia: Antonio Vivaldi"
  },
  {
    "id": "8ee63b8e-116a-40c8-9d95-682dd9c70359",
    "text": "Which French composer wrote the opera 'Carmen'?",
    "options": [
      "Georges Bizet",
      "Jules Massenet",
      "Charles Gounod",
      "Jacques Offenbach"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Georges Bizet composed the opera 'Carmen,' which premiered in 1875 and became one of the most popular operas ever written.",
    "detailedExplanation": "Georges Bizet composed 'Carmen' in 1874, with its premiere at the Opéra-Comique in Paris on March 3, 1875. Initially, the opera shocked audiences with its realistic portrayal of working-class characters and themes of lawlessness and passion. Tragically, Bizet died just three months after the premiere, never knowing that 'Carmen' would become one of the most frequently performed operas in history. The opera features famous arias like the 'Habanera' and the 'Toreador Song,' and its Spanish-influenced music has captivated audiences worldwide for nearly 150 years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Carmen",
    "citationTitle": "Wikipedia: Carmen"
  }
]