[
  {
    "id": "09159dfe-4240-429b-a86d-cd8f65d5ae9a",
    "text": "Which Classical composer was known to have suffered from what is now believed to be Tourette's syndrome, exhibiting involuntary tics and vocalizations?",
    "options": [
      "Wolfgang Amadeus Mozart",
      "Ludwig van Beethoven",
      "Franz Schubert",
      "Joseph Haydn"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Mozart exhibited behaviors consistent with Tourette's syndrome, including facial tics and compulsive use of scatological language.",
    "detailedExplanation": "Historical accounts describe Mozart as having involuntary facial movements, tics, and a compulsive use of crude language in both speech and correspondence. Modern medical analysis of these documented behaviors suggests he may have suffered from Tourette's syndrome. His letters to his cousin Maria Anna Thekla Mozart are filled with scatological humor and wordplay that goes beyond mere juvenile behavior, indicating possible coprolalia associated with the condition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wolfgang_Amadeus_Mozart",
    "citationTitle": "Wikipedia: Wolfgang Amadeus Mozart"
  },
  {
    "id": "ee1945ee-0dce-4b30-b855-29e55db6b455",
    "text": "Which composer's final symphony remained unfinished with only two complete movements, leading to numerous attempts by other composers to complete it?",
    "options": [
      "Gustav Mahler",
      "Franz Schubert",
      "Anton Bruckner",
      "Robert Schumann"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Schubert's Symphony No. 8 in B minor, known as the 'Unfinished Symphony,' has only two complete movements.",
    "detailedExplanation": "Franz Schubert's Symphony No. 8 in B minor, D. 759, composed in 1822, remains one of classical music's greatest mysteries. Only the first two movements were completed, with sketches existing for a third movement. The reason for its incompletion remains unknown, though theories range from Schubert's dissatisfaction with the work to his busy schedule with other compositions. The symphony wasn't discovered until 1865, decades after Schubert's death, and has inspired numerous completion attempts by composers including Brian Newbould and others.",
    "citationUrl": "https://en.wikipedia.org/wiki/Symphony_No._8_(Schubert)",
    "citationTitle": "Wikipedia: Symphony No. 8 (Schubert)"
  },
  {
    "id": "d6c4860f-aad3-4efc-b3fe-30fb404db099",
    "text": "Which Baroque composer was imprisoned for nearly a month in 1717 for demanding release from his employment with Duke Wilhelm Ernst?",
    "options": [
      "George Frideric Handel",
      "Johann Sebastian Bach",
      "Antonio Vivaldi",
      "Jean-Philippe Rameau"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bach was imprisoned by Duke Wilhelm Ernst in Weimar for demanding his release to accept a position with Prince Leopold.",
    "detailedExplanation": "In 1717, Johann Sebastian Bach was court organist and concertmaster to Duke Wilhelm Ernst of Saxe-Weimar. When he received an offer from Prince Leopold of Anhalt-Köthen for a better position as Kapellmeister, the Duke refused to release him from his contract. Bach persisted in his demands for release and was subsequently imprisoned from November 6 to December 2, 1717. During this imprisonment, he composed several works including parts of 'The Well-Tempered Clavier.' He was finally released and dismissed 'with notice of his unfavorable discharge.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Johann_Sebastian_Bach",
    "citationTitle": "Wikipedia: Johann Sebastian Bach"
  },
  {
    "id": "357c6b6a-92e8-427f-ac82-65adfbb4c75b",
    "text": "Which composer's only opera, 'Fidelio,' was originally titled 'Leonore' and underwent three different versions before reaching its final form?",
    "options": [
      "Franz Schubert",
      "Ludwig van Beethoven",
      "Robert Schumann",
      "Felix Mendelssohn"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Beethoven's opera 'Fidelio' was originally called 'Leonore' and was revised multiple times between 1805 and 1814.",
    "detailedExplanation": "Ludwig van Beethoven's only completed opera underwent a complicated genesis. Originally titled 'Leonore,' it premiered in 1805 to limited success, partly due to the French occupation of Vienna. Beethoven revised it in 1806, shortening it from three acts to two. The final version, retitled 'Fidelio,' premiered in 1814. The opera tells the story of Leonore, who disguises herself as a man named Fidelio to rescue her imprisoned husband. Beethoven composed four different overtures for the opera: three 'Leonore' overtures and the final 'Fidelio' overture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fidelio",
    "citationTitle": "Wikipedia: Fidelio"
  },
  {
    "id": "e3926c6a-8694-406f-a8af-8a5fe79a6b14",
    "text": "Which composer was known as 'Il Prete Rosso' (The Red Priest) due to his red hair and religious vocation?",
    "options": [
      "Claudio Monteverdi",
      "Antonio Vivaldi",
      "Arcangelo Corelli",
      "Giuseppe Tartini"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Antonio Vivaldi was nicknamed 'Il Prete Rosso' because of his distinctive red hair and his ordination as a Catholic priest.",
    "detailedExplanation": "Antonio Vivaldi was ordained as a Catholic priest in 1703, earning him the nickname 'Il Prete Rosso' (The Red Priest) due to his distinctive red hair. However, he rarely said Mass, claiming that his chest condition (possibly asthma) prevented him from doing so. Instead, he focused on his musical career, composing over 500 concertos and working primarily at the Ospedale della Pietà in Venice, an orphanage for girls where he taught music and composed many of his works, including 'The Four Seasons.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Antonio_Vivaldi",
    "citationTitle": "Wikipedia: Antonio Vivaldi"
  },
  {
    "id": "24831657-ca7c-445e-94da-abee7d182abe",
    "text": "Which composer's String Quartet No. 14 in D minor was subtitled 'Death and the Maiden' after he used his own song of the same name as the theme for variations in the second movement?",
    "options": [
      "Franz Schubert",
      "Ludwig van Beethoven",
      "Johannes Brahms",
      "Robert Schumann"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Schubert's String Quartet No. 14 uses his song 'Der Tod und das Mädchen' as the basis for the second movement's theme and variations.",
    "detailedExplanation": "Franz Schubert composed his String Quartet No. 14 in D minor, D. 810, in 1824, during a period of illness and depression. The quartet gets its nickname from the second movement, which is a set of variations on Schubert's own song 'Der Tod und das Mädchen' (Death and the Maiden), composed in 1817. The song sets a poem by Matthias Claudius depicting a dialogue between Death and a young maiden. The dark, dramatic character of the original song permeates the entire quartet, making it one of Schubert's most emotionally intense chamber works.",
    "citationUrl": "https://en.wikipedia.org/wiki/String_Quartet_No._14_(Schubert)",
    "citationTitle": "Wikipedia: String Quartet No. 14 (Schubert)"
  },
  {
    "id": "91ad8c3a-3246-4763-bf9c-c2f222443689",
    "text": "Which composer was forced to flee Paris during the French Revolution and died in poverty in London, despite being one of the most celebrated symphonists of his time?",
    "options": [
      "Luigi Boccherini",
      "Ignaz Pleyel",
      "Giovanni Battista Viotti",
      "Franz Joseph Haydn"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Ignaz Pleyel fled revolutionary France and struggled financially in London, despite his earlier fame as a composer and symphonist.",
    "detailedExplanation": "Ignaz Pleyel was one of the most performed composers of the late 18th century, a student of Haydn who composed 41 symphonies and numerous chamber works. During the French Revolution, his aristocratic connections made him suspect, forcing him to flee Paris. He moved to London in 1792, where he competed directly with his former teacher Haydn during the latter's London visits. Despite his earlier success, Pleyel struggled financially in London and his music fell out of favor. He eventually returned to Paris and founded the famous Pleyel piano manufacturing company, but his compositional career never recovered its former glory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ignaz_Pleyel",
    "citationTitle": "Wikipedia: Ignaz Pleyel"
  },
  {
    "id": "35c62fc3-73f4-42cb-b195-155f932b44b1",
    "text": "Which composer's Piano Sonata No. 32 in C minor, Op. 111, was his final piano sonata and unusually contains only two movements instead of the traditional three or four?",
    "options": [
      "Ludwig van Beethoven",
      "Franz Schubert",
      "Wolfgang Amadeus Mozart",
      "Robert Schumann"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Beethoven's final piano sonata, Op. 111, has only two movements and represents the culmination of his late compositional style.",
    "detailedExplanation": "Ludwig van Beethoven's Piano Sonata No. 32 in C minor, Op. 111, composed in 1821-1822, was his final piano sonata and one of his most profound late works. The sonata consists of only two movements: a dramatic first movement in C minor and a transcendent set of variations in C major. When his publisher questioned the missing movements, Beethoven reportedly replied that he had no time to write a third movement. The work represents a spiritual journey from struggle to transcendence, with the second movement's variations achieving an almost mystical quality that seems to dissolve into eternity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Piano_Sonata_No._32_(Beethoven)",
    "citationTitle": "Wikipedia: Piano Sonata No. 32 (Beethoven)"
  },
  {
    "id": "f2177f98-72c8-4491-8f12-ec15394afd23",
    "text": "Which composer wrote his famous 'Goldberg Variations' specifically to help an insomniac Russian diplomat fall asleep?",
    "options": [
      "Johann Sebastian Bach",
      "Georg Philipp Telemann",
      "Antonio Vivaldi",
      "Jean-Philippe Rameau"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bach composed the Goldberg Variations for Count Kaiserling's harpsichordist Johann Goldberg to play during sleepless nights.",
    "detailedExplanation": "The Goldberg Variations (BWV 988) were commissioned by Count Hermann Carl von Keyserlingk, a Russian diplomat suffering from insomnia. The Count employed a young harpsichordist named Johann Theophilus Goldberg, who would play these variations in an adjoining room during the Count's sleepless nights. Bach received a golden goblet filled with 100 Louis d'or for this commission, making it one of his most lucrative single works.",
    "citationUrl": "https://en.wikipedia.org/wiki/Goldberg_Variations",
    "citationTitle": "Wikipedia: Goldberg Variations"
  },
  {
    "id": "b0a4b13a-c042-4857-82c0-01d96af52956",
    "text": "Which composer was nicknamed 'The Swan of Pesaro' and revolutionized opera by incorporating elaborate vocal ornamentations called 'coloratura'?",
    "options": [
      "Vincenzo Bellini",
      "Gaetano Donizetti",
      "Gioachino Rossini",
      "Giuseppe Verdi"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Rossini, born in Pesaro, was called 'The Swan of Pesaro' and was famous for his coloratura passages.",
    "detailedExplanation": "Gioachino Rossini, born in Pesaro, Italy, earned the nickname 'The Swan of Pesaro' for his melodious compositions and graceful musical style. He revolutionized opera through his use of coloratura - elaborate vocal runs, trills, and ornamentations that showcased singers' technical abilities. His operas like 'The Barber of Seville' and 'William Tell' featured these intricate vocal passages that became a hallmark of the bel canto style.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gioachino_Rossini",
    "citationTitle": "Wikipedia: Gioachino Rossini"
  },
  {
    "id": "b5e43b62-997a-46d2-a5ef-f8c8070a0376",
    "text": "Which composer's 'Missa Solemnis' took him four years to complete and was originally intended for the enthronement of his patron Archduke Rudolf?",
    "options": [
      "Wolfgang Amadeus Mozart",
      "Ludwig van Beethoven",
      "Franz Joseph Haydn",
      "Antonio Salieri"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Beethoven's Missa Solemnis was composed for Archduke Rudolf's installation as Archbishop of Olmütz.",
    "detailedExplanation": "Beethoven began composing his Missa Solemnis in D major, Op. 123, in 1819 for the enthronement of Archduke Rudolf as Archbishop of Olmütz. However, the work's complexity and Beethoven's perfectionist nature meant it took four years to complete, finishing in 1823 - long after Rudolf's ceremony. Beethoven considered it one of his greatest achievements, calling it his 'greatest work' and spent more time on it than any other single composition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Missa_solemnis_(Beethoven)",
    "citationTitle": "Wikipedia: Missa solemnis (Beethoven)"
  },
  {
    "id": "a66782ca-c3aa-4ffe-9d46-a481c28c4315",
    "text": "Which composer invented the 'Leitmotif' technique and built his own opera house in Bayreuth specifically for performing his works?",
    "options": [
      "Richard Wagner",
      "Richard Strauss",
      "Gustav Mahler",
      "Anton Bruckner"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Wagner developed the leitmotif system and built the Bayreuth Festspielhaus for his Ring Cycle.",
    "detailedExplanation": "Richard Wagner revolutionized opera through his leitmotif technique - recurring musical themes associated with specific characters, objects, or ideas. Unsatisfied with existing opera houses, Wagner built the Bayreuth Festspielhaus, which opened in 1876 specifically for his Ring Cycle. The theater featured innovative acoustic design and a hidden orchestra pit that allowed audiences to focus entirely on the stage drama without visual distraction from the musicians.",
    "citationUrl": "https://en.wikipedia.org/wiki/Richard_Wagner",
    "citationTitle": "Wikipedia: Richard Wagner"
  },
  {
    "id": "a4c5307e-deec-479a-b1ce-ea6402568464",
    "text": "Which composer's Piano Concerto No. 2 was initially criticized as 'unplayable' but later became one of the most beloved concertos in the repertoire?",
    "options": [
      "Sergei Rachmaninoff",
      "Pyotr Ilyich Tchaikovsky",
      "Frédéric Chopin",
      "Franz Liszt"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Rachmaninoff's Piano Concerto No. 2 overcame initial criticism to become extremely popular.",
    "detailedExplanation": "Rachmaninoff's Piano Concerto No. 2 in C minor, Op. 18, premiered in 1901 after the composer recovered from a severe depression following the failure of his First Symphony. Initially, critics found it technically demanding and emotionally overwhelming, calling it 'unplayable.' However, audiences embraced its lush romanticism and virtuosic passages. The concerto helped establish Rachmaninoff's reputation and remains one of the most frequently performed and recorded piano concertos today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Piano_Concerto_No._2_(Rachmaninoff)",
    "citationTitle": "Wikipedia: Piano Concerto No. 2 (Rachmaninoff)"
  },
  {
    "id": "a335df29-f7f0-46f9-878f-ffeb8f60bab1",
    "text": "Which composer wrote over 600 secular vocal works called 'madrigals' and was known as 'Il Divino' (The Divine One)?",
    "options": [
      "Giovanni Pierluigi da Palestrina",
      "Claudio Monteverdi",
      "Luca Marenzio",
      "Carlo Gesualdo"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Luca Marenzio was called 'Il Divino' for his exceptional madrigal compositions.",
    "detailedExplanation": "Luca Marenzio (1553-1599) was an Italian late Renaissance composer who earned the nickname 'Il Divino' for his exceptional skill in composing madrigals. He wrote over 600 secular vocal works, primarily madrigals, which were sophisticated polyphonic songs typically set to poetry. Marenzio's madrigals were renowned throughout Europe for their expressive word-painting techniques and harmonic innovation, influencing composers across the continent and helping to establish the madrigal as a premier Renaissance art form.",
    "citationUrl": "https://en.wikipedia.org/wiki/Luca_Marenzio",
    "citationTitle": "Wikipedia: Luca Marenzio"
  },
  {
    "id": "379053a4-d238-4a94-b03b-d838398d3789",
    "text": "Which composer's Symphony No. 8 is nicknamed 'Symphony of a Thousand' due to the massive forces required for performance?",
    "options": [
      "Anton Bruckner",
      "Gustav Mahler",
      "Richard Strauss",
      "Max Reger"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Mahler's 8th Symphony requires enormous performing forces, earning it the 'Symphony of a Thousand' nickname.",
    "detailedExplanation": "Gustav Mahler's Symphony No. 8 in E-flat major, composed in 1906, earned the nickname 'Symphony of a Thousand' from impresario Emil Gutmann, though Mahler himself disliked the moniker. The work requires massive performing forces including a large orchestra, organ, eight vocal soloists, two mixed choirs, and a children's choir - totaling around 400-1000 performers depending on the production. The symphony sets two texts: the medieval hymn 'Veni creator spiritus' and the final scene from Goethe's 'Faust.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Symphony_No._8_(Mahler)",
    "citationTitle": "Wikipedia: Symphony No. 8 (Mahler)"
  },
  {
    "id": "ebccebf7-c2c3-4215-a8ec-5d2adfb54b73",
    "text": "Which Baroque composer was known as 'Il Caro Sassone' (The Dear Saxon) by his Italian contemporaries and wrote over 40 operas?",
    "options": [
      "George Frideric Handel",
      "Johann Adolf Hasse",
      "Christoph Willibald Gluck",
      "Giovanni Battista Pergolesi"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Johann Adolf Hasse was called 'Il Caro Sassone' by Italians and was a prolific opera composer.",
    "detailedExplanation": "Johann Adolf Hasse (1699-1783) was a German Baroque composer who spent much of his career in Italy, where he earned the affectionate nickname 'Il Caro Sassone' (The Dear Saxon). Hasse became one of the most successful opera composers of his era, writing over 60 operas in the Italian style. His works were performed throughout Europe, and he was particularly celebrated for his collaboration with the famous librettist Pietro Metastasio. Despite his enormous popularity during his lifetime, his works fell into obscurity after his death.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johann_Adolf_Hasse",
    "citationTitle": "Wikipedia: Johann Adolf Hasse"
  },
  {
    "id": "c8a8d80c-7d32-4721-b8ef-95055a100462",
    "text": "Which composer's 'Diabelli Variations' was written as a response to a waltz theme by publisher Anton Diabelli, transforming it into 33 elaborate variations that became one of the greatest piano works ever composed?",
    "options": [
      "Ludwig van Beethoven",
      "Franz Schubert",
      "Robert Schumann",
      "Johannes Brahms"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Beethoven's Diabelli Variations, Op. 120, was composed between 1819-1823 as his response to Diabelli's waltz theme.",
    "detailedExplanation": "Anton Diabelli, a music publisher and composer, sent a simple waltz theme to various composers asking each to write a single variation. While most complied with brief contributions, Beethoven became fascinated with the seemingly trivial theme and spent four years creating 33 masterful variations that completely transformed the original material. The work is considered one of the greatest sets of variations in classical music, showcasing Beethoven's incredible ability to find profound musical possibilities in the most ordinary material.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diabelli_Variations",
    "citationTitle": "Wikipedia: Diabelli Variations"
  },
  {
    "id": "7167f9e1-78e6-4e54-99a8-925b7bd2d6aa",
    "text": "Which composer died at age 35 shortly after completing his haunting 'Requiem in D minor,' leading to persistent legends that he was poisoned by a rival composer?",
    "options": [
      "Franz Schubert",
      "Wolfgang Amadeus Mozart",
      "Felix Mendelssohn",
      "Henry Purcell"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Mozart died in December 1791 at age 35, leaving his Requiem unfinished (completed by his student Süssmayr).",
    "detailedExplanation": "Mozart's death in Vienna on December 5, 1791, at the remarkably young age of 35, sparked numerous conspiracy theories and legends. The most persistent myth, popularized by Pushkin's play and later Amadeus, suggested he was poisoned by Antonio Salieri out of jealousy. However, modern medical analysis suggests he likely died from acute rheumatic fever or kidney disease. His final work, the Requiem in D minor, was commissioned by Count Franz von Walsegg and left incomplete at Mozart's death, later finished by his student Franz Xaver Süssmayr.",
    "citationUrl": "https://en.wikipedia.org/wiki/Death_of_Wolfgang_Amadeus_Mozart",
    "citationTitle": "Wikipedia: Death of Wolfgang Amadeus Mozart"
  },
  {
    "id": "83900901-4854-4667-8188-52e89af0127f",
    "text": "Which composer's 'The Four Seasons' violin concertos are among the earliest examples of 'program music,' with each concerto depicting specific scenes described in accompanying sonnets?",
    "options": [
      "Johann Sebastian Bach",
      "George Frideric Handel",
      "Antonio Vivaldi",
      "Arcangelo Corelli"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Vivaldi's 'The Four Seasons' (c. 1725) includes sonnets that describe the musical scenes being portrayed in each seasonal concerto.",
    "detailedExplanation": "Antonio Vivaldi's 'The Four Seasons' (Le quattro stagioni) represents a revolutionary approach to instrumental music by incorporating descriptive sonnets that guide the listener through specific pastoral scenes. Each of the four violin concertos corresponds to a season and includes detailed musical depictions of events described in the accompanying poetry—from birds singing in spring to storms in summer, hunting scenes in autumn, and people shivering by fires in winter. This makes them among the earliest and most successful examples of program music, where instrumental music tells a specific story or paints particular scenes.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Four_Seasons_(Vivaldi)",
    "citationTitle": "Wikipedia: The Four Seasons (Vivaldi)"
  },
  {
    "id": "23dd5099-dc1c-4196-8520-0ba222ad0538",
    "text": "Which composer's Piano Concerto No. 1 was rejected by Nikolai Rubinstein as 'worthless and unplayable' but later became one of the most popular concertos ever written?",
    "options": [
      "Pyotr Ilyich Tchaikovsky",
      "Sergei Rachmaninoff",
      "Frédéric Chopin",
      "Franz Liszt"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Tchaikovsky's Piano Concerto No. 1 in B-flat minor was harshly criticized by Rubinstein in 1874 but became enormously popular worldwide.",
    "detailedExplanation": "When Tchaikovsky first played his Piano Concerto No. 1 in B-flat minor for pianist Nikolai Rubinstein in December 1874, hoping for his endorsement and premiere performance, Rubinstein delivered a devastating critique. He declared the work 'worthless and unplayable,' criticizing its technical difficulties and unconventional structure. Deeply hurt, Tchaikovsky refused to make the extensive changes Rubinstein demanded and instead dedicated the concerto to German pianist Hans von Bülow, who premiered it successfully in Boston in 1875. Ironically, the concerto became one of the most beloved and frequently performed works in the piano repertoire, and Rubinstein later admitted his error and performed it himself.",
    "citationUrl": "https://en.wikipedia.org/wiki/Piano_Concerto_No._1_(Tchaikovsky)",
    "citationTitle": "Wikipedia: Piano Concerto No. 1 (Tchaikovsky)"
  }
]