[
  {
    "id": "155a4b82-96e3-4576-83ed-972167b0ae03",
    "text": "Which classical composer was known as 'The Red Priest' due to his religious vocation and distinctive red hair?",
    "options": [
      "Johann Sebastian Bach",
      "Antonio Vivaldi",
      "George Frideric Handel",
      "Claudio Monteverdi"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Antonio Vivaldi was nicknamed 'The Red Priest' because he was an ordained Catholic priest with distinctive red hair.",
    "detailedExplanation": "Antonio Vivaldi (1678-1741) was an Italian Baroque composer and virtuoso violinist who was ordained as a Catholic priest in 1703. His nickname 'Il Prete Rosso' (The Red Priest) came from his distinctive red hair and his clerical status. Despite his religious vocation, Vivaldi was better known for his musical compositions, particularly his violin concertos including 'The Four Seasons,' and spent much of his career teaching at an orphanage for girls in Venice where he composed many of his works.",
    "citationUrl": "https://en.wikipedia.org/wiki/Antonio_Vivaldi",
    "citationTitle": "Wikipedia: Antonio Vivaldi"
  },
  {
    "id": "839f5cf9-09ab-438a-9be5-0a1e0a1bcc6a",
    "text": "Which composer wrote exactly 104 symphonies, earning him the nickname 'Papa' from his musicians?",
    "options": [
      "Wolfgang Amadeus Mozart",
      "Franz Joseph Haydn",
      "Ludwig van Beethoven",
      "Franz Schubert"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Franz Joseph Haydn composed 104 symphonies and was affectionately called 'Papa Haydn' by his musicians due to his fatherly leadership style.",
    "detailedExplanation": "Franz Joseph Haydn (1732-1809) composed exactly 104 symphonies during his career, more than any other major classical composer. He earned the nickname 'Papa Haydn' from the musicians in his orchestra at Esterházy Palace, where he served as Kapellmeister for nearly 30 years. This affectionate title reflected both his paternal care for his musicians and his role as a founding father of the symphony and string quartet forms. His innovative approach to orchestral music and his mentorship of younger composers like Mozart made him one of the most influential figures of the Classical period.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joseph_Haydn",
    "citationTitle": "Wikipedia: Joseph Haydn"
  },
  {
    "id": "de4805e5-6b70-4def-9081-35fcdedc22c4",
    "text": "Which composer's only opera, 'Fidelio,' had to be revised multiple times and was originally titled 'Leonore'?",
    "options": [
      "Johannes Brahms",
      "Ludwig van Beethoven",
      "Robert Schumann",
      "Felix Mendelssohn"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Beethoven's only opera 'Fidelio' was originally called 'Leonore' and underwent several revisions before achieving its final form.",
    "detailedExplanation": "Ludwig van Beethoven composed only one opera during his career, 'Fidelio,' which proved to be one of his most challenging projects. Originally titled 'Leonore,' the opera premiered in 1805 but was poorly received. Beethoven revised it extensively, creating three different versions between 1805 and 1814. The opera tells the story of Leonore, who disguises herself as a prison guard named Fidelio to rescue her husband Florestan from political imprisonment. Despite the difficulties Beethoven faced in composing for the operatic stage, 'Fidelio' is now considered a masterpiece that explores themes of freedom, justice, and marital devotion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fidelio",
    "citationTitle": "Wikipedia: Fidelio"
  },
  {
    "id": "c9b26f2b-c5c6-46ce-84c7-7f7bbc512f1f",
    "text": "Which Romantic composer died at age 31, leaving behind over 600 compositions including the famous 'Unfinished Symphony'?",
    "options": [
      "Franz Schubert",
      "Frédéric Chopin",
      "Felix Mendelssohn",
      "Carl Maria von Weber"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Franz Schubert died at just 31 years old in 1828, having composed over 600 works including the famous Symphony No. 8 'Unfinished.'",
    "detailedExplanation": "Franz Schubert (1797-1828) lived only 31 years but was extraordinarily prolific, composing over 600 works in his short lifetime. His Symphony No. 8 in B minor, known as the 'Unfinished Symphony,' was composed in 1822 but consists of only two movements instead of the traditional four, with scholars still debating why Schubert never completed it. Despite his brief life, Schubert made significant contributions to art song (lieder), chamber music, and symphonic literature. His melodic genius and harmonic innovations bridged the Classical and Romantic periods, though he received little public recognition during his lifetime.",
    "citationUrl": "https://en.wikipedia.org/wiki/Franz_Schubert",
    "citationTitle": "Wikipedia: Franz Schubert"
  },
  {
    "id": "6e3b2fb0-9ddb-4a35-bd72-6397ec15ab1b",
    "text": "Which composer was famous for his 'War of the Romantics' rivalry with Johannes Brahms and composed the symphonic poem 'Les Préludes'?",
    "options": [
      "Richard Wagner",
      "Franz Liszt",
      "Hector Berlioz",
      "Anton Bruckner"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Franz Liszt was a key figure in the 'War of the Romantics' opposing Brahms's traditional approach, and composed the symphonic poem 'Les Préludes.'",
    "detailedExplanation": "Franz Liszt (1811-1886) was a central figure in the philosophical and aesthetic conflict known as the 'War of the Romantics,' which divided 19th-century classical music into two camps. Liszt championed programmatic music and innovative forms like the symphonic poem, opposing the more traditional approach favored by Johannes Brahms and his supporters. 'Les Préludes' (1854) was one of Liszt's most famous symphonic poems, inspired by Alphonse de Lamartine's poetry. As a virtuoso pianist, composer, and teacher, Liszt revolutionized piano technique and was instrumental in developing the concept of the modern piano recital.",
    "citationUrl": "https://en.wikipedia.org/wiki/Franz_Liszt",
    "citationTitle": "Wikipedia: Franz Liszt"
  },
  {
    "id": "42261472-532c-4b93-b1ec-d5005997a202",
    "text": "Which French composer wrote the opera 'Carmen' but died just three months after its premiere?",
    "options": [
      "Claude Debussy",
      "Gabriel Fauré",
      "Georges Bizet",
      "Jules Massenet"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Georges Bizet composed the opera 'Carmen,' which premiered in 1875, but he died three months later at age 36.",
    "detailedExplanation": "Georges Bizet (1838-1875) composed the opera 'Carmen,' which premiered at the Opéra-Comique in Paris on March 3, 1875. The opera initially received a lukewarm reception from audiences and critics who found its subject matter too scandalous and realistic. Tragically, Bizet died of a heart attack on June 3, 1875, just three months after the premiere and never lived to see 'Carmen' become one of the most popular and frequently performed operas in history. The opera's Spanish setting, memorable melodies like the 'Habanera' and 'Toreador Song,' and its dramatic story of passion and death have made it a cornerstone of the operatic repertoire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Georges_Bizet",
    "citationTitle": "Wikipedia: Georges Bizet"
  },
  {
    "id": "6b53ea4f-6c78-4b20-b2d5-96b8732a8205",
    "text": "Which composer served as a court musician for 29 years under Prince Nikolaus Esterházy and is considered the 'Father of the String Quartet'?",
    "options": [
      "Carl Philipp Emanuel Bach",
      "Franz Joseph Haydn",
      "Luigi Boccherini",
      "Johann Christian Bach"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Haydn served the Esterházy family for nearly three decades and established the string quartet as a major musical form.",
    "detailedExplanation": "Franz Joseph Haydn served as Kapellmeister for the wealthy Esterházy family from 1761 to 1790, spending 29 years at their palace in Eisenstadt and later Esterháza. This position provided him with financial security and access to excellent musicians, allowing him to experiment and develop his compositional skills. During this period, Haydn essentially created the string quartet as we know it, composing 68 string quartets that established the four-movement structure and the balanced conversation between four equal voices. His isolation at the Esterházy court, which he famously described as forcing him to become original, led to innovations that earned him recognition as both the 'Father of the String Quartet' and the 'Father of the Symphony.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Joseph_Haydn",
    "citationTitle": "Wikipedia: Joseph Haydn"
  },
  {
    "id": "14e3b09d-aecb-46c0-baf3-1fa30d44f7c2",
    "text": "Which Russian composer wrote the ballet 'The Firebird' as his first major success, launching his international career?",
    "options": [
      "Pyotr Ilyich Tchaikovsky",
      "Sergei Rachmaninoff",
      "Igor Stravinsky",
      "Modest Mussorgsky"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Igor Stravinsky's 'The Firebird' (1910) was his breakthrough composition that established his reputation internationally.",
    "detailedExplanation": "Igor Stravinsky (1882-1971) composed 'The Firebird' (L'Oiseau de feu) in 1910 as his first major commission from Sergei Diaghilev's Ballets Russes. At age 27, Stravinsky was relatively unknown when Diaghilev took a chance on him after other composers were unavailable. The ballet's premiere in Paris was a tremendous success, launching Stravinsky's international career and establishing him as a major force in modern music. 'The Firebird' drew on Russian folk tales and demonstrated Stravinsky's ability to blend traditional Russian musical elements with innovative orchestration and rhythmic complexity. This success led to further collaborations with Diaghilev, including 'Petrushka' and the revolutionary 'The Rite of Spring.'",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Firebird",
    "citationTitle": "Wikipedia: The Firebird"
  },
  {
    "id": "318e55ab-aec8-45c7-b914-81a19d9a8900",
    "text": "Which composer was completely deaf by the time he composed his famous 9th Symphony featuring 'Ode to Joy'?",
    "options": [
      "Ludwig van Beethoven",
      "Wolfgang Amadeus Mozart",
      "Johann Sebastian Bach",
      "Franz Liszt"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Beethoven was almost completely deaf when he composed his 9th Symphony in 1824.",
    "detailedExplanation": "Ludwig van Beethoven began losing his hearing in his late twenties and was almost completely deaf by 1814. Despite this profound disability, he continued composing and conducted the premiere of his 9th Symphony in 1824, though he couldn't hear the audience's thunderous applause. The symphony's final movement features Friedrich Schiller's 'Ode to Joy' and has become one of the most recognizable pieces in classical music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ludwig_van_Beethoven",
    "citationTitle": "Wikipedia: Ludwig van Beethoven"
  },
  {
    "id": "35027010-2c82-41e5-b5f6-55364c2557af",
    "text": "Which composer wrote 'The Four Seasons,' a set of violin concertos representing each season of the year?",
    "options": [
      "Johann Sebastian Bach",
      "Antonio Vivaldi",
      "Georg Handel",
      "Arcangelo Corelli"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Antonio Vivaldi composed 'The Four Seasons' around 1720 as part of his larger work 'The Contest Between Harmony and Invention.'",
    "detailedExplanation": "Antonio Vivaldi's 'The Four Seasons' consists of four violin concertos, each musically depicting a different season through innovative baroque techniques. Written around 1720, the concertos include programmatic elements like birdsong in 'Spring' and thunderstorms in 'Summer.' Each concerto is accompanied by a sonnet, possibly written by Vivaldi himself, describing the seasonal scenes the music portrays.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Four_Seasons_(Vivaldi)",
    "citationTitle": "Wikipedia: The Four Seasons (Vivaldi)"
  },
  {
    "id": "1cc5339c-61b2-4d64-bbc1-23da1a940cd9",
    "text": "Which composer died at the young age of 35, leaving behind works like 'The Magic Flute' and 'Don Giovanni'?",
    "options": [
      "Franz Schubert",
      "Wolfgang Amadeus Mozart",
      "Felix Mendelssohn",
      "Frédéric Chopin"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Wolfgang Amadeus Mozart died in 1791 at age 35, having composed over 600 works in his short lifetime.",
    "detailedExplanation": "Wolfgang Amadeus Mozart died on December 5, 1791, at the remarkably young age of 35. Despite his brief life, he composed over 600 works across virtually every musical genre of his time, including operas, symphonies, concertos, and chamber music. His final year was particularly productive, seeing the completion of 'The Magic Flute,' his Piano Concerto No. 27, and his unfinished Requiem, which he was working on at the time of his death.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wolfgang_Amadeus_Mozart",
    "citationTitle": "Wikipedia: Wolfgang Amadeus Mozart"
  },
  {
    "id": "1bab63d6-5fd1-4d25-9538-4e81b38ec2aa",
    "text": "Which Polish composer spent most of his adult life in Paris and is famous primarily for his piano compositions including nocturnes and études?",
    "options": [
      "Sergei Rachmaninoff",
      "Franz Liszt",
      "Frédéric Chopin",
      "Robert Schumann"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Frédéric Chopin left Poland in 1830 and spent most of his career in Paris, becoming renowned for his virtuosic piano compositions.",
    "detailedExplanation": "Frédéric Chopin left his native Poland in 1830 at age 20 and settled in Paris, where he spent the remainder of his life. He became the quintessential Romantic pianist-composer, writing almost exclusively for the piano. His compositions, including 21 nocturnes, 27 études, and 4 ballades, expanded the technical and expressive possibilities of piano music. Chopin's works remain central to the piano repertoire and are beloved for their poetic beauty and technical brilliance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fr%C3%A9d%C3%A9ric_Chopin",
    "citationTitle": "Wikipedia: Frédéric Chopin"
  },
  {
    "id": "84bc4af8-148f-4b9b-96c3-7929fd75565d",
    "text": "Which German composer wrote the epic four-opera cycle 'Der Ring des Nibelungen' (The Ring of the Nibelung)?",
    "options": [
      "Richard Strauss",
      "Richard Wagner",
      "Gustav Mahler",
      "Anton Bruckner"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Richard Wagner composed 'Der Ring des Nibelungen,' a monumental cycle of four operas premiered in its entirety in 1876.",
    "detailedExplanation": "Richard Wagner's 'Der Ring des Nibelungen' is one of the most ambitious works in opera history, consisting of four interconnected operas: 'Das Rheingold,' 'Die Walküre,' 'Siegfried,' and 'Götterdämmerung.' Wagner worked on the cycle for over 25 years, and it premiered in its complete form at his specially built Bayreuth Festival Theatre in 1876. The work totals approximately 15 hours of music and revolutionized opera through Wagner's use of leitmotifs and continuous musical drama.",
    "citationUrl": "https://en.wikipedia.org/wiki/Der_Ring_des_Nibelungen",
    "citationTitle": "Wikipedia: Der Ring des Nibelungen"
  },
  {
    "id": "b99f5985-5d13-4c8d-a312-ad4340ea58cf",
    "text": "Which composer's 'Brandenburg Concertos' are considered among the finest examples of Baroque orchestral music?",
    "options": [
      "Georg Telemann",
      "Johann Sebastian Bach",
      "Henry Purcell",
      "Jean-Philippe Rameau"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Johann Sebastian Bach composed the six Brandenburg Concertos around 1721, dedicating them to Christian Ludwig, Margrave of Brandenburg-Schwedt.",
    "detailedExplanation": "Johann Sebastian Bach's Brandenburg Concertos, composed around 1721, represent the pinnacle of Baroque concerto grosso form. Bach dedicated these six concertos to Christian Ludwig, Margrave of Brandenburg-Schwedt, though they were likely never performed at the margrave's court. Each concerto features different instrumental combinations and showcases Bach's mastery of counterpoint and orchestration. They remain among the most frequently performed and recorded works in the classical repertoire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brandenburg_Concertos",
    "citationTitle": "Wikipedia: Brandenburg Concertos"
  },
  {
    "id": "1d4b5568-29b2-4196-8d16-165cc3ce007f",
    "text": "Which Russian composer wrote the ballets 'Swan Lake,' 'The Nutcracker,' and 'Sleeping Beauty'?",
    "options": [
      "Modest Mussorgsky",
      "Pyotr Ilyich Tchaikovsky",
      "Nikolai Rimsky-Korsakov",
      "Sergei Prokofiev"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Pyotr Ilyich Tchaikovsky composed these three beloved ballets, which remain cornerstones of the classical ballet repertoire.",
    "detailedExplanation": "Pyotr Ilyich Tchaikovsky revolutionized ballet music with his three masterpieces: 'Swan Lake' (1876), 'Sleeping Beauty' (1889), and 'The Nutcracker' (1892). These works elevated ballet from mere entertainment to high art through their sophisticated orchestration and memorable melodies. While 'Swan Lake' initially received mixed reviews, all three ballets are now considered essential works that defined the sound of classical ballet and remain among the most performed ballets worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pyotr_Ilyich_Tchaikovsky",
    "citationTitle": "Wikipedia: Pyotr Ilyich Tchaikovsky"
  },
  {
    "id": "c52213c4-1803-42ad-bcd6-ba0781eb3abd",
    "text": "Which composer developed the concept of 'absolute music' and wrote four symphonies, including one subtitled 'Tragic'?",
    "options": [
      "Anton Dvořák",
      "Johannes Brahms",
      "César Franck",
      "Max Bruch"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Johannes Brahms was a key proponent of absolute music and composed four symphonies, with his Symphony No. 4 sometimes called 'Tragic.'",
    "detailedExplanation": "Johannes Brahms was a leading advocate for 'absolute music' - music that exists for its own sake without extramusical associations or programmatic content. This put him at odds with composers like Wagner and Liszt who favored program music. Brahms spent over 20 years working on his First Symphony, intimidated by Beethoven's legacy. His four symphonies, completed between 1876 and 1885, demonstrate his mastery of classical forms while incorporating Romantic harmonies and emotional depth.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johannes_Brahms",
    "citationTitle": "Wikipedia: Johannes Brahms"
  },
  {
    "id": "b045c882-5dd9-4ed4-b6da-3a6704fd9a41",
    "text": "Which composer was nicknamed 'The Divine Bohemian' and wrote the popular 'New World Symphony' while living in America?",
    "options": [
      "Antonín Dvořák",
      "Bedřich Smetana",
      "Leoš Janáček",
      "Bohuslav Martinů"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Antonín Dvořák composed his famous Symphony No. 9 'From the New World' during his time as director of the National Conservatory in New York.",
    "detailedExplanation": "Antonín Dvořák (1841-1904) was a Czech composer who spent three years (1892-1895) in the United States as director of the National Conservatory of Music in New York. During this period, he composed his most famous work, Symphony No. 9 in E minor 'From the New World,' which incorporated elements he perceived as uniquely American, including influences from Native American music and African-American spirituals. The symphony premiered at Carnegie Hall in 1893 to great acclaim and remains one of the most popular symphonies in the classical repertoire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Anton%C3%ADn_Dvo%C5%99%C3%A1k",
    "citationTitle": "Wikipedia: Antonín Dvořák"
  },
  {
    "id": "438e625c-40ce-4a88-872e-aa45d9903edd",
    "text": "Which Baroque composer wrote 'Messiah,' featuring the famous 'Hallelujah Chorus,' and became a British citizen later in life?",
    "options": [
      "Johann Sebastian Bach",
      "George Frideric Handel",
      "Henry Purcell",
      "Jean-Baptiste Lully"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "George Frideric Handel composed 'Messiah' in 1741 and became a naturalized British citizen in 1727.",
    "detailedExplanation": "George Frideric Handel (1685-1759) was a German-born Baroque composer who spent most of his career in London after moving to England in 1712. He became a naturalized British citizen in 1727 and was deeply integrated into British musical life. His oratorio 'Messiah,' composed in just 24 days in 1741, premiered in Dublin in 1742 and became one of the most frequently performed choral works in Western music. The 'Hallelujah Chorus' from this work is so revered that audience tradition dictates standing during its performance, a custom allegedly started by King George II.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Frideric_Handel",
    "citationTitle": "Wikipedia: George Frideric Handel"
  },
  {
    "id": "c4f2f024-6a35-4da8-a390-31f12e75ad65",
    "text": "Which Italian composer is considered the father of modern orchestration and wrote the revolutionary 'Symphonie Fantastique'?",
    "options": [
      "Giuseppe Verdi",
      "Gioachino Rossini",
      "Hector Berlioz",
      "Giacomo Puccini"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hector Berlioz, though French not Italian, revolutionized orchestration and composed 'Symphonie Fantastique' in 1830.",
    "detailedExplanation": "Hector Berlioz (1803-1869) was a French Romantic composer who revolutionized the art of orchestration and is often considered its father in the modern sense. His 'Symphonie Fantastique,' composed in 1830, was groundbreaking for its innovative use of orchestral color, its programmatic narrative structure, and its use of the 'idée fixe' (a recurring musical theme representing his beloved). The symphony tells the story of an artist's opium-induced dreams about unrequited love and includes movements depicting a ball, a pastoral scene, a march to the scaffold, and a witches' sabbath. This work established many techniques that would influence orchestral composition for generations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hector_Berlioz",
    "citationTitle": "Wikipedia: Hector Berlioz"
  },
  {
    "id": "77f437fc-c8f1-45ac-bcf1-de1567bd9483",
    "text": "Which 20th-century composer wrote 'The Rite of Spring,' which famously caused a riot at its 1913 Paris premiere?",
    "options": [
      "Claude Debussy",
      "Igor Stravinsky",
      "Maurice Ravel",
      "Sergei Prokofiev"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Igor Stravinsky's 'The Rite of Spring' premiered on May 29, 1913, at the Théâtre des Champs-Élysées in Paris and caused one of the most famous riots in music history.",
    "detailedExplanation": "Igor Stravinsky (1882-1971) composed 'The Rite of Spring' (Le Sacre du printemps) as a ballet score for Sergei Diaghilev's Ballets Russes. The premiere on May 29, 1913, at the Théâtre des Champs-Élysées in Paris is legendary for the audience riot it provoked. The work's radical departure from traditional harmony, its complex rhythmic patterns, and Vaslav Nijinsky's equally revolutionary choreography shocked the audience. The combination of pounding rhythms, dissonant harmonies, and primitive themes depicting ancient Russian pagan rituals was too avant-garde for many attendees, leading to shouting matches between supporters and detractors. Today, it's considered one of the most influential musical works of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rite_of_Spring",
    "citationTitle": "Wikipedia: The Rite of Spring"
  }
]