[
  {
    "id": "7bdedfbc-723a-4de4-813a-a8fa41b94478",
    "text": "What is the name of the AI that replaces FRIDAY as Tony Stark's assistant in Spider-Man: Far From Home?",
    "options": [
      "KAREN",
      "EDITH",
      "VERONICA",
      "TADASHI"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "EDITH (Even Dead, I'm The Hero) is Tony Stark's AI system that he bequeaths to Peter Parker.",
    "detailedExplanation": "In Spider-Man: Far From Home, Tony Stark leaves behind an advanced AI system called EDITH (Even Dead, I'm The Hero) for Peter Parker. EDITH has access to Stark Industries' global satellite network and drone arsenal, making it incredibly powerful and dangerous in the wrong hands. The AI becomes a central plot device when Mysterio manipulates Peter into giving him access to the system.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spider-Man:_Far_From_Home",
    "citationTitle": "Wikipedia: Spider-Man: Far From Home"
  },
  {
    "id": "98800820-89da-48cd-957c-776e997e329b",
    "text": "In Guardians of the Galaxy Vol. 2, what is the name of the Ravager faction that remains loyal to Yondu?",
    "options": [
      "The Reavers",
      "The Ravager Flame",
      "The Centaurian Guard",
      "Yondu's Fin Fang Foom"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Ravager Flame is the name given to Yondu's loyal crew members who refuse to mutiny against him.",
    "detailedExplanation": "In Guardians of the Galaxy Vol. 2, Yondu faces a mutiny led by Taserface when his crew becomes frustrated with his apparent favoritism toward Peter Quill. However, some Ravagers remain loyal to Yondu and are referred to as 'The Ravager Flame.' These loyal crew members include Kraglin and others who ultimately help Yondu, Rocket, and Baby Groot escape and mount a rescue mission for the other Guardians on Ego's planet.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_Vol._2",
    "citationTitle": "Wikipedia: Guardians of the Galaxy Vol. 2"
  },
  {
    "id": "cafe9f16-b4bd-4874-beea-cb1c84958b0c",
    "text": "What is the name of the quantum virus that infects Janet van Dyne during her time in the Quantum Realm?",
    "options": [
      "Quantum Entanglement Syndrome",
      "Temporal Displacement Disorder",
      "Quantum healing particles",
      "She doesn't get infected with a virus"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Janet van Dyne doesn't get infected with a virus; instead, she gains quantum healing abilities from prolonged exposure to quantum energy.",
    "detailedExplanation": "In Ant-Man and the Wasp, Janet van Dyne doesn't contract a quantum virus during her 30 years in the Quantum Realm. Instead, she develops quantum healing abilities and enhanced perception due to prolonged exposure to quantum energy. This is demonstrated when she temporarily possesses Scott Lang's body to communicate and later uses her quantum energy to stabilize Ava Starr (Ghost), who is suffering from molecular disequilibrium. The quantum energy exposure enhanced her rather than infected her.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ant-Man_and_the_Wasp",
    "citationTitle": "Wikipedia: Ant-Man and the Wasp"
  },
  {
    "id": "ba8aef70-6e41-43bd-a686-afe6fab6cf05",
    "text": "What is the name of the protocol that Nick Fury activates at the end of Avengers: Infinity War?",
    "options": [
      "The Avengers Initiative",
      "The Protector Protocol",
      "He doesn't activate a named protocol",
      "Project P.E.G.A.S.U.S."
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Nick Fury doesn't activate a specifically named protocol; he simply uses a modified pager to contact Captain Marvel.",
    "detailedExplanation": "At the end of Avengers: Infinity War, Nick Fury uses a modified pager-like device to send a distress signal to Captain Marvel before being snapped out of existence. While this action isn't part of a specifically named protocol shown in the film, it represents Fury's last resort contingency plan. The device displays Captain Marvel's symbol, indicating it was specifically designed to contact her in case of an extreme emergency. This setup pays off in Captain Marvel and Avengers: Endgame, where we learn the full context of their relationship.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avengers:_Infinity_War",
    "citationTitle": "Wikipedia: Avengers: Infinity War"
  },
  {
    "id": "ea641f64-0ad3-4538-8ef9-c534a34e9c73",
    "text": "In Doctor Strange, what is the name of the London Sanctum's guardian who is killed by Kaecilius?",
    "options": [
      "Master Drumm",
      "Master Hamir",
      "Master Sol Rama",
      "Master Tainer"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Master Sol Rama was the guardian of the London Sanctum who was killed by Kaecilius and his zealots.",
    "detailedExplanation": "In Doctor Strange, Master Sol Rama serves as the guardian of the London Sanctum Sanctorum, one of three mystical buildings that protect Earth from interdimensional threats. He is killed by Kaecilius and his zealots during their attack on the London Sanctum as part of their plan to summon Dormammu from the Dark Dimension. His death weakens Earth's mystical defenses and forces the remaining Masters of the Mystic Arts, including Strange, to take more desperate measures to protect reality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doctor_Strange_(2016_film)",
    "citationTitle": "Wikipedia: Doctor Strange (2016 film)"
  },
  {
    "id": "6822432c-4be4-461a-b148-6a2be6befcbc",
    "text": "What is the name of the winter soldier program's activation book in Captain America: The Winter Soldier?",
    "options": [
      "Red Ledger",
      "The Siberian Manifesto",
      "It doesn't have a specific name in the film",
      "Winter Protocol"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The red book containing Bucky's trigger words isn't given a specific name in Captain America: The Winter Soldier.",
    "detailedExplanation": "In Captain America: The Winter Soldier and Civil War, the red notebook containing Bucky Barnes' trigger words is simply referred to as 'the book' or 'the red book.' While it contains the Russian words that activate his Winter Soldier programming ('Longing,' 'Rusted,' 'Seventeen,' etc.), the book itself is never given an official designation or code name within the films. It serves as a crucial plot device representing Hydra's control over Bucky, but the MCU doesn't assign it a formal title like some other MacGuffins in the franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Captain_America:_The_Winter_Soldier",
    "citationTitle": "Wikipedia: Captain America: The Winter Soldier"
  },
  {
    "id": "37f8e10c-20f2-4de9-bc55-3443a7a3cf40",
    "text": "In Black Panther, what is the name of the White Wolf that M'Baku's tribe captures?",
    "options": [
      "Bucky Barnes",
      "Ulysses Klaue",
      "Erik Killmonger",
      "Agent Ross"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bucky Barnes is referred to as the 'White Wolf' by the Wakandan children after being given sanctuary there.",
    "detailedExplanation": "At the end of Captain America: Civil War, Bucky Barnes is given sanctuary in Wakanda where he undergoes treatment to remove his Winter Soldier programming. In the post-credits scene of Black Panther, we see Bucky has recovered and is living peacefully among the Wakandans. The local children have given him the nickname 'White Wolf,' which Shuri mentions when she visits him. This name is a reference to the Marvel Comics character of the same name, though in a different context, and shows how Bucky has found acceptance and a new identity in Wakanda.",
    "citationUrl": "https://en.wikipedia.org/wiki/Black_Panther_(film)",
    "citationTitle": "Wikipedia: Black Panther (film)"
  },
  {
    "id": "deaa83d3-a2e1-4929-999d-9aaec7ecc9c8",
    "text": "In Captain America: The Winter Soldier, what is the name of the algorithm used by HYDRA within S.H.I.E.L.D. to identify future threats?",
    "options": [
      "Project Insight",
      "Zola Algorithm",
      "Operation Paperclip",
      "Algorithm Zero"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Zola Algorithm was developed by Arnim Zola to predict and eliminate future threats to HYDRA's plans.",
    "detailedExplanation": "In Captain America: The Winter Soldier, it's revealed that Arnim Zola, while working within S.H.I.E.L.D., developed an algorithm that could analyze a person's past behavior to predict their future actions. This algorithm was used by HYDRA to identify individuals who would become threats to their world domination plans. The algorithm was housed within Zola's consciousness, which had been preserved in a computer system since the 1970s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Captain_America:_The_Winter_Soldier",
    "citationTitle": "Wikipedia: Captain America: The Winter Soldier"
  },
  {
    "id": "e3546980-2475-40ba-872a-70d31f851f12",
    "text": "What is the real name of the character known as the Ancient One's predecessor, as mentioned in Doctor Strange?",
    "options": [
      "Agamotto",
      "Kaluu",
      "Master Kaecilius",
      "Drumm"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Agamotto was the first Sorcerer Supreme and creator of the Eye of Agamotto that contains the Time Stone.",
    "detailedExplanation": "In the MCU's Doctor Strange, Agamotto is referenced as the first Sorcerer Supreme who created the Eye of Agamotto, which houses the Time Stone. The Ancient One explains to Stephen Strange that Agamotto was the first to harness the power of the Time Stone and established the order of mystical protectors. The Sanctum Sanctorum contains various artifacts and references to Agamotto's legacy, including the window of the worlds that bears his symbol.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doctor_Strange_(2016_film)",
    "citationTitle": "Wikipedia: Doctor Strange (2016 film)"
  },
  {
    "id": "307d086f-03c9-4ee2-b5c5-fa4a53b89b04",
    "text": "In Avengers: Infinity War, what percentage of life does Thanos claim the universe has lost due to overpopulation and finite resources?",
    "options": [
      "25%",
      "33%",
      "50%",
      "This specific percentage is never mentioned"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "While Thanos discusses overpopulation extensively, he never gives a specific percentage of life lost in the MCU.",
    "detailedExplanation": "Throughout Avengers: Infinity War, Thanos frequently discusses his motivation regarding overpopulation and finite resources, particularly when explaining his actions on Titan and other planets. However, contrary to what many fans believe, Thanos never actually states a specific percentage of life that the universe has lost due to these issues. He speaks generally about suffering and starvation, and his plan to eliminate 50% of all life, but doesn't quantify the current state of universal suffering with a specific statistic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avengers:_Infinity_War",
    "citationTitle": "Wikipedia: Avengers: Infinity War"
  },
  {
    "id": "6ebc9e15-d163-4f8f-a62a-8c1e4542403e",
    "text": "What is the name of the moon where Peter Quill's father Ego first tells him about his celestial heritage?",
    "options": [
      "Ego's Moon",
      "The Sovereign Moon",
      "Berhert",
      "This scene takes place on Ego's planet, not a moon"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The revelation scene between Ego and Peter Quill takes place on Ego's planet itself, not on any moon.",
    "detailedExplanation": "In Guardians of the Galaxy Vol. 2, when Ego reveals to Peter Quill that he is his father and explains Peter's celestial heritage, this crucial scene takes place on Ego's own planet. Ego himself is a living planet, and the beautiful garden-like environment where they have their heart-to-heart conversation is part of Ego's planetary form. There is no separate moon involved in this revelation scene - the entire sequence occurs on the surface of the celestial being that is Ego.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_Vol._2",
    "citationTitle": "Wikipedia: Guardians of the Galaxy Vol. 2"
  },
  {
    "id": "03b9301f-d448-45f8-871a-72b718b6d515",
    "text": "In Thor: Ragnarok, what is the name of the song that plays during the final battle scene on the Rainbow Bridge?",
    "options": [
      "Immigrant Song by Led Zeppelin",
      "Thunderstruck by AC/DC",
      "We Will Rock You by Queen",
      "The Hammer of the Gods by Led Zeppelin"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Led Zeppelin's 'Immigrant Song' plays during Thor's lightning-powered assault in the climactic Rainbow Bridge battle.",
    "detailedExplanation": "In one of the most memorable moments of Thor: Ragnarok, Led Zeppelin's 'Immigrant Song' plays during the climactic battle scene where Thor, having fully embraced his powers as the God of Thunder, fights Hela's undead army on the Rainbow Bridge. The song's lyrics about Norse mythology ('We come from the land of the ice and snow') perfectly complement Thor's character arc and his unleashing of his true lightning powers. This moment represents Thor's transformation and acceptance of his role as Asgard's protector.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thor:_Ragnarok",
    "citationTitle": "Wikipedia: Thor: Ragnarok"
  },
  {
    "id": "e132ffd4-f08d-4053-b624-7b6c093a3bc6",
    "text": "What is the specific model number of the War Machine armor that James Rhodes wears in Captain America: Civil War?",
    "options": [
      "Mark II",
      "Mark III",
      "Mark IV",
      "Mark V"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Rhodes wears the War Machine Mark III armor during the events of Captain America: Civil War.",
    "detailedExplanation": "In Captain America: Civil War, James 'Rhodey' Rhodes operates the War Machine Mark III armor during the conflict between the Avengers. This is the armor he's wearing when he's accidentally shot down by Vision's Mind Stone beam during the airport battle in Germany. The War Machine Mark III featured enhanced weaponry and defensive capabilities compared to its predecessors, and its distinctive silver and black color scheme made it easily recognizable during the film's major action sequences.",
    "citationUrl": "https://en.wikipedia.org/wiki/War_Machine",
    "citationTitle": "Wikipedia: War Machine"
  },
  {
    "id": "4c88db1a-6c69-479d-abb0-e92f5e975e9c",
    "text": "In the MCU, what is the name of the rare metal that makes up Captain America's shield, besides vibranium?",
    "options": [
      "Adamantium",
      "Uru metal",
      "It's pure vibranium only",
      "Proto-Adamantium"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "In the MCU, Captain America's shield is made of pure vibranium, unlike the comics where it's a vibranium-steel alloy.",
    "detailedExplanation": "Unlike the comics where Captain America's shield is made of a unique vibranium-steel alloy sometimes called 'proto-adamantium,' in the Marvel Cinematic Universe the shield is described as being made of pure vibranium. This was established in Captain America: The First Avenger, where Howard Stark explains that the shield is made from all the vibranium they had available. The MCU simplified the shield's composition to avoid the complex metallurgy explanations from the comics and because adamantium rights belong to Fox's X-Men franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Captain_America%27s_shield",
    "citationTitle": "Wikipedia: Captain America's shield"
  },
  {
    "id": "0533db4e-c5cc-4a36-a08e-132f07684832",
    "text": "What is the name of the Kree city that serves as the capital of the Kree Empire in the MCU?",
    "options": [
      "Attilan",
      "Hala",
      "Kree-Lar",
      "The Supreme Intelligence Chamber"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Hala is the homeworld and capital city of the Kree Empire, featured prominently in Captain Marvel.",
    "detailedExplanation": "In Captain Marvel, Hala is established as the capital world of the Kree Empire, where the Supreme Intelligence resides and from where the Kree military operations are coordinated. The city is shown as a highly advanced technological metropolis with towering structures and sophisticated architecture. Hala serves as the central hub of Kree civilization and is where Carol Danvers undergoes her training as a member of Starforce before discovering her true identity and the truth about the Kree-Skrull conflict.",
    "citationUrl": "https://en.wikipedia.org/wiki/Captain_Marvel_(film)",
    "citationTitle": "Wikipedia: Captain Marvel (film)"
  },
  {
    "id": "f5faa11c-3f96-460f-bd1e-de6a49b5b922",
    "text": "In 'Avengers: Endgame', what is the exact timestamp that Tony Stark tells Scott Lang to rewind to when discussing the Time Heist strategy?",
    "options": [
      "October 7th, 1970",
      "December 16th, 1991",
      "May 4th, 2012",
      "September 7th, 2018"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Tony Stark specifically mentions October 7th, 1970 as the date to target for retrieving the Tesseract and Pym Particles.",
    "detailedExplanation": "During the planning phase of the Time Heist in Avengers: Endgame, Tony Stark identifies October 7th, 1970 as a crucial date when both the Tesseract and Pym Particles were located at Camp Lehigh. This date becomes significant as it's when Howard Stark was working on the Tesseract research and Hank Pym was developing his shrinking technology for S.H.I.E.L.D., making it possible for Tony and Steve to retrieve both items in a single mission to the past.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avengers:_Endgame",
    "citationTitle": "Wikipedia: Avengers: Endgame"
  },
  {
    "id": "482c02fc-d77f-4fbd-b770-4c1dd50898dc",
    "text": "What is the name of the AI system that replaces FRIDAY in 'Spider-Man: Far From Home'?",
    "options": [
      "KAREN",
      "EDITH",
      "VERONICA",
      "TADASHI"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "E.D.I.T.H. (Even Dead I'm The Hero) is the AI system Tony Stark left to Peter Parker, controlling a global satellite network.",
    "detailedExplanation": "E.D.I.T.H. stands for 'Even Dead I'm The Hero' and represents Tony Stark's final gift to Peter Parker in Spider-Man: Far From Home. This advanced AI system controls a vast network of orbital satellites equipped with drones and weapons, essentially giving Peter access to a global surveillance and defense network. The system becomes central to the film's plot when Mysterio manipulates Peter into giving him access to E.D.I.T.H., which he then uses to stage elaborate illusions and attacks.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spider-Man:_Far_From_Home",
    "citationTitle": "Wikipedia: Spider-Man: Far From Home"
  },
  {
    "id": "da5c4332-4be2-4a21-a05b-3d864d384c47",
    "text": "In 'Guardians of the Galaxy Vol. 2', what percentage does Rocket claim his success rate is for his plans?",
    "options": [
      "87%",
      "92%",
      "97%",
      "100%"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Rocket boasts about his 97% success rate when the Guardians are planning their strategy against the Sovereign fleet.",
    "detailedExplanation": "During the opening sequence of Guardians of the Galaxy Vol. 2, when the team is preparing to face the Sovereign's remote-controlled fleet, Rocket confidently states that his plans have a 97% success rate. This moment showcases Rocket's characteristic arrogance and tactical expertise, though it also sets up the tension within the team as his abrasive personality creates conflict with other members, particularly with Peter Quill and Gamora throughout the film.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_Vol._2",
    "citationTitle": "Wikipedia: Guardians of the Galaxy Vol. 2"
  },
  {
    "id": "bd14eff4-4b53-4f0d-a8f3-17e2be364305",
    "text": "What is the name of the quantum tunnel device that Hank Pym uses to attempt communication with Janet van Dyne in 'Ant-Man and the Wasp'?",
    "options": [
      "Quantum Entanglement Device",
      "Subatomic Communication Array",
      "Quantum Tunnel Generator",
      "Quantum Vehicle"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Quantum Vehicle is the machine Hank Pym builds to safely navigate and communicate within the Quantum Realm to rescue Janet.",
    "detailedExplanation": "In Ant-Man and the Wasp, Hank Pym constructs the Quantum Vehicle, a sophisticated machine designed to safely traverse the Quantum Realm and establish communication with his wife Janet van Dyne, who has been trapped there for decades. The vehicle represents a significant advancement from the basic shrinking technology, incorporating stabilization systems and communication arrays that can function in the chaotic environment of the Quantum Realm. The device becomes crucial to the film's plot as multiple parties seek to obtain it for their own purposes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ant-Man_and_the_Wasp",
    "citationTitle": "Wikipedia: Ant-Man and the Wasp"
  },
  {
    "id": "5fc8fe61-e3d8-4e95-af7d-a248d40f0f20",
    "text": "In 'Doctor Strange in the Multiverse of Madness', what Earth designation is given to the universe where the Illuminati exists?",
    "options": [
      "Earth-616",
      "Earth-838",
      "Earth-199999",
      "Earth-92131"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Earth-838 is the designation for the alternate universe where Doctor Strange encounters the Illuminati council.",
    "detailedExplanation": "Earth-838 is revealed as the designation for the alternate universe that Doctor Strange and America Chavez visit in Doctor Strange in the Multiverse of Madness. This universe features the Illuminati, a secret council of superheroes including Professor X, Captain Marvel (Maria Rambeau), Captain Carter, Black Bolt, Mister Fantastic, and their universe's Doctor Strange (deceased). The specific numbering follows Marvel's multiverse classification system, and this universe represents a darker timeline where the local Doctor Strange caused an incursion that destroyed another universe, leading to his execution by the Illuminati.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doctor_Strange_in_the_Multiverse_of_Madness",
    "citationTitle": "Wikipedia: Doctor Strange in the Multiverse of Madness"
  }
]