[
  {
    "id": "006935f0-3d64-41da-9b2f-07f0894e00b9",
    "text": "In which MCU film does the character of Wanda Maximoff first appear?",
    "options": [
      "Avengers: Age of Ultron",
      "Captain America: The Winter Soldier",
      "Avengers: Infinity War",
      "Doctor Strange in the Multiverse of Madness"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Wanda Maximoff first appears in a mid-credits scene of Captain America: The Winter Soldier.",
    "detailedExplanation": "While Wanda Maximoff, also known as Scarlet Witch, has her first major role in Avengers: Age of Ultron, she actually made her MCU debut in the mid-credits scene of Captain America: The Winter Soldier alongside her twin brother Pietro. In this scene, they are shown as test subjects of Baron von Strucker's experiments with Loki's scepter.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wanda_Maximoff_(Marvel_Cinematic_Universe)",
    "citationTitle": "Wikipedia: Wanda Maximoff (Marvel Cinematic Universe)"
  },
  {
    "id": "4889d1b6-ffe0-4478-b248-be9c2b7cce46",
    "text": "What is the name of the AI that replaces JARVIS after Vision is created?",
    "options": [
      "EDITH",
      "FRIDAY",
      "KAREN",
      "VERONICA"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "FRIDAY becomes Tony Stark's new AI assistant after JARVIS becomes Vision.",
    "detailedExplanation": "After JARVIS is uploaded into Vision's body in Avengers: Age of Ultron, Tony Stark creates a new AI assistant named FRIDAY, voiced by Kerry Condon. FRIDAY serves as Stark's primary AI throughout subsequent films, including Captain America: Civil War and Avengers: Infinity War. The other options are also MCU AIs: EDITH appears in Spider-Man: Far From Home, KAREN is Spider-Man's suit AI, and VERONICA is the Hulkbuster armor system.",
    "citationUrl": "https://en.wikipedia.org/wiki/F.R.I.D.A.Y.",
    "citationTitle": "Wikipedia: F.R.I.D.A.Y."
  },
  {
    "id": "adf2dcc5-b1ed-4585-b01a-35c1b590b84f",
    "text": "In Thor: Ragnarok, what song plays during the final battle scene on the Rainbow Bridge?",
    "options": [
      "Thunderstruck by AC/DC",
      "Immigrant Song by Led Zeppelin",
      "We Will Rock You by Queen",
      "Eye of the Tiger by Survivor"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Led Zeppelin's 'Immigrant Song' plays during the climactic battle sequence in Thor: Ragnarok.",
    "detailedExplanation": "Director Taika Waititi used Led Zeppelin's 'Immigrant Song' to great effect during the final battle sequence of Thor: Ragnarok, where Thor unleashes his full lightning powers against Hela's forces on the Rainbow Bridge. The song's Norse mythology references and driving rhythm perfectly complement the scene's epic nature. The song also appears earlier in the film during Thor's gladiator fight on Sakaar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thor:_Ragnarok",
    "citationTitle": "Wikipedia: Thor: Ragnarok"
  },
  {
    "id": "7d54f1bb-c13b-4412-8500-343f5fc80826",
    "text": "In Guardians of the Galaxy, what does Peter Quill call his ship?",
    "options": [
      "The Benatar",
      "The Milano",
      "The Quadrant",
      "The Orloni"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Peter Quill names his ship the Milano after actress Alyssa Milano.",
    "detailedExplanation": "Peter Quill's ship in the first Guardians of the Galaxy film is called the Milano, named after 1980s actress Alyssa Milano, whom Quill had a childhood crush on. The ship serves as the team's primary means of transportation and mobile base. In Guardians of the Galaxy Vol. 2, the ship is destroyed, and by Avengers: Infinity War, the team is using a new ship called the Benatar, named after singer Pat Benatar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_(film)",
    "citationTitle": "Wikipedia: Guardians of the Galaxy (film)"
  },
  {
    "id": "bd7ae1cb-f07d-4d24-8353-0b8420f49802",
    "text": "Which actor played the villain Aldrich Killian in Iron Man 3?",
    "options": [
      "Guy Pearce",
      "Ben Kingsley",
      "James Badge Dale",
      "Ty Simpkins"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Guy Pearce portrays Aldrich Killian, the main antagonist of Iron Man 3.",
    "detailedExplanation": "Guy Pearce plays Aldrich Killian, the brilliant scientist who becomes the true villain of Iron Man 3. Initially appearing as a disabled scientist seeking Tony Stark's help, Killian transforms himself using the Extremis virus and orchestrates the Mandarin terrorist attacks through actor Trevor Slattery (Ben Kingsley). Killian's character represents themes of disability, transformation, and revenge against Tony Stark's past arrogance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iron_Man_3",
    "citationTitle": "Wikipedia: Iron Man 3"
  },
  {
    "id": "0ce9f217-3a64-4052-bcbe-bfc35a15a32b",
    "text": "In Black Panther, what is the name of Wakanda's capital city?",
    "options": [
      "Birnin Zana",
      "Jabari-Land",
      "Necropolis",
      "Alkama Fields"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Birnin Zana, also known as the Golden City, is Wakanda's capital.",
    "detailedExplanation": "Birnin Zana, which translates to 'Golden City,' serves as the capital of Wakanda in the MCU. The city is built around a massive vibranium mound and features advanced technology seamlessly integrated with traditional African architecture. The Royal Palace, where the Black Panther rules, is located in this city. The other options represent different areas of Wakanda: Jabari-Land is the mountain region where the Jabari tribe lives, while Necropolis and Alkama Fields are other locations within the kingdom.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wakanda",
    "citationTitle": "Wikipedia: Wakanda"
  },
  {
    "id": "f8582d9d-1841-4565-ae35-3e5370e02144",
    "text": "In which MCU film does Spider-Man first appear?",
    "options": [
      "Spider-Man: Homecoming",
      "Captain America: Civil War",
      "Avengers: Infinity War",
      "Spider-Man: Far From Home"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Spider-Man made his MCU debut in Captain America: Civil War (2016).",
    "detailedExplanation": "Tom Holland's Spider-Man first appeared in the Marvel Cinematic Universe in Captain America: Civil War, released in May 2016. This was several months before his solo film Spider-Man: Homecoming hit theaters in July 2017. His appearance in Civil War was crucial for establishing the character within the MCU and setting up his relationship with Tony Stark/Iron Man.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spider-Man_in_film",
    "citationTitle": "Wikipedia: Spider-Man in film"
  },
  {
    "id": "3c8553af-cadb-4079-8824-757ee6e59a23",
    "text": "What is the name of the AI system that replaces FRIDAY after Tony Stark's death?",
    "options": [
      "KAREN",
      "EDITH",
      "FRIDAY",
      "JARVIS"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "EDITH (Even Dead, I'm The Hero) is the AI system Tony Stark left for Peter Parker.",
    "detailedExplanation": "EDITH, which stands for 'Even Dead, I'm The Hero,' is the advanced AI system that Tony Stark created and left to Peter Parker in Spider-Man: Far From Home. The system controls a massive network of weaponized drones and represents Stark's final gift and responsibility to Spider-Man. Unlike FRIDAY, which was Stark's personal AI assistant, EDITH was specifically designed as a legacy system.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spider-Man:_Far_From_Home",
    "citationTitle": "Wikipedia: Spider-Man: Far From Home"
  },
  {
    "id": "834517d8-ccab-40b0-93c9-60683ea92d46",
    "text": "Which Infinity Stone was hidden on Vormir?",
    "options": [
      "Power Stone",
      "Reality Stone",
      "Soul Stone",
      "Mind Stone"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Soul Stone was located on Vormir, guarded by the Red Skull.",
    "detailedExplanation": "The Soul Stone was revealed to be hidden on the planet Vormir in Avengers: Infinity War. It was guarded by Red Skull, who had been transported there after his encounter with the Tesseract in Captain America: The First Avenger. To obtain the Soul Stone, one must sacrifice someone they love, which led to the tragic death of Gamora when Thanos claimed it, and later Black Widow's sacrifice when the Avengers retrieved it during their time heist.",
    "citationUrl": "https://en.wikipedia.org/wiki/Infinity_Stones",
    "citationTitle": "Wikipedia: Infinity Stones"
  },
  {
    "id": "668d8af5-1bbd-4164-99bc-5ba83c087b4a",
    "text": "In Thor: Ragnarok, what is the name of the Grandmaster's planet?",
    "options": [
      "Asgard",
      "Sakaar",
      "Xandar",
      "Ego"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sakaar is the junk planet ruled by the Grandmaster where Thor becomes a gladiator.",
    "detailedExplanation": "Sakaar is the bizarre junk planet ruled by the eccentric Grandmaster (Jeff Goldblum) in Thor: Ragnarok. After being banished by Hela, Thor crash-lands on this world where he's forced to participate in gladiatorial contests. It's on Sakaar that Thor reunites with Hulk, who has been living there as the Grandmaster's champion gladiator. The planet serves as a crucial setting for Thor's character development and his eventual escape to save Asgard.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thor:_Ragnarok",
    "citationTitle": "Wikipedia: Thor: Ragnarok"
  },
  {
    "id": "19f820a0-40c5-4abe-bb06-da1fd3b64323",
    "text": "Which character says the line 'I am inevitable' in Avengers: Endgame?",
    "options": [
      "Ultron",
      "Loki",
      "Thanos",
      "Dormammu"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Thanos declares 'I am inevitable' during the final battle in Endgame.",
    "detailedExplanation": "Thanos speaks the iconic line 'I am inevitable' during the climactic final battle in Avengers: Endgame, just before snapping his fingers with what he believes are the complete Infinity Stones. This moment represents his absolute confidence in his destiny and mission. However, Tony Stark's reply of 'And I... am... Iron Man' before his own snap turns this moment into Thanos's ultimate defeat, making the line deeply ironic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avengers:_Endgame",
    "citationTitle": "Wikipedia: Avengers: Endgame"
  },
  {
    "id": "cbf948e6-f7ad-4fb0-9aef-2949321032e6",
    "text": "What is the name of Star-Lord's ship in Guardians of the Galaxy?",
    "options": [
      "The Benatar",
      "Milano",
      "The Dark Aster",
      "Sanctuary II"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Star-Lord's ship is called the Milano, named after actress Alyssa Milano.",
    "detailedExplanation": "The Milano is Peter Quill/Star-Lord's ship in the first two Guardians of the Galaxy films. According to director James Gunn, the ship was named after actress Alyssa Milano, whom Peter had a childhood crush on before being abducted from Earth. The Milano serves as the Guardians' primary mode of transportation and mobile base of operations. In later films, they use a different ship called the Benatar, named after singer Pat Benatar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_(film)",
    "citationTitle": "Wikipedia: Guardians of the Galaxy (film)"
  },
  {
    "id": "135f033f-0039-47a1-b307-966d1bce0a5e",
    "text": "Which actor plays the role of Vision in the MCU?",
    "options": [
      "Benedict Cumberbatch",
      "Paul Bettany",
      "Tom Hiddleston",
      "Mark Ruffalo"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Paul Bettany portrays Vision in the MCU films and WandaVision series.",
    "detailedExplanation": "Paul Bettany plays Vision in the Marvel Cinematic Universe, first appearing in Avengers: Age of Ultron. Interestingly, Bettany had already been part of the MCU since the first Iron Man film as the voice of JARVIS, Tony Stark's AI assistant. When JARVIS was given physical form as Vision, Bettany transitioned from voice work to on-screen performance, continuing the role through multiple films and the Disney+ series WandaVision.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vision_(Marvel_Comics)",
    "citationTitle": "Wikipedia: Vision (Marvel Comics)"
  },
  {
    "id": "4d62e388-c087-4014-9e97-215c0cfaddbe",
    "text": "Who directed the first two Guardians of the Galaxy films?",
    "options": [
      "Taika Waititi",
      "James Gunn",
      "Ryan Coogler",
      "Peyton Reed"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "James Gunn directed both Guardians of the Galaxy (2014) and Guardians of the Galaxy Vol. 2 (2017).",
    "detailedExplanation": "James Gunn wrote and directed the first two Guardians of the Galaxy films, bringing his unique blend of humor, heart, and spectacular soundtracks to the cosmic side of the MCU. His work transformed relatively obscure comic book characters into beloved household names. Although temporarily removed from the third film due to controversy, Gunn was later reinstated and returned to complete the trilogy with Guardians of the Galaxy Vol. 3.",
    "citationUrl": "https://en.wikipedia.org/wiki/James_Gunn",
    "citationTitle": "Wikipedia: James Gunn"
  },
  {
    "id": "4e5db434-3b4a-4737-a4d2-3fb70d5c8952",
    "text": "In Thor: Ragnarok, what planet does Thor find himself stranded on?",
    "options": [
      "Xandar",
      "Sakaar",
      "Asgard",
      "Jotunheim"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Thor is stranded on the planet Sakaar, ruled by the Grandmaster.",
    "detailedExplanation": "In Thor: Ragnarok, after being banished by Hela, Thor finds himself on the chaotic junk planet Sakaar, ruled by the eccentric Grandmaster (Jeff Goldblum). On Sakaar, Thor is forced to participate in gladiatorial contests and reunites with Hulk, who has been the planet's champion gladiator. This planet serves as a crucial setting where Thor loses his hammer, his hair, and eventually his eye, while gaining new allies for the final battle against Hela.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thor:_Ragnarok",
    "citationTitle": "Wikipedia: Thor: Ragnarok"
  },
  {
    "id": "21d96fa8-92f1-447f-98cd-64ad84d2dd4f",
    "text": "Which actress plays Gamora in the Guardians of the Galaxy films?",
    "options": [
      "Zoe Saldana",
      "Karen Gillan",
      "Pom Klementieff",
      "Elizabeth Debicki"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Zoe Saldana portrays Gamora, the green-skinned assassin and Guardian.",
    "detailedExplanation": "Zoe Saldana plays Gamora, the adopted daughter of Thanos and member of the Guardians of the Galaxy. Known as 'the most dangerous woman in the galaxy,' Gamora undergoes extensive makeup and prosthetics to achieve the character's distinctive green skin. Saldana's portrayal spans multiple MCU films, and she's notable for playing prominent characters in major sci-fi franchises, including Avatar and Star Trek, often requiring significant physical transformation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gamora_(Marvel_Cinematic_Universe)",
    "citationTitle": "Wikipedia: Gamora (Marvel Cinematic Universe)"
  },
  {
    "id": "fb9dc8e5-5fc6-41af-b1e3-a1d7733648e7",
    "text": "In Avengers: Endgame, how many years pass during the 'Blip' time jump?",
    "options": [
      "3 years",
      "5 years",
      "7 years",
      "10 years"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "There is a 5-year time jump between Thanos's snap and the events of the final battle.",
    "detailedExplanation": "Avengers: Endgame features a five-year time jump after Thanos's snap (referred to as 'the Blip') that wiped out half of all life in the universe. During this period, the world attempts to move on and rebuild, with the surviving Avengers dealing with their failure in different ways. This time jump allows the film to explore the long-term consequences of Thanos's actions and sets up the emotional stakes for the time heist that forms the movie's central plot.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avengers:_Endgame",
    "citationTitle": "Wikipedia: Avengers: Endgame"
  },
  {
    "id": "89d2c58f-5d5d-4d53-8da1-1fccfadaffc1",
    "text": "In 'Avengers: Endgame', what is the name of Tony Stark's daughter?",
    "options": [
      "Morgan Stark",
      "Pepper Stark",
      "Virginia Stark",
      "Maria Stark"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tony Stark's daughter is named Morgan Stark, played by Lexi Rabe.",
    "detailedExplanation": "Morgan Stark appears in Avengers: Endgame as the young daughter of Tony Stark and Pepper Potts. She plays a crucial emotional role in the film, representing what Tony has to lose and ultimately what motivates his final sacrifice. The character was portrayed by child actress Lexi Rabe and appears in several touching scenes with Robert Downey Jr.'s Tony Stark, including the famous 'I love you 3000' moment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avengers:_Endgame",
    "citationTitle": "Wikipedia: Avengers: Endgame"
  },
  {
    "id": "4fb817eb-ad84-4fa8-bf7b-ae0401ec52f1",
    "text": "In Avengers: Endgame, what is the name of Thor's new weapon that he dual-wields alongside Mjolnir during the final battle?",
    "options": [
      "Gungnir",
      "Stormbreaker",
      "Hofund",
      "Gram"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Stormbreaker is the axe-like weapon Thor forged in Avengers: Infinity War and continues to use in Endgame.",
    "detailedExplanation": "Stormbreaker was introduced in Avengers: Infinity War as Thor's new weapon, forged on Nidavellir with the help of Rocket and Groot. Unlike Mjolnir, which requires worthiness to lift, Stormbreaker can be wielded by anyone with sufficient strength. In Endgame's climactic battle, Thor memorably dual-wields both Stormbreaker and the restored Mjolnir against Thanos, showcasing his full power as the God of Thunder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stormbreaker_(comics)",
    "citationTitle": "Wikipedia: Stormbreaker"
  },
  {
    "id": "ad54076d-fb67-4b69-be1f-ea10030aa646",
    "text": "Which MCU film was the first to gross over $1 billion worldwide at the box office?",
    "options": [
      "Iron Man 3",
      "The Avengers",
      "Avengers: Age of Ultron",
      "Captain America: Civil War"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Avengers (2012) was the first MCU film to cross the $1 billion mark, earning $1.518 billion worldwide.",
    "detailedExplanation": "The Avengers marked a major milestone for the MCU, becoming not only the culmination of Phase One but also the franchise's first billion-dollar hit. Released in 2012, it earned approximately $1.518 billion worldwide, making it the third-highest grossing film of all time at that point. This success validated Marvel's ambitious shared universe concept and set the stage for future ensemble films. The movie's massive box office performance demonstrated the appeal of bringing together multiple superhero franchises in a single film.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Avengers_(2012_film)",
    "citationTitle": "Wikipedia: The Avengers (2012 film)"
  }
]