[
  {
    "id": "9459e79a-8e4d-4fe4-b543-4c5ee4ea353f",
    "text": "Which social media platform is known for its character limit on posts?",
    "options": [
      "Facebook",
      "Twitter",
      "Instagram",
      "LinkedIn"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Twitter is famous for its character limit on posts, originally 140 characters and later expanded to 280.",
    "detailedExplanation": "Twitter, launched in 2006, became known for its unique constraint of limiting posts (called 'tweets') to a specific character count. The platform originally had a 140-character limit, which was later doubled to 280 characters in 2017 for most languages. This limitation encouraged concise communication and became one of Twitter's defining features, distinguishing it from other social media platforms that allowed longer-form content.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twitter",
    "citationTitle": "Wikipedia: Twitter"
  },
  {
    "id": "1cfa223b-2bb7-4a2d-8da0-68c36aebf613",
    "text": "What does the 'In' in LinkedIn stand for?",
    "options": [
      "Internet",
      "Individual",
      "Information",
      "It doesn't stand for anything specific"
    ],
    "correctIndex": 3,
    "category": "science",
    "difficulty": "easy",
    "explanation": "LinkedIn's name comes from 'Linked In' as in being connected or linked into a professional network.",
    "detailedExplanation": "LinkedIn was founded in 2003 as a professional networking platform. The name 'LinkedIn' comes from the concept of being 'linked in' to a professional network, emphasizing connections between professionals. The 'In' doesn't stand for a specific word but rather represents the idea of being connected or integrated into a network of professional contacts. The platform was designed to help people maintain professional relationships and advance their careers through networking.",
    "citationUrl": "https://en.wikipedia.org/wiki/LinkedIn",
    "citationTitle": "Wikipedia: LinkedIn"
  },
  {
    "id": "de3b39ad-58ab-48de-8da5-f6d9183515a5",
    "text": "Which platform is primarily known for disappearing messages and stories?",
    "options": [
      "WhatsApp",
      "Snapchat",
      "Telegram",
      "Signal"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Snapchat pioneered the concept of disappearing messages and stories that automatically delete after viewing.",
    "detailedExplanation": "Snapchat, launched in 2011, revolutionized social media by introducing the concept of ephemeral messaging - content that disappears after a set time. The platform's core feature was sending photos and videos that would automatically delete after being viewed, typically within 1-10 seconds. Snapchat also introduced 'Stories' - collections of snaps that disappear after 24 hours. This concept of disappearing content was so popular that it was later adopted by many other platforms including Instagram, Facebook, and WhatsApp.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snapchat",
    "citationTitle": "Wikipedia: Snapchat"
  },
  {
    "id": "085ac2c4-7760-4e80-b025-a3c388f674e6",
    "text": "What was the original name of Facebook when it was first launched?",
    "options": [
      "The Facebook",
      "FacePage",
      "Social Connect",
      "Campus Network"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Facebook was originally called 'The Facebook' when Mark Zuckerberg launched it in 2004.",
    "detailedExplanation": "When Mark Zuckerberg launched the platform in February 2004, it was called 'The Facebook,' named after the physical facebook directories given to students at some colleges. The site was initially limited to Harvard University students before expanding to other Ivy League schools and eventually all universities. The company dropped 'The' from its name in 2005, becoming simply 'Facebook.' The original concept was inspired by physical 'face books' that helped students identify and connect with their classmates.",
    "citationUrl": "https://en.wikipedia.org/wiki/Facebook",
    "citationTitle": "Wikipedia: Facebook"
  },
  {
    "id": "ade9ff71-4153-4ce0-a79e-d6dc391ac46d",
    "text": "Which video-sharing platform uses the slogan 'Broadcast Yourself'?",
    "options": [
      "TikTok",
      "Vimeo",
      "YouTube",
      "Dailymotion"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "YouTube's original slogan was 'Broadcast Yourself,' emphasizing user-generated content.",
    "detailedExplanation": "YouTube, founded in 2005, adopted the slogan 'Broadcast Yourself' to emphasize its mission of democratizing video sharing and allowing anyone to become a content creator. This slogan reflected the platform's revolutionary approach of enabling ordinary users to upload and share videos with a global audience, contrasting with traditional broadcasting which was limited to media companies. The slogan captured the essence of user-generated content and the platform's role in giving everyone a voice in the digital media landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/YouTube",
    "citationTitle": "Wikipedia: YouTube"
  },
  {
    "id": "fcca30ee-dc1c-40e5-9e81-579d9849c1cc",
    "text": "What is the maximum length of a TikTok video as of 2024?",
    "options": [
      "15 seconds",
      "1 minute",
      "3 minutes",
      "10 minutes"
    ],
    "correctIndex": 3,
    "category": "science",
    "difficulty": "easy",
    "explanation": "TikTok has gradually increased its maximum video length, reaching 10 minutes by 2022.",
    "detailedExplanation": "TikTok began with a 15-second video limit when it launched globally in 2018, emphasizing short-form content. However, the platform has continuously evolved to compete with other video platforms and accommodate creator needs. The company extended the limit to 60 seconds in 2021, then to 3 minutes later that year, and finally to 10 minutes in 2022. This evolution reflects TikTok's strategy to capture more viewing time and allow for more diverse content types, while still maintaining its core appeal of quick, engaging videos.",
    "citationUrl": "https://en.wikipedia.org/wiki/TikTok",
    "citationTitle": "Wikipedia: TikTok"
  },
  {
    "id": "6da08320-f609-47a7-b2c6-fd96a99972c6",
    "text": "Which platform is known for its distinctive square photo format (originally)?",
    "options": [
      "Pinterest",
      "Instagram",
      "Flickr",
      "500px"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Instagram was famous for its square photo format, inspired by Polaroid instant cameras.",
    "detailedExplanation": "Instagram, launched in 2010, originally only allowed square-format photos with a 1:1 aspect ratio, mimicking the aesthetic of Polaroid instant cameras and classic film photography. This distinctive square format became one of Instagram's signature features, encouraging users to think more carefully about composition and creating a consistent, organized look across the platform. While Instagram later added support for landscape and portrait orientations in 2015, the square format remains iconic and is still widely used by many users and brands for its classic, symmetrical appeal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Instagram",
    "citationTitle": "Wikipedia: Instagram"
  },
  {
    "id": "5a9fb906-7cc1-468a-8543-cda04d833bcc",
    "text": "Which social media platform was originally designed exclusively for college students?",
    "options": [
      "Twitter",
      "Facebook",
      "LinkedIn",
      "MySpace"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Facebook was initially exclusive to college students, starting at Harvard before expanding to other universities.",
    "detailedExplanation": "Facebook began as an exclusive platform for college students when Mark Zuckerberg launched it at Harvard University in February 2004. Initially called 'The Facebook,' it was only accessible to students with a valid university email address. The platform gradually expanded to other Ivy League schools, then to all universities, and eventually to high schools before opening to the general public in September 2006. This exclusive, educational origin helped establish Facebook's early user base and contributed to its rapid growth, as the exclusivity created demand and the college environment encouraged viral adoption.",
    "citationUrl": "https://en.wikipedia.org/wiki/History_of_Facebook",
    "citationTitle": "Wikipedia: History of Facebook"
  },
  {
    "id": "c77e4988-d562-42af-8ba3-2851efa7b350",
    "text": "What color is the iconic bird logo of Twitter?",
    "options": [
      "Blue",
      "Red",
      "Green",
      "Purple"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Twitter's bird logo is blue.",
    "detailedExplanation": "Twitter's mascot and logo features a blue bird, which has been the platform's signature color since its early days. The bird was originally called 'Larry the Bird' after basketball legend Larry Bird, and the blue color became synonymous with the Twitter brand identity until the platform's rebrand to X in 2023.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twitter",
    "citationTitle": "Wikipedia: Twitter"
  },
  {
    "id": "47491506-0a06-424d-a9b6-b95005c0c91a",
    "text": "Which social media platform is owned by Meta (formerly Facebook Inc.)?",
    "options": [
      "TikTok",
      "WhatsApp",
      "Discord",
      "Telegram"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "WhatsApp is owned by Meta.",
    "detailedExplanation": "WhatsApp was acquired by Facebook (now Meta) in 2014 for approximately $19 billion, making it one of the largest tech acquisitions in history. Along with Facebook and Instagram, WhatsApp is part of Meta's family of social media and messaging platforms, serving over 2 billion users worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/WhatsApp",
    "citationTitle": "Wikipedia: WhatsApp"
  },
  {
    "id": "c64c25af-38dd-4b45-8e13-cc68dee99041",
    "text": "What does the hashtag symbol (#) represent on social media platforms?",
    "options": [
      "Private message",
      "Tagged topic or keyword",
      "Premium account",
      "Admin post"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Hashtags represent tagged topics or keywords.",
    "detailedExplanation": "The hashtag (#) symbol is used across social media platforms to categorize content and make it discoverable. When users click on or search for a hashtag, they can see all public posts that include that tag. This system was popularized by Twitter and has since been adopted by virtually all major social media platforms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hashtag",
    "citationTitle": "Wikipedia: Hashtag"
  },
  {
    "id": "823c548d-4ded-44ba-8aee-c99caa59a93c",
    "text": "Which platform is primarily known for professional networking and career development?",
    "options": [
      "Pinterest",
      "LinkedIn",
      "Reddit",
      "Tumblr"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "LinkedIn is the professional networking platform.",
    "detailedExplanation": "LinkedIn was launched in 2003 as a social network specifically designed for professional networking, career development, and business connections. Users create profiles that resemble digital resumes, connect with colleagues and industry professionals, and share career-related content. It has become the dominant platform for professional networking with over 900 million users.",
    "citationUrl": "https://en.wikipedia.org/wiki/LinkedIn",
    "citationTitle": "Wikipedia: LinkedIn"
  },
  {
    "id": "219404d7-e8fb-43a0-8d87-dae4c42ed312",
    "text": "What type of content is Pinterest primarily designed for sharing?",
    "options": [
      "Text posts",
      "Audio clips",
      "Images and visual content",
      "Live streams"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Pinterest is designed for sharing images and visual content.",
    "detailedExplanation": "Pinterest operates as a visual discovery platform where users create boards to 'pin' images, infographics, and other visual content. The platform is organized around visual inspiration, DIY projects, recipes, fashion, and other lifestyle content. Users can save and organize visual content from across the web onto themed boards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pinterest",
    "citationTitle": "Wikipedia: Pinterest"
  },
  {
    "id": "720c9d77-abb3-4b1d-bc3e-f25c41a7fc5b",
    "text": "Which company owns both Instagram and WhatsApp?",
    "options": [
      "Google",
      "Microsoft",
      "Meta",
      "Apple"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Meta owns both Instagram and WhatsApp.",
    "detailedExplanation": "Meta (formerly Facebook Inc.) owns multiple major social media platforms including Facebook, Instagram (acquired in 2012), and WhatsApp (acquired in 2014). This makes Meta one of the most influential companies in social media, with its platforms collectively serving billions of users worldwide across different types of social networking and messaging services.",
    "citationUrl": "https://en.wikipedia.org/wiki/Meta_Platforms",
    "citationTitle": "Wikipedia: Meta Platforms"
  },
  {
    "id": "a8ee9f3a-9ec2-4e05-8d80-865c208e8d26",
    "text": "What is the main feature that distinguishes Reddit from other social media platforms?",
    "options": [
      "Video calling",
      "Upvoting and downvoting system",
      "Story features",
      "Live streaming"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Reddit's upvoting and downvoting system is its main distinguishing feature.",
    "detailedExplanation": "Reddit operates as a social news aggregation platform where users can submit content and vote on posts and comments using an upvote/downvote system. This voting mechanism determines the visibility and ranking of content, with highly upvoted content rising to the top. This democratic approach to content curation sets Reddit apart from other social media platforms that rely more on algorithmic feeds.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reddit",
    "citationTitle": "Wikipedia: Reddit"
  },
  {
    "id": "eacfb2c8-9e7a-4bc4-969a-35c8a5ca260d",
    "text": "Which social media platform was originally launched in China and became globally popular for short-form videos?",
    "options": [
      "Vine",
      "TikTok",
      "Snapchat",
      "Instagram Reels"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "TikTok originated in China and became globally popular for short videos.",
    "detailedExplanation": "TikTok was developed by Chinese company ByteDance and launched internationally in 2018, though it evolved from the Chinese app Douyin. The platform became a global phenomenon by focusing on short-form vertical videos with sophisticated editing tools, filters, and an algorithm that quickly learns user preferences. It has revolutionized social media consumption, particularly among younger demographics.",
    "citationUrl": "https://en.wikipedia.org/wiki/TikTok",
    "citationTitle": "Wikipedia: TikTok"
  },
  {
    "id": "dbf0431f-8714-4694-b094-cccb72012e5d",
    "text": "Which social media platform introduced the concept of 'Stories' that disappear after 24 hours?",
    "options": [
      "Instagram",
      "Snapchat",
      "Facebook",
      "Twitter"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Snapchat was the first platform to introduce Stories in 2013.",
    "detailedExplanation": "Snapchat pioneered the Stories feature in October 2013, allowing users to post photos and videos that would automatically disappear after 24 hours. This innovative approach to temporary content sharing was later adopted by many other social media platforms including Instagram, Facebook, and WhatsApp, but Snapchat deserves credit as the original creator of this now-ubiquitous social media feature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snapchat",
    "citationTitle": "Wikipedia: Snapchat"
  },
  {
    "id": "96f7f38a-5e48-4ce6-a4a6-586ba447e90a",
    "text": "What year was YouTube founded?",
    "options": [
      "2003",
      "2005",
      "2007",
      "2004"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "YouTube was founded in February 2005 by three former PayPal employees.",
    "detailedExplanation": "YouTube was created in February 2005 by Chad Hurley, Steve Chen, and Jawed Karim, who were all former employees of PayPal. The idea reportedly came from their difficulty sharing videos from a dinner party. The first YouTube video, titled 'Me at the zoo,' was uploaded by co-founder Jawed Karim on April 23, 2005. Google acquired YouTube in October 2006 for $1.65 billion, and it has since become the world's largest video-sharing platform.",
    "citationUrl": "https://en.wikipedia.org/wiki/YouTube",
    "citationTitle": "Wikipedia: YouTube"
  },
  {
    "id": "78e55247-79b3-4173-b84b-a76537ccde58",
    "text": "Which social media platform uses 'subreddits' to organize content?",
    "options": [
      "Discord",
      "Reddit",
      "Tumblr",
      "4chan"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Reddit organizes its content into topic-specific communities called subreddits.",
    "detailedExplanation": "Reddit uses a unique organizational system called subreddits, which are individual communities focused on specific topics, interests, or themes. Each subreddit is denoted by 'r/' followed by the community name (like r/technology or r/cooking). Users can subscribe to subreddits that interest them, and each community has its own rules, moderators, and culture. This system allows Reddit to host thousands of different communities on virtually every topic imaginable, making it one of the most diverse content platforms on the internet.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reddit",
    "citationTitle": "Wikipedia: Reddit"
  },
  {
    "id": "df86a473-3299-4398-b409-4447f1d98d05",
    "text": "Which company originally developed TikTok?",
    "options": [
      "Tencent",
      "ByteDance",
      "Alibaba",
      "Baidu"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "TikTok was developed by the Chinese company ByteDance.",
    "detailedExplanation": "TikTok was created by ByteDance, a Chinese technology company founded by Zhang Yiming in 2012. ByteDance originally launched a similar app called Douyin in China in September 2016, then released TikTok for international markets in 2017. The app gained massive popularity after ByteDance acquired Musical.ly in 2018 and merged it with TikTok. ByteDance remains the parent company of TikTok, though the app operates under different regional structures due to various regulatory requirements around the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/TikTok",
    "citationTitle": "Wikipedia: TikTok"
  }
]