[
  {
    "id": "ac19eec7-1c71-49d3-9645-dfb2d0745389",
    "text": "What was the original character limit for a single Twitter post when the platform launched in 2006?",
    "options": [
      "120 characters",
      "140 characters",
      "160 characters",
      "200 characters"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Twitter originally had a 140-character limit, inspired by SMS text message constraints.",
    "detailedExplanation": "When Twitter launched in 2006, it imposed a 140-character limit on tweets, which was designed around the constraints of SMS text messaging (160 characters minus space for username). This limitation became one of Twitter's defining features, encouraging concise communication. The limit was later expanded to 280 characters in 2017 for most languages, though the original constraint helped shape the platform's unique culture of brevity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twitter",
    "citationTitle": "Wikipedia: Twitter"
  },
  {
    "id": "df520874-7a4e-40fe-85ba-7bd909e53794",
    "text": "Which social media platform was originally called 'The Facebook' and was initially restricted to college students?",
    "options": [
      "MySpace",
      "Facebook",
      "Friendster",
      "LinkedIn"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Facebook was originally called 'The Facebook' and launched exclusively for Harvard students before expanding to other universities.",
    "detailedExplanation": "Facebook was founded by Mark Zuckerberg in 2004 as 'The Facebook' at Harvard University. Initially, it was exclusively available to college students with valid university email addresses, starting with Harvard before expanding to other Ivy League schools and eventually all universities. The platform dropped 'The' from its name in 2005 and opened to the general public in 2006. This exclusivity strategy helped create a sense of prestige and drove demand for access to the platform.",
    "citationUrl": "https://en.wikipedia.org/wiki/Facebook",
    "citationTitle": "Wikipedia: Facebook"
  },
  {
    "id": "91ab706e-1a1a-4a08-aab8-1907e1891019",
    "text": "What does the 'Ln' stand for in LinkedIn's original domain name and company structure?",
    "options": [
      "Link Network",
      "LinkedIn",
      "Link Navigator",
      "Linked Names"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "LinkedIn's name is simply a combination of 'Link' and 'In', representing the concept of linking people in professional networks.",
    "detailedExplanation": "LinkedIn was founded in 2003 by Reid Hoffman and launched as a professional networking platform. The name 'LinkedIn' is a portmanteau of 'Link' and 'In', emphasizing the platform's core purpose of linking professionals within their industries and networks. The company went public in 2011 and was later acquired by Microsoft in 2016 for $26.2 billion. LinkedIn has become the dominant platform for professional networking, job searching, and business-related social media activities.",
    "citationUrl": "https://en.wikipedia.org/wiki/LinkedIn",
    "citationTitle": "Wikipedia: LinkedIn"
  },
  {
    "id": "c8c50318-37d0-463d-a99c-b35dc1fd5530",
    "text": "Which video-sharing platform was created by three former PayPal employees and was originally intended for dating videos?",
    "options": [
      "Vimeo",
      "YouTube",
      "Dailymotion",
      "Metacafe"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "YouTube was founded by Chad Hurley, Steve Chen, and Jawed Karim, all former PayPal employees, with initial plans for a dating site.",
    "detailedExplanation": "YouTube was founded in February 2005 by Chad Hurley, Steve Chen, and Jawed Karim, who had all previously worked at PayPal. The original concept was for a video dating site where people could upload videos of themselves. However, the founders quickly pivoted to a general video-sharing platform when they realized the broader potential. The first YouTube video, 'Me at the zoo,' was uploaded by co-founder Jawed Karim on April 23, 2005. Google acquired YouTube for $1.65 billion in 2006, just 20 months after its creation.",
    "citationUrl": "https://en.wikipedia.org/wiki/YouTube",
    "citationTitle": "Wikipedia: YouTube"
  },
  {
    "id": "2b0fc4e9-3c9c-4822-a897-d87fc0eda763",
    "text": "What was the original name of the app that later became TikTok in international markets?",
    "options": [
      "Vine2",
      "Musical.ly",
      "Dubsmash",
      "Flipagram"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "TikTok evolved from Musical.ly, which was acquired by ByteDance and merged with their existing Douyin app.",
    "detailedExplanation": "Musical.ly was launched in 2014 by Alex Zhu and Luyu Yang as a short-form video platform focused on lip-syncing and music videos. The app gained massive popularity, particularly among teenagers. In 2017, Chinese company ByteDance acquired Musical.ly for approximately $800 million. In 2018, ByteDance merged Musical.ly with their existing Chinese app Douyin to create TikTok for international markets. This merger combined Musical.ly's Western user base with ByteDance's advanced algorithm technology, creating the global phenomenon known as TikTok today.",
    "citationUrl": "https://en.wikipedia.org/wiki/TikTok",
    "citationTitle": "Wikipedia: TikTok"
  },
  {
    "id": "17e55da4-4e9a-457e-a6a6-1240db5442cd",
    "text": "Which social media platform introduced the concept of 'Stories' that disappear after 24 hours, later copied by many other platforms?",
    "options": [
      "Instagram",
      "Snapchat",
      "Facebook",
      "WhatsApp"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Snapchat pioneered the 'Stories' feature in 2013, which was later adopted by Instagram, Facebook, and other platforms.",
    "detailedExplanation": "Snapchat introduced the 'Stories' feature in October 2013, allowing users to post photos and videos that would automatically disappear after 24 hours. This innovation was revolutionary as it encouraged more casual, unfiltered sharing compared to permanent posts. The feature became so successful that it was subsequently copied by numerous other platforms: Instagram Stories (2016), Facebook Stories (2017), WhatsApp Status (2017), and YouTube Stories (2018). This widespread adoption demonstrates how Snapchat's innovation fundamentally changed social media behavior and user expectations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snapchat",
    "citationTitle": "Wikipedia: Snapchat"
  },
  {
    "id": "b1e82f57-cb62-4f40-b34a-9ef2f3961f30",
    "text": "What programming language was primarily used to build the initial version of Facebook?",
    "options": [
      "Java",
      "Python",
      "PHP",
      "Ruby"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Facebook was initially built using PHP, chosen for its rapid development capabilities and ease of use for web applications.",
    "detailedExplanation": "Mark Zuckerberg chose PHP to build the original version of Facebook in his Harvard dorm room in 2004. PHP was selected because it allowed for rapid prototyping and development, making it ideal for a college project that needed to be built quickly. While Facebook has since evolved to use a complex architecture with multiple programming languages and technologies, including their own PHP dialect called Hack, the platform's foundation was built on PHP. This choice proved fortuitous as it allowed Facebook to scale rapidly in its early days while being accessible to developers familiar with web technologies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Facebook",
    "citationTitle": "Wikipedia: Facebook"
  },
  {
    "id": "86a250dd-354c-4494-bded-49f3d92cb442",
    "text": "Which social media platform was originally limited to 6-second video loops and was discontinued in 2017?",
    "options": [
      "Vine",
      "Periscope",
      "Meerkat",
      "Keek"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Vine was a short-form video platform limited to 6-second loops, launched by Twitter in 2013 and discontinued in 2017.",
    "detailedExplanation": "Vine was a video hosting service owned by Twitter that allowed users to create and share 6-second looping video clips. Launched in January 2013, Vine quickly became popular for its creative constraints that forced users to be innovative within the time limit. The platform gave rise to internet celebrities known as 'Viners' and influenced internet culture significantly. However, facing competition from platforms like Instagram (which extended video length) and declining user engagement, Twitter announced Vine's discontinuation in October 2016, with the app officially shutting down in January 2017. Its influence can be seen in today's short-form video platforms like TikTok.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vine_(service)",
    "citationTitle": "Wikipedia: Vine (service)"
  },
  {
    "id": "2b3e929c-db23-41a8-aa7f-c1e768dd0a08",
    "text": "Which social media platform was originally designed as a location-based check-in service and was one of the first to implement gamification with badges and mayorships?",
    "options": [
      "Foursquare",
      "Gowalla",
      "Brightkite",
      "Loopt"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Foursquare pioneered location-based social networking with check-ins and gamification elements.",
    "detailedExplanation": "Foursquare, launched in 2009, revolutionized social media by focusing on location-based services. Users could 'check in' at various venues to earn points and badges, with the most frequent visitor becoming the 'mayor' of that location. This gamification approach influenced many subsequent social platforms and helped establish location-based services as a key component of modern social media.",
    "citationUrl": "https://en.wikipedia.org/wiki/Foursquare_City_Guide",
    "citationTitle": "Wikipedia: Foursquare City Guide"
  },
  {
    "id": "bf462b99-bdeb-429c-a9f2-1e39f1030ece",
    "text": "What was the maximum price per share that Snapchat's parent company Snap Inc. reached during its IPO trading debut in March 2017?",
    "options": [
      "$29.44",
      "$24.48",
      "$31.50",
      "$27.09"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Snap Inc. shares peaked at $29.44 during their first day of trading on March 2, 2017.",
    "detailedExplanation": "Snap Inc.'s initial public offering was one of the most anticipated tech IPOs of 2017. The company priced its shares at $17 but saw significant first-day trading activity, with shares reaching a high of $29.44 before closing at $24.48. This represented a 44% gain from the IPO price and valued the company at approximately $28 billion, making it one of the largest tech IPOs since Facebook.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snap_Inc.",
    "citationTitle": "Wikipedia: Snap Inc."
  },
  {
    "id": "a176b6aa-255b-46a8-a816-311b67029bdb",
    "text": "Which feature did Instagram introduce in 2016 that allowed users to save posts privately without the original poster knowing?",
    "options": [
      "Collections",
      "Archive",
      "Bookmarks",
      "Private Save"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Instagram introduced the Bookmarks feature in December 2016, allowing users to privately save posts.",
    "detailedExplanation": "The Bookmarks feature was introduced by Instagram in December 2016 as a way for users to save posts they wanted to revisit later without having to like them publicly. This feature addressed a common user behavior where people would like posts just to save them for later reference. The saved posts are stored privately in the user's profile and are not visible to other users or the original poster.",
    "citationUrl": "https://en.wikipedia.org/wiki/Instagram",
    "citationTitle": "Wikipedia: Instagram"
  },
  {
    "id": "263c5719-ad17-4423-9267-20d39c54da42",
    "text": "What is the name of the proprietary algorithm that Pinterest uses to curate and recommend content to users based on their interests and behavior?",
    "options": [
      "Smart Feed",
      "Pinterest Lens",
      "Home Feed Algorithm",
      "Pin Ranking"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Pinterest uses the Home Feed Algorithm to personalize content recommendations for users.",
    "detailedExplanation": "Pinterest's Home Feed Algorithm is a sophisticated machine learning system that analyzes user behavior, including pins they save, boards they create, and content they engage with, to curate a personalized home feed. The algorithm considers factors like pin quality, user preferences, recent activity, and topic relevance to determine which pins to show each user, making Pinterest particularly effective for discovery and inspiration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pinterest",
    "citationTitle": "Wikipedia: Pinterest"
  },
  {
    "id": "c4d81656-a500-47a9-a1a1-e7075728aff3",
    "text": "Which social media platform was acquired by Verizon in 2017 for $350 million, representing a massive loss from its peak valuation of $1.1 billion?",
    "options": [
      "Tumblr",
      "Vine",
      "MySpace",
      "Flickr"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Tumblr was sold to Verizon for $350 million in 2017, far below its previous $1.1 billion valuation.",
    "detailedExplanation": "Tumblr, the microblogging platform known for its creative communities and multimedia content, was acquired by Verizon as part of its purchase of Yahoo in 2017. The $350 million price tag represented a significant decline from Yahoo's original $1.1 billion acquisition of Tumblr in 2013. The platform had struggled with monetization and content moderation issues, leading to its devaluation despite maintaining a dedicated user base.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tumblr",
    "citationTitle": "Wikipedia: Tumblr"
  },
  {
    "id": "21ae2333-80b9-4d66-a6f5-4c32632c2465",
    "text": "What does the 'X' in the rebranded name 'X' (formerly Twitter) represent according to Elon Musk's vision for the platform?",
    "options": [
      "An everything app",
      "Mathematical variable",
      "Crossing boundaries",
      "X-factor innovation"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Elon Musk envisioned 'X' as an 'everything app' combining social media, payments, and other services.",
    "detailedExplanation": "When Elon Musk rebranded Twitter to 'X' in July 2023, he described his vision of transforming the platform into an 'everything app' similar to China's WeChat. This concept would integrate social media, messaging, payments, shopping, and other services into a single platform. The 'X' branding reflects Musk's long-standing fascination with the letter, having previously used it for companies like X.com (which became PayPal) and SpaceX.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twitter",
    "citationTitle": "Wikipedia: Twitter"
  },
  {
    "id": "4878828f-fb70-4af3-b4a7-4f4899e7516f",
    "text": "Which professional networking feature did LinkedIn introduce in 2013 that allows users to publish long-form content directly on the platform?",
    "options": [
      "LinkedIn Articles",
      "Publishing Platform",
      "LinkedIn Pulse",
      "Professional Posts"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "LinkedIn Pulse was launched in 2013 as the platform's publishing feature for long-form content.",
    "detailedExplanation": "LinkedIn Pulse was originally launched as a standalone news app in 2013, but was later integrated into LinkedIn's main platform as a publishing tool. It allows users to write and publish long-form articles, positioning themselves as thought leaders in their industries. The feature transformed LinkedIn from a simple networking site into a content platform, enabling professionals to share insights, industry knowledge, and personal experiences with their network and beyond.",
    "citationUrl": "https://en.wikipedia.org/wiki/LinkedIn",
    "citationTitle": "Wikipedia: LinkedIn"
  },
  {
    "id": "895196b1-3d9d-467e-a565-7abc599de9d9",
    "text": "What is the name of the virtual reality social platform launched by Meta (Facebook) in 2021 as part of their metaverse initiative?",
    "options": [
      "Meta Spaces",
      "Horizon Worlds",
      "Virtual Reality Hub",
      "Meta Universe"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Horizon Worlds is Meta's virtual reality social platform launched in 2021 for metaverse experiences.",
    "detailedExplanation": "Horizon Worlds represents Meta's ambitious entry into virtual reality social networking, launched in December 2021. The platform allows users to create avatars, build virtual worlds, and interact with others in immersive VR environments using Oculus headsets. It's a key component of Meta's broader metaverse strategy, aiming to create persistent virtual spaces where people can socialize, work, and play, representing the company's vision for the future of social interaction beyond traditional 2D platforms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Horizon_Worlds",
    "citationTitle": "Wikipedia: Horizon Worlds"
  },
  {
    "id": "ec406ebc-8ae9-4818-b884-f8d693384e6f",
    "text": "Which social media platform's algorithm is known as 'EdgeRank' and determines what content appears in users' news feeds?",
    "options": [
      "Facebook",
      "Instagram",
      "Twitter",
      "LinkedIn"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Facebook's algorithm is called EdgeRank, which calculates the relevance of posts based on affinity, weight, and time decay.",
    "detailedExplanation": "EdgeRank is Facebook's proprietary algorithm that was officially named and explained by the company in 2010. It determines which posts appear in a user's news feed by calculating three main factors: affinity (how close the user is to the content creator), weight (the type of content and engagement it receives), and time decay (how recent the post is). While Facebook has evolved this algorithm significantly since then, EdgeRank remains the foundational concept behind how Facebook curates content for its billions of users.",
    "citationUrl": "https://en.wikipedia.org/wiki/Facebook",
    "citationTitle": "Wikipedia: Facebook"
  },
  {
    "id": "f6fc6211-5624-445c-a293-f0b41f8ce63b",
    "text": "What is the minimum age requirement to create an account on most major social media platforms including Facebook, Instagram, and Twitter?",
    "options": [
      "16 years old",
      "13 years old",
      "18 years old",
      "15 years old"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Most major social media platforms require users to be at least 13 years old, in compliance with COPPA regulations.",
    "detailedExplanation": "The minimum age of 13 for social media platforms is primarily due to the Children's Online Privacy Protection Act (COPPA) in the United States, which restricts the collection of personal information from children under 13. This has become the de facto standard for most major platforms globally, including Facebook, Instagram, Twitter, TikTok, and YouTube. Some platforms in certain regions have higher age requirements - for example, WhatsApp requires users to be 16 in Europe due to GDPR regulations, but 13 remains the most common global standard.",
    "citationUrl": "https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act",
    "citationTitle": "Wikipedia: Children's Online Privacy Protection Act"
  },
  {
    "id": "4f4ee578-a5f6-4663-9b3f-5369308f31c7",
    "text": "Which social media platform introduced the hashtag (#) symbol as a way to categorize and search content, later adopted by most other platforms?",
    "options": [
      "Facebook",
      "Instagram",
      "Twitter",
      "Tumblr"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Twitter was the first major social media platform to implement hashtags in 2007, revolutionizing content discovery and trending topics.",
    "detailedExplanation": "The hashtag was first proposed on Twitter by Chris Messina in August 2007 as a way to group related tweets together. Initially, Twitter was hesitant to adopt the feature, but it gained organic popularity among users, especially during events like the San Diego wildfires in 2007. Twitter officially embraced hashtags in 2009 by making them clickable links. The concept proved so successful that virtually every major social media platform subsequently adopted hashtags, including Instagram, Facebook, LinkedIn, and TikTok, fundamentally changing how content is organized and discovered across social media.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hashtag",
    "citationTitle": "Wikipedia: Hashtag"
  },
  {
    "id": "3b77e9c8-d12b-4f9b-9d61-669a4fd6f944",
    "text": "What was the original purchase price when Facebook acquired WhatsApp in 2014, making it one of the largest tech acquisitions in history?",
    "options": [
      "$12 billion",
      "$19 billion",
      "$25 billion",
      "$16 billion"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Facebook acquired WhatsApp for $19 billion in 2014, including $4 billion in cash, $12 billion in Facebook shares, and $3 billion in restricted stock units.",
    "detailedExplanation": "The WhatsApp acquisition by Facebook in February 2014 was valued at approximately $19 billion, making it one of the largest technology acquisitions ever at the time. The deal consisted of $4 billion in cash, $12 billion worth of Facebook shares, and an additional $3 billion in restricted stock units for WhatsApp employees that would vest over four years. This acquisition was particularly notable because WhatsApp had only 55 employees at the time, making it worth roughly $345 million per employee. The purchase was driven by WhatsApp's massive user base of 450 million monthly active users and its strong growth in international markets.",
    "citationUrl": "https://en.wikipedia.org/wiki/WhatsApp",
    "citationTitle": "Wikipedia: WhatsApp"
  }
]