[
  {
    "id": "f5f5c4f1-bb88-4fa2-aec8-b9c9159ceccc",
    "text": "Who delivered the famous 'I Have a Dream' speech during the 1963 March on Washington?",
    "options": [
      "Martin Luther King Jr.",
      "Malcolm X",
      "Rosa Parks",
      "Jesse Jackson"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Martin Luther King Jr. delivered the iconic 'I Have a Dream' speech on August 28, 1963.",
    "detailedExplanation": "Martin Luther King Jr. delivered his famous 'I Have a Dream' speech on August 28, 1963, during the March on Washington for Jobs and Freedom. The speech was delivered from the steps of the Lincoln Memorial to over 250,000 civil rights supporters and is considered one of the most important speeches in American history, calling for an end to racism and for civil and economic rights.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Have_a_Dream",
    "citationTitle": "Wikipedia: I Have a Dream"
  },
  {
    "id": "a50ea369-7860-4cdb-bf3e-42dc79a1f814",
    "text": "Rosa Parks sparked the Montgomery Bus Boycott by refusing to give up her seat on a bus in which year?",
    "options": [
      "1953",
      "1955",
      "1957",
      "1960"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Rosa Parks refused to give up her bus seat on December 1, 1955, sparking the Montgomery Bus Boycott.",
    "detailedExplanation": "On December 1, 1955, Rosa Parks, an African American seamstress, refused to give up her seat to a white passenger on a Montgomery city bus in Alabama. Her arrest sparked the Montgomery Bus Boycott, a 381-day mass protest that became a pivotal event in the Civil Rights Movement and led to a Supreme Court ruling that segregated buses were unconstitutional.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rosa_Parks",
    "citationTitle": "Wikipedia: Rosa Parks"
  },
  {
    "id": "c6e7118b-cd91-48b8-8247-5115612a2245",
    "text": "Which Indian leader used non-violent resistance to lead India's independence movement from British rule?",
    "options": [
      "Jawaharlal Nehru",
      "Mahatma Gandhi",
      "Subhas Chandra Bose",
      "Bhagat Singh"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Mahatma Gandhi led India's independence movement using non-violent civil disobedience methods.",
    "detailedExplanation": "Mahatma Gandhi pioneered the use of non-violent civil disobedience as a means of political protest. Through methods like the Salt March in 1930 and various boycotts of British goods, Gandhi mobilized millions of Indians in the struggle for independence. His philosophy of non-violence (ahimsa) influenced civil rights movements worldwide, including the American Civil Rights Movement led by Martin Luther King Jr.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mahatma_Gandhi",
    "citationTitle": "Wikipedia: Mahatma Gandhi"
  },
  {
    "id": "76c9d712-421c-486c-ace9-84862c878fd5",
    "text": "What was the name of the landmark 1954 Supreme Court case that declared racial segregation in public schools unconstitutional?",
    "options": [
      "Plessy v. Ferguson",
      "Brown v. Board of Education",
      "Roe v. Wade",
      "Miranda v. Arizona"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Brown v. Board of Education (1954) ruled that racial segregation in public schools was unconstitutional.",
    "detailedExplanation": "Brown v. Board of Education of Topeka was a landmark 1954 Supreme Court case that unanimously ruled that racial segregation of children in public schools was unconstitutional. The decision overturned the 'separate but equal' doctrine established by Plessy v. Ferguson in 1896, marking a major victory for the civil rights movement and paving the way for integration efforts across the United States.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brown_v._Board_of_Education",
    "citationTitle": "Wikipedia: Brown v. Board of Education"
  },
  {
    "id": "b1160af4-d978-47f0-8835-dd799ede98e7",
    "text": "Nelson Mandela was imprisoned for 27 years before becoming president of which country?",
    "options": [
      "Zimbabwe",
      "Kenya",
      "South Africa",
      "Nigeria"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Nelson Mandela was imprisoned for 27 years before becoming South Africa's first Black president in 1994.",
    "detailedExplanation": "Nelson Mandela was imprisoned from 1962 to 1990 for his anti-apartheid activities in South Africa. After his release, he led negotiations to end apartheid and establish multiracial elections. In 1994, he became South Africa's first Black president, serving until 1999. His peaceful transition from prisoner to president made him an international symbol of reconciliation and human rights.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nelson_Mandela",
    "citationTitle": "Wikipedia: Nelson Mandela"
  },
  {
    "id": "7fea7f43-b3ba-442c-9aae-8aaee2c8b10e",
    "text": "What does the acronym 'NAACP' stand for?",
    "options": [
      "National Association for the Advancement of Colored People",
      "North American Alliance of Civil Protection",
      "National Agency for African Cultural Programs",
      "New American Association of Community Partners"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "easy",
    "explanation": "NAACP stands for National Association for the Advancement of Colored People, founded in 1909.",
    "detailedExplanation": "The National Association for the Advancement of Colored People (NAACP) was founded in 1909 and is one of the oldest and most influential civil rights organizations in the United States. The organization has played a crucial role in fighting racial discrimination through legal challenges, lobbying efforts, and public education campaigns. The NAACP was instrumental in many landmark cases, including Brown v. Board of Education.",
    "citationUrl": "https://en.wikipedia.org/wiki/NAACP",
    "citationTitle": "Wikipedia: NAACP"
  },
  {
    "id": "76dbe608-4425-4a05-aca8-57c4612b8682",
    "text": "The Selma to Montgomery marches in 1965 were primarily focused on securing which right?",
    "options": [
      "School integration",
      "Voting rights",
      "Housing equality",
      "Employment opportunities"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Selma to Montgomery marches in 1965 were organized to demand voting rights for African Americans.",
    "detailedExplanation": "The Selma to Montgomery marches were three protest marches held in 1965 to demand voting rights for African Americans. The marches covered 54 miles from Selma to Montgomery, Alabama, and were met with violent resistance, particularly on 'Bloody Sunday' (March 7, 1965). The brutal images from the marches helped galvanize national support for voting rights legislation, leading to the passage of the Voting Rights Act of 1965.",
    "citationUrl": "https://en.wikipedia.org/wiki/Selma_to_Montgomery_marches",
    "citationTitle": "Wikipedia: Selma to Montgomery marches"
  },
  {
    "id": "609b0393-47ee-4290-b8ec-85371849bcf0",
    "text": "Which civil rights organization was founded by young activists and played a key role in sit-ins and freedom rides?",
    "options": [
      "SCLC (Southern Christian Leadership Conference)",
      "SNCC (Student Nonviolent Coordinating Committee)",
      "CORE (Congress of Racial Equality)",
      "Black Panthers"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "SNCC (Student Nonviolent Coordinating Committee) was founded by young activists in 1960 and organized many sit-ins and freedom rides.",
    "detailedExplanation": "The Student Nonviolent Coordinating Committee (SNCC) was founded in 1960 by young civil rights activists, many of whom were college students. SNCC played a crucial role in organizing sit-ins at segregated lunch counters, freedom rides on interstate buses, and voter registration drives in the South. The organization was known for its grassroots approach and willingness to put young people on the front lines of the civil rights struggle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Student_Nonviolent_Coordinating_Committee",
    "citationTitle": "Wikipedia: Student Nonviolent Coordinating Committee"
  },
  {
    "id": "9e3d8c15-076d-495b-b997-34b8d65dfee6",
    "text": "In which city did Rosa Parks refuse to give up her bus seat, sparking the Montgomery Bus Boycott?",
    "options": [
      "Birmingham",
      "Montgomery",
      "Memphis",
      "Atlanta"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Rosa Parks refused to give up her seat on a Montgomery city bus on December 1, 1955.",
    "detailedExplanation": "On December 1, 1955, Rosa Parks, a 42-year-old seamstress, refused to give up her seat to a white passenger on a Montgomery city bus in Alabama. Her arrest sparked the Montgomery Bus Boycott, which lasted 381 days and became a pivotal event in the Civil Rights Movement. The boycott was organized by the Montgomery Improvement Association, led by a young Martin Luther King Jr.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rosa_Parks",
    "citationTitle": "Wikipedia: Rosa Parks"
  },
  {
    "id": "36967a1a-a0e0-404b-9757-ada071984e27",
    "text": "What was the name of the group of nine African American students who integrated Little Rock Central High School in 1957?",
    "options": [
      "The Freedom Nine",
      "The Little Rock Nine",
      "The Arkansas Nine",
      "The Central Nine"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Little Rock Nine were the nine African American students who enrolled at Little Rock Central High School in 1957.",
    "detailedExplanation": "The Little Rock Nine were a group of nine African American students enrolled in Little Rock Central High School in 1957. Their enrollment was the first major test of the implementation of the Supreme Court's decision in Brown v. Board of Education. The students faced significant opposition and required federal intervention, including the deployment of federal troops by President Eisenhower to ensure their safety and enforce integration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Little_Rock_Nine",
    "citationTitle": "Wikipedia: Little Rock Nine"
  },
  {
    "id": "ca113515-bc8a-4aed-9714-6973d5aecb00",
    "text": "Which landmark Supreme Court case in 1954 declared racial segregation in public schools unconstitutional?",
    "options": [
      "Plessy v. Ferguson",
      "Brown v. Board of Education",
      "Loving v. Virginia",
      "Miranda v. Arizona"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Brown v. Board of Education (1954) overturned the 'separate but equal' doctrine for public schools.",
    "detailedExplanation": "Brown v. Board of Education of Topeka was a landmark 1954 Supreme Court case that declared state laws establishing separate public schools for black and white students to be unconstitutional. The decision effectively overturned the Plessy v. Ferguson decision of 1896, which had allowed state-sponsored segregation. This ruling became a major catalyst for the Civil Rights Movement of the 1950s and 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brown_v._Board_of_Education",
    "citationTitle": "Wikipedia: Brown v. Board of Education"
  },
  {
    "id": "22f2b93e-9383-4a24-965c-a3648b662957",
    "text": "What were the discriminatory laws that enforced racial segregation in the Southern United States called?",
    "options": [
      "Black Codes",
      "Jim Crow Laws",
      "Segregation Acts",
      "Southern Codes"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Jim Crow Laws were state and local laws that enforced racial segregation in the Southern United States.",
    "detailedExplanation": "Jim Crow Laws were a collection of state and local statutes that legalized racial segregation in the Southern United States from the late 19th century through the mid-20th century. These laws mandated the separation of white and black people in public spaces such as schools, transportation, restrooms, restaurants, and water fountains. The laws were enforced until 1965 and were a major target of the Civil Rights Movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jim_Crow_laws",
    "citationTitle": "Wikipedia: Jim Crow laws"
  },
  {
    "id": "277a1954-4f83-470d-969f-e90d9b94e476",
    "text": "In what year was the Civil Rights Act, which prohibited discrimination based on race, color, religion, sex, or national origin, signed into law?",
    "options": [
      "1963",
      "1964",
      "1965",
      "1968"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Civil Rights Act was signed into law by President Lyndon B. Johnson on July 2, 1964.",
    "detailedExplanation": "The Civil Rights Act of 1964 was landmark civil rights and labor law legislation that prohibited discrimination based on race, color, religion, sex, or national origin. It was signed into law by President Lyndon B. Johnson on July 2, 1964. The Act ended segregation in public places and banned employment discrimination, representing one of the crowning legislative achievements of the Civil Rights Movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964",
    "citationTitle": "Wikipedia: Civil Rights Act of 1964"
  },
  {
    "id": "e7b8dfdb-4b92-4f43-9861-83377df22c6a",
    "text": "What was the name of the peaceful protest strategy often used during the Civil Rights Movement where protesters would sit in segregated establishments?",
    "options": [
      "Stand-ins",
      "Sit-ins",
      "Walk-ins",
      "Sleep-ins"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Sit-ins were a form of nonviolent protest where demonstrators would occupy seats in segregated establishments.",
    "detailedExplanation": "Sit-ins were a form of nonviolent protest used during the Civil Rights Movement where demonstrators would sit in segregated public places and refuse to leave until they were served or arrested. The most famous sit-ins began on February 1, 1960, when four African American college students sat at a segregated lunch counter at Woolworth's in Greensboro, North Carolina. This sparked a wave of similar protests across the South.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sit-in",
    "citationTitle": "Wikipedia: Sit-in"
  },
  {
    "id": "270b1c7f-d039-463a-8d30-7ea94022561c",
    "text": "Who was the prominent civil rights leader known for advocating 'by any means necessary' and was a key figure in the Nation of Islam?",
    "options": [
      "Martin Luther King Jr.",
      "Malcolm X",
      "Stokely Carmichael",
      "Medgar Evers"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Malcolm X was known for his 'by any means necessary' philosophy and was a prominent minister in the Nation of Islam.",
    "detailedExplanation": "Malcolm X was an African American Muslim minister and human rights activist who was a prominent figure during the civil rights movement. He was known for his advocacy of Black nationalism and his famous phrase 'by any means necessary.' Malcolm X served as a spokesman for the Nation of Islam until 1964, when he broke with the group. His approach to civil rights often contrasted with the nonviolent philosophy of Martin Luther King Jr.",
    "citationUrl": "https://en.wikipedia.org/wiki/Malcolm_X",
    "citationTitle": "Wikipedia: Malcolm X"
  },
  {
    "id": "e2c9a0e2-af2e-4250-9e21-97bc61087a87",
    "text": "Which famous speech by Martin Luther King Jr. was delivered during the 1963 March on Washington?",
    "options": [
      "I Have a Dream",
      "Letter from Birmingham Jail",
      "Beyond Vietnam",
      "Where Do We Go From Here"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The 'I Have a Dream' speech was delivered by MLK on August 28, 1963, during the March on Washington for Jobs and Freedom.",
    "detailedExplanation": "Martin Luther King Jr.'s 'I Have a Dream' speech is one of the most iconic moments in American civil rights history. Delivered on August 28, 1963, from the steps of the Lincoln Memorial to over 250,000 civil rights supporters, the speech called for an end to racism and for civil and economic rights. The speech was largely improvised, as King departed from his prepared remarks to deliver the famous 'dream' portion that has become synonymous with the civil rights movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Have_a_Dream",
    "citationTitle": "Wikipedia: I Have a Dream"
  },
  {
    "id": "95011561-45f2-4dc0-b6fd-6b1e4d80f075",
    "text": "Rosa Parks sparked the Montgomery Bus Boycott in 1955 when she refused to give up her seat to a white passenger. In which U.S. state did this occur?",
    "options": [
      "Georgia",
      "Alabama",
      "Mississippi",
      "South Carolina"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Rosa Parks was arrested in Montgomery, Alabama, which led to the 381-day Montgomery Bus Boycott that helped launch the civil rights movement.",
    "detailedExplanation": "On December 1, 1955, Rosa Parks, a seamstress and NAACP member, was riding a Montgomery city bus in Alabama when she refused to give up her seat to a white passenger. Her arrest sparked the Montgomery Bus Boycott, organized by the Montgomery Improvement Association and led by a young Martin Luther King Jr. The boycott lasted 381 days and ended when the Supreme Court ruled that segregated public buses were unconstitutional, marking a significant victory for the civil rights movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Montgomery_bus_boycott",
    "citationTitle": "Wikipedia: Montgomery Bus Boycott"
  },
  {
    "id": "641ba322-98a9-4116-bab4-ef513fc06afc",
    "text": "What was the name of the 1960s student-led sit-in movement that began at a Woolworth's lunch counter?",
    "options": [
      "Birmingham Campaign",
      "Freedom Rides",
      "Greensboro sit-ins",
      "Selma to Montgomery marches"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Greensboro sit-ins began on February 1, 1960, when four African American college students sat at a whites-only lunch counter at Woolworth's in North Carolina.",
    "detailedExplanation": "The Greensboro sit-ins began on February 1, 1960, when four African American freshmen from North Carolina A&T State University sat down at the segregated lunch counter at Woolworth's in Greensboro, North Carolina. When refused service, they remained seated until the store closed. This act of peaceful protest sparked a wave of similar sit-ins across the South, involving thousands of students and becoming a pivotal strategy in the civil rights movement. The protests demonstrated the power of nonviolent resistance and student activism in challenging segregation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Greensboro_sit-ins",
    "citationTitle": "Wikipedia: Greensboro sit-ins"
  },
  {
    "id": "e68a5f44-72ef-4c82-844b-ee2a88dc748e",
    "text": "Which landmark legislation, signed by President Lyndon B. Johnson in 1964, outlawed discrimination based on race, color, religion, sex, or national origin?",
    "options": [
      "Voting Rights Act",
      "Civil Rights Act",
      "Fair Housing Act",
      "Equal Pay Act"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Civil Rights Act of 1964 was groundbreaking federal legislation that prohibited discrimination in public places, employment, and education.",
    "detailedExplanation": "The Civil Rights Act of 1964 was landmark federal legislation signed into law by President Lyndon B. Johnson on July 2, 1964. The act outlawed discrimination based on race, color, religion, sex, or national origin in public accommodations, employment, and education. It was one of the most significant achievements of the civil rights movement and represented the culmination of years of activism and struggle. The legislation effectively ended Jim Crow laws in the South and provided federal enforcement mechanisms to ensure compliance with anti-discrimination measures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964",
    "citationTitle": "Wikipedia: Civil Rights Act of 1964"
  },
  {
    "id": "aa98f097-5a93-4627-a77c-44c30179b119",
    "text": "Who delivered the famous 'I Have a Dream' speech during the March on Washington in 1963?",
    "options": [
      "Martin Luther King Jr.",
      "Malcolm X",
      "Rosa Parks",
      "Jesse Jackson"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Martin Luther King Jr. delivered the iconic 'I Have a Dream' speech on August 28, 1963.",
    "detailedExplanation": "Martin Luther King Jr. delivered his famous 'I Have a Dream' speech on August 28, 1963, during the March on Washington for Jobs and Freedom. Speaking from the steps of the Lincoln Memorial to over 250,000 participants, King's speech became one of the most powerful and memorable moments of the American civil rights movement. The speech called for an end to racism and for civil and economic rights, and it helped build momentum for the Civil Rights Act of 1964.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Have_a_Dream",
    "citationTitle": "Wikipedia: I Have a Dream"
  }
]