[
  {
    "id": "fdbfdae4-ce01-47d9-aac5-a10e1f5b4c4d",
    "text": "Which Supreme Court case established the 'separate but equal' doctrine that legally justified segregation for nearly 60 years?",
    "options": [
      "Dred Scott v. Sandford",
      "Plessy v. Ferguson",
      "Williams v. Mississippi",
      "The Civil Rights Cases"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Plessy v. Ferguson (1896) established the 'separate but equal' doctrine.",
    "detailedExplanation": "In 1896, the Supreme Court ruled 7-1 in Plessy v. Ferguson that racial segregation laws did not violate the U.S. Constitution as long as the facilities for each race were equal in quality. This decision provided legal justification for the Jim Crow laws and racial segregation that persisted until Brown v. Board of Education overturned it in 1954. The case originated when Homer Plessy, who was one-eighth black, deliberately violated Louisiana's Separate Car Act by sitting in a whites-only railway car.",
    "citationUrl": "https://en.wikipedia.org/wiki/Plessy_v._Ferguson",
    "citationTitle": "Wikipedia: Plessy v. Ferguson"
  },
  {
    "id": "3bbbbfce-4dba-427a-895e-f7fae1de71ef",
    "text": "What was the name of the organized campaign of mass resistance by white Southerners to racial integration following Brown v. Board of Education?",
    "options": [
      "Southern Manifesto",
      "Massive Resistance",
      "White Citizens' Councils",
      "Dixiecrat Movement"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Massive Resistance was Virginia Senator Harry F. Byrd's organized campaign against school integration.",
    "detailedExplanation": "Massive Resistance was a policy declared by Virginia Senator Harry F. Byrd Sr. and his political organization in response to the 1954 Brown v. Board of Education decision. The campaign involved using legal maneuvers, economic pressure, and even violence to prevent the racial integration of schools in the South. Virginia went so far as to close public schools rather than integrate them, and the policy influenced similar resistance efforts across the Southern states until the late 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Massive_resistance",
    "citationTitle": "Wikipedia: Massive Resistance"
  },
  {
    "id": "fc0b8106-88e2-4ba5-bfb3-cf1c05d5b320",
    "text": "Which civil rights organization was founded by Ella Baker, Martin Luther King Jr., and other leaders specifically to coordinate nonviolent protests across the South?",
    "options": [
      "Student Nonviolent Coordinating Committee (SNCC)",
      "Congress of Racial Equality (CORE)",
      "Southern Christian Leadership Conference (SCLC)",
      "National Association for the Advancement of Colored People (NAACP)"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Southern Christian Leadership Conference was founded in 1957 to coordinate nonviolent resistance.",
    "detailedExplanation": "The Southern Christian Leadership Conference (SCLC) was established in 1957 following the success of the Montgomery Bus Boycott. Founded by Martin Luther King Jr., Ella Baker, and other prominent civil rights leaders, the SCLC was created to harness the moral authority and organizing power of black churches to conduct nonviolent protests in the service of civil rights reform. Unlike the NAACP's focus on legal challenges, the SCLC emphasized mass action and civil disobedience as tools for social change.",
    "citationUrl": "https://en.wikipedia.org/wiki/Southern_Christian_Leadership_Conference",
    "citationTitle": "Wikipedia: Southern Christian Leadership Conference"
  },
  {
    "id": "22ffe7ae-103a-4b87-917a-525b09a75dfa",
    "text": "What was the name of the 1961 campaign where interracial groups of activists rode buses into the segregated South to test compliance with desegregation decisions?",
    "options": [
      "Journey of Reconciliation",
      "Freedom Rides",
      "Freedom Summer",
      "March Against Fear"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Freedom Rides were organized by CORE and SNCC to test interstate bus desegregation.",
    "detailedExplanation": "The Freedom Rides were organized in 1961 by the Congress of Racial Equality (CORE) and the Student Nonviolent Coordinating Committee (SNCC) to test the Supreme Court's decisions in Boynton v. Virginia, which declared segregated public buses unconstitutional. The interracial groups of activists faced violent opposition, particularly in Alabama where buses were firebombed and riders were brutally beaten. The federal government eventually intervened, and the Interstate Commerce Commission banned segregation in interstate travel facilities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Freedom_Riders",
    "citationTitle": "Wikipedia: Freedom Riders"
  },
  {
    "id": "4303e0d3-6aec-4933-bef5-d06e1dbbb3f0",
    "text": "Which landmark voting rights case resulted in the Supreme Court ruling that literacy tests and poll taxes were unconstitutional barriers to voting?",
    "options": [
      "Smith v. Allwright",
      "Harper v. Virginia State Board of Elections",
      "Gomillion v. Lightfoot",
      "South Carolina v. Katzenbach"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Harper v. Virginia State Board of Elections (1966) struck down poll taxes in state elections.",
    "detailedExplanation": "In Harper v. Virginia State Board of Elections (1966), the Supreme Court ruled 6-3 that Virginia's poll tax violated the Equal Protection Clause of the Fourteenth Amendment. The Court declared that wealth or fee-paying has no relation to voting qualifications, and that the right to vote is fundamental in a free and democratic society. This decision effectively eliminated poll taxes as a barrier to voting in both federal and state elections, removing one of the primary tools used to disenfranchise African American voters in the South.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harper_v._Virginia_State_Board_of_Elections",
    "citationTitle": "Wikipedia: Harper v. Virginia State Board of Elections"
  },
  {
    "id": "bdc69628-5c2c-4ce4-bb2c-80ebfba94c15",
    "text": "What was the name of the housing discrimination practice where banks and insurance companies refused services to residents of certain areas based on racial composition?",
    "options": [
      "Blockbusting",
      "White flight",
      "Redlining",
      "Covenant restriction"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Redlining was the systematic denial of services to residents of specific neighborhoods based on race.",
    "detailedExplanation": "Redlining was a discriminatory practice that began in the 1930s where banks, insurance companies, and other institutions would literally draw red lines on maps around neighborhoods with significant African American populations and refuse to provide mortgages, insurance, or other services to residents in those areas. This practice was institutionalized by federal agencies like the Home Owners' Loan Corporation and the Federal Housing Administration, creating systematic residential segregation and limiting wealth accumulation in black communities. The practice wasn't banned until the Fair Housing Act of 1968.",
    "citationUrl": "https://en.wikipedia.org/wiki/Redlining",
    "citationTitle": "Wikipedia: Redlining"
  },
  {
    "id": "377aadb8-3624-40f5-8af5-f3e3849396d0",
    "text": "Which civil rights leader coined the phrase 'Black Power' and later became honorary Prime Minister of the Black Panther Party?",
    "options": [
      "Huey P. Newton",
      "Bobby Seale",
      "Stokely Carmichael",
      "H. Rap Brown"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Stokely Carmichael popularized 'Black Power' during the 1966 March Against Fear in Mississippi.",
    "detailedExplanation": "Stokely Carmichael, chairman of the Student Nonviolent Coordinating Committee (SNCC), popularized the term 'Black Power' during the 1966 March Against Fear in Mississippi. His call for black self-determination and pride marked a shift away from the integrationist approach of earlier civil rights movements toward black nationalism and self-empowerment. Carmichael later joined the Black Panther Party as Honorary Prime Minister in 1967, though he eventually left due to ideological differences. He later changed his name to Kwame Ture and moved to Guinea, West Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stokely_Carmichael",
    "citationTitle": "Wikipedia: Stokely Carmichael"
  },
  {
    "id": "a60d7c00-e2f2-43fa-a7f8-e95aa0a3eb7f",
    "text": "What was the name of the 1964 voter registration campaign in Mississippi that brought over 1,000 mostly white college students to help register black voters?",
    "options": [
      "Mississippi Freedom Project",
      "Freedom Summer",
      "Delta Ministry",
      "Mississippi Freedom Democratic Party"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Freedom Summer was the 1964 campaign that brought national attention to voting rights violations in Mississippi.",
    "detailedExplanation": "Freedom Summer was a 1964 voter registration campaign organized by civil rights organizations including SNCC, CORE, and the NAACP. The project brought over 1,000 mostly white college volunteers to Mississippi to help register black voters and establish 'Freedom Schools' to educate disenfranchised African Americans. The campaign faced intense violent opposition, including the murders of three civil rights workers - James Chaney, Andrew Goodman, and Michael Schwerner. The national outrage over these killings and other violence helped build support for the Voting Rights Act of 1965.",
    "citationUrl": "https://en.wikipedia.org/wiki/Freedom_Summer",
    "citationTitle": "Wikipedia: Freedom Summer"
  },
  {
    "id": "ee0a6448-6c34-478a-99df-a474725405bb",
    "text": "Which civil rights activist coined the term 'Black Power' during the 1966 March Against Fear in Mississippi?",
    "options": [
      "Stokely Carmichael",
      "H. Rap Brown",
      "Malcolm X",
      "Eldridge Cleaver"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Stokely Carmichael popularized the term 'Black Power' during the 1966 March Against Fear.",
    "detailedExplanation": "Stokely Carmichael, chairman of the Student Nonviolent Coordinating Committee (SNCC), first used the phrase 'Black Power' as a political slogan during the June 1966 March Against Fear in Mississippi. The march was organized after James Meredith was shot while walking from Memphis to Jackson. Carmichael's use of the term marked a shift in the civil rights movement toward more militant activism and black nationalism, moving away from the integrationist approach favored by leaders like Martin Luther King Jr.",
    "citationUrl": "https://en.wikipedia.org/wiki/Black_Power",
    "citationTitle": "Wikipedia: Black Power"
  },
  {
    "id": "03eddb53-6078-4abc-ad8f-5b197a3c311c",
    "text": "The Indian National Congress adopted which resolution in 1929 that declared complete independence as India's political goal?",
    "options": [
      "Lahore Resolution",
      "Purna Swaraj Resolution",
      "Quit India Resolution",
      "Non-Cooperation Resolution"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Purna Swaraj Resolution was adopted at the Lahore session in 1929, declaring complete independence as the goal.",
    "detailedExplanation": "The Purna Swaraj Resolution (Complete Self-Rule Resolution) was adopted by the Indian National Congress at its Lahore session on December 31, 1929, under the presidency of Jawaharlal Nehru. This resolution marked a significant shift from seeking dominion status within the British Empire to demanding complete independence. The Congress decided to observe January 26, 1930, as Independence Day, and this date later became India's Republic Day. The resolution paved the way for Gandhi's Salt March and the Civil Disobedience Movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Purna_Swaraj",
    "citationTitle": "Wikipedia: Purna Swaraj"
  },
  {
    "id": "205e7539-9ae7-4ec6-a8e5-0e14e76a6176",
    "text": "Which South African township uprising in 1976 began as a protest against Afrikaans being made a compulsory language of instruction?",
    "options": [
      "Sharpeville Uprising",
      "Soweto Uprising",
      "Alexandra Uprising",
      "Langa Uprising"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Soweto Uprising began on June 16, 1976, as a student protest against the Afrikaans language requirement.",
    "detailedExplanation": "The Soweto Uprising began on June 16, 1976, when thousands of black students in Soweto protested against the Bantu Education Act's requirement that classes be conducted in Afrikaans. The students viewed this as another tool of oppression, as many teachers couldn't speak Afrikaans and students struggled to learn in what they considered the 'language of the oppressor.' Police opened fire on the peaceful student demonstration, killing 13-year-old Hector Pieterson among others. The uprising spread nationwide and became a turning point in the anti-apartheid struggle, with June 16 now celebrated as Youth Day in South Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/1976_Soweto_uprising",
    "citationTitle": "Wikipedia: 1976 Soweto uprising"
  },
  {
    "id": "9aaf05fd-3dde-4ed5-86ac-518556cf5391",
    "text": "What was the name of the legal doctrine that the NAACP's legal strategy aimed to overturn, which was established in the 1896 Plessy v. Ferguson case?",
    "options": [
      "Separate but equal",
      "State's rights",
      "Due process",
      "Equal protection"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The 'separate but equal' doctrine from Plessy v. Ferguson was the primary target of NAACP legal challenges.",
    "detailedExplanation": "The 'separate but equal' doctrine was established in the 1896 Supreme Court case Plessy v. Ferguson, which upheld racial segregation as constitutional as long as facilities were supposedly equal. The NAACP's Legal Defense Fund, led by lawyers like Charles Hamilton Houston and later Thurgood Marshall, developed a systematic legal strategy to challenge this doctrine. They focused on demonstrating that segregated facilities were inherently unequal, particularly in education cases. This strategy culminated in the landmark 1954 Brown v. Board of Education decision, which explicitly overturned the 'separate but equal' doctrine in public education.",
    "citationUrl": "https://en.wikipedia.org/wiki/Separate_but_equal",
    "citationTitle": "Wikipedia: Separate but equal"
  },
  {
    "id": "b0dbeb4c-6e00-42c8-ac56-85c090a1ec58",
    "text": "Which Native American activist organization occupied Alcatraz Island from 1969 to 1971 to protest federal policies?",
    "options": [
      "American Indian Movement (AIM)",
      "Indians of All Tribes",
      "National Congress of American Indians",
      "Native American Rights Fund"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Indians of All Tribes occupied Alcatraz Island for 19 months to draw attention to Native American rights.",
    "detailedExplanation": "Indians of All Tribes, led by activists including Richard Oakes and LaNada Means, occupied Alcatraz Island from November 1969 to June 1971. The occupation was based on the Treaty of Fort Laramie (1868), which stated that abandoned federal land should be returned to Native Americans. The occupiers established a community on the island, running their own school, day care, and medical clinic. They issued a proclamation offering to buy Alcatraz for $24 in glass beads and cloth, satirizing the supposed purchase of Manhattan. The occupation drew national attention to Native American issues and inspired the Red Power movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Occupation_of_Alcatraz",
    "citationTitle": "Wikipedia: Occupation of Alcatraz"
  },
  {
    "id": "01e9ef5c-523c-4aa0-9d2c-e40e511ba250",
    "text": "The Mattachine Society, founded in 1950, was one of the earliest organizations advocating for which group's civil rights?",
    "options": [
      "Women",
      "LGBTQ+ individuals",
      "Disabled individuals",
      "Elderly Americans"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Mattachine Society was one of the first sustained LGBTQ+ rights organizations in the United States.",
    "detailedExplanation": "The Mattachine Society was founded in Los Angeles in 1950 by Harry Hay and other activists as one of the first sustained organizations in the United States to advocate for gay rights. Named after medieval French societies of unmarried men, the Mattachine Society initially operated in secrecy due to the hostile political climate of the McCarthy era. The organization aimed to unite homosexuals, educate them about their rights, and lead political action to eliminate discrimination. Along with the Daughters of Bilitis (founded in 1955 for lesbians), the Mattachine Society laid important groundwork for the later gay liberation movement that emerged after the Stonewall riots in 1969.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mattachine_Society",
    "citationTitle": "Wikipedia: Mattachine Society"
  },
  {
    "id": "d0225bd2-a29f-4a6b-b377-8c3843d4dcc8",
    "text": "Which Chilean protest song became an anthem of resistance movements worldwide, including during the 1973 Chilean coup?",
    "options": [
      "Te Recuerdo Amanda",
      "Venceremos",
      "El pueblo unido jamás será vencido",
      "La Nueva Canción"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "'El pueblo unido jamás será vencido' became an international anthem of resistance and civil rights movements.",
    "detailedExplanation": "'El pueblo unido jamás será vencido' (The people united will never be defeated) was composed by Sergio Ortega with lyrics by Quilapayún in 1973. Originally created to support Salvador Allende's Popular Unity government in Chile, it became a powerful anthem of resistance after Pinochet's military coup. The song was quickly adopted by civil rights and liberation movements around the world, translated into numerous languages, and performed by international artists. Its message of unity and resistance resonated across different struggles for justice and democracy, making it one of the most recognizable protest songs globally.",
    "citationUrl": "https://en.wikipedia.org/wiki/El_pueblo_unido_jam%C3%A1s_ser%C3%A1_vencido",
    "citationTitle": "Wikipedia: El pueblo unido jamás será vencido"
  },
  {
    "id": "d114bb25-b6c1-4925-b074-cf1257d1a800",
    "text": "The 1965 Selma to Montgomery marches were primarily organized to protest restrictions on which fundamental right?",
    "options": [
      "Freedom of speech",
      "Voting rights",
      "Equal education",
      "Fair housing"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Selma to Montgomery marches focused specifically on securing voting rights for African Americans in the South.",
    "detailedExplanation": "The Selma to Montgomery marches in March 1965 were organized by civil rights leaders including Martin Luther King Jr. to protest discriminatory practices that prevented African Americans from exercising their voting rights. Despite the 15th Amendment, Southern states used tactics like literacy tests, poll taxes, and outright intimidation to disenfranchise black voters. The first march on March 7, known as 'Bloody Sunday,' saw peaceful protesters brutally attacked by state troopers at the Edmund Pettus Bridge. The violent images broadcast on television galvanized national support and directly contributed to the passage of the Voting Rights Act of 1965, which eliminated many barriers to voting.",
    "citationUrl": "https://en.wikipedia.org/wiki/Selma_to_Montgomery_marches",
    "citationTitle": "Wikipedia: Selma to Montgomery marches"
  },
  {
    "id": "d15bd913-31cd-41e5-8d5a-dc99a7886683",
    "text": "Which civil rights organization did Bayard Rustin help found in 1942, making him a pioneer of nonviolent resistance tactics in America?",
    "options": [
      "Southern Christian Leadership Conference",
      "Congress of Racial Equality",
      "Student Nonviolent Coordinating Committee",
      "National Association for the Advancement of Colored People"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Bayard Rustin co-founded the Congress of Racial Equality (CORE) in 1942.",
    "detailedExplanation": "Bayard Rustin, though often overlooked due to his homosexuality and former communist ties, was instrumental in bringing Gandhian nonviolent resistance methods to the American civil rights movement. In 1942, he helped establish the Congress of Racial Equality (CORE) in Chicago, which became one of the first organizations to systematically apply nonviolent direct action tactics to combat racial segregation. CORE pioneered sit-ins and freedom rides, techniques that would later become central to the broader civil rights movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bayard_Rustin",
    "citationTitle": "Wikipedia: Bayard Rustin"
  },
  {
    "id": "4b34f884-032d-4f0f-b897-f686e732b33a",
    "text": "The 1968 Poor People's Campaign culminated in the construction of a temporary city on the National Mall. What was this encampment called?",
    "options": [
      "Freedom City",
      "Resurrection City",
      "Justice Village",
      "Liberty Town"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The temporary encampment was called Resurrection City, housing thousands of protesters for six weeks.",
    "detailedExplanation": "Following Martin Luther King Jr.'s assassination, the Southern Christian Leadership Conference proceeded with his planned Poor People's Campaign in May 1968. The campaign established 'Resurrection City,' a temporary settlement of tents and makeshift structures on the National Mall in Washington, D.C. For six weeks, this encampment housed up to 3,000 protesters of various racial backgrounds, all demanding economic justice and an end to poverty. The city had its own zip code, mayor, and basic services, symbolizing the campaign's vision of multiracial economic solidarity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Poor_People%27s_Campaign",
    "citationTitle": "Wikipedia: Poor People's Campaign"
  },
  {
    "id": "000fc336-f1e8-4259-80bb-30a886f0c2bc",
    "text": "Which landmark Supreme Court case in 1944 struck down white-only primary elections, significantly advancing Black voting rights before Brown v. Board?",
    "options": [
      "Shelley v. Kraemer",
      "Smith v. Allwright",
      "Morgan v. Virginia",
      "Sweatt v. Painter"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Smith v. Allwright (1944) ruled that white-only Democratic primaries violated the 15th Amendment.",
    "detailedExplanation": "Smith v. Allwright was a crucial but often overlooked Supreme Court victory that predated the more famous Brown v. Board decision by a decade. The case challenged the Democratic Party's white-only primary system in Texas, which effectively disenfranchised Black voters since the Democratic primary winner almost always won the general election in the South. The Court ruled 8-1 that these exclusionary primaries violated the 15th Amendment, marking a significant step toward dismantling legal barriers to Black political participation and laying important groundwork for the voting rights struggles of the 1950s and 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Smith_v._Allwright",
    "citationTitle": "Wikipedia: Smith v. Allwright"
  },
  {
    "id": "bceef40e-1bc1-4a55-94fc-15a0cf3d49f4",
    "text": "What was the name of the secret network that helped approximately 40,000 enslaved people escape to freedom, led by figures like Harriet Tubman?",
    "options": [
      "Freedom Railroad",
      "Liberty Line",
      "Underground Railroad",
      "Escape Route"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Underground Railroad was the network of secret routes and safe houses used by enslaved people to escape to free states.",
    "detailedExplanation": "The Underground Railroad was a network of secret routes, safe houses, and abolitionists who helped enslaved African Americans escape to free states and Canada from the early 1800s until the Civil War. Despite its name, it was neither underground nor a railroad, but used railway terminology as code - 'stations' were safe houses, 'conductors' were guides, and 'passengers' were fleeing slaves. Harriet Tubman, known as 'Moses,' was the most famous conductor, making 19 trips and leading approximately 70 people to freedom. The network demonstrated remarkable courage and organization in the face of severe legal penalties.",
    "citationUrl": "https://en.wikipedia.org/wiki/Underground_Railroad",
    "citationTitle": "Wikipedia: Underground Railroad"
  }
]