[
  {
    "id": "6b584cf8-7bda-4370-9af2-30b0342e6f99",
    "text": "Which iconic speech by Martin Luther King Jr. was delivered during the 1963 March on Washington?",
    "options": [
      "Letter from Birmingham Jail",
      "I Have a Dream",
      "Beyond Vietnam",
      "Where Do We Go From Here"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The 'I Have a Dream' speech was delivered on August 28, 1963, during the March on Washington for Jobs and Freedom.",
    "detailedExplanation": "Martin Luther King Jr.'s 'I Have a Dream' speech is one of the most famous speeches in American history, delivered to over 250,000 civil rights supporters from the steps of the Lincoln Memorial in Washington, D.C. The speech called for an end to racism and outlined King's vision of a future where people would 'not be judged by the color of their skin but by the content of their character.' The March on Washington was a pivotal moment in the American Civil Rights Movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Have_a_Dream",
    "citationTitle": "Wikipedia: I Have a Dream"
  },
  {
    "id": "1a33f702-ade8-4f7d-bcb5-0cd1c7c33e4e",
    "text": "Rosa Parks' refusal to give up her bus seat in 1955 sparked a boycott in which Alabama city?",
    "options": [
      "Birmingham",
      "Mobile",
      "Montgomery",
      "Huntsville"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Rosa Parks was arrested in Montgomery, Alabama, leading to the Montgomery Bus Boycott that lasted 381 days.",
    "detailedExplanation": "On December 1, 1955, Rosa Parks, a seamstress and NAACP activist, refused to give up her seat to a white passenger on a Montgomery city bus, violating the city's racial segregation laws. Her arrest sparked the Montgomery Bus Boycott, organized by the Montgomery Improvement Association and led by a young Martin Luther King Jr. The boycott lasted from December 5, 1955, to December 20, 1956, and ended when the Supreme Court ruled that segregated public buses were unconstitutional.",
    "citationUrl": "https://en.wikipedia.org/wiki/Montgomery_bus_boycott",
    "citationTitle": "Wikipedia: Montgomery Bus Boycott"
  },
  {
    "id": "f8799659-ce84-4ca5-ac4b-6d6caea180db",
    "text": "What was the name of the 1961 civil rights campaign where activists rode interstate buses into segregated Southern states?",
    "options": [
      "Freedom Rides",
      "Journey of Reconciliation",
      "Southern Manifesto",
      "Liberty Express"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Freedom Rides were organized by the Congress of Racial Equality (CORE) to test Supreme Court decisions declaring segregated public buses unconstitutional.",
    "detailedExplanation": "The Freedom Rides were a series of bus trips through the American South in 1961 to protest segregated bus terminals. The rides were organized by CORE and the Student Nonviolent Coordinating Committee (SNCC) to test the Supreme Court decisions in Morgan v. Virginia (1946) and Boynton v. Virginia (1960), which declared segregated public buses and terminals unconstitutional. The Freedom Riders faced violent opposition, particularly in Alabama, but their courage helped bring national attention to civil rights violations in the South.",
    "citationUrl": "https://en.wikipedia.org/wiki/Freedom_Riders",
    "citationTitle": "Wikipedia: Freedom Riders"
  },
  {
    "id": "861823da-7fe2-45b9-b4d6-41e5ea71a653",
    "text": "Which landmark 1954 Supreme Court case declared racial segregation in public schools unconstitutional?",
    "options": [
      "Plessy v. Ferguson",
      "Brown v. Board of Education",
      "Loving v. Virginia",
      "Heart of Atlanta Motel v. United States"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Brown v. Board of Education overturned the 'separate but equal' doctrine and ruled that segregated schools were inherently unequal.",
    "detailedExplanation": "Brown v. Board of Education of Topeka was a landmark 1954 Supreme Court case that ruled unanimously that racial segregation of children in public schools was unconstitutional. The decision overturned the 1896 Plessy v. Ferguson case, which had established the 'separate but equal' doctrine. Chief Justice Earl Warren wrote that 'separate educational facilities are inherently unequal,' marking a major victory for the civil rights movement and setting the legal precedent for challenging segregation in other areas of American society.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brown_v._Board_of_Education",
    "citationTitle": "Wikipedia: Brown v. Board of Education"
  },
  {
    "id": "8db1862c-6b8d-48f7-a828-c28a4a9ae6fe",
    "text": "Who was the first African American student to enroll at the University of Mississippi in 1962, requiring federal intervention?",
    "options": [
      "Ruby Bridges",
      "James Meredith",
      "Thurgood Marshall",
      "Medgar Evers"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "James Meredith's enrollment at Ole Miss caused riots, prompting President Kennedy to send federal marshals and troops to ensure his safety.",
    "detailedExplanation": "James Meredith's attempt to enroll at the University of Mississippi in 1962 led to a major confrontation between federal and state authorities. Governor Ross Barnett tried to prevent Meredith's enrollment, leading to campus riots that resulted in two deaths and hundreds of injuries. President John F. Kennedy federalized the Mississippi National Guard and sent federal marshals to protect Meredith. The incident, known as the 'Battle of Oxford,' became a symbol of federal determination to enforce civil rights despite violent local opposition.",
    "citationUrl": "https://en.wikipedia.org/wiki/James_Meredith",
    "citationTitle": "Wikipedia: James Meredith"
  },
  {
    "id": "50b8e005-0fd7-444f-92a5-5be41fb03ab3",
    "text": "Which organization, founded in 1909, became known as the oldest civil rights organization in the United States?",
    "options": [
      "Southern Christian Leadership Conference",
      "Congress of Racial Equality",
      "NAACP",
      "Student Nonviolent Coordinating Committee"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The NAACP (National Association for the Advancement of Colored People) was founded in 1909 by a multiracial group of activists.",
    "detailedExplanation": "The National Association for the Advancement of Colored People (NAACP) was founded on February 12, 1909, by a diverse group of civil rights activists including Ida B. Wells, W.E.B. Du Bois, Henry Moskowitz, Mary White Ovington, and others. The organization was created in response to the ongoing violence against African Americans and the Springfield race riots of 1908. The NAACP became the most influential civil rights organization in the United States, using legal strategies to challenge segregation and discrimination, most notably in the Brown v. Board of Education case.",
    "citationUrl": "https://en.wikipedia.org/wiki/NAACP",
    "citationTitle": "Wikipedia: NAACP"
  },
  {
    "id": "0d6c10ed-071c-4621-853c-abbb77f499b0",
    "text": "The Civil Rights Act of 1964 was signed into law by which U.S. President?",
    "options": [
      "John F. Kennedy",
      "Lyndon B. Johnson",
      "Dwight D. Eisenhower",
      "Richard Nixon"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "President Lyndon B. Johnson signed the Civil Rights Act of 1964 into law on July 2, 1964, after it was initially proposed by President Kennedy.",
    "detailedExplanation": "The Civil Rights Act of 1964 was landmark legislation that outlawed discrimination based on race, color, religion, sex, or national origin. While initially proposed by President John F. Kennedy, it was signed into law by President Lyndon B. Johnson on July 2, 1964, following Kennedy's assassination. The act ended segregation in public places and banned employment discrimination, representing one of the crowning legislative achievements of the civil rights movement. Johnson famously remarked that signing the bill would cost the Democratic Party the South for a generation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964",
    "citationTitle": "Wikipedia: Civil Rights Act of 1964"
  },
  {
    "id": "54f85357-456c-4a72-849c-2bcc957201ca",
    "text": "Which bus boycott lasted 381 days and became a pivotal moment in the American Civil Rights Movement?",
    "options": [
      "Birmingham Bus Boycott",
      "Montgomery Bus Boycott",
      "Tallahassee Bus Boycott",
      "Baton Rouge Bus Boycott"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Montgomery Bus Boycott lasted from December 1955 to December 1956, sparked by Rosa Parks' arrest.",
    "detailedExplanation": "The Montgomery Bus Boycott began on December 5, 1955, after Rosa Parks was arrested for refusing to give up her seat to a white passenger. The boycott, organized by the Montgomery Improvement Association and led by Martin Luther King Jr., lasted 381 days and ended when the Supreme Court ruled that segregated public buses were unconstitutional. This event marked King's emergence as a national civil rights leader and demonstrated the power of nonviolent protest.",
    "citationUrl": "https://en.wikipedia.org/wiki/Montgomery_bus_boycott",
    "citationTitle": "Wikipedia: Montgomery Bus Boycott"
  },
  {
    "id": "bd5538d2-df4f-4ab2-99df-421fa18e3a85",
    "text": "Nelson Mandela was imprisoned for 27 years. On which island was he held for the majority of this time?",
    "options": [
      "Devil's Island",
      "Alcatraz Island",
      "Robben Island",
      "Rikers Island"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Mandela spent 18 of his 27 years in prison on Robben Island, a former leper colony off Cape Town.",
    "detailedExplanation": "Robben Island, located off the coast of Cape Town, South Africa, served as a maximum-security prison where Nelson Mandela was held from 1964 to 1982. The island had previously been used as a leper colony and military base. Mandela and other political prisoners were subjected to hard labor in limestone quarries. The prison became a symbol of the apartheid regime's oppression, and today it serves as a museum and UNESCO World Heritage Site.",
    "citationUrl": "https://en.wikipedia.org/wiki/Robben_Island",
    "citationTitle": "Wikipedia: Robben Island"
  },
  {
    "id": "1165dd09-6fd0-49c2-af07-93b06be60408",
    "text": "What was the name of the 1963 march where Martin Luther King Jr. delivered his famous 'I Have a Dream' speech?",
    "options": [
      "March Against Fear",
      "Selma to Montgomery March",
      "March on Washington for Jobs and Freedom",
      "Poor People's Campaign"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The March on Washington for Jobs and Freedom took place on August 28, 1963, where King delivered his iconic speech.",
    "detailedExplanation": "The March on Washington for Jobs and Freedom was organized by a coalition of civil rights, labor, and religious organizations on August 28, 1963. Approximately 250,000 people gathered at the Lincoln Memorial in Washington, D.C., to advocate for civil and economic rights for African Americans. The march was where Martin Luther King Jr. delivered his famous 'I Have a Dream' speech, which became one of the defining moments of the American Civil Rights Movement and helped build support for landmark civil rights legislation.",
    "citationUrl": "https://en.wikipedia.org/wiki/March_on_Washington_for_Jobs_and_Freedom",
    "citationTitle": "Wikipedia: March on Washington for Jobs and Freedom"
  },
  {
    "id": "232ea6d8-faaa-4eb2-8b1b-dc571cdcd931",
    "text": "Which Indian leader developed the concept of 'Satyagraha' as a form of nonviolent resistance?",
    "options": [
      "Jawaharlal Nehru",
      "Subhas Chandra Bose",
      "Mahatma Gandhi",
      "Bal Gangadhar Tilak"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Mahatma Gandhi developed Satyagraha, meaning 'truth-force,' as a method of nonviolent civil disobedience.",
    "detailedExplanation": "Mahatma Gandhi developed the philosophy and practice of Satyagraha, which literally means 'holding onto truth' or 'truth-force.' This form of nonviolent resistance was first employed during Gandhi's time in South Africa (1893-1915) fighting discriminatory laws against Indians. Gandhi later used Satyagraha extensively in India's independence movement, including during the Salt March of 1930. The concept influenced civil rights movements worldwide, including Martin Luther King Jr.'s approach in the United States.",
    "citationUrl": "https://en.wikipedia.org/wiki/Satyagraha",
    "citationTitle": "Wikipedia: Satyagraha"
  },
  {
    "id": "7344386b-fe64-441c-985d-b6b0ef83a9fd",
    "text": "The Stonewall Riots of 1969, which sparked the modern LGBTQ+ rights movement, took place in which New York City neighborhood?",
    "options": [
      "Harlem",
      "Greenwich Village",
      "Lower East Side",
      "Chelsea"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Stonewall Inn was located in Greenwich Village, where the riots began on June 28, 1969.",
    "detailedExplanation": "The Stonewall Riots began in the early morning hours of June 28, 1969, at the Stonewall Inn, a gay bar in Greenwich Village, Manhattan. The riots were sparked by a police raid on the bar, which was common at the time as homosexuality was largely criminalized. However, this time the patrons fought back, leading to several days of protests and violent clashes with law enforcement. The riots are widely considered the catalyst for the modern LGBTQ+ rights movement in the United States, leading to the formation of activist organizations and annual Pride parades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stonewall_riots",
    "citationTitle": "Wikipedia: Stonewall Riots"
  },
  {
    "id": "650e6aaf-5b71-468e-a353-d8fbe4118642",
    "text": "Which 1954 Supreme Court case declared racial segregation in public schools unconstitutional?",
    "options": [
      "Plessy v. Ferguson",
      "Brown v. Board of Education",
      "Loving v. Virginia",
      "Heart of Atlanta Motel v. United States"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Brown v. Board of Education overturned the 'separate but equal' doctrine established by Plessy v. Ferguson.",
    "detailedExplanation": "Brown v. Board of Education of Topeka was a landmark 1954 Supreme Court case that declared state laws establishing separate public schools for black and white students to be unconstitutional. The unanimous decision overturned the 'separate but equal' doctrine established by Plessy v. Ferguson in 1896. The case was actually a combination of five separate cases from different states, all challenging school segregation. Chief Justice Earl Warren wrote the opinion, stating that separate educational facilities were inherently unequal and violated the Equal Protection Clause of the 14th Amendment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brown_v._Board_of_Education",
    "citationTitle": "Wikipedia: Brown v. Board of Education"
  },
  {
    "id": "115b6116-89f9-47c7-8a66-ceeed3746a77",
    "text": "Which civil rights organization was founded in 1909 and is known by the acronym NAACP?",
    "options": [
      "National Association for the Advancement of Colored People",
      "National Alliance Against Civil Prejudice",
      "National Assembly for African Civil Progress",
      "National Action Against Color Prejudice"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The NAACP, founded in 1909, became one of the most influential civil rights organizations in American history.",
    "detailedExplanation": "The National Association for the Advancement of Colored People (NAACP) was founded on February 12, 1909, by a multiracial group of activists including Ida B. Wells, W.E.B. Du Bois, Henry Moscowitz, Mary White Ovington, Oswald Garrison Villand, and William English Walling. The organization was formed in response to the ongoing violence against African Americans and became the largest and most influential civil rights organization in the United States. The NAACP played crucial roles in landmark cases like Brown v. Board of Education and continues to advocate for civil rights today.",
    "citationUrl": "https://en.wikipedia.org/wiki/NAACP",
    "citationTitle": "Wikipedia: NAACP"
  },
  {
    "id": "7d30f3ba-8983-4ba9-9fd3-84e90ecd0d6e",
    "text": "Which historic march in 1963 culminated with Martin Luther King Jr.'s famous 'I Have a Dream' speech?",
    "options": [
      "March on Washington for Jobs and Freedom",
      "Selma to Montgomery March",
      "March Against Fear",
      "Prayer Pilgrimage for Freedom"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The March on Washington for Jobs and Freedom on August 28, 1963, where MLK delivered his iconic speech from the Lincoln Memorial steps.",
    "detailedExplanation": "The March on Washington for Jobs and Freedom took place on August 28, 1963, and was a pivotal moment in the American Civil Rights Movement. Over 250,000 people gathered at the Lincoln Memorial in Washington, D.C., to demand civil and economic rights for African Americans. It was here that Martin Luther King Jr. delivered his famous 'I Have a Dream' speech, which became one of the most iconic moments in civil rights history and helped build momentum for the Civil Rights Act of 1964.",
    "citationUrl": "https://en.wikipedia.org/wiki/March_on_Washington_for_Jobs_and_Freedom",
    "citationTitle": "Wikipedia: March on Washington for Jobs and Freedom"
  },
  {
    "id": "7d82de48-8354-4c8f-acb2-4e0fe947d949",
    "text": "What was the name of the legal doctrine that enforced racial segregation in the Southern United States until the 1960s?",
    "options": [
      "Separate but Equal",
      "Black Codes",
      "Jim Crow Laws",
      "Grandfather Clause"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Jim Crow Laws were state and local statutes that legalized racial segregation in the Southern United States from the 1870s through the mid-1960s.",
    "detailedExplanation": "Jim Crow Laws were a collection of state and local statutes that legalized racial segregation in the Southern United States. Named after a racist caricature of African Americans, these laws mandated the separation of white and black people in public spaces, schools, transportation, restrooms, restaurants, and water fountains. The laws were enforced from the 1870s into the mid-1960s and were designed to marginalize African Americans by denying them the right to vote, hold jobs, get an education or other opportunities while maintaining the 'separate but equal' doctrine established by Plessy v. Ferguson.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jim_Crow_laws",
    "citationTitle": "Wikipedia: Jim Crow laws"
  },
  {
    "id": "dcee9a6e-581c-408a-8283-00eb7630266e",
    "text": "Who was the first African American student to integrate an all-white elementary school in the American South in 1960?",
    "options": [
      "Dorothy Counts",
      "Ruby Bridges",
      "Linda Brown",
      "Carlotta Walls"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Ruby Bridges was six years old when she became the first African American child to integrate an all-white elementary school in the South at William Frantz Elementary in New Orleans.",
    "detailedExplanation": "Ruby Bridges made history on November 14, 1960, when she became the first African American child to integrate an all-white elementary school in the South. At just six years old, she walked through angry crowds of protesters to attend William Frantz Elementary School in New Orleans, Louisiana. Federal marshals had to escort her to school each day for her protection. Her courage in the face of intense hatred and violence became a powerful symbol of the civil rights movement and helped pave the way for school desegregation across the South.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ruby_Bridges",
    "citationTitle": "Wikipedia: Ruby Bridges"
  },
  {
    "id": "0ec8f2d9-8759-483b-a998-e1370cea6613",
    "text": "Which Indian activist's philosophy of non-violent resistance heavily influenced the American Civil Rights Movement?",
    "options": [
      "Jawaharlal Nehru",
      "Subhas Chandra Bose",
      "Mahatma Gandhi",
      "Sardar Patel"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Mahatma Gandhi's philosophy of satyagraha (non-violent resistance) greatly influenced Martin Luther King Jr. and other civil rights leaders in their peaceful protest strategies.",
    "detailedExplanation": "Mahatma Gandhi's philosophy of satyagraha, meaning 'truth-force' or non-violent resistance, profoundly influenced the American Civil Rights Movement. Martin Luther King Jr. studied Gandhi's methods of peaceful protest and civil disobedience that had successfully challenged British colonial rule in India. King adapted these principles to the American context, organizing boycotts, sit-ins, and peaceful marches that avoided violence while drawing attention to racial injustice. This approach proved highly effective in gaining public sympathy and political support for civil rights legislation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mahatma_Gandhi",
    "citationTitle": "Wikipedia: Mahatma Gandhi"
  },
  {
    "id": "e6e590bc-7c54-4b45-9825-9f957ca579fe",
    "text": "The Montgomery Bus Boycott, which lasted 381 days, was sparked by whose arrest for refusing to give up her bus seat?",
    "options": [
      "Rosa Parks",
      "Claudette Colvin",
      "Diane Nash",
      "Dorothy Height"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Rosa Parks' arrest on December 1, 1955, for refusing to give up her seat to a white passenger sparked the Montgomery Bus Boycott, a pivotal moment in the Civil Rights Movement.",
    "detailedExplanation": "On December 1, 1955, Rosa Parks, a 42-year-old African American seamstress, was arrested in Montgomery, Alabama, for refusing to give up her bus seat to a white passenger. Her act of defiance sparked the Montgomery Bus Boycott, which lasted 381 days and became one of the most significant protests of the Civil Rights Movement. The boycott, organized by Martin Luther King Jr. and others, successfully challenged the city's segregated public transportation system and demonstrated the economic power of coordinated non-violent resistance. The Supreme Court eventually ruled that segregated public buses were unconstitutional.",
    "citationUrl": "https://en.wikipedia.org/wiki/Montgomery_bus_boycott",
    "citationTitle": "Wikipedia: Montgomery bus boycott"
  },
  {
    "id": "960c1219-50e6-4eff-9567-460ff2ae1b1a",
    "text": "Which civil rights leader organized the 1963 March on Washington for Jobs and Freedom, where Martin Luther King Jr. delivered his famous 'I Have a Dream' speech?",
    "options": [
      "A. Philip Randolph",
      "Ralph Bunche",
      "Thurgood Marshall",
      "James Farmer"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "A. Philip Randolph, a prominent labor leader, was the chief organizer of the 1963 March on Washington.",
    "detailedExplanation": "Asa Philip Randolph was a labor leader and civil rights activist who served as the chief organizer of the March on Washington for Jobs and Freedom on August 28, 1963. Randolph had previously threatened to organize a similar march in 1941, which led President Roosevelt to create the Fair Employment Practice Committee. The 1963 march brought together over 250,000 people and featured Martin Luther King Jr.'s iconic 'I Have a Dream' speech, but it was Randolph's organizational skills and decades of activism that made the event possible.",
    "citationUrl": "https://en.wikipedia.org/wiki/March_on_Washington_for_Jobs_and_Freedom",
    "citationTitle": "Wikipedia: March on Washington for Jobs and Freedom"
  }
]