[
  {
    "id": "f477a62c-d310-4986-8a45-9f0474849300",
    "text": "What physical barrier divided East and West Berlin during the Cold War?",
    "options": [
      "The Iron Curtain",
      "The Berlin Wall",
      "The Brandenburg Gate",
      "The Checkpoint Charlie"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Berlin Wall was constructed in 1961 to physically separate East and West Berlin.",
    "detailedExplanation": "The Berlin Wall was erected by East German authorities on August 13, 1961, to prevent East Germans from fleeing to the West through Berlin. The concrete barrier stretched 87 miles around West Berlin and became one of the most potent symbols of the Cold War division between communist East and capitalist West. It stood for 28 years until it was torn down in 1989.",
    "citationUrl": "https://en.wikipedia.org/wiki/Berlin_Wall",
    "citationTitle": "Wikipedia: Berlin Wall"
  },
  {
    "id": "3784c668-122e-414a-a4ea-ae8b40e05738",
    "text": "Which conflict is often considered the first proxy war of the Cold War era?",
    "options": [
      "Vietnam War",
      "Korean War",
      "Cuban Revolution",
      "Hungarian Revolution"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Korean War (1950-1953) was the first major proxy conflict between the US-backed South and Soviet/Chinese-backed North Korea.",
    "detailedExplanation": "The Korean War began in June 1950 when North Korean forces invaded South Korea. The conflict quickly became a proxy war with the United States leading UN forces supporting South Korea, while China and the Soviet Union backed North Korea. The war ended in 1953 with an armistice that still remains in effect today, leaving Korea divided along the 38th parallel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Korean_War",
    "citationTitle": "Wikipedia: Korean War"
  },
  {
    "id": "87f768e8-9cee-4dd9-acca-817fb70dc18c",
    "text": "What was the name of the US policy aimed at preventing the spread of communism?",
    "options": [
      "Marshall Plan",
      "Containment",
      "Detente",
      "Mutual Assured Destruction"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Containment was the US strategy to prevent Soviet expansion and the spread of communist influence worldwide.",
    "detailedExplanation": "The Containment policy was developed by diplomat George F. Kennan in 1947 and became the cornerstone of US foreign policy during the Cold War. The strategy sought to prevent the expansion of Soviet influence and communist ideology through diplomatic, economic, and military means. This policy guided American involvement in conflicts like Korea and Vietnam and led to the creation of NATO.",
    "citationUrl": "https://en.wikipedia.org/wiki/Containment",
    "citationTitle": "Wikipedia: Containment"
  },
  {
    "id": "c8c16926-ced3-48ac-a990-912f3acd0788",
    "text": "During which crisis did the world come closest to nuclear war?",
    "options": [
      "Berlin Crisis",
      "Cuban Missile Crisis",
      "U-2 Incident",
      "Bay of Pigs Invasion"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Cuban Missile Crisis in October 1962 brought the US and Soviet Union to the brink of nuclear conflict.",
    "detailedExplanation": "The Cuban Missile Crisis lasted 13 days in October 1962 when the US discovered Soviet nuclear missiles in Cuba. President Kennedy imposed a naval blockade around Cuba and demanded removal of the missiles. The tense standoff included preparation for invasion and nuclear strikes before Soviet Premier Khrushchev agreed to remove the missiles in exchange for a US pledge not to invade Cuba.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "3e77a66f-f9f8-4662-af3e-e65f35c0bf7d",
    "text": "What military alliance was formed by Western nations in response to Soviet expansion?",
    "options": [
      "Warsaw Pact",
      "NATO",
      "SEATO",
      "ANZUS"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "NATO (North Atlantic Treaty Organization) was established in 1949 as a collective defense alliance against Soviet threats.",
    "detailedExplanation": "NATO was created on April 4, 1949, by twelve founding members including the United States, Canada, and ten Western European nations. The alliance was based on the principle of collective defense - an attack on one member would be considered an attack on all. NATO served as a counterbalance to Soviet military power and was answered by the Soviet Union's creation of the Warsaw Pact in 1955.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO",
    "citationTitle": "Wikipedia: NATO"
  },
  {
    "id": "8159d7aa-6135-406b-827b-fd6ea53295b7",
    "text": "Which Soviet leader initiated the policies of glasnost and perestroika?",
    "options": [
      "Leonid Brezhnev",
      "Yuri Andropov",
      "Mikhail Gorbachev",
      "Nikita Khrushchev"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Mikhail Gorbachev introduced glasnost (openness) and perestroika (restructuring) in the mid-1980s, leading to the end of the Cold War.",
    "detailedExplanation": "Mikhail Gorbachev became Soviet leader in 1985 and introduced sweeping reforms to revitalize the struggling Soviet system. Glasnost allowed greater freedom of speech and press, while perestroika aimed to restructure the Soviet economy and political system. These reforms ultimately led to greater openness with the West, reduced tensions, and inadvertently contributed to the collapse of communist governments across Eastern Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mikhail_Gorbachev",
    "citationTitle": "Wikipedia: Mikhail Gorbachev"
  },
  {
    "id": "2f7ba1fb-8435-4f79-9829-c38e42eae502",
    "text": "What was the failed CIA-backed invasion of Cuba called?",
    "options": [
      "Operation Mongoose",
      "Bay of Pigs Invasion",
      "Cuban Revolution",
      "Operation Northwoods"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Bay of Pigs Invasion in April 1961 was a failed attempt by CIA-trained Cuban exiles to overthrow Fidel Castro.",
    "detailedExplanation": "The Bay of Pigs Invasion took place on April 17, 1961, when approximately 1,400 Cuban exiles trained by the CIA attempted to invade Cuba and overthrow Fidel Castro's government. The operation was a disaster, with most invaders killed or captured within three days. The failure strengthened Castro's position, pushed Cuba closer to the Soviet Union, and was a major embarrassment for President Kennedy's administration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bay_of_Pigs_Invasion",
    "citationTitle": "Wikipedia: Bay of Pigs Invasion"
  },
  {
    "id": "643999da-f826-4af7-8039-375ecc34b6fa",
    "text": "In what year did the Berlin Wall fall, symbolizing the end of the Cold War?",
    "options": [
      "1987",
      "1989",
      "1991",
      "1985"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Berlin Wall fell on November 9, 1989, as East Germany opened its borders and citizens began tearing down the barrier.",
    "detailedExplanation": "The fall of the Berlin Wall occurred on November 9, 1989, following mounting pressure for reform in East Germany and confusion over new travel regulations. Thousands of East Berliners rushed to the border crossings, and guards eventually opened the gates. Citizens from both sides celebrated and began physically dismantling the wall with hammers and pickaxes, creating one of the most iconic moments in modern history and effectively ending the Cold War division of Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fall_of_the_Berlin_Wall",
    "citationTitle": "Wikipedia: Fall of the Berlin Wall"
  },
  {
    "id": "3506cc44-0353-4f30-b9cd-0e6ffee0be2d",
    "text": "Which event in 1962 brought the world closest to nuclear war?",
    "options": [
      "Berlin Blockade",
      "Cuban Missile Crisis",
      "Bay of Pigs Invasion",
      "Korean War"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Cuban Missile Crisis in October 1962 was the closest the world came to nuclear war.",
    "detailedExplanation": "The Cuban Missile Crisis occurred in October 1962 when the Soviet Union placed nuclear missiles in Cuba, just 90 miles from the US coast. For 13 tense days, President Kennedy and Premier Khrushchev engaged in a high-stakes diplomatic standoff that brought the superpowers to the brink of nuclear conflict before the Soviets agreed to remove the missiles.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "b5364db4-0489-4e7c-b31d-71535a2f4ca5",
    "text": "What was the name of the US-led military alliance formed in 1949?",
    "options": [
      "SEATO",
      "NATO",
      "ANZUS",
      "OAS"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "NATO (North Atlantic Treaty Organization) was established in 1949 as a Western military alliance.",
    "detailedExplanation": "The North Atlantic Treaty Organization (NATO) was formed on April 4, 1949, as a collective defense alliance between the United States, Canada, and Western European nations. It was created in response to growing Soviet influence in Eastern Europe and served as a counterbalance to communist expansion during the Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO",
    "citationTitle": "Wikipedia: NATO"
  },
  {
    "id": "d8f57acb-46ab-4094-b6f8-934a9d5c5497",
    "text": "In which year did the Berlin Wall fall?",
    "options": [
      "1987",
      "1988",
      "1989",
      "1990"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Berlin Wall fell on November 9, 1989, marking the beginning of the end of the Cold War.",
    "detailedExplanation": "The Berlin Wall fell on November 9, 1989, when East German authorities announced that citizens could cross the border freely. Thousands of East and West Berliners gathered at the wall and began celebrating and physically demolishing it with hammers and pickaxes. This event symbolized the collapse of communist control in Eastern Europe and the approaching end of the Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fall_of_the_Berlin_Wall",
    "citationTitle": "Wikipedia: Fall of the Berlin Wall"
  },
  {
    "id": "8726fd8e-ada6-4ae1-b048-86e278a2fe2f",
    "text": "What was the Soviet Union's military alliance counterpart to NATO called?",
    "options": [
      "Comintern",
      "Warsaw Pact",
      "COMECON",
      "Red Army Alliance"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Warsaw Pact was the Soviet-led military alliance formed in 1955.",
    "detailedExplanation": "The Warsaw Pact, officially called the Treaty of Friendship, Cooperation and Mutual Assistance, was established on May 14, 1955, as the Soviet Union's response to NATO and West Germany's integration into the Western alliance. It included the Soviet Union and seven Eastern European satellite states, serving as the primary military alliance of the communist bloc during the Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Warsaw_Pact",
    "citationTitle": "Wikipedia: Warsaw Pact"
  },
  {
    "id": "4eb17d9c-a018-4a1a-ab50-73a10660a3fc",
    "text": "Which US president announced the policy of 'containment' to stop communist expansion?",
    "options": [
      "Franklin D. Roosevelt",
      "Harry Truman",
      "Dwight Eisenhower",
      "John F. Kennedy"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Harry Truman announced the Truman Doctrine in 1947, establishing the policy of containment.",
    "detailedExplanation": "President Harry Truman announced the Truman Doctrine on March 12, 1947, pledging US support to countries threatened by Soviet expansion. This policy of 'containment' aimed to prevent the spread of communism and became the foundation of American Cold War strategy for decades, influencing US involvement in conflicts around the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Truman_Doctrine",
    "citationTitle": "Wikipedia: Truman Doctrine"
  },
  {
    "id": "d6b343c9-74e3-4b66-bcba-953f68a6b5d7",
    "text": "What was the name of the US economic aid program to rebuild Western Europe after World War II?",
    "options": [
      "Truman Plan",
      "Marshall Plan",
      "Eisenhower Doctrine",
      "Atlantic Charter"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Marshall Plan provided billions in economic aid to rebuild Western Europe from 1948-1952.",
    "detailedExplanation": "The Marshall Plan, officially known as the European Recovery Program, was announced by Secretary of State George Marshall in 1947 and implemented from 1948 to 1952. It provided over $13 billion in economic aid to help rebuild Western European economies after World War II, while also serving to strengthen these nations against potential communist influence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marshall_Plan",
    "citationTitle": "Wikipedia: Marshall Plan"
  },
  {
    "id": "ae8a70a3-d004-489e-a7a5-d53146d40fbf",
    "text": "Which Asian war (1950-1953) was considered the first 'hot war' of the Cold War era?",
    "options": [
      "Vietnam War",
      "Korean War",
      "Chinese Civil War",
      "Indonesian War"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Korean War (1950-1953) was the first major military conflict of the Cold War.",
    "detailedExplanation": "The Korean War began on June 25, 1950, when North Korean forces invaded South Korea. It became a proxy war between the superpowers, with the US leading UN forces supporting South Korea while China and the Soviet Union backed North Korea. The conflict ended in 1953 with an armistice that left Korea divided along the 38th parallel, where it remains today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Korean_War",
    "citationTitle": "Wikipedia: Korean War"
  },
  {
    "id": "6acef58c-6956-428d-9537-9d9c273ae55c",
    "text": "Which crisis brought the world closest to nuclear war in 1962?",
    "options": [
      "The Berlin Crisis",
      "The Cuban Missile Crisis",
      "The Korean War",
      "The Bay of Pigs Invasion"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Cuban Missile Crisis in October 1962 was the closest the superpowers came to nuclear conflict.",
    "detailedExplanation": "The Cuban Missile Crisis occurred in October 1962 when the United States discovered Soviet nuclear missiles in Cuba. For thirteen days, President Kennedy and Premier Khrushchev engaged in tense negotiations while the world teetered on the brink of nuclear war. The crisis was resolved when the Soviets agreed to remove the missiles from Cuba in exchange for a U.S. pledge not to invade Cuba and the secret removal of U.S. missiles from Turkey.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "7dabf4f5-1d50-4120-a69b-69a500ae91d1",
    "text": "What was the name of the U.S. plan to provide economic aid to Western Europe after World War II?",
    "options": [
      "The Truman Doctrine",
      "The Marshall Plan",
      "The Eisenhower Doctrine",
      "The Atlantic Charter"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Marshall Plan provided billions in aid to help rebuild Western Europe after WWII.",
    "detailedExplanation": "The Marshall Plan, officially known as the European Recovery Program, was announced by U.S. Secretary of State George Marshall in 1947. The plan provided over $12 billion in economic assistance to help rebuild Western European economies after World War II. It was designed not only to rebuild war-torn regions but also to prevent the spread of Soviet communism by creating strong, democratic allies in Western Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marshall_Plan",
    "citationTitle": "Wikipedia: Marshall Plan"
  },
  {
    "id": "5574b5fe-8963-4630-9da7-d7299e4c9ebc",
    "text": "Which military alliance was formed by NATO countries' communist counterparts in 1955?",
    "options": [
      "SEATO",
      "CENTO",
      "The Warsaw Pact",
      "The Cominform"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Warsaw Pact was the Soviet-led military alliance formed in response to NATO.",
    "detailedExplanation": "The Warsaw Pact, officially called the Treaty of Friendship, Cooperation and Mutual Assistance, was established on May 14, 1955, as a collective defense treaty among the Soviet Union and seven Eastern European countries. It was created in direct response to the formation of NATO and West Germany's integration into the Western alliance. The pact served as the Soviet Union's tool for maintaining control over Eastern Europe until it was dissolved in 1991.",
    "citationUrl": "https://en.wikipedia.org/wiki/Warsaw_Pact",
    "citationTitle": "Wikipedia: Warsaw Pact"
  },
  {
    "id": "099209c4-8528-44dc-8cdf-11114e34a277",
    "text": "What was the first major proxy war of the Cold War that lasted from 1950-1953?",
    "options": [
      "The Vietnam War",
      "The Korean War",
      "The Afghanistan War",
      "The Angola Civil War"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Korean War was the first major military conflict where the superpowers supported opposing sides.",
    "detailedExplanation": "The Korean War began on June 25, 1950, when North Korean forces invaded South Korea. The conflict became a proxy war between the superpowers, with the United States and other UN forces supporting South Korea, while China and the Soviet Union backed North Korea. The war ended in an armistice on July 27, 1953, with Korea remaining divided along roughly the same border as before the war, establishing the pattern for Cold War proxy conflicts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Korean_War",
    "citationTitle": "Wikipedia: Korean War"
  },
  {
    "id": "05dd9db3-05ca-4041-9b05-18790f289594",
    "text": "Which structure, built in 1961, became the most famous symbol of the Cold War division between East and West?",
    "options": [
      "The Iron Curtain",
      "The Berlin Wall",
      "Checkpoint Charlie",
      "The Brandenburg Gate"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Berlin Wall was built in 1961 to separate East and West Berlin and became the most iconic symbol of Cold War division.",
    "detailedExplanation": "The Berlin Wall was constructed starting on August 13, 1961, by the German Democratic Republic (East Germany) to prevent East Germans from fleeing to West Berlin and then to West Germany. The wall physically divided Berlin for 28 years and became the most powerful symbol of the Cold War's ideological divide between communist East and capitalist West. It stretched 96 miles around West Berlin and featured barbed wire, guard towers, and anti-vehicle trenches.",
    "citationUrl": "https://en.wikipedia.org/wiki/Berlin_Wall",
    "citationTitle": "Wikipedia: Berlin Wall"
  }
]