[
  {
    "id": "ce95fb19-95a6-4619-9f22-8b7164029626",
    "text": "Which Soviet leader was in power during the Cuban Missile Crisis and what codename did the Soviets use for their nuclear missile operation in Cuba?",
    "options": [
      "Stalin - Operation Mongoose",
      "Khrushchev - Operation Anadyr",
      "Brezhnev - Operation Red Star",
      "Malenkov - Operation Caribbean"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Nikita Khrushchev led the USSR during the 1962 Cuban Missile Crisis, with Operation Anadyr as the Soviet codename.",
    "detailedExplanation": "The Cuban Missile Crisis of October 1962 occurred under Nikita Khrushchev's leadership of the Soviet Union. The Soviets codenamed their secret operation to deploy nuclear missiles in Cuba 'Operation Anadyr,' named after a river in Siberia to mislead Western intelligence about the operation's true destination. The crisis brought the world closer to nuclear war than any other event during the Cold War, lasting 13 days before both superpowers reached a negotiated resolution.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "f6f3632d-2e3f-4f9b-95a9-636007ff541a",
    "text": "The 1983 'Able Archer 83' NATO military exercise nearly triggered what response from the Soviet Union?",
    "options": [
      "Invasion of West Germany",
      "Preemptive nuclear strike",
      "Withdrawal from arms control treaties",
      "Deployment of submarines to Cuba"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Soviet leadership believed Able Archer 83 might be cover for an actual NATO first strike and considered preemptive nuclear action.",
    "detailedExplanation": "Able Archer 83 was a NATO command post exercise simulating nuclear warfare that took place in November 1983. The exercise was so realistic that Soviet intelligence agencies, already on high alert due to recent tensions, believed it might be cover for an actual NATO first strike against the Soviet Union. Some Soviet leaders seriously considered launching a preemptive nuclear strike. The crisis was largely unknown to the public until years later and represented one of the most dangerous moments of the entire Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Able_Archer_83",
    "citationTitle": "Wikipedia: Able Archer 83"
  },
  {
    "id": "fc8faf8b-1fb9-4ed8-a934-4de1d516c75e",
    "text": "Which city was the site of the famous 1960 U-2 spy plane shootdown that derailed the Paris Summit between Eisenhower and Khrushchev?",
    "options": [
      "Murmansk",
      "Sverdlovsk",
      "Stalingrad",
      "Arkhangelsk"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Gary Powers' U-2 spy plane was shot down over Sverdlovsk (now Yekaterinburg) on May 1, 1960.",
    "detailedExplanation": "On May 1, 1960, CIA pilot Gary Powers was flying a U-2 spy plane on a reconnaissance mission over the Soviet Union when it was shot down by a surface-to-air missile near Sverdlovsk (now Yekaterinburg). Initially, the US claimed it was a weather research aircraft that had strayed off course, but the Soviets produced both the wreckage and Powers alive, creating a major diplomatic embarrassment. The incident led to the collapse of the Paris Summit scheduled for May 16, 1960, and significantly worsened US-Soviet relations.",
    "citationUrl": "https://en.wikipedia.org/wiki/1960_U-2_incident",
    "citationTitle": "Wikipedia: 1960 U-2 incident"
  },
  {
    "id": "3eaee74a-58ce-4cfc-8b25-f3997ce7eeb6",
    "text": "What was the name of the secret US program that recruited Nazi scientists after World War II, many of whom later worked on America's space and missile programs?",
    "options": [
      "Operation Paperclip",
      "Operation Mockingbird",
      "Operation Gladio",
      "Operation Northwoods"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Operation Paperclip secretly brought Nazi scientists to the US, including Wernher von Braun who later led NASA's moon program.",
    "detailedExplanation": "Operation Paperclip was a secret United States intelligence program that brought more than 1,600 German scientists, engineers, and technicians from Nazi Germany to the US after World War II. Many had been members of the Nazi Party and some had used slave labor during the war. The most famous was Wernher von Braun, who had developed the V-2 rocket and later became a key figure in NASA's Apollo program. The operation was controversial even within the US government and remained classified for decades, playing a significant role in America's Cold War technological competition with the Soviet Union.",
    "citationUrl": "https://en.wikipedia.org/wiki/Operation_Paperclip",
    "citationTitle": "Wikipedia: Operation Paperclip"
  },
  {
    "id": "f27cf815-dc31-4a25-b550-a5134744f8d5",
    "text": "During the Berlin Airlift (1948-1949), approximately how many flights per day were Western allies making at the peak of operations?",
    "options": [
      "500 flights",
      "800 flights",
      "1,400 flights",
      "2,000 flights"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "At its peak, the Berlin Airlift involved approximately 1,400 flights daily, with planes landing every few minutes.",
    "detailedExplanation": "The Berlin Airlift, known as Operation Vittles by the Americans and Operation Plainfare by the British, was launched in response to the Soviet blockade of West Berlin in June 1948. At its peak in spring 1949, the operation involved approximately 1,400 flights per day, with aircraft landing at Berlin's airports every few minutes around the clock. The massive logistical operation delivered over 2.3 million tons of supplies including food, fuel, and raw materials to sustain West Berlin's 2.5 million residents. The success of the airlift forced the Soviets to lift the blockade in May 1949.",
    "citationUrl": "https://en.wikipedia.org/wiki/Berlin_Blockade",
    "citationTitle": "Wikipedia: Berlin Blockade"
  },
  {
    "id": "42bc0cdd-1b40-4e7e-a33d-8687b0c8e02f",
    "text": "Which Soviet defector's 1954 revelations about KGB operations in the West led to the exposure of the Cambridge Five spy ring?",
    "options": [
      "Oleg Penkovsky",
      "Vladimir Petrov",
      "Igor Gouzenko",
      "Anatoly Golitsyn"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Vladimir Petrov's defection in Australia provided crucial intelligence that helped expose British intelligence officers working for the KGB.",
    "detailedExplanation": "Vladimir Petrov was a Soviet intelligence officer who defected to Australia in April 1954 along with his wife Evdokia. His defection, known as the Petrov Affair, provided Western intelligence with detailed information about Soviet espionage operations. While Petrov's direct revelations didn't immediately expose the Cambridge Five, his intelligence contributed to the growing suspicions about Soviet penetration of British intelligence that eventually led to uncovering the spy ring including Kim Philby, Donald Maclean, Guy Burgess, Anthony Blunt, and John Cairncross.",
    "citationUrl": "https://en.wikipedia.org/wiki/Petrov_Affair",
    "citationTitle": "Wikipedia: Petrov Affair"
  },
  {
    "id": "6eef8b98-4189-4ff3-81d3-ca72fb8e16b5",
    "text": "What was the maximum range of Soviet SS-20 intermediate-range ballistic missiles that prompted NATO's 'Double-Track Decision' in 1979?",
    "options": [
      "3,000 km",
      "5,000 km",
      "7,500 km",
      "10,000 km"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The SS-20 had a range of approximately 5,000 km, enough to hit targets throughout Western Europe from Soviet territory.",
    "detailedExplanation": "The Soviet SS-20 Saber (Pioneer) was a mobile intermediate-range ballistic missile with a range of approximately 5,000 kilometers and capable of carrying three nuclear warheads. Deployed starting in 1976, it could strike any target in Western Europe while remaining out of range of most NATO weapons. This capability prompted NATO's controversial 'Double-Track Decision' in December 1979, which called for negotiations with the Soviets while simultaneously preparing to deploy American Pershing II and cruise missiles in Europe. This decision sparked massive peace protests across Europe and marked a significant escalation in Cold War tensions.",
    "citationUrl": "https://en.wikipedia.org/wiki/RSD-10_Pioneer",
    "citationTitle": "Wikipedia: RSD-10 Pioneer"
  },
  {
    "id": "fe66985c-551f-454d-8a68-b510ecd13d51",
    "text": "The 1961 Bay of Pigs invasion was launched from which Central American country with CIA backing?",
    "options": [
      "Honduras",
      "Guatemala",
      "Nicaragua",
      "Costa Rica"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The CIA trained Cuban exiles in Guatemala before launching the failed Bay of Pigs invasion in April 1961.",
    "detailedExplanation": "The Bay of Pigs invasion was launched on April 17, 1961, by approximately 1,400 Cuban exiles who had been trained and equipped by the CIA in secret camps in Guatemala. The Guatemalan government of Miguel Ydígoras Fuentes had agreed to allow the use of their territory for training the exile force, known as Brigade 2506. The invasion was a complete failure, with most of the exile force killed or captured within 72 hours. The disaster severely damaged US-Cuban relations, pushed Cuba closer to the Soviet Union, and led to increased tensions that would culminate in the Cuban Missile Crisis the following year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bay_of_Pigs_Invasion",
    "citationTitle": "Wikipedia: Bay of Pigs Invasion"
  },
  {
    "id": "cf31b7d3-cebc-4a66-8134-efa852d4aff7",
    "text": "What was the codename for the CIA operation that attempted to overthrow Fidel Castro by landing Cuban exiles at the Bay of Pigs in 1961?",
    "options": [
      "Operation Mongoose",
      "Operation Zapata",
      "Operation Northwoods",
      "Operation Pluto"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Operation Zapata was the CIA codename for the Bay of Pigs invasion.",
    "detailedExplanation": "Operation Zapata was the official CIA codename for the failed Bay of Pigs invasion in April 1961. The operation involved training Cuban exiles in Guatemala and Nicaragua before launching an amphibious assault at the Bay of Pigs (Bahía de Cochinos) in Cuba. The invasion was a disaster, with most of the 1,400 Cuban exiles killed or captured within three days. Operation Mongoose was a later covert program, while Operation Northwoods was a proposed false flag operation that was never implemented.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bay_of_Pigs_Invasion",
    "citationTitle": "Wikipedia: Bay of Pigs Invasion"
  },
  {
    "id": "675ff866-ebb9-49b6-953f-44ddd06374d7",
    "text": "Which Soviet leader's speech at the 20th Party Congress in 1956 denounced Stalin's crimes and initiated de-Stalinization?",
    "options": [
      "Georgy Malenkov",
      "Nikita Khrushchev",
      "Leonid Brezhnev",
      "Lavrentiy Beria"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Nikita Khrushchev delivered the famous 'Secret Speech' denouncing Stalin in 1956.",
    "detailedExplanation": "Nikita Khrushchev's 'Secret Speech' (officially titled 'On the Cult of Personality and Its Consequences') was delivered to a closed session of the 20th Congress of the Communist Party of the Soviet Union on February 25, 1956. In this four-hour speech, Khrushchev systematically dismantled Stalin's legacy, revealing details of his purges, executions, and errors in judgment. The speech marked the beginning of de-Stalinization and had profound effects throughout the communist world, contributing to uprisings in Poland and Hungary later that year.",
    "citationUrl": "https://en.wikipedia.org/wiki/On_the_Cult_of_Personality_and_Its_Consequences",
    "citationTitle": "Wikipedia: On the Cult of Personality and Its Consequences"
  },
  {
    "id": "7009fbb4-cb66-4782-9c7f-ed1c4b0ed74a",
    "text": "During the Prague Spring of 1968, which Warsaw Pact countries participated in Operation Danube, the invasion that ended Czechoslovak liberalization?",
    "options": [
      "USSR, Poland, East Germany, Hungary, Bulgaria",
      "USSR, Poland, East Germany, Romania, Albania",
      "USSR, Poland, Hungary, Bulgaria, Yugoslavia",
      "USSR, East Germany, Hungary, Bulgaria, Romania"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Five Warsaw Pact countries invaded Czechoslovakia: USSR, Poland, East Germany, Hungary, and Bulgaria.",
    "detailedExplanation": "Operation Danube was launched on August 20-21, 1968, involving approximately 200,000 troops and 2,000 tanks from five Warsaw Pact countries: the Soviet Union, Poland, East Germany, Hungary, and Bulgaria. Notably, Romania refused to participate and actually condemned the invasion, while Albania had already distanced itself from the Warsaw Pact by this time. The invasion effectively ended Alexander Dubček's reforms and the period known as the Prague Spring, establishing the Brezhnev Doctrine which asserted the Soviet Union's right to intervene in socialist countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Warsaw_Pact_invasion_of_Czechoslovakia",
    "citationTitle": "Wikipedia: Warsaw Pact invasion of Czechoslovakia"
  },
  {
    "id": "3acad919-641c-4858-b3c2-90774eddd718",
    "text": "What was the name of the 1962 high-altitude nuclear test conducted by the United States that caused widespread electromagnetic pulse damage in Hawaii?",
    "options": [
      "Operation Fishbowl",
      "Operation Starfish Prime",
      "Operation Dominic",
      "Operation Hardtack"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Operation Starfish Prime was the 1962 high-altitude nuclear test that caused EMP damage in Hawaii.",
    "detailedExplanation": "Operation Starfish Prime was conducted on July 9, 1962, as part of the larger Operation Fishbowl test series. The 1.4-megaton nuclear warhead was detonated 400 kilometers above the Pacific Ocean, creating an electromagnetic pulse that knocked out street lights, set off burglar alarms, and damaged electrical equipment in Honolulu, nearly 1,400 kilometers away. The test also created artificial radiation belts around Earth and damaged several satellites. This test demonstrated the potential for high-altitude nuclear explosions to cause widespread electronic disruption, a concern that remains relevant today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Starfish_Prime",
    "citationTitle": "Wikipedia: Starfish Prime"
  },
  {
    "id": "131cbad1-cdfb-41e0-8f62-7f9474a78ade",
    "text": "Which East German border guard became famous for jumping over barbed wire to escape to West Berlin in August 1961, shortly after construction of the Berlin Wall began?",
    "options": [
      "Peter Fechter",
      "Conrad Schumann",
      "Chris Gueffroy",
      "Ida Siekmann"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Conrad Schumann made the famous leap over barbed wire to West Berlin in 1961.",
    "detailedExplanation": "On August 15, 1961, just two days after construction of the Berlin Wall began, 19-year-old East German border guard Conrad Schumann made a dramatic escape by jumping over the barbed wire barrier at the corner of Ruppiner Straße and Bernauer Straße. The moment was captured in an iconic photograph by Peter Leibing. Schumann had been stationed to prevent East Berliners from escaping, but instead chose freedom himself. He lived in West Germany until his death in 1998, though he reportedly struggled with homesickness and guilt about leaving his family behind.",
    "citationUrl": "https://en.wikipedia.org/wiki/Conrad_Schumann",
    "citationTitle": "Wikipedia: Conrad Schumann"
  },
  {
    "id": "441fedb5-495d-4bb8-8d07-e6d2c98c8e71",
    "text": "What was the name of the secret CIA project that tested mind control techniques using LSD and other drugs on unwitting subjects during the 1950s and 1960s?",
    "options": [
      "Project ARTICHOKE",
      "Project BLUEBIRD",
      "Project MKUltra",
      "Project CHATTER"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Project MKUltra was the CIA's notorious mind control program using LSD and other techniques.",
    "detailedExplanation": "Project MKUltra was a CIA program that ran from 1953 to approximately 1973, aimed at developing mind control techniques for interrogation and other purposes. Led by chemist Sidney Gottlieb, the project involved administering LSD and other psychoactive drugs to unwitting subjects, including CIA employees, military personnel, doctors, government agents, and members of the general public. The program included experiments at psychiatric hospitals, universities, and prisons. Most MKUltra records were destroyed in 1973 on orders of CIA Director Richard Helms, but the program was exposed during congressional investigations in the 1970s.",
    "citationUrl": "https://en.wikipedia.org/wiki/MKUltra",
    "citationTitle": "Wikipedia: MKUltra"
  },
  {
    "id": "f33343f7-f768-49bc-bd4d-5f467d314495",
    "text": "Which Soviet nuclear submarine suffered a reactor accident in 1961 that killed eight crew members and became the first nuclear submarine disaster?",
    "options": [
      "K-19",
      "K-8",
      "K-27",
      "K-129"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "K-19 suffered the first nuclear submarine reactor accident in 1961, killing eight crew members.",
    "detailedExplanation": "On July 4, 1961, the Soviet nuclear submarine K-19 suffered a major reactor coolant leak while on patrol in the North Atlantic. The submarine's nuclear reactor began to overheat dangerously, threatening a potential nuclear explosion. Captain Nikolai Zateyev ordered his crew to make emergency repairs without proper protective equipment, as the submarine carried nuclear ballistic missiles and was near NATO shipping lanes. Eight crew members died from acute radiation sickness within weeks, and many others suffered long-term health effects. The incident was kept secret for decades and inspired the 2002 film 'K-19: The Widowmaker.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Soviet_submarine_K-19",
    "citationTitle": "Wikipedia: Soviet submarine K-19"
  },
  {
    "id": "ae67570c-8618-4021-b90c-0b23c7274294",
    "text": "What was the name of the 1983 NATO military exercise that simulated nuclear warfare and reportedly brought the superpowers closest to nuclear war since the Cuban Missile Crisis?",
    "options": [
      "Able Archer 83",
      "Reforger 83",
      "Autumn Forge 83",
      "Wintex-Cimex 83"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Able Archer 83 was the NATO exercise that nearly triggered nuclear war due to Soviet paranoia.",
    "detailedExplanation": "Able Archer 83 was a NATO command post exercise conducted from November 2-11, 1983, that simulated a nuclear conflict scenario. The exercise featured realistic elements including radio silence, encrypted communications, and participation by high-level officials including President Reagan. Soviet intelligence, already on high alert due to recent tensions including the downing of KAL Flight 007, interpreted the exercise as preparation for an actual first strike. Some Soviet nuclear forces were placed on alert, and there were reports that Soviet submarines armed with nuclear weapons were deployed. The crisis was largely unknown to the West until years later when Soviet defectors revealed how close the world had come to nuclear war.",
    "citationUrl": "https://en.wikipedia.org/wiki/Able_Archer_83",
    "citationTitle": "Wikipedia: Able Archer 83"
  },
  {
    "id": "748df7f6-b2bf-426f-9675-69c05a9ce627",
    "text": "Which Cold War incident in 1960 involved Francis Gary Powers and led to the collapse of a major summit between Eisenhower and Khrushchev?",
    "options": [
      "U-2 spy plane shootdown",
      "Berlin Tunnel discovery",
      "Bay of Pigs invasion",
      "Abel-Powers prisoner exchange"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Francis Gary Powers was shot down in his U-2 spy plane over Soviet territory in May 1960.",
    "detailedExplanation": "On May 1, 1960, CIA pilot Francis Gary Powers was flying a U-2 reconnaissance mission over the Soviet Union when his aircraft was shot down by a surface-to-air missile. Initially, the U.S. claimed it was a weather research plane, but when the Soviets produced both Powers and wreckage of the spy equipment, the deception was exposed. This incident led to the collapse of the Paris Summit between Eisenhower and Khrushchev scheduled for later that month, significantly escalating Cold War tensions.",
    "citationUrl": "https://en.wikipedia.org/wiki/1960_U-2_incident",
    "citationTitle": "Wikipedia: 1960 U-2 incident"
  },
  {
    "id": "81c748a5-0c08-49fc-b9cb-abd5208b91f2",
    "text": "What was the codename for the failed 1956 Hungarian uprising against Soviet rule that resulted in approximately 200,000 refugees fleeing to Austria?",
    "options": [
      "Operation Ajax",
      "Hungarian Revolution of 1956",
      "Operation Valuable",
      "Prague Spring"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Hungarian Revolution of 1956 was brutally suppressed by Soviet forces, leading to mass refugee exodus.",
    "detailedExplanation": "The Hungarian Revolution of 1956 began on October 23 as a student demonstration in Budapest and quickly spread into a nationwide revolt against Soviet-imposed policies. Initially successful, with reformist Imre Nagy becoming Prime Minister, the revolution was crushed when Soviet tanks entered Budapest on November 4. The brutal suppression resulted in approximately 2,500 Hungarian deaths and over 200,000 refugees fleeing to neighboring Austria. The West's failure to intervene demonstrated the limits of the policy of 'rollback' and solidified Soviet control over Eastern Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hungarian_Revolution_of_1956",
    "citationTitle": "Wikipedia: Hungarian Revolution of 1956"
  },
  {
    "id": "7aa64e27-f9d9-453d-a31b-91cff9531619",
    "text": "Which Soviet submarine during the Cuban Missile Crisis nearly launched a nuclear torpedo, prevented only by the requirement for agreement from all three senior officers aboard?",
    "options": [
      "B-36",
      "B-59",
      "K-19",
      "B-37"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Soviet submarine B-59 nearly launched a nuclear torpedo during the Cuban Missile Crisis blockade.",
    "detailedExplanation": "On October 27, 1962, Soviet submarine B-59 was detected by U.S. Navy destroyers during the Cuban Missile Crisis blockade. Out of radio contact and under attack by depth charges, the submarine's captain and political officer wanted to launch a nuclear torpedo. However, Deputy Brigade Commander Captain Vasily Arkhipov refused to agree, and Soviet protocol required unanimous consent from all three senior officers. Arkhipov's decision prevented what could have been the start of nuclear war, making this one of the closest moments the world came to nuclear conflict during the Crisis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vasily_Arkhipov",
    "citationTitle": "Wikipedia: Vasily Arkhipov"
  },
  {
    "id": "caa1059d-3396-445e-b62b-1225c33f9e0c",
    "text": "The 1983 'Able Archer 83' NATO military exercise simulating nuclear warfare procedures caused such alarm in Moscow that some Soviet leaders believed what was actually happening?",
    "options": [
      "The U.S. was preparing to invade Cuba",
      "NATO was conducting a first strike drill",
      "The West was preparing an actual nuclear first strike",
      "The U.S. was testing new missile defense systems"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Soviet leadership feared Able Archer 83 was cover for an actual Western nuclear first strike preparation.",
    "detailedExplanation": "Able Archer 83 was a NATO command post exercise in November 1983 that simulated nuclear conflict escalation procedures. The exercise's realism, combined with recent tensions from the Soviet shootdown of KAL 007 and Reagan's 'Evil Empire' rhetoric, led some in Soviet leadership to believe the West might be using the exercise as cover for actual first strike preparations. The KGB placed intelligence services on high alert, and some Soviet nuclear forces were reportedly readied. This incident highlighted how close the superpowers came to miscalculation and nuclear war during this period of heightened Cold War tensions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Able_Archer_83",
    "citationTitle": "Wikipedia: Able Archer 83"
  }
]