[
  {
    "id": "62685f5b-565d-4892-a070-11cc48a7f9b2",
    "text": "Which Cold War crisis brought the world closest to nuclear war in October 1962?",
    "options": [
      "Berlin Crisis",
      "Bay of Pigs Invasion",
      "Cuban Missile Crisis",
      "Korean War"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Cuban Missile Crisis in October 1962 brought the superpowers to the brink of nuclear war.",
    "detailedExplanation": "The Cuban Missile Crisis of October 1962 was a 13-day confrontation between the United States and Soviet Union over Soviet ballistic missiles deployed in Cuba. President Kennedy imposed a naval blockade around Cuba, and for several days, the world stood on the brink of nuclear war. The crisis was resolved when the Soviets agreed to remove missiles from Cuba in exchange for the US not invading Cuba and secretly removing missiles from Turkey.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "0ba55637-f65e-4101-908d-327c38d22ade",
    "text": "Which operation saw the US and allies airlift supplies to West Berlin during the Soviet blockade of 1948-1949?",
    "options": [
      "Operation Vittles",
      "Operation Berlin Express",
      "Operation Airlift",
      "Operation Freedom"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Operation Vittles was the US codename for the Berlin Airlift that supplied West Berlin during the Soviet blockade.",
    "detailedExplanation": "Operation Vittles (also known as the Berlin Airlift) was the massive humanitarian effort from June 1948 to May 1949 to supply West Berlin during the Soviet blockade. The Soviets had blocked all road, rail, and water access to West Berlin. Allied forces flew over 200,000 flights, delivering more than 2.3 million tons of food, fuel, and supplies to sustain the city's 2.5 million residents.",
    "citationUrl": "https://en.wikipedia.org/wiki/Berlin_Blockade",
    "citationTitle": "Wikipedia: Berlin Blockade"
  },
  {
    "id": "af6e3c5f-1cfa-4d97-a346-137b5fb2602a",
    "text": "Which country did the Soviet Union invade in 1979, leading to a decade-long conflict often called 'Russia's Vietnam'?",
    "options": [
      "Czechoslovakia",
      "Hungary",
      "Afghanistan",
      "Poland"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Soviet Union invaded Afghanistan in 1979, beginning a costly nine-year war.",
    "detailedExplanation": "The Soviet-Afghan War began on December 24, 1979, when the Soviet Union invaded Afghanistan to support the communist People's Democratic Party of Afghanistan against the mujahideen resistance. The conflict lasted until 1989 and became known as the Soviet Union's Vietnam due to its length, cost, and ultimate failure. The war significantly weakened the Soviet Union economically and militarily, contributing to its eventual collapse.",
    "citationUrl": "https://en.wikipedia.org/wiki/Soviet%E2%80%93Afghan_War",
    "citationTitle": "Wikipedia: Soviet–Afghan War"
  },
  {
    "id": "80e8e9be-dfa7-4ca5-ac90-e6224b03083d",
    "text": "What was the name of the speech given by Winston Churchill in 1946 that popularized the term 'Iron Curtain'?",
    "options": [
      "The Sinews of Peace",
      "The Gathering Storm",
      "Blood, Toil, Tears and Sweat",
      "Their Finest Hour"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Churchill's 'The Sinews of Peace' speech at Westminster College popularized the term 'Iron Curtain'.",
    "detailedExplanation": "Winston Churchill delivered 'The Sinews of Peace' speech on March 5, 1946, at Westminster College in Fulton, Missouri. In this speech, he famously declared that 'an iron curtain has descended across the continent' of Europe, describing the division between Western democracies and Eastern European countries under Soviet influence. This speech is often considered one of the opening volleys of the Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iron_Curtain",
    "citationTitle": "Wikipedia: Iron Curtain"
  },
  {
    "id": "5a87dec7-71c7-45c6-ace7-a7a257ce674a",
    "text": "Which US President announced the doctrine of containing communism that became a cornerstone of Cold War policy?",
    "options": [
      "Franklin D. Roosevelt",
      "Harry S. Truman",
      "Dwight D. Eisenhower",
      "John F. Kennedy"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "President Harry Truman announced the Truman Doctrine in 1947, establishing the policy of containment.",
    "detailedExplanation": "President Harry Truman announced the Truman Doctrine on March 12, 1947, in a speech to Congress. The doctrine established the policy of containment, pledging US support for countries threatened by Soviet expansionism. Initially focused on Greece and Turkey, the doctrine became the foundation of American Cold War foreign policy, committing the United States to resist the spread of communism worldwide through economic and military aid.",
    "citationUrl": "https://en.wikipedia.org/wiki/Truman_Doctrine",
    "citationTitle": "Wikipedia: Truman Doctrine"
  },
  {
    "id": "088842d1-5393-4bdd-a897-d3a143c3b468",
    "text": "Which U.S. President famously delivered the 'Tear down this wall!' speech at the Brandenburg Gate in Berlin?",
    "options": [
      "Jimmy Carter",
      "Ronald Reagan",
      "George H.W. Bush",
      "Richard Nixon"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Ronald Reagan delivered this iconic speech on June 12, 1987, challenging Soviet leader Gorbachev to tear down the Berlin Wall.",
    "detailedExplanation": "President Ronald Reagan's speech at the Brandenburg Gate on June 12, 1987, became one of the most memorable moments of his presidency and the Cold War. Standing near the Berlin Wall, Reagan directly addressed Soviet leader Mikhail Gorbachev with the famous words 'Mr. Gorbachev, tear down this wall!' The speech was initially met with skepticism by some advisors who thought it too provocative, but it became a powerful symbol of American determination to end the division of Berlin and, by extension, the Cold War itself.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tear_down_this_wall!",
    "citationTitle": "Wikipedia: Tear down this wall!"
  },
  {
    "id": "9289951b-f9df-4ff3-9156-cd1e99feeb0e",
    "text": "The Cuban Missile Crisis occurred during which year?",
    "options": [
      "1961",
      "1962",
      "1963",
      "1964"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Cuban Missile Crisis took place in October 1962, bringing the world to the brink of nuclear war.",
    "detailedExplanation": "The Cuban Missile Crisis was a 13-day confrontation between the United States and the Soviet Union in October 1962, widely regarded as the closest the Cold War came to escalating into a full-scale nuclear war. The crisis began when American U-2 spy planes discovered Soviet medium-range ballistic missiles under construction in Cuba. President Kennedy imposed a naval quarantine around Cuba and demanded the removal of the missiles, leading to intense negotiations that ultimately resulted in the Soviets agreeing to remove the missiles in exchange for a U.S. pledge not to invade Cuba.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "66dcae92-ef15-49fa-967b-8ed28024df73",
    "text": "Which country was divided at the 38th parallel following World War II, leading to a major Cold War conflict?",
    "options": [
      "Vietnam",
      "Germany",
      "Korea",
      "China"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Korea was divided at the 38th parallel in 1945, with the North controlled by Soviet forces and the South by American forces.",
    "detailedExplanation": "Following Japan's surrender in World War II, Korea was divided at the 38th parallel as a temporary administrative measure, with Soviet forces occupying the north and American forces the south. This division became permanent as the Cold War intensified, leading to the establishment of communist North Korea and capitalist South Korea. The division ultimately resulted in the Korean War (1950-1953), which became a major proxy conflict of the Cold War, with Chinese and Soviet support for the North and UN (primarily American) support for the South.",
    "citationUrl": "https://en.wikipedia.org/wiki/Division_of_Korea",
    "citationTitle": "Wikipedia: Division of Korea"
  },
  {
    "id": "232b7a53-6cf7-46ad-b81d-49b4a24734b4",
    "text": "What was the name of the Soviet policy of openness and transparency introduced by Mikhail Gorbachev?",
    "options": [
      "Perestroika",
      "Glasnost",
      "Détente",
      "Demokratizatsiya"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Glasnost, meaning 'openness,' was Gorbachev's policy of increased transparency and freedom of information in the Soviet Union.",
    "detailedExplanation": "Glasnost, literally meaning 'openness' or 'transparency,' was a key policy introduced by Soviet leader Mikhail Gorbachev in the mid-1980s alongside Perestroika (restructuring). This policy aimed to increase transparency in government institutions and activities, allowing for greater freedom of information, speech, and press. Glasnost led to more open discussion of political and social issues, criticism of government policies, and revelation of historical truths previously suppressed by the Soviet government. This increased openness ultimately contributed to the weakening of Communist Party control and played a significant role in the eventual dissolution of the Soviet Union.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glasnost",
    "citationTitle": "Wikipedia: Glasnost"
  },
  {
    "id": "d0ab02d4-479e-449e-8dc3-b217c370749e",
    "text": "Which Eastern European country was the first to hold free elections after the fall of communist rule in 1989?",
    "options": [
      "East Germany",
      "Poland",
      "Hungary",
      "Czechoslovakia"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Poland held partially free parliamentary elections in June 1989, marking the beginning of the end of communist rule in Eastern Europe.",
    "detailedExplanation": "Poland became the first Eastern European country to break free from communist rule when it held partially free parliamentary elections on June 4, 1989. These elections were the result of the Round Table Talks between the communist government and the Solidarity movement led by Lech Wałęsa. While the elections were not completely free (the communists reserved 65% of seats in the Sejm), Solidarity won 99 of 100 seats in the Senate and all available seats in the lower house. This victory marked the beginning of the peaceful transition away from communism in Eastern Europe and inspired similar movements throughout the Soviet bloc.",
    "citationUrl": "https://en.wikipedia.org/wiki/1989_Polish_legislative_election",
    "citationTitle": "Wikipedia: 1989 Polish legislative election"
  },
  {
    "id": "a3a09ce6-f12a-4878-a04d-3459ecfd7a91",
    "text": "The Marshall Plan was designed to help rebuild which region after World War II?",
    "options": [
      "Eastern Europe",
      "Western Europe",
      "Southeast Asia",
      "Latin America"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Marshall Plan provided economic aid to rebuild Western European countries and prevent the spread of communism.",
    "detailedExplanation": "The Marshall Plan, officially known as the European Recovery Program, was an American initiative passed in 1948 to provide economic aid to Western European countries devastated by World War II. Named after Secretary of State George C. Marshall, the plan provided over $12 billion (equivalent to about $130 billion today) in economic assistance to help rebuild Western European economies. The plan had dual purposes: humanitarian aid to help rebuild war-torn Europe and strategic containment of Soviet influence by strengthening Western European democracies economically and politically, making them less susceptible to communist takeover.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marshall_Plan",
    "citationTitle": "Wikipedia: Marshall Plan"
  },
  {
    "id": "ab85b9bd-256f-4f7a-96e9-a775988fc1ef",
    "text": "Which event in 1961 was a failed CIA-sponsored invasion attempt in Cuba?",
    "options": [
      "Operation Mongoose",
      "Bay of Pigs Invasion",
      "Cuban Revolution",
      "Operation Zapata"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Bay of Pigs Invasion was a failed CIA-sponsored attempt by Cuban exiles to overthrow Fidel Castro's government in April 1961.",
    "detailedExplanation": "The Bay of Pigs Invasion was a failed military landing operation on the southwestern coast of Cuba in April 1961. The CIA-sponsored operation involved approximately 1,400 Cuban exiles who had been trained and equipped by the United States to overthrow Fidel Castro's communist government. The invasion was a complete disaster, with most of the exile force killed or captured within three days. The failure was a major embarrassment for the newly elected President John F. Kennedy and actually strengthened Castro's position in Cuba, pushing him closer to the Soviet Union and contributing to the later Cuban Missile Crisis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bay_of_Pigs_Invasion",
    "citationTitle": "Wikipedia: Bay of Pigs Invasion"
  },
  {
    "id": "b9d60c6d-7785-4f67-bdc4-4e06d8fa2952",
    "text": "What was the name of the military alliance formed by the Soviet Union and Eastern European countries in response to NATO?",
    "options": [
      "COMECON",
      "Warsaw Pact",
      "Eastern Alliance",
      "Soviet Bloc Treaty"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Warsaw Pact, formally known as the Treaty of Friendship, Cooperation and Mutual Assistance, was established in 1955.",
    "detailedExplanation": "The Warsaw Pact was a collective defense treaty signed on May 14, 1955, by the Soviet Union and seven Eastern European countries: Albania, Bulgaria, Czechoslovakia, East Germany, Hungary, Poland, and Romania. Formally called the Treaty of Friendship, Cooperation and Mutual Assistance, it was established as a direct response to West Germany's admission to NATO in 1955. The Warsaw Pact served as the Eastern Bloc's military alliance during the Cold War, providing the Soviet Union with a formal structure to maintain control over Eastern Europe and coordinate military strategy against NATO forces.",
    "citationUrl": "https://en.wikipedia.org/wiki/Warsaw_Pact",
    "citationTitle": "Wikipedia: Warsaw Pact"
  },
  {
    "id": "f1f0e176-9ea4-4b6d-81a9-8616d75488d8",
    "text": "Which Cold War crisis in 1962 brought the world closest to nuclear war?",
    "options": [
      "Berlin Blockade",
      "Cuban Missile Crisis",
      "Korean War",
      "Bay of Pigs Invasion"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Cuban Missile Crisis in October 1962 brought the US and USSR to the brink of nuclear war.",
    "detailedExplanation": "The Cuban Missile Crisis occurred in October 1962 when the Soviet Union placed nuclear missiles in Cuba, just 90 miles from the US coast. President Kennedy imposed a naval blockade and demanded their removal. For thirteen tense days, the world teetered on the edge of nuclear war as both superpowers engaged in intense negotiations. The crisis was resolved when Soviet Premier Khrushchev agreed to remove the missiles in exchange for US assurances not to invade Cuba and the secret removal of US missiles from Turkey.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "153152b2-3f70-449f-a003-2652eb3c90fc",
    "text": "Which Cold War space achievement by the Soviet Union in 1957 shocked the Western world?",
    "options": [
      "First human in space",
      "First moon landing",
      "Launch of Sputnik 1",
      "First space station"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Sputnik 1, launched in October 1957, was the first artificial satellite and sparked the Space Race.",
    "detailedExplanation": "On October 4, 1957, the Soviet Union successfully launched Sputnik 1, the world's first artificial satellite, catching the United States completely off guard. The beach ball-sized satellite orbited Earth every 96 minutes, transmitting radio signals that could be heard by amateur radio operators worldwide. This achievement demonstrated Soviet technological superiority and ICBMs capability, causing widespread panic in the US about falling behind in science and technology. The 'Sputnik Crisis' led to increased funding for American science education, the creation of NASA in 1958, and intensified the Cold War competition in space exploration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sputnik_1",
    "citationTitle": "Wikipedia: Sputnik 1"
  },
  {
    "id": "559bebe0-a5d4-4ce7-867d-226dd6a942d5",
    "text": "Which Soviet leader was in power during the Cuban Missile Crisis in 1962?",
    "options": [
      "Joseph Stalin",
      "Nikita Khrushchev",
      "Leonid Brezhnev",
      "Mikhail Gorbachev"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Nikita Khrushchev was the Soviet Premier during the Cuban Missile Crisis.",
    "detailedExplanation": "Nikita Khrushchev served as First Secretary of the Communist Party of the Soviet Union from 1953 to 1964 and was the key Soviet decision-maker during the Cuban Missile Crisis in October 1962. He authorized the placement of nuclear missiles in Cuba and later negotiated their removal with President Kennedy, helping to prevent nuclear war during this tense 13-day standoff.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "003af776-517f-4229-962a-b784570196fc",
    "text": "What was the name of the U.S. program that provided economic aid to rebuild Western Europe after World War II?",
    "options": [
      "Truman Doctrine",
      "Marshall Plan",
      "Atlantic Charter",
      "Eisenhower Doctrine"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Marshall Plan was the American initiative to provide economic assistance to Western Europe.",
    "detailedExplanation": "Officially known as the European Recovery Program, the Marshall Plan was proposed by U.S. Secretary of State George Marshall in 1947. Between 1948 and 1951, the United States provided over $12 billion in economic assistance to help rebuild Western European economies devastated by World War II. The plan also served to contain Soviet influence by strengthening capitalist democracies in Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marshall_Plan",
    "citationTitle": "Wikipedia: Marshall Plan"
  },
  {
    "id": "74cf6cc0-3a72-4c96-ada7-d1e237a0a414",
    "text": "Which event in 1961 embarrassed the Kennedy administration and strengthened Castro's position in Cuba?",
    "options": [
      "Operation Mongoose",
      "Bay of Pigs Invasion",
      "Cuban Missile Crisis",
      "Mariel Boatlift"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Bay of Pigs Invasion was a failed CIA-sponsored attempt to overthrow Castro.",
    "detailedExplanation": "The Bay of Pigs Invasion occurred in April 1961 when approximately 1,400 CIA-trained Cuban exiles attempted to invade Cuba and overthrow Fidel Castro's government. The operation failed disastrously within three days, with most invaders killed or captured. The failure was a major embarrassment for the newly inaugurated President Kennedy and actually strengthened Castro's hold on power while pushing Cuba closer to the Soviet Union.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bay_of_Pigs_Invasion",
    "citationTitle": "Wikipedia: Bay of Pigs Invasion"
  },
  {
    "id": "ef0df3da-b46e-4352-87b8-b36df7d4bfd0",
    "text": "In which year was the Berlin Wall finally torn down, symbolizing the end of the Cold War?",
    "options": [
      "1987",
      "1989",
      "1991",
      "1993"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Berlin Wall was torn down in November 1989.",
    "detailedExplanation": "The Berlin Wall began to be dismantled on November 9, 1989, after East German authorities announced that citizens could cross the border freely. This followed months of political upheaval and growing pressure for reform in East Germany. The fall of the wall became one of the most powerful symbols of the end of the Cold War, reuniting families and ultimately leading to German reunification in 1990.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fall_of_the_Berlin_Wall",
    "citationTitle": "Wikipedia: Fall of the Berlin Wall"
  },
  {
    "id": "198f8e4c-aa29-431c-a4a6-d910dedcf0ba",
    "text": "Which Soviet leader was in power during the Cuban Missile Crisis of 1962?",
    "options": [
      "Joseph Stalin",
      "Nikita Khrushchev",
      "Leonid Brezhnev",
      "Mikhail Gorbachev"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Nikita Khrushchev was the Soviet Premier during the Cuban Missile Crisis in October 1962.",
    "detailedExplanation": "Nikita Khrushchev served as the leader of the Soviet Union from 1953 to 1964, following Stalin's death. He was the key Soviet figure during the Cuban Missile Crisis in October 1962, when the USSR placed nuclear missiles in Cuba, leading to a tense 13-day standoff with President John F. Kennedy's administration. Khrushchev ultimately agreed to remove the missiles in exchange for the US promising not to invade Cuba and secretly removing missiles from Turkey.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  }
]