[
  {
    "id": "27ac5eb9-d6a5-4910-9de9-e610be44a279",
    "text": "Who holds the men's 100-meter world record?",
    "options": [
      "Usain Bolt",
      "Carl Lewis",
      "Justin Gatlin",
      "Tyson Gay"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Usain Bolt holds the men's 100m world record at 9.58 seconds.",
    "detailedExplanation": "Usain Bolt of Jamaica set the men's 100-meter world record at 9.58 seconds during the 2009 World Championships in Berlin, Germany. This incredible time broke his own previous world record and remains unbeaten to this day. Bolt's dominance in sprinting earned him the nickname 'Lightning Bolt' and made him one of the most recognizable athletes in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/100_metres_world_record_progression",
    "citationTitle": "Wikipedia: 100 metres world record progression"
  },
  {
    "id": "d38e696d-f660-4cdb-a2c5-2b90a92459b5",
    "text": "What is the women's marathon world record holder's nationality?",
    "options": [
      "Kenyan",
      "Ethiopian",
      "British",
      "American"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Brigid Kosgei of Kenya holds the women's marathon world record.",
    "detailedExplanation": "Brigid Kosgei of Kenya set the women's marathon world record at 2:14:04 during the 2019 Chicago Marathon. This stunning performance broke Paula Radcliffe's long-standing record that had stood for 16 years. Kosgei's time was nearly a minute and a half faster than the previous record, marking one of the most significant improvements in marathon history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marathon_world_record_progression",
    "citationTitle": "Wikipedia: Marathon world record progression"
  },
  {
    "id": "c84f8848-1323-4d6f-9db6-04762f4cc88c",
    "text": "In which athletic event did Sergey Bubka become famous for setting world records?",
    "options": [
      "High jump",
      "Pole vault",
      "Long jump",
      "Javelin throw"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Sergey Bubka was a legendary pole vaulter who broke the world record 35 times.",
    "detailedExplanation": "Sergey Bubka of Ukraine (competing for the Soviet Union early in his career) dominated pole vaulting throughout the 1980s and 1990s. He broke the world record an astounding 35 times during his career, both indoors and outdoors. Bubka was the first person to clear 6 meters in pole vault and his outdoor record of 6.14 meters, set in 1994, stood for over 20 years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sergey_Bubka",
    "citationTitle": "Wikipedia: Sergey Bubka"
  },
  {
    "id": "1c80738b-a819-4956-99f6-42ef8f7f7367",
    "text": "Approximately how far is the current men's shot put world record?",
    "options": [
      "19 meters",
      "21 meters",
      "23 meters",
      "25 meters"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Randy Barnes holds the men's shot put world record at 23.12 meters.",
    "detailedExplanation": "American shot putter Randy Barnes set the men's shot put world record at 23.12 meters (75 feet 10¼ inches) on May 20, 1990, at the Westwood Invitational in Los Angeles. This record has stood for over three decades and is considered one of the most enduring records in track and field. Barnes' throw was remarkable for its distance and the longevity of the record.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shot_put_world_record_progression",
    "citationTitle": "Wikipedia: Shot put world record progression"
  },
  {
    "id": "331a71b4-8696-4179-9432-3d810a6aa9fe",
    "text": "What is the men's high jump world record height?",
    "options": [
      "2.35m",
      "2.40m",
      "2.45m",
      "2.50m"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Javier Sotomayor holds the men's high jump world record at 2.45 meters.",
    "detailedExplanation": "Cuban high jumper Javier Sotomayor set the men's high jump world record at 2.45 meters (8 feet 0¼ inches) on July 27, 1993, in Salamanca, Spain. Sotomayor remains the only person to have jumped over 8 feet in the high jump, and his record has stood for over 30 years. He was known for his exceptional technique and consistency at extreme heights.",
    "citationUrl": "https://en.wikipedia.org/wiki/High_jump_world_record_progression",
    "citationTitle": "Wikipedia: High jump world record progression"
  },
  {
    "id": "576adbae-2083-4a0c-a5cc-3e5f0605120a",
    "text": "Who holds the women's 400-meter world record?",
    "options": [
      "Marita Koch",
      "Allyson Felix",
      "Marie-José Pérec",
      "Sanya Richards-Ross"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Marita Koch of East Germany holds the women's 400m world record at 47.60 seconds.",
    "detailedExplanation": "Marita Koch of East Germany set the women's 400-meter world record at 47.60 seconds on October 6, 1985, in Canberra, Australia. This record has remained unbroken for nearly 40 years, making it one of the oldest standing world records in track and field. Koch was one of the most dominant sprinters of the 1980s and her 400m record is considered virtually untouchable.",
    "citationUrl": "https://en.wikipedia.org/wiki/400_metres_world_record_progression",
    "citationTitle": "Wikipedia: 400 metres world record progression"
  },
  {
    "id": "da4dd95f-174a-44e7-aef2-91938480659c",
    "text": "In which decade was the current men's long jump world record set?",
    "options": [
      "1980s",
      "1990s",
      "2000s",
      "2010s"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Mike Powell set the men's long jump world record in 1991.",
    "detailedExplanation": "American long jumper Mike Powell set the men's long jump world record at 8.95 meters (29 feet 4¼ inches) on August 30, 1991, at the World Championships in Tokyo, Japan. This jump broke Bob Beamon's legendary record that had stood since the 1968 Olympics. Powell's record-breaking performance came during one of the greatest head-to-head competitions in track and field history, as he was competing against Carl Lewis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Long_jump_world_record_progression",
    "citationTitle": "Wikipedia: Long jump world record progression"
  },
  {
    "id": "979237fb-4c5b-4efa-9f82-824f1575cd1f",
    "text": "What distance event does Eliud Kipchoge hold the official world record in?",
    "options": [
      "10,000 meters",
      "Half marathon",
      "Marathon",
      "25K road race"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Eliud Kipchoge holds the official men's marathon world record.",
    "detailedExplanation": "Eliud Kipchoge of Kenya holds the official men's marathon world record at 2:01:09, which he set at the 2022 Berlin Marathon. While Kipchoge famously ran under 2 hours (1:59:40) in a special event in Vienna in 2019, that performance doesn't count as an official world record due to the controlled conditions. His Berlin time represents the fastest official marathon ever run under competition conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eliud_Kipchoge",
    "citationTitle": "Wikipedia: Eliud Kipchoge"
  },
  {
    "id": "b0f34b5d-fd35-4b10-9ffe-fe7199da35aa",
    "text": "What is the current women's pole vault world record height?",
    "options": [
      "6.15 meters",
      "6.05 meters",
      "5.95 meters",
      "6.25 meters"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Yelena Isinbayeva of Russia set the women's pole vault world record at 6.15 meters in 2009.",
    "detailedExplanation": "Russian pole vaulter Yelena Isinbayeva set the women's pole vault world record at 6.15 meters (20 feet 2 inches) on August 28, 2009, at the World Championships in Berlin. Isinbayeva was known for her dominance in the sport and set 28 world records during her career, both indoor and outdoor. She remains one of the most successful pole vaulters in history and her outdoor record still stands today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Women%27s_pole_vault_world_record_progression",
    "citationTitle": "Wikipedia: Women's pole vault world record progression"
  },
  {
    "id": "c4d3ea53-547a-441c-b6f6-11b71368e7d4",
    "text": "Who holds the men's 1500-meter world record?",
    "options": [
      "Hicham El Guerrouj",
      "Sebastian Coe",
      "Noureddine Morceli",
      "Noah Ngeny"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Hicham El Guerrouj of Morocco set the men's 1500m world record of 3:26.00 in 1998.",
    "detailedExplanation": "Moroccan middle-distance runner Hicham El Guerrouj set the men's 1500-meter world record with a time of 3 minutes 26.00 seconds on July 14, 1998, in Rome, Italy. El Guerrouj is widely considered one of the greatest middle-distance runners of all time and also holds the mile world record. His 1500m record has stood for over 25 years and remains one of the most enduring records in track and field.",
    "citationUrl": "https://en.wikipedia.org/wiki/1500_metres_world_record_progression",
    "citationTitle": "Wikipedia: 1500 metres world record progression"
  },
  {
    "id": "625318e5-8ab8-4274-b420-227042a73e01",
    "text": "What is the current women's 100-meter hurdles world record time?",
    "options": [
      "12.20 seconds",
      "12.21 seconds",
      "12.25 seconds",
      "12.18 seconds"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Tobi Amusan of Nigeria set the women's 100m hurdles world record at 12.20 seconds in 2022.",
    "detailedExplanation": "Nigerian hurdler Tobi Amusan set the women's 100-meter hurdles world record with a time of 12.20 seconds on July 24, 2022, during the semi-finals at the World Athletics Championships in Eugene, Oregon. This broke the previous record of 12.21 seconds that had been held by Kendra Harrison since 2016. Amusan's record-breaking performance came just before she went on to win the world championship title later that day.",
    "citationUrl": "https://en.wikipedia.org/wiki/100_metres_hurdles",
    "citationTitle": "Wikipedia: 100 metres hurdles"
  },
  {
    "id": "a8d6e1eb-3635-4ced-9f31-5a1fa433e3d7",
    "text": "In which athletic event did Bob Beamon famously break the world record at the 1968 Olympics?",
    "options": [
      "Long jump",
      "Triple jump",
      "High jump",
      "Pole vault"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Bob Beamon set a legendary long jump world record of 8.90 meters at the 1968 Mexico City Olympics.",
    "detailedExplanation": "American athlete Bob Beamon achieved one of the most famous moments in Olympic history when he jumped 8.90 meters (29 feet 2½ inches) in the long jump at the 1968 Mexico City Olympics. This jump broke the previous world record by an incredible 55 centimeters (21.75 inches), a margin so large that it gave rise to the term 'Beamonesque' for similarly spectacular athletic achievements. His record stood for 23 years until Mike Powell broke it in 1991.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bob_Beamon",
    "citationTitle": "Wikipedia: Bob Beamon"
  },
  {
    "id": "7b47e756-ebfd-4501-9e65-022be9c8db59",
    "text": "What is the current women's hammer throw world record distance?",
    "options": [
      "82.98 meters",
      "81.74 meters",
      "80.85 meters",
      "83.45 meters"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Anita Włodarczyk of Poland holds the women's hammer throw world record at 82.98 meters, set in 2016.",
    "detailedExplanation": "Polish hammer thrower Anita Włodarczyk set the women's hammer throw world record with a distance of 82.98 meters (272 feet 3 inches) on August 28, 2016, during the Kamila Skolimowska Memorial in Warsaw, Poland. This was actually Włodarczyk's fourth world record, as she had previously broken the record three times between 2009 and 2015. She is considered the greatest women's hammer thrower of all time and won three consecutive Olympic gold medals (2012, 2016, 2020).",
    "citationUrl": "https://en.wikipedia.org/wiki/Hammer_throw",
    "citationTitle": "Wikipedia: Hammer throw"
  },
  {
    "id": "2f0351b8-6cdf-4622-b5cb-67a7f5149020",
    "text": "Who holds the men's 200-meter world record?",
    "options": [
      "Usain Bolt",
      "Michael Johnson",
      "Yohan Blake",
      "Noah Lyles"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Usain Bolt of Jamaica set the men's 200m world record of 19.19 seconds at the 2009 World Championships.",
    "detailedExplanation": "Jamaican sprinter Usain Bolt set the men's 200-meter world record with a time of 19.19 seconds on August 20, 2009, at the World Championships in Berlin, Germany. This broke his own previous world record of 19.30 seconds set at the 2008 Beijing Olympics. Bolt's 200m record is considered one of the most impressive in track and field, improving Michael Johnson's long-standing record by a significant margin. The record has stood for over 14 years and counting.",
    "citationUrl": "https://en.wikipedia.org/wiki/200_metres",
    "citationTitle": "Wikipedia: 200 metres"
  },
  {
    "id": "53405dfa-39fe-45a1-ad46-2e21dbc96307",
    "text": "What is the current men's javelin throw world record distance?",
    "options": [
      "98.48 meters",
      "97.24 meters",
      "96.96 meters",
      "99.12 meters"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Jan Železný of Czech Republic holds the men's javelin world record at 98.48 meters, set in 1996.",
    "detailedExplanation": "Czech javelin thrower Jan Železný set the men's javelin throw world record with a distance of 98.48 meters (323 feet 1 inch) on May 25, 1996, in Jena, Germany. Železný is widely regarded as the greatest javelin thrower of all time, having set the world record four times during his career. His record has stood for over 27 years and he also won three Olympic gold medals (1992, 1996, 2000). The record is considered one of the most enduring in track and field.",
    "citationUrl": "https://en.wikipedia.org/wiki/Javelin_throw",
    "citationTitle": "Wikipedia: Javelin throw"
  },
  {
    "id": "7fe914e6-0578-4380-b950-4eec8a8115fb",
    "text": "In what year was the current women's long jump world record set?",
    "options": [
      "1988",
      "1987",
      "1989",
      "1986"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Galina Chistyakova set the women's long jump world record of 7.52 meters in 1988.",
    "detailedExplanation": "Soviet athlete Galina Chistyakova set the women's long jump world record with a distance of 7.52 meters (24 feet 8¼ inches) on June 11, 1988, in Leningrad (now St. Petersburg), Russia. This record has stood for over 35 years, making it one of the oldest world records in track and field. Chistyakova's record came during the golden era of Soviet athletics in the late 1980s, and despite numerous attempts by world-class athletes over the decades, it remains unbroken.",
    "citationUrl": "https://en.wikipedia.org/wiki/Long_jump",
    "citationTitle": "Wikipedia: Long jump"
  },
  {
    "id": "9341eb03-1d84-46eb-abc3-a163deaf8b84",
    "text": "What is the current women's 800-meter world record time?",
    "options": [
      "1:53.28",
      "1:54.12",
      "1:52.89",
      "1:55.03"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Jarmila Kratochvílová of Czechoslovakia set the women's 800m world record at 1:53.28 in 1983.",
    "detailedExplanation": "The women's 800-meter world record of 1:53.28 was set by Jarmila Kratochvílová of Czechoslovakia on July 26, 1983, in Munich, Germany. This record has stood for over 40 years and is considered one of the longest-standing world records in track and field. Kratochvílová's performance came during an era when she dominated middle-distance running, and this particular record remains one of the most remarkable achievements in women's athletics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Women%27s_800_metres_world_record_progression",
    "citationTitle": "Wikipedia: Women's 800 metres world record progression"
  },
  {
    "id": "f72a9d02-d399-40db-8b86-b49a34499f0f",
    "text": "Which country holds the men's 4x100-meter relay world record?",
    "options": [
      "Jamaica",
      "United States",
      "Great Britain",
      "Canada"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Jamaica holds the men's 4x100m relay world record with a time of 36.84 seconds, set at the 2012 London Olympics.",
    "detailedExplanation": "The Jamaican men's 4x100-meter relay team set the current world record of 36.84 seconds at the 2012 London Olympics. The team consisted of Nesta Carter, Michael Frater, Yohan Blake, and Usain Bolt. This record showcased Jamaica's dominance in sprinting during that era, with the team combining exceptional individual speed with precise baton exchanges. The record was initially under scrutiny due to a later doping case involving Nesta Carter, but the record time itself remains official.",
    "citationUrl": "https://en.wikipedia.org/wiki/4_%C3%97_100_metres_relay_world_record_progression",
    "citationTitle": "Wikipedia: 4 × 100 metres relay world record progression"
  },
  {
    "id": "4ec71021-983a-43ab-8717-97ac6392439b",
    "text": "What is the current men's 10,000-meter world record time?",
    "options": [
      "26:11.00",
      "26:17.53",
      "26:24.68",
      "26:08.77"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Joshua Cheptegei of Uganda set the men's 10,000m world record at 26:11.00 in 2020.",
    "detailedExplanation": "Joshua Cheptegei of Uganda set the current men's 10,000-meter world record with a time of 26:11.00 on October 7, 2020, in Valencia, Spain. This performance broke the previous record held by Ethiopia's Kenenisa Bekele, which had stood since 2005. Cheptegei's record-breaking run was notable for its tactical execution and consistent pacing throughout the 25-lap race, demonstrating his exceptional endurance and speed combination that has made him one of the greatest distance runners of his generation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_10,000_metres_world_record_progression",
    "citationTitle": "Wikipedia: Men's 10,000 metres world record progression"
  },
  {
    "id": "4a3d025a-34fd-402d-953e-4ec7a7c73626",
    "text": "In which athletic event did Florence Griffith-Joyner set world records that still stand today?",
    "options": [
      "100m and 200m",
      "200m and 400m",
      "100m and 400m",
      "100m hurdles and 200m"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Florence Griffith-Joyner holds the women's world records in both 100m (10.49) and 200m (21.34), both set in 1988.",
    "detailedExplanation": "Florence Griffith-Joyner, known as 'Flo-Jo', set the women's world records in both the 100 meters (10.49 seconds) and 200 meters (21.34 seconds) in 1988. The 100m record was set on July 16, 1988, at the U.S. Olympic Trials in Indianapolis, while the 200m record was established on September 29, 1988, at the Seoul Olympics. These records have remained unbroken for over 35 years, making them among the most enduring world records in track and field. Griffith-Joyner's performances were characterized by her exceptional speed, distinctive running style, and colorful racing attire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Florence_Griffith_Joyner",
    "citationTitle": "Wikipedia: Florence Griffith Joyner"
  }
]