[
  {
    "id": "8222bd29-9d8b-4875-b0e2-d68332353c4f",
    "text": "What is the current men's world record time for the 100-meter sprint, set by Usain Bolt in 2009?",
    "options": [
      "9.58 seconds",
      "9.63 seconds",
      "9.69 seconds",
      "9.72 seconds"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Usain Bolt set the world record of 9.58 seconds at the 2009 World Championships in Berlin.",
    "detailedExplanation": "Usain Bolt's incredible 9.58-second performance in the 100-meter sprint at the 2009 World Athletics Championships in Berlin remains unbroken today. This remarkable achievement came just over a year after he first broke the world record at the 2008 Beijing Olympics with 9.69 seconds, which he then improved to 9.58 seconds. The record represents the pinnacle of human sprinting speed and has stood for over 14 years.",
    "citationUrl": "https://en.wikipedia.org/wiki/100_metres_world_record_progression",
    "citationTitle": "Wikipedia: 100 metres world record progression"
  },
  {
    "id": "a35806c1-386e-4ebd-9c29-e52d629ec9cf",
    "text": "Which athlete holds the women's world record in the pole vault, clearing 5.06 meters in 2009?",
    "options": [
      "Jenn Suhr",
      "Yelena Isinbayeva",
      "Sandi Morris",
      "Katie Nageotte"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Russian pole vaulter Yelena Isinbayeva set the women's world record of 5.06 meters in Zurich in 2009.",
    "detailedExplanation": "Yelena Isinbayeva of Russia revolutionized women's pole vaulting and set the world record of 5.06 meters at the World Athletics Final in Zurich on August 28, 2009. This was her 28th world record, as she consistently pushed the boundaries of the sport throughout her career. Isinbayeva was known for her technical excellence and mental strength, often setting records at major competitions. Her record has stood for over 14 years and remains one of the most enduring world records in athletics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pole_vault_world_record_progression",
    "citationTitle": "Wikipedia: Pole vault world record progression"
  },
  {
    "id": "c399531e-d4b1-477a-af7c-09fa1c15b523",
    "text": "What is the current men's marathon world record, set by Kelvin Kiptum in 2023?",
    "options": [
      "2:01:39",
      "2:01:09",
      "2:00:35",
      "2:02:57"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Kelvin Kiptum of Kenya set the men's marathon world record of 2:01:39 at the Chicago Marathon in October 2023.",
    "detailedExplanation": "Kelvin Kiptum made history at the 2023 Chicago Marathon on October 8, 2023, when he ran 2:01:39, breaking Eliud Kipchoge's previous world record of 2:01:09 set in Berlin in 2022. The 23-year-old Kenyan's performance was remarkable not only for the time but also because it was just his third marathon ever. Kiptum's record brought him tantalizingly close to breaking the 2-hour barrier in an official race, something that remains one of athletics' greatest challenges.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marathon_world_record_progression",
    "citationTitle": "Wikipedia: Marathon world record progression"
  },
  {
    "id": "726c104a-f893-4968-b64c-5901b269d17d",
    "text": "Who holds the women's world record in the heptathlon with 7,291 points, set in 1988?",
    "options": [
      "Carolina Klüft",
      "Nafissatou Thiam",
      "Jackie Joyner-Kersee",
      "Jessica Ennis-Hill"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jackie Joyner-Kersee of the USA set the heptathlon world record of 7,291 points at the 1988 Seoul Olympics.",
    "detailedExplanation": "Jackie Joyner-Kersee's heptathlon world record of 7,291 points, achieved at the 1988 Seoul Olympics, is one of the most enduring records in track and field. The American athlete dominated multi-events during the 1980s and 1990s, and this particular record has stood for over 35 years. The heptathlon consists of seven events over two days: 100m hurdles, high jump, shot put, 200m, long jump, javelin, and 800m. Joyner-Kersee's record is considered by many experts to be one of the greatest athletic achievements of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Heptathlon_world_record_progression",
    "citationTitle": "Wikipedia: Heptathlon world record progression"
  },
  {
    "id": "c43874a0-f402-4b7f-9123-91a3fbbd73ec",
    "text": "What is the current men's world record in the shot put, set by Randy Barnes in 1990?",
    "options": [
      "23.37 meters",
      "23.12 meters",
      "22.91 meters",
      "22.47 meters"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Randy Barnes threw 23.37 meters at a meet in Westwood, California in May 1990, a record that still stands today.",
    "detailedExplanation": "Randy Barnes of the United States set the men's shot put world record of 23.37 meters (76 feet 8 inches) on May 20, 1990, at a meet in Westwood, California. This remarkable throw has stood for over 33 years, making it one of the oldest world records in athletics. Barnes was known for his exceptional strength and technique, and his record came during the peak of his career. The longevity of this record speaks to the extraordinary nature of the performance and the difficulty of throwing the 16-pound shot put to such distances.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shot_put_world_record_progression",
    "citationTitle": "Wikipedia: Shot put world record progression"
  },
  {
    "id": "815af0f7-8bbb-4ccb-87c4-c3466ee8fbf4",
    "text": "Which athlete holds the men's 400-meter world record of 43.03 seconds, set in 2016?",
    "options": [
      "Michael Johnson",
      "Jeremy Wariner",
      "Wayde van Niekerk",
      "LaShawn Merritt"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Wayde van Niekerk of South Africa ran 43.03 seconds in the 400m final at the 2016 Rio Olympics, breaking Michael Johnson's 17-year-old record.",
    "detailedExplanation": "Wayde van Niekerk's stunning 43.03-second performance in the men's 400 meters at the 2016 Rio Olympics is considered one of the greatest races in Olympic history. Running from lane 8, the South African shattered Michael Johnson's seemingly untouchable world record of 43.18 seconds that had stood since 1999. Van Niekerk's record-breaking run not only earned him Olympic gold but also made him the first person to run under 10 seconds for 100m, under 20 seconds for 200m, and under 44 seconds for 400m, showcasing his incredible versatility as a sprinter.",
    "citationUrl": "https://en.wikipedia.org/wiki/400_metres_world_record_progression",
    "citationTitle": "Wikipedia: 400 metres world record progression"
  },
  {
    "id": "88ef6539-f23d-4bd0-8253-6faeb051a7cf",
    "text": "What is the current women's world record in the 10,000 meters, set by Letesenbet Gidey in 2021?",
    "options": [
      "29:01.03",
      "29:06.82",
      "29:17.45",
      "29:31.78"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Ethiopian runner Letesenbet Gidey set the women's 10,000m world record of 29:01.03 in Hengelo, Netherlands in June 2021.",
    "detailedExplanation": "Letesenbet Gidey of Ethiopia broke the women's 10,000-meter world record with a time of 29:01.03 at the FBK Games in Hengelo, Netherlands, on June 8, 2021. This performance broke the previous record of 29:17.45 set by Almaz Ayana of Ethiopia at the 2016 Rio Olympics. Gidey's record-breaking run was aided by perfect pacing and ideal weather conditions, and she became the first woman to break 29:02 for the distance. The Ethiopian distance runner had already shown her exceptional ability by setting world records in the 5,000m and the half marathon.",
    "citationUrl": "https://en.wikipedia.org/wiki/10,000_metres_world_record_progression",
    "citationTitle": "Wikipedia: 10,000 metres world record progression"
  },
  {
    "id": "81e83178-3abd-4155-9b87-e3dcdd709cc5",
    "text": "Who holds the men's javelin throw world record of 98.48 meters, set in 1996?",
    "options": [
      "Aki Parviainen",
      "Jan Železný",
      "Andreas Thorkildsen",
      "Uwe Hohn"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jan Železný of the Czech Republic threw 98.48 meters in Jena, Germany in May 1996, a record that still stands today.",
    "detailedExplanation": "Jan Železný of the Czech Republic set the men's javelin world record of 98.48 meters (323 feet 1 inch) on May 25, 1996, in Jena, Germany. This record has stood for over 27 years and represents the pinnacle of javelin throwing with the current specification javelin (introduced in 1986). Železný was widely regarded as the greatest javelin thrower of all time, winning three consecutive Olympic gold medals (1992, 1996, 2000) and setting the world record four times during his career. His technique and consistency were legendary, and his record remains tantalizingly close to the 100-meter barrier.",
    "citationUrl": "https://en.wikipedia.org/wiki/Javelin_throw_world_record_progression",
    "citationTitle": "Wikipedia: Javelin throw world record progression"
  },
  {
    "id": "352e9486-6296-41dc-8e26-637521179fe2",
    "text": "Which athlete holds the men's decathlon world record with 9,126 points, achieved at the 2018 Talence Décastar meet in France?",
    "options": [
      "Ashton Eaton",
      "Kevin Mayer",
      "Roman Šebrle",
      "Daley Thompson"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Kevin Mayer set the men's decathlon world record with 9,126 points in 2018.",
    "detailedExplanation": "French athlete Kevin Mayer broke the decathlon world record on September 16, 2018, at the Talence Décastar meet in France, scoring 9,126 points. This broke American Ashton Eaton's previous record of 9,045 points set in 2015. Mayer's record-breaking performance included personal bests in several events and established him as one of the greatest multi-event athletes in history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Decathlon_world_record_progression",
    "citationTitle": "Wikipedia: Decathlon world record progression"
  },
  {
    "id": "f44529ca-44bc-43d0-a5cf-0ad2a7015dee",
    "text": "What is the women's 400-meter hurdles world record, set by Sydney McLaughlin-Levrone at the 2022 World Athletics Championships?",
    "options": [
      "50.68 seconds",
      "51.90 seconds",
      "51.46 seconds",
      "50.08 seconds"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Sydney McLaughlin-Levrone ran 50.08 seconds to set the women's 400m hurdles world record in 2022.",
    "detailedExplanation": "American athlete Sydney McLaughlin-Levrone set the women's 400-meter hurdles world record with a time of 50.08 seconds at the 2022 World Athletics Championships in Eugene, Oregon. This was her fifth world record in the event, breaking her own previous record of 50.68 seconds from the same year. She became the first woman to break the 50.20 barrier and then the 50.10 barrier in this event.",
    "citationUrl": "https://en.wikipedia.org/wiki/400_metres_hurdles",
    "citationTitle": "Wikipedia: 400 metres hurdles"
  },
  {
    "id": "4f33063e-c3d5-4417-8a3c-57491a742042",
    "text": "Who holds the men's high jump world record of 2.45 meters, set in 1993 and still standing today?",
    "options": [
      "Javier Sotomayor",
      "Patrik Sjöberg",
      "Carlo Thränhardt",
      "Igor Paklin"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Cuban athlete Javier Sotomayor jumped 2.45 meters in 1993, a record that remains unbroken.",
    "detailedExplanation": "Javier Sotomayor of Cuba set the men's high jump world record of 2.45 meters (8 feet 0.46 inches) on July 27, 1993, at the World Championships in Stuttgart, Germany. This record has stood for over 30 years, making it one of the longest-standing world records in athletics. Sotomayor also holds the indoor world record of 2.43 meters and was the first person to clear 8 feet in the high jump.",
    "citationUrl": "https://en.wikipedia.org/wiki/High_jump_world_record_progression",
    "citationTitle": "Wikipedia: High jump world record progression"
  },
  {
    "id": "c32e5afe-0bdf-4e70-8dd5-18f66759badb",
    "text": "Which athlete set the women's long jump world record of 7.52 meters in 1988, a record that has stood for over 35 years?",
    "options": [
      "Jackie Joyner-Kersee",
      "Galina Chistyakova",
      "Heike Drechsler",
      "Anișoara Cușmir-Stanciu"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Soviet athlete Galina Chistyakova jumped 7.52 meters in 1988 to set the women's long jump world record.",
    "detailedExplanation": "Galina Chistyakova of the Soviet Union set the women's long jump world record with a leap of 7.52 meters (24 feet 8.25 inches) on June 11, 1988, in Leningrad (now St. Petersburg), Russia. This record has remained unbroken for over 35 years, making it one of the most enduring records in track and field. The jump came during the height of the Cold War era when Eastern European athletes dominated many field events.",
    "citationUrl": "https://en.wikipedia.org/wiki/Long_jump_world_record_progression",
    "citationTitle": "Wikipedia: Long jump world record progression"
  },
  {
    "id": "f1f0e826-4547-4767-8d85-3008b0de1dc9",
    "text": "What is the men's 800-meter world record, set by David Rudisha of Kenya at the 2012 London Olympics?",
    "options": [
      "1:40.91",
      "1:41.73",
      "1:41.01",
      "1:40.46"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "David Rudisha ran 1:40.46 to win Olympic gold and set the 800m world record in 2012.",
    "detailedExplanation": "Kenyan middle-distance runner David Rudisha set the men's 800-meter world record with a time of 1:40.46 at the 2012 Summer Olympics in London. Running in lane 4, Rudisha led from start to finish and became the first person to run under 1:41 in the 800 meters. His performance was notable not only for the record time but also for the tactical execution, as he controlled the race from the front throughout both laps of the track.",
    "citationUrl": "https://en.wikipedia.org/wiki/800_metres_world_record_progression",
    "citationTitle": "Wikipedia: 800 metres world record progression"
  },
  {
    "id": "10e0b880-3a43-4fb2-9d45-45d869aa90be",
    "text": "Which athlete holds the women's discus throw world record of 76.80 meters, set in 1988?",
    "options": [
      "Martina Hellmann",
      "Gabriele Reinsch",
      "Ilke Wyludda",
      "Diana Gansky"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "East German athlete Gabriele Reinsch threw 76.80 meters to set the women's discus world record in 1988.",
    "detailedExplanation": "Gabriele Reinsch of East Germany set the women's discus throw world record with a throw of 76.80 meters (252 feet 0 inches) on July 9, 1988, in Neubrandenburg, East Germany. This record has stood for over 35 years and was achieved during the era when East German athletes dominated throwing events. Reinsch's record throw came just two months before the 1988 Seoul Olympics, though she did not compete at those Games.",
    "citationUrl": "https://en.wikipedia.org/wiki/Discus_throw_world_record_progression",
    "citationTitle": "Wikipedia: Discus throw world record progression"
  },
  {
    "id": "08cc6d8e-4174-419d-b045-eb7661ee2ee2",
    "text": "What is the men's 1500-meter world record, set by Hicham El Guerrouj of Morocco in 1998?",
    "options": [
      "3:26.00",
      "3:28.12",
      "3:27.37",
      "3:25.96"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Hicham El Guerrouj ran 3:26.00 in the 1500 meters to set the world record in 1998.",
    "detailedExplanation": "Moroccan middle-distance runner Hicham El Guerrouj set the men's 1500-meter world record with a time of 3:26.00 on July 14, 1998, in Rome, Italy. El Guerrouj, widely considered the greatest miler in history, broke his own previous world record and improved the mark by nearly two seconds. This record has stood for over 25 years and remains one of the most impressive performances in middle-distance running history.",
    "citationUrl": "https://en.wikipedia.org/wiki/1500_metres_world_record_progression",
    "citationTitle": "Wikipedia: 1500 metres world record progression"
  },
  {
    "id": "19b0a4c8-6bbe-4db1-b59e-59cd7fe75d67",
    "text": "Who holds the women's hammer throw world record of 82.98 meters, achieved in 2016?",
    "options": [
      "Tatyana Lysenko",
      "Anita Włodarczyk",
      "Betty Heidler",
      "Yipsi Moreno"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Polish athlete Anita Włodarczyk threw 82.98 meters to set the women's hammer throw world record in 2016.",
    "detailedExplanation": "Anita Włodarczyk of Poland set the women's hammer throw world record with a throw of 82.98 meters (272 feet 3 inches) on August 28, 2016, at the Kamila Skolimowska Memorial meet in Warsaw, Poland. This was Włodarczyk's fourth world record in the event, and she became the first woman to throw over 82 meters in the hammer. Her dominance in the event included Olympic gold medals in 2012, 2016, and 2021.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hammer_throw_world_record_progression",
    "citationTitle": "Wikipedia: Hammer throw world record progression"
  },
  {
    "id": "9f596e7b-e909-4fac-a68a-bcccd93ab4e0",
    "text": "Which athlete holds the men's triple jump world record of 18.29 meters, set at the 1995 World Championships in Gothenburg?",
    "options": [
      "Jonathan Edwards",
      "Kenny Harrison",
      "Christian Taylor",
      "Pedro Pablo Pichardo"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jonathan Edwards of Great Britain set the men's triple jump world record of 18.29 meters in 1995.",
    "detailedExplanation": "Jonathan Edwards achieved this remarkable feat at the 1995 World Championships in Gothenburg, Sweden. What makes this record even more extraordinary is that Edwards actually broke the world record twice in the same competition - first with a jump of 18.16 meters, and then improving it to 18.29 meters in the final round. This record has stood for nearly three decades and remains one of the most enduring world records in track and field athletics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_triple_jump_world_record_progression",
    "citationTitle": "Wikipedia: Men's triple jump world record progression"
  },
  {
    "id": "57bffeae-c789-4250-b4f5-5e4070bee4d7",
    "text": "What is the women's 3000-meter steeplechase world record, set by Beatrice Chepkoech of Kenya in 2018?",
    "options": [
      "8:44.32",
      "8:58.81",
      "8:52.78",
      "9:05.49"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Beatrice Chepkoech set the women's 3000-meter steeplechase world record at 8:44.32 in Monaco in 2018.",
    "detailedExplanation": "Beatrice Chepkoech's phenomenal performance at the Diamond League meeting in Monaco on July 20, 2018, saw her obliterate the previous world record by over 8 seconds. Her time of 8:44.32 was so remarkable that it broke the 8:45 barrier for the first time in women's steeplechase history. The Kenyan runner's record-breaking performance was particularly impressive given that she had only switched to steeplechase from the 1500 meters relatively recently in her career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Women%27s_3000_metres_steeplechase_world_record_progression",
    "citationTitle": "Wikipedia: Women's 3000 metres steeplechase world record progression"
  },
  {
    "id": "af8103fa-81dd-4b87-91c2-a2fdfc17d8db",
    "text": "Which country holds the men's 4x400-meter relay world record of 2:54.29, set at the 1993 World Championships in Stuttgart?",
    "options": [
      "United States",
      "Jamaica",
      "Great Britain",
      "Bahamas"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The United States team set the men's 4x400-meter relay world record of 2:54.29 in Stuttgart in 1993.",
    "detailedExplanation": "The American quartet of Andrew Valmon, Quincy Watts, Butch Reynolds, and Michael Johnson achieved this incredible feat at the 1993 World Championships in Stuttgart, Germany. This record has proven to be one of the most enduring in track and field, standing for over 30 years. The team's anchor leg runner, Michael Johnson, was already establishing himself as one of the greatest 400-meter runners of all time, and this relay performance was part of his legendary career that would later include individual world records.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_4_%C3%97_400_metres_relay_world_record_progression",
    "citationTitle": "Wikipedia: Men's 4 × 400 metres relay world record progression"
  },
  {
    "id": "9fc79c2e-6297-433f-9b20-5d1260d02aa1",
    "text": "What is the men's 20-kilometer race walk world record, set by Yusuke Suzuki of Japan in 2015?",
    "options": [
      "1:16:36",
      "1:18:45",
      "1:15:23",
      "1:17:02"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Yusuke Suzuki set the men's 20-kilometer race walk world record at 1:16:36 in Nomi, Japan in 2015.",
    "detailedExplanation": "Yusuke Suzuki achieved this remarkable time at the Japanese Race Walking Championships in Nomi on March 15, 2015. His performance broke the previous world record and demonstrated the technical excellence required in race walking, where athletes must maintain contact with the ground at all times while achieving incredible speeds. Suzuki's record was particularly significant as it showcased Japan's strength in race walking events, with the nation producing several world-class competitors in this demanding discipline.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_20_kilometres_race_walk_world_record_progression",
    "citationTitle": "Wikipedia: Men's 20 kilometres race walk world record progression"
  }
]