[
  {
    "id": "4fac2642-126a-4e98-875f-07da482dbe2b",
    "text": "Who holds the men's world record for the 100-meter sprint?",
    "options": [
      "Usain Bolt",
      "Tyson Gay",
      "Yohan Blake",
      "Justin Gatlin"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Usain Bolt holds the men's 100m world record with a time of 9.58 seconds.",
    "detailedExplanation": "Usain Bolt of Jamaica set the men's 100-meter world record at 9.58 seconds during the 2009 World Championships in Athletics in Berlin, Germany. This record broke his own previous record of 9.69 seconds set at the 2008 Beijing Olympics. Bolt's dominance in sprinting earned him the nickname 'Lightning Bolt' and made him one of the most recognizable athletes in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/100_metres_world_record_progression",
    "citationTitle": "Wikipedia: 100 metres world record progression"
  },
  {
    "id": "4bcd4f8d-10bc-48e7-89de-bfb9ee5aac10",
    "text": "What is the women's world record time for the marathon?",
    "options": [
      "2:14:04",
      "2:17:01",
      "2:11:53",
      "2:19:12"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Brigid Kosgei set the women's marathon world record at 2:14:04 in 2019.",
    "detailedExplanation": "Brigid Kosgei of Kenya set the women's marathon world record with a time of 2:14:04 at the 2019 Chicago Marathon on October 13, 2019. This remarkable performance shattered the previous record of 2:15:25 held by Paula Radcliffe since 2003, breaking it by over a minute. Kosgei's record-breaking run made her only the second woman to break 2:15 in the marathon and established her as one of the greatest distance runners of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marathon_world_record_progression",
    "citationTitle": "Wikipedia: Marathon world record progression"
  },
  {
    "id": "77a77a84-25fd-4380-92af-33157dfb2363",
    "text": "Who holds the men's pole vault world record?",
    "options": [
      "Sergey Bubka",
      "Renaud Lavillenie",
      "Armand Duplantis",
      "Brad Walker"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Armand Duplantis holds the men's pole vault world record at 6.24 meters.",
    "detailedExplanation": "Armand 'Mondo' Duplantis of Sweden set the men's pole vault world record at 6.24 meters (20 feet 5¾ inches) at the Eugene Diamond League meeting in July 2022. The Swedish-American athlete has broken the world record multiple times, surpassing the legendary Sergey Bubka's long-standing dominance in the event. Duplantis, who was born in the United States but competes for Sweden, has revolutionized pole vaulting with his consistency and ability to clear unprecedented heights.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_pole_vault_world_record_progression",
    "citationTitle": "Wikipedia: Men's pole vault world record progression"
  },
  {
    "id": "3c0982b1-51f3-433d-a152-4f9f67b98c18",
    "text": "What is the men's world record for the shot put?",
    "options": [
      "22.91m",
      "23.37m",
      "23.12m",
      "22.63m"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Randy Barnes holds the men's shot put world record at 23.37 meters, set in 1990.",
    "detailedExplanation": "Randy Barnes of the United States set the men's shot put world record at 23.37 meters (76 feet 8 inches) on May 20, 1990, in Westwood, Los Angeles. This record has stood for over three decades, making it one of the most enduring world records in track and field. Barnes' technique and explosive power made him one of the greatest shot putters of all time, though his career was later marred by doping violations that led to a lifetime ban from competition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_shot_put_world_record_progression",
    "citationTitle": "Wikipedia: Men's shot put world record progression"
  },
  {
    "id": "b4b6c7a5-799a-4a9c-9029-66e4f6b412c2",
    "text": "Who holds the women's high jump world record?",
    "options": [
      "Stefka Kostadinova",
      "Blanka Vlašić",
      "Anna Chicherova",
      "Kajsa Bergqvist"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Stefka Kostadinova of Bulgaria holds the women's high jump world record at 2.09 meters.",
    "detailedExplanation": "Stefka Kostadinova of Bulgaria set the women's high jump world record at 2.09 meters (6 feet 10¼ inches) on August 30, 1987, at the World Championships in Rome, Italy. This record has remained unbroken for over 35 years, making it one of the oldest standing world records in athletics. Kostadinova's achievement is particularly remarkable as she was only 22 years old when she set the record, and no woman has come closer than 3 centimeters to matching her mark since then.",
    "citationUrl": "https://en.wikipedia.org/wiki/Women%27s_high_jump_world_record_progression",
    "citationTitle": "Wikipedia: Women's high jump world record progression"
  },
  {
    "id": "fd318227-e511-476a-b5f1-e0f52e1af6ff",
    "text": "What is the men's world record for the 400-meter hurdles?",
    "options": [
      "46.78 seconds",
      "47.02 seconds",
      "46.70 seconds",
      "47.19 seconds"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Karsten Warholm holds the men's 400m hurdles world record at 46.70 seconds, but the closest option is 46.78.",
    "detailedExplanation": "Karsten Warholm of Norway set the men's 400-meter hurdles world record at 46.70 seconds during the Tokyo 2020 Olympics on August 3, 2021. His performance demolished the previous world record by 0.76 seconds, one of the largest margins of improvement in track and field history. Warholm's run was so fast that it would have won the flat 400-meter race at many major championships, showcasing the incredible evolution of hurdling technique and training methods in recent years.",
    "citationUrl": "https://en.wikipedia.org/wiki/400_metres_hurdles_world_record_progression",
    "citationTitle": "Wikipedia: 400 metres hurdles world record progression"
  },
  {
    "id": "229e0e04-2411-487c-ab06-51ef0b2043b8",
    "text": "Who holds the women's javelin throw world record?",
    "options": [
      "Petra Felke",
      "Barbora Špotáková",
      "Osleidys Menéndez",
      "Trine Hattestad"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Barbora Špotáková of Czech Republic holds the women's javelin world record at 72.28 meters.",
    "detailedExplanation": "Barbora Špotáková of the Czech Republic set the women's javelin throw world record at 72.28 meters (237 feet 2 inches) on September 13, 2008, in Stuttgart, Germany. This throw came just weeks after she won Olympic gold in Beijing, establishing her as the greatest female javelin thrower of all time. Špotáková's record has stood for over 15 years, and her dominance in the event included two Olympic gold medals and three World Championship titles.",
    "citationUrl": "https://en.wikipedia.org/wiki/Women%27s_javelin_throw_world_record_progression",
    "citationTitle": "Wikipedia: Women's javelin throw world record progression"
  },
  {
    "id": "b41f2e05-e0c1-47cd-9880-f53f86035f1a",
    "text": "What is the men's world record for the decathlon?",
    "options": [
      "9018 points",
      "9126 points",
      "8893 points",
      "9045 points"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Kevin Mayer holds the men's decathlon world record with 9126 points, set in 2018.",
    "detailedExplanation": "Kevin Mayer of France set the men's decathlon world record with 9126 points at the 2018 Décastar meeting in Talence, France, on September 15-16, 2018. Mayer's performance broke the previous record of 9045 points held by American Ashton Eaton since 2015. The decathlon, known as the ultimate test of athletic versatility, consists of ten events over two days: 100m, long jump, shot put, high jump, 400m, 110m hurdles, discus, pole vault, javelin, and 1500m. Mayer's record-breaking performance showcased exceptional consistency across all ten disciplines.",
    "citationUrl": "https://en.wikipedia.org/wiki/Decathlon_world_record_progression",
    "citationTitle": "Wikipedia: Decathlon world record progression"
  },
  {
    "id": "0eee1344-703f-4348-beb5-373b27e2483c",
    "text": "Which country holds the men's 4x100m relay world record set at the 2012 London Olympics?",
    "options": [
      "United States",
      "Jamaica",
      "Trinidad and Tobago",
      "Great Britain"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Jamaica set the men's 4x100m relay world record of 36.84 seconds at the 2012 London Olympics.",
    "detailedExplanation": "Jamaica's relay team consisting of Nesta Carter, Michael Frater, Yohan Blake, and Usain Bolt set the men's 4x100m relay world record with a time of 36.84 seconds at the 2012 London Olympics. This record broke their own previous world record of 37.04 seconds set at the 2011 World Championships. The Jamaican team's dominance in sprinting during this era, led by Usain Bolt, made them nearly unbeatable in relay events.",
    "citationUrl": "https://en.wikipedia.org/wiki/4_%C3%97_100_metres_relay_world_record_progression",
    "citationTitle": "Wikipedia: 4 × 100 metres relay world record progression"
  },
  {
    "id": "0ed12c96-fbda-400c-a067-6e4892754946",
    "text": "What is the women's world record for the 800-meter run, set by Jarmila Kratochvílová in 1983?",
    "options": [
      "1:53.28",
      "1:55.16",
      "1:52.34",
      "1:54.01"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Jarmila Kratochvílová of Czechoslovakia set the women's 800m world record of 1:53.28 in 1983.",
    "detailedExplanation": "Jarmila Kratochvílová's women's 800-meter world record of 1:53.28, set on July 26, 1983, in Munich, remains one of athletics' longest-standing world records. The Czech athlete set this remarkable time during the height of her career, and despite numerous attempts by world-class middle-distance runners over the decades, this record has proven exceptionally difficult to break. The longevity of this record is considered one of the most impressive feats in track and field history.",
    "citationUrl": "https://en.wikipedia.org/wiki/800_metres_world_record_progression",
    "citationTitle": "Wikipedia: 800 metres world record progression"
  },
  {
    "id": "b6c91a1d-de20-413f-af59-53f36d841b3c",
    "text": "In which year was the current men's long jump world record of 8.95 meters set by Bob Beamon broken?",
    "options": [
      "It still stands today",
      "1991",
      "1988",
      "1995"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Bob Beamon's long jump world record was broken in 1991 by Mike Powell, who jumped 8.95 meters.",
    "detailedExplanation": "Bob Beamon's legendary long jump world record of 8.90 meters, set at the 1968 Mexico City Olympics, stood for 23 years until Mike Powell of the United States broke it with a jump of 8.95 meters at the 1991 World Championships in Tokyo. Beamon's jump was so extraordinary that it exceeded the existing world record by 55 centimeters, coining the term 'Beamonesque' for performances that far exceed previous standards. Powell's record still stands today, making it one of athletics' most enduring records.",
    "citationUrl": "https://en.wikipedia.org/wiki/Long_jump_world_record_progression",
    "citationTitle": "Wikipedia: Long jump world record progression"
  },
  {
    "id": "e3f609ea-fa4e-48d3-a2e3-d3a8272f673c",
    "text": "Who holds the women's 10,000-meter world record with a time of 29:01.03?",
    "options": [
      "Tirunesh Dibaba",
      "Almaz Ayana",
      "Paula Radcliffe",
      "Letesenbet Gidey"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Letesenbet Gidey of Ethiopia set the women's 10,000m world record of 29:01.03 in 2021.",
    "detailedExplanation": "Letesenbet Gidey of Ethiopia set the women's 10,000-meter world record with a time of 29:01.03 on June 8, 2021, at the Ethiopian Olympic Trials in Hengelo, Netherlands. This performance broke the previous record of 29:17.45 set by Almaz Ayana at the 2016 Rio Olympics. Gidey's record came during a period of remarkable performances in distance running, aided by advances in running shoe technology and optimal racing conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/10,000_metres_world_record_progression",
    "citationTitle": "Wikipedia: 10,000 metres world record progression"
  },
  {
    "id": "e9ec5f5d-f0ef-4b96-a0b1-c4e712adaf9a",
    "text": "What is the men's world record for the hammer throw, rounded to the nearest meter?",
    "options": [
      "84 meters",
      "87 meters",
      "86 meters",
      "85 meters"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The men's hammer throw world record is 86.74 meters, which rounds to 87 meters when rounded to the nearest meter.",
    "detailedExplanation": "Yuriy Sedykh of the Soviet Union holds the men's hammer throw world record with a distance of 86.74 meters, set on August 30, 1986, in Stuttgart, Germany. This record has stood for over 35 years, making it one of the oldest world records in athletics. Sedykh was a dominant hammer thrower who won two Olympic gold medals and set multiple world records during his career. The longevity of this record demonstrates the exceptional nature of his performance and the technical difficulty of the hammer throw event.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hammer_throw_world_record_progression",
    "citationTitle": "Wikipedia: Hammer throw world record progression"
  },
  {
    "id": "19b1dafc-075a-4eed-b320-a3b3398248ac",
    "text": "Which athlete holds both the men's 5,000m and 10,000m world records?",
    "options": [
      "Kenenisa Bekele",
      "Joshua Cheptegei",
      "Mo Farah",
      "Haile Gebrselassie"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Joshua Cheptegei of Uganda holds both the men's 5,000m (12:35.36) and 10,000m (26:11.00) world records.",
    "detailedExplanation": "Joshua Cheptegei of Uganda currently holds both men's long-distance world records. He set the 10,000-meter world record of 26:11.00 on October 7, 2020, in Valencia, Spain, and the 5,000-meter world record of 12:35.36 on August 14, 2020, in Monaco. Cheptegei's achievements represent a new era in distance running, where technological advances in shoes and training methods have contributed to faster times. His dominance in both events showcases his exceptional versatility as a distance runner.",
    "citationUrl": "https://en.wikipedia.org/wiki/5000_metres_world_record_progression",
    "citationTitle": "Wikipedia: 5000 metres world record progression"
  },
  {
    "id": "3a5db4e0-aff4-4af9-a984-930deb7dce64",
    "text": "What is the women's world record for the discus throw, set by Gabriele Reinsch in 1988?",
    "options": [
      "74.08m",
      "76.80m",
      "75.24m",
      "73.83m"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Gabriele Reinsch of East Germany set the women's discus world record of 76.80 meters in 1988.",
    "detailedExplanation": "Gabriele Reinsch of East Germany set the women's discus throw world record of 76.80 meters on July 9, 1988, in Neubrandenburg. This record has stood for over 35 years and remains one of athletics' most enduring world records. The record was set during an era when East German athletes dominated many throwing events through systematic training programs. Despite numerous attempts by world-class throwers over the decades, Reinsch's mark has proven remarkably difficult to approach, let alone surpass.",
    "citationUrl": "https://en.wikipedia.org/wiki/Discus_throw_world_record_progression",
    "citationTitle": "Wikipedia: Discus throw world record progression"
  },
  {
    "id": "a9424bbb-c64e-4cd7-a838-11be837e51d8",
    "text": "Who holds the women's heptathlon world record with 7,291 points?",
    "options": [
      "Carolina Klüft",
      "Jessica Ennis-Hill",
      "Jackie Joyner-Kersee",
      "Naftali Temu"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Jackie Joyner-Kersee of the United States holds the women's heptathlon world record with 7,291 points, set in 1988.",
    "detailedExplanation": "Jackie Joyner-Kersee set the women's heptathlon world record of 7,291 points at the 1988 Seoul Olympics, a record that has stood for over 35 years. Her performance included outstanding marks across all seven events: 100m hurdles, high jump, shot put, 200m, long jump, javelin throw, and 800m. Joyner-Kersee is widely considered the greatest female multi-event athlete of all time, and her heptathlon record is regarded as one of the most impressive and enduring records in athletics. The longevity of this record speaks to the exceptional nature of her all-around athletic ability.",
    "citationUrl": "https://en.wikipedia.org/wiki/Heptathlon_world_record_progression",
    "citationTitle": "Wikipedia: Heptathlon world record progression"
  },
  {
    "id": "67ae356f-1269-4f5f-95bd-3335fc737497",
    "text": "Which athlete holds the men's world record for the 1500-meter run with a time of 3:26.00?",
    "options": [
      "Hicham El Guerrouj",
      "Sebastian Coe",
      "Noureddine Morceli",
      "Noah Ngeny"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Hicham El Guerrouj of Morocco set the men's 1500m world record of 3:26.00 in 1998.",
    "detailedExplanation": "Hicham El Guerrouj, the Moroccan middle-distance runner, established the men's 1500-meter world record of 3:26.00 on July 14, 1998, in Rome. This record has stood for over 25 years, making it one of the most enduring records in athletics. El Guerrouj is widely considered one of the greatest middle-distance runners of all time, also holding the mile world record.",
    "citationUrl": "https://en.wikipedia.org/wiki/1500_metres_world_record_progression",
    "citationTitle": "Wikipedia: 1500 metres world record progression"
  },
  {
    "id": "dcd80616-9138-433f-bcd5-b40e242d22b9",
    "text": "What is the women's world record for the triple jump, set by Inessa Kravets in 1995?",
    "options": [
      "14.87 meters",
      "15.50 meters",
      "15.74 meters",
      "14.63 meters"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Inessa Kravets of Ukraine set the women's triple jump world record of 15.50 meters in 1995.",
    "detailedExplanation": "Ukrainian athlete Inessa Kravets established the women's triple jump world record of 15.50 meters on August 10, 1995, at the World Championships in Gothenburg, Sweden. This remarkable record has remained unbroken for nearly three decades, demonstrating the exceptional nature of her performance. Kravets was known for her technical precision and explosive power in the triple jump.",
    "citationUrl": "https://en.wikipedia.org/wiki/Triple_jump_world_record_progression",
    "citationTitle": "Wikipedia: Triple jump world record progression"
  },
  {
    "id": "2515a932-6f7d-4daa-9252-2b2e937fe8e8",
    "text": "Which event does Florence Griffith-Joyner hold both the 100m and 200m women's world records in?",
    "options": [
      "Indoor track only",
      "Outdoor track and field",
      "Both indoor and outdoor",
      "Masters competition"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Florence Griffith-Joyner holds the outdoor women's world records in both the 100m (10.49) and 200m (21.34).",
    "detailedExplanation": "Florence Griffith-Joyner, known as 'Flo-Jo,' set both the women's 100-meter world record of 10.49 seconds and the 200-meter world record of 21.34 seconds during the 1988 season. Both records were set in outdoor competition and remain unbroken over 35 years later. Her 100m record was set at the U.S. Olympic Trials, while her 200m record was achieved at the Seoul Olympics, making her performances among the most enduring in athletics history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Florence_Griffith_Joyner",
    "citationTitle": "Wikipedia: Florence Griffith Joyner"
  },
  {
    "id": "bfbc2379-4beb-4449-bcf6-d11fca430945",
    "text": "What is the men's world record for the 3000-meter steeplechase, held by Lamecha Girma?",
    "options": [
      "7:53.63",
      "7:52.11",
      "8:03.28",
      "7:58.33"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Lamecha Girma of Ethiopia set the men's 3000m steeplechase world record of 7:53.63 in 2023.",
    "detailedExplanation": "Ethiopian runner Lamecha Girma broke the long-standing men's 3000-meter steeplechase world record with a time of 7:53.63 at the Diamond League meeting in Paris on June 9, 2023. This performance broke the previous record of 7:53.63 that had been held by Conseslus Kipruto since 2018. Girma's record represents the culmination of years of Ethiopian dominance in steeplechase running and showcases the evolution of the event.",
    "citationUrl": "https://en.wikipedia.org/wiki/3000_metres_steeplechase_world_record_progression",
    "citationTitle": "Wikipedia: 3000 metres steeplechase world record progression"
  }
]