[
  {
    "id": "ed7dcc78-2a82-4edc-891a-bd9e5e01a093",
    "text": "What is the largest country in the world by land area?",
    "options": [
      "China",
      "Canada",
      "United States",
      "Russia"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Russia is the largest country by land area, covering over 17 million square kilometers.",
    "detailedExplanation": "Russia spans eleven time zones and covers approximately 17.1 million square kilometers (6.6 million square miles), making it by far the largest country in the world by land area. It covers more than one-eighth of Earth's inhabited land area and is nearly twice the size of the second-largest country, Canada. Russia's vast territory extends from Eastern Europe across northern Asia to the Pacific Ocean.",
    "citationUrl": "https://en.wikipedia.org/wiki/Russia",
    "citationTitle": "Wikipedia: Russia"
  },
  {
    "id": "cc8b66d0-231d-4b8e-97a2-d5cdaab6939f",
    "text": "Which is the smallest country in the world?",
    "options": [
      "Monaco",
      "Vatican City",
      "San Marino",
      "Liechtenstein"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Vatican City is the smallest country in the world, covering only 0.17 square miles.",
    "detailedExplanation": "Vatican City, officially Vatican City State, is the smallest sovereign nation in the world by both area and population. Located entirely within Rome, Italy, it covers just 0.17 square miles (0.44 square kilometers) or about 121 acres. The country serves as the spiritual and administrative headquarters of the Roman Catholic Church and is home to the Pope. Despite its tiny size, Vatican City is a fully independent nation with its own postal system, telephone system, and even issues its own euros.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vatican_City",
    "citationTitle": "Wikipedia: Vatican City"
  },
  {
    "id": "4de0f46c-40df-4eef-83c9-28ea8a60d1f7",
    "text": "What is the largest ocean on Earth?",
    "options": [
      "Atlantic Ocean",
      "Indian Ocean",
      "Arctic Ocean",
      "Pacific Ocean"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Pacific Ocean is the largest ocean, covering about one-third of Earth's surface.",
    "detailedExplanation": "The Pacific Ocean is by far the largest and deepest ocean basin on Earth, covering approximately 165.2 million square kilometers (63.8 million square miles). It spans from the Arctic in the north to the Antarctic in the south, and from Asia and Australia in the west to the Americas in the east. The Pacific Ocean contains more than half of the free water on Earth and covers about one-third of the planet's surface, which is larger than all land areas combined.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pacific_Ocean",
    "citationTitle": "Wikipedia: Pacific Ocean"
  },
  {
    "id": "f4631604-f378-4761-818a-4063bef95cb8",
    "text": "Which is the largest desert in the world?",
    "options": [
      "Sahara Desert",
      "Gobi Desert",
      "Antarctica",
      "Arabian Desert"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Antarctica is technically the largest desert, as deserts are defined by low precipitation, not temperature.",
    "detailedExplanation": "While many people think of hot, sandy regions when they hear 'desert,' Antarctica is actually the world's largest desert by area, covering about 14 million square kilometers (5.4 million square miles). Deserts are defined by their extremely low precipitation levels rather than temperature, and Antarctica receives very little rainfall or snowfall annually. It is classified as a polar desert. The Sahara, while the largest hot desert, is only about 9 million square kilometers in comparison.",
    "citationUrl": "https://en.wikipedia.org/wiki/Desert",
    "citationTitle": "Wikipedia: Desert"
  },
  {
    "id": "2a52f31e-3fab-4947-9174-b23a352e9856",
    "text": "What is the longest river in the world?",
    "options": [
      "Amazon River",
      "Nile River",
      "Mississippi River",
      "Yangtze River"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Nile River is generally considered the longest river at approximately 6,650 kilometers long.",
    "detailedExplanation": "The Nile River, flowing through northeastern Africa, is traditionally considered the world's longest river at approximately 6,650 kilometers (4,130 miles) in length. It flows northward through eleven countries, with Egypt, Sudan, and Uganda being the primary nations along its course, before emptying into the Mediterranean Sea. While there has been some debate with the Amazon River over which is truly longer due to different measurement methods and source definitions, the Nile is most commonly recognized as holding this record.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nile",
    "citationTitle": "Wikipedia: Nile"
  },
  {
    "id": "22fdd553-c6ef-4f62-9718-289c328182dc",
    "text": "Which is the highest mountain peak in the world?",
    "options": [
      "K2",
      "Mount Kilimanjaro",
      "Mount Everest",
      "Mount McKinley"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Mount Everest is the highest mountain peak at 29,032 feet (8,849 meters) above sea level.",
    "detailedExplanation": "Mount Everest, located in the Himalayan mountain range on the border between Nepal and Tibet (China), is the Earth's highest mountain peak above sea level. Its official height is 8,848.86 meters (29,031.7 feet), as jointly announced by China and Nepal in 2020. Known as 'Sagarmatha' in Nepali and 'Chomolungma' in Tibetan, Everest attracts climbers from around the world, though reaching its summit remains an extremely dangerous and challenging endeavor that requires extensive preparation and favorable weather conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mount_Everest",
    "citationTitle": "Wikipedia: Mount Everest"
  },
  {
    "id": "090a6add-48e4-42a5-9489-f7da825fd05a",
    "text": "Which continent has the smallest land area?",
    "options": [
      "Europe",
      "Antarctica",
      "Australia",
      "South America"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Australia is the smallest continent by land area at about 8.6 million square kilometers.",
    "detailedExplanation": "Australia is the smallest of the seven continents, covering approximately 8.6 million square kilometers (3.3 million square miles). Sometimes referred to as Australia/Oceania when including the surrounding Pacific islands, the Australian continent consists primarily of the Australian mainland, Tasmania, and New Guinea. Despite being the smallest continent, Australia is still the sixth-largest country in the world. Europe, while often considered small, is actually larger than Australia at about 10.2 million square kilometers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Australia_(continent)",
    "citationTitle": "Wikipedia: Australia (continent)"
  },
  {
    "id": "f49cce50-d978-4e3f-ab32-11feaf5c975d",
    "text": "What is the highest mountain in the world?",
    "options": [
      "K2",
      "Mount Kilimanjaro",
      "Mount Everest",
      "Mount McKinley"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Mount Everest is the highest mountain at 29,032 feet above sea level.",
    "detailedExplanation": "Mount Everest, located in the Himalayas on the border between Nepal and Tibet, is the highest mountain on Earth above sea level at 8,848.86 meters (29,031.7 feet). Known as Sagarmatha in Nepali and Chomolungma in Tibetan, it was first successfully climbed by Edmund Hillary and Tenzing Norgay in 1953. The mountain continues to grow by about 4 millimeters per year due to tectonic activity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mount_Everest",
    "citationTitle": "Wikipedia: Mount Everest"
  },
  {
    "id": "159a31de-8350-48a3-8a82-55b2c1bd8897",
    "text": "What is the deepest point on Earth's surface?",
    "options": [
      "Puerto Rico Trench",
      "Java Trench",
      "Mariana Trench",
      "Peru-Chile Trench"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Mariana Trench contains Challenger Deep, the deepest known point at about 36,200 feet below sea level.",
    "detailedExplanation": "The Mariana Trench, located in the western Pacific Ocean near Guam, contains Challenger Deep, the deepest known point on Earth's surface. It reaches a maximum depth of approximately 11,034 meters (36,200 feet) below sea level. The trench was formed by the subduction of the Pacific Plate beneath the smaller Mariana Plate. The extreme pressure at this depth is over 1,000 times greater than at sea level.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mariana_Trench",
    "citationTitle": "Wikipedia: Mariana Trench"
  },
  {
    "id": "68344f43-30d9-400c-ba03-1d87e5b98852",
    "text": "Which is the largest lake in the world by surface area?",
    "options": [
      "Lake Superior",
      "Lake Victoria",
      "Caspian Sea",
      "Lake Baikal"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Caspian Sea is the largest lake by surface area, covering about 143,000 square miles.",
    "detailedExplanation": "The Caspian Sea, despite its name, is actually the world's largest lake by surface area, covering approximately 371,000 square kilometers (143,000 square miles). Located between Europe and Asia, it is bordered by Russia, Kazakhstan, Turkmenistan, Iran, and Azerbaijan. It is technically a lake because it is completely enclosed by land, though it contains saltwater and was historically connected to ancient oceans.",
    "citationUrl": "https://en.wikipedia.org/wiki/Caspian_Sea",
    "citationTitle": "Wikipedia: Caspian Sea"
  },
  {
    "id": "96c54cef-6e65-48d4-b5a1-776973975905",
    "text": "What is the world's largest ocean?",
    "options": [
      "Atlantic Ocean",
      "Indian Ocean",
      "Arctic Ocean",
      "Pacific Ocean"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Pacific Ocean is the largest ocean, covering about one-third of Earth's surface.",
    "detailedExplanation": "The Pacific Ocean covers approximately 165.2 million square kilometers (63.8 million square miles), making it larger than all the land area on Earth combined. It stretches from Asia and Australia to the Americas and covers about one-third of the planet's surface. The Pacific is so vast that it contains more than half of the world's free water and is larger than the Atlantic and Indian Oceans combined.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pacific_Ocean",
    "citationTitle": "Wikipedia: Pacific Ocean"
  },
  {
    "id": "fa8b1e08-d7c1-4808-87cc-b87b8d330452",
    "text": "Which is the world's largest desert?",
    "options": [
      "Sahara Desert",
      "Gobi Desert",
      "Antarctica",
      "Arabian Desert"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Antarctica is technically the world's largest desert, as deserts are defined by low precipitation, not temperature.",
    "detailedExplanation": "Antarctica is classified as the world's largest desert because deserts are defined by their lack of precipitation rather than their temperature. Antarctica covers about 14 million square kilometers (5.4 million square miles) and receives very little snowfall annually. The Sahara is the largest hot desert, but Antarctica qualifies as a cold desert and surpasses it in size.",
    "citationUrl": "https://en.wikipedia.org/wiki/Antarctica",
    "citationTitle": "Wikipedia: Antarctica"
  },
  {
    "id": "a1cbad2f-466c-43c1-8b3b-29e3bbe4578f",
    "text": "What is the world's largest island?",
    "options": [
      "Australia",
      "Greenland",
      "New Guinea",
      "Borneo"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Greenland is the world's largest island, covering over 2 million square kilometers.",
    "detailedExplanation": "Greenland is the world's largest island, covering approximately 2.17 million square kilometers (836,330 square miles). It is an autonomous territory within the Kingdom of Denmark, located between the Arctic and Atlantic oceans. About 80% of Greenland is covered by ice, and it has a population of approximately 56,000 people. Australia is larger but is considered a continent rather than an island.",
    "citationUrl": "https://en.wikipedia.org/wiki/Greenland",
    "citationTitle": "Wikipedia: Greenland"
  },
  {
    "id": "11bd1784-e556-48f5-84bf-4b5f68542651",
    "text": "Which lake holds the most fresh water by volume?",
    "options": [
      "Lake Superior",
      "Lake Baikal",
      "Lake Victoria",
      "Caspian Sea"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Lake Baikal contains about 20% of the world's unfrozen fresh water.",
    "detailedExplanation": "Lake Baikal in Siberia, Russia, contains approximately 20% of the world's unfrozen fresh water by volume, despite not being the largest lake by surface area. It holds about 23,615 cubic kilometers of water and is also the world's oldest and deepest freshwater lake, reaching depths of 1,642 meters (5,387 feet). The lake is over 25 million years old and contains thousands of endemic species.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lake_Baikal",
    "citationTitle": "Wikipedia: Lake Baikal"
  },
  {
    "id": "0aa73e5c-e45b-4418-9b4d-4ac5e42dc8b4",
    "text": "Which is the largest country in the world by land area?",
    "options": [
      "Canada",
      "China",
      "Russia",
      "United States"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Russia is the largest country by land area, covering over 17 million square kilometers.",
    "detailedExplanation": "Russia spans across 17.1 million square kilometers (6.6 million square miles), making it by far the largest country in the world by land area. It covers more than one-eighth of Earth's inhabited land area and extends across eleven time zones. Russia is nearly twice as large as Canada, the second-largest country, and covers more area than the entire continent of Antarctica.",
    "citationUrl": "https://en.wikipedia.org/wiki/Russia",
    "citationTitle": "Wikipedia: Russia"
  },
  {
    "id": "1d3c7d7b-edcc-4e9c-a974-5795fd658625",
    "text": "What is the smallest country in the world by area?",
    "options": [
      "Monaco",
      "Vatican City",
      "San Marino",
      "Liechtenstein"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Vatican City is the smallest sovereign state in the world, covering just 0.17 square miles.",
    "detailedExplanation": "Vatican City, officially known as Vatican City State, covers only 0.17 square miles (0.44 square kilometers or 44 hectares). Located entirely within Rome, Italy, it is an enclave that serves as the spiritual and administrative headquarters of the Roman Catholic Church. The entire country can be walked across in about 20 minutes, making it roughly one-eighth the size of New York's Central Park.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vatican_City",
    "citationTitle": "Wikipedia: Vatican City"
  },
  {
    "id": "264db6f0-b8fc-4a62-8587-3bc98080b8ce",
    "text": "What is the smallest country in the world?",
    "options": [
      "Monaco",
      "Vatican City",
      "San Marino",
      "Liechtenstein"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Vatican City is the smallest sovereign nation, covering just 0.17 square miles (0.44 square kilometers).",
    "detailedExplanation": "Vatican City, officially Vatican City State, is an enclave within Rome, Italy, and is the smallest internationally recognized sovereign state in the world by both area and population. With an area of approximately 121 acres (49 hectares) or 0.17 square miles, it is roughly one-eighth the size of New York's Central Park. The entire country can be walked across in about 20 minutes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vatican_City",
    "citationTitle": "Wikipedia: Vatican City"
  },
  {
    "id": "197f2542-9d65-4dec-a28b-43e559502e43",
    "text": "Which is the world's largest ocean?",
    "options": [
      "Atlantic Ocean",
      "Indian Ocean",
      "Arctic Ocean",
      "Pacific Ocean"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "The Pacific Ocean is the largest ocean, covering about one-third of Earth's surface.",
    "detailedExplanation": "The Pacific Ocean covers approximately 165.2 million square kilometers (63.8 million square miles), which is about 46% of the world's water surface and about one-third of the total surface area of Earth. It is larger than all the land area on Earth combined and contains more than half of the free water in the world. The Pacific stretches from Asia and Australia to the Americas and is bounded by the Arctic in the north and the Southern Ocean in the south.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pacific_Ocean",
    "citationTitle": "Wikipedia: Pacific Ocean"
  },
  {
    "id": "b1b35f2d-2147-47d5-a461-9800fe8d156d",
    "text": "What is the world's largest desert?",
    "options": [
      "Sahara Desert",
      "Gobi Desert",
      "Antarctica",
      "Arabian Desert"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "easy",
    "explanation": "Antarctica is technically the world's largest desert, as it receives very little precipitation despite being covered in ice.",
    "detailedExplanation": "Antarctica is classified as the world's largest desert, covering approximately 14 million square kilometers (5.4 million square miles). While most people think of deserts as hot, sandy places, a desert is technically defined as a region that receives very little precipitation. Antarctica receives less than 200mm of precipitation annually, qualifying it as a polar desert. The Sahara, while the largest hot desert, covers about 9 million square kilometers, making it smaller than Antarctica.",
    "citationUrl": "https://en.wikipedia.org/wiki/Antarctic_Desert",
    "citationTitle": "Wikipedia: Antarctic Desert"
  }
]