[
  {
    "id": "8786f3aa-5266-4fe0-80e7-05b639db7c1f",
    "text": "Which famous sculpture was stolen from the Louvre in 1911 and missing for over two years?",
    "options": [
      "Venus de Milo",
      "Mona Lisa",
      "Winged Victory of Samothrace",
      "The Thinker"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Venus de Milo was stolen from the Louvre in 1911 by Italian handyman Vincenzo Peruggia.",
    "detailedExplanation": "On August 21, 1911, the Venus de Milo was stolen from the Louvre Museum in Paris by Vincenzo Peruggia, an Italian handyman who had worked at the museum. The theft made international headlines and the sculpture remained missing for 28 months. Peruggia kept the sculpture in his apartment, believing it should be returned to Italy. The sculpture was eventually recovered when Peruggia attempted to sell it to an art dealer in Florence in 1913.",
    "citationUrl": "https://en.wikipedia.org/wiki/Venus_de_Milo",
    "citationTitle": "Wikipedia: Venus de Milo"
  },
  {
    "id": "107c45c5-02e2-4007-aa70-75d434fab540",
    "text": "What material is Michelangelo's David primarily carved from?",
    "options": [
      "Marble",
      "Bronze",
      "Granite",
      "Limestone"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Michelangelo's David is carved from a single block of white Carrara marble.",
    "detailedExplanation": "Michelangelo's David, completed between 1501 and 1504, is carved from a single block of white Carrara marble. The marble block was originally commissioned by the Opera del Duomo for the Cathedral of Florence in 1464, but remained untouched for decades. When Michelangelo took on the project, the marble block was considered flawed and difficult to work with, making his achievement even more remarkable. The 17-foot tall masterpiece demonstrates Michelangelo's incredible skill in transforming this challenging material into one of the world's most recognizable sculptures.",
    "citationUrl": "https://en.wikipedia.org/wiki/David_(Michelangelo)",
    "citationTitle": "Wikipedia: David (Michelangelo)"
  },
  {
    "id": "8a1fb1f7-8d96-45a9-bab8-787cf780cd2d",
    "text": "Which ancient sculpture is missing both arms and was discovered on the Greek island of Milos?",
    "options": [
      "Laocoön and His Sons",
      "Venus de Milo",
      "Winged Victory of Samothrace",
      "Discus Thrower"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Venus de Milo, discovered on the Greek island of Milos in 1820, is famous for its missing arms.",
    "detailedExplanation": "The Venus de Milo, also known as Aphrodite of Milos, was discovered in 1820 by a peasant named Yorgos Kentrotas on the Greek island of Milos (also called Melos). The ancient Greek sculpture, dating from around 130-100 BCE, depicts the goddess Aphrodite and is renowned for its missing arms, which have never been found. The sculpture was acquired by France and has been displayed in the Louvre Museum since 1821, becoming one of the most famous ancient sculptures in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Venus_de_Milo",
    "citationTitle": "Wikipedia: Venus de Milo"
  },
  {
    "id": "a6dcf161-1316-4831-9b64-0933f492ed43",
    "text": "Which sculptor created the famous work 'The Kiss'?",
    "options": [
      "Auguste Rodin",
      "Michelangelo",
      "Donatello",
      "Bernini"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Auguste Rodin created 'The Kiss', one of his most famous sculptures completed in the 1880s.",
    "detailedExplanation": "Auguste Rodin created 'The Kiss' (originally titled 'Francesca da Rimini') as part of his larger work 'The Gates of Hell' in the 1880s. The sculpture depicts Paolo and Francesca, two characters from Dante's Inferno who fell in love while reading together and were killed by Francesca's husband. Rodin decided to make it a standalone piece due to its popularity. The sculpture exists in multiple versions, with the original marble version housed in the Musée Rodin in Paris. It has become one of the most recognizable sculptures in Western art.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kiss_(Rodin_sculpture)",
    "citationTitle": "Wikipedia: The Kiss (Rodin sculpture)"
  },
  {
    "id": "5b1df431-c494-4243-8cc2-46d7d5cf07cd",
    "text": "Mount Rushmore features the faces of four U.S. presidents. Which president is NOT depicted?",
    "options": [
      "Thomas Jefferson",
      "Franklin D. Roosevelt",
      "Abraham Lincoln",
      "George Washington"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Franklin D. Roosevelt is not depicted on Mount Rushmore. The four presidents shown are Washington, Jefferson, Theodore Roosevelt, and Lincoln.",
    "detailedExplanation": "Mount Rushmore National Memorial features the 60-foot tall faces of four U.S. presidents: George Washington, Thomas Jefferson, Theodore Roosevelt, and Abraham Lincoln. The monument was carved between 1927 and 1941 under the direction of sculptor Gutzon Borglum. Franklin D. Roosevelt, while a significant president, is not among the four depicted. The presidents were chosen to represent the nation's birth (Washington), growth (Jefferson), development (Theodore Roosevelt), and preservation (Lincoln).",
    "citationUrl": "https://en.wikipedia.org/wiki/Mount_Rushmore",
    "citationTitle": "Wikipedia: Mount Rushmore"
  },
  {
    "id": "d16666c1-6a09-4861-92b5-17a0924161dd",
    "text": "Which sculpture by Gian Lorenzo Bernini depicts a biblical shepherd boy about to fight a giant?",
    "options": [
      "Apollo and Daphne",
      "David",
      "The Ecstasy of Saint Teresa",
      "Pluto and Proserpina"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Bernini's David depicts the biblical David preparing to fight Goliath, captured in dynamic motion.",
    "detailedExplanation": "Gian Lorenzo Bernini's David, completed in 1624, depicts the biblical shepherd boy David at the moment he is about to sling the stone at the giant Goliath. Unlike Michelangelo's static David, Bernini's sculpture captures David in dynamic motion, with his body twisted and face showing intense concentration. The sculpture demonstrates Bernini's mastery of Baroque style, emphasizing movement, emotion, and dramatic tension. It was commissioned by Cardinal Scipione Borghese and remains in the Galleria Borghese in Rome.",
    "citationUrl": "https://en.wikipedia.org/wiki/David_(Bernini)",
    "citationTitle": "Wikipedia: David (Bernini)"
  },
  {
    "id": "2baf6994-847d-4654-87a7-d614e936353c",
    "text": "The ancient Greek sculpture 'Laocoön and His Sons' depicts a Trojan priest being attacked by what creatures?",
    "options": [
      "Lions",
      "Sea serpents",
      "Eagles",
      "Centaurs"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Laocoön and His Sons shows the Trojan priest and his sons being killed by sea serpents sent by the gods.",
    "detailedExplanation": "The Laocoön Group, discovered in Rome in 1506, depicts the Trojan priest Laocoön and his two sons being attacked by giant sea serpents. According to Greek and Roman mythology, Laocoön warned the Trojans not to accept the wooden horse left by the Greeks, angering the gods who supported the Greeks. As punishment, the gods sent sea serpents to kill Laocoön and his sons. The sculpture, likely created between 200-70 BCE, is renowned for its dramatic expression of physical and emotional agony and has been housed in the Vatican Museums since its discovery.",
    "citationUrl": "https://en.wikipedia.org/wiki/Laoco%C3%B6n_and_His_Sons",
    "citationTitle": "Wikipedia: Laocoön and His Sons"
  },
  {
    "id": "161b423b-c511-4565-9d60-cc07e0813902",
    "text": "Which sculptor created 'The Thinker', originally conceived as part of a larger work called 'The Gates of Hell'?",
    "options": [
      "Auguste Rodin",
      "Camille Claudel",
      "Antoine Bourdelle",
      "Aristide Maillol"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Auguste Rodin created 'The Thinker' around 1880 as part of his monumental 'Gates of Hell' commission.",
    "detailedExplanation": "Auguste Rodin's iconic bronze sculpture 'The Thinker' was originally titled 'The Poet' and was meant to represent Dante contemplating the circles of Hell in front of the Gates. The sculpture was first conceived around 1880 as part of Rodin's commission for a decorative portal based on Dante's Divine Comedy. The work became so popular that Rodin later created it as a standalone piece, and numerous bronze casts exist in museums worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Thinker",
    "citationTitle": "Wikipedia: The Thinker"
  },
  {
    "id": "6e90dafe-409d-4ca0-bb8f-3eb6ad49fadc",
    "text": "The ancient Greek statue known as the 'Winged Victory of Samothrace' is missing which body part?",
    "options": [
      "Head",
      "Arms",
      "Legs",
      "Wings"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Winged Victory of Samothrace is missing its head, though it retains its dramatic wings and flowing drapery.",
    "detailedExplanation": "The Winged Victory of Samothrace, created around 200-190 BCE, is one of the most celebrated sculptures of ancient Greece. Discovered in 1863 on the Greek island of Samothrace, the marble statue depicts Nike, the goddess of victory, standing on the prow of a ship. While the sculpture's head has never been found, its powerful composition of wind-swept drapery and outstretched wings creates a sense of movement and triumph that has inspired viewers for over two millennia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Winged_Victory_of_Samothrace",
    "citationTitle": "Wikipedia: Winged Victory of Samothrace"
  },
  {
    "id": "c73c9e9f-40ba-4795-9ffe-716758908643",
    "text": "Which controversial British artist created the diamond-encrusted platinum skull titled 'For the Love of God'?",
    "options": [
      "Banksy",
      "Damien Hirst",
      "Tracey Emin",
      "Antony Gormley"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Damien Hirst created this controversial artwork in 2007, using 8,601 diamonds on an 18th-century human skull.",
    "detailedExplanation": "Damien Hirst's 'For the Love of God' is one of the most expensive artworks ever created, valued at over £50 million. The sculpture consists of a platinum cast of an 18th-century human skull encrusted with 8,601 diamonds, including a 52.07-carat pink diamond on the forehead. Created in 2007, the work exemplifies Hirst's ongoing fascination with death and luxury, combining memento mori symbolism with contemporary excess. The piece sparked debates about art, commerce, and mortality when it was exhibited.",
    "citationUrl": "https://en.wikipedia.org/wiki/For_the_Love_of_God",
    "citationTitle": "Wikipedia: For the Love of God"
  },
  {
    "id": "80d4e8f9-379e-4bd2-a2aa-7c6a94e2e2e5",
    "text": "The famous Easter Island statues are known by what name in the local Rapa Nui language?",
    "options": [
      "Maoi",
      "Moai",
      "Mahi",
      "Manu"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Easter Island statues are called 'Moai' in the Rapa Nui language of the island's indigenous people.",
    "detailedExplanation": "The Moai are monolithic human figures carved by the Rapa Nui people on Easter Island between 1250 and 1500 CE. Nearly 1,000 statues exist on the island, most carved from volcanic tuff at the Rano Raraku quarry. Contrary to popular belief, many Moai have bodies buried underground, not just heads. These sculptures were created to honor ancestors and were believed to walk to their final positions around the island, according to local oral tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moai",
    "citationTitle": "Wikipedia: Moai"
  },
  {
    "id": "97958191-1fed-4d1a-b7fd-ca92f52e843e",
    "text": "Which Spanish surrealist artist created the melting clock sculpture 'Nobility of Time'?",
    "options": [
      "Pablo Picasso",
      "Joan Miró",
      "Salvador Dalí",
      "Antoni Gaudí"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Salvador Dalí created 'Nobility of Time' as a three-dimensional version of his famous melting clocks motif.",
    "detailedExplanation": "Salvador Dalí's 'Nobility of Time' is a bronze sculpture that brings his iconic melting timepieces from his paintings into three-dimensional form. Created in the 1970s and 1980s, this sculpture series features Dalí's signature soft watches draped over a dead tree branch, symbolizing the relativity and fluidity of time. The work reflects Dalí's fascination with Einstein's theory of relativity and his surrealist exploration of dreams, memory, and the subconscious mind.",
    "citationUrl": "https://en.wikipedia.org/wiki/Salvador_Dal%C3%AD",
    "citationTitle": "Wikipedia: Salvador Dalí"
  },
  {
    "id": "5b6bac8e-e367-489f-97dd-8235351ad82a",
    "text": "The ancient statue 'Doryphoros' (Spear Bearer) was created by which Greek sculptor and is considered the ideal example of contrapposto?",
    "options": [
      "Phidias",
      "Praxiteles",
      "Polykleitos",
      "Lysippos"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Polykleitos created the Doryphoros around 450-440 BCE as a demonstration of his theories on ideal human proportions.",
    "detailedExplanation": "The Doryphoros by Polykleitos is one of the most important sculptures in Western art history, exemplifying the classical Greek ideal of perfect human proportions. Created around 450-440 BCE, the bronze original is lost, but Roman marble copies survive. The sculpture demonstrates contrapposto, where the figure's weight shifts to one leg, creating a natural, relaxed pose. Polykleitos wrote a treatise called 'The Canon' describing the mathematical relationships that governed the sculpture's proportions, making it both an artwork and a theoretical statement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doryphoros",
    "citationTitle": "Wikipedia: Doryphoros"
  },
  {
    "id": "5a97d8eb-ce24-48ca-ba90-92e32cdcdc5f",
    "text": "Which American sculptor created the massive environmental artwork 'Spiral Jetty' in Utah's Great Salt Lake?",
    "options": [
      "Robert Smithson",
      "Donald Judd",
      "Richard Serra",
      "Dan Flavin"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Robert Smithson created 'Spiral Jetty' in 1970 as one of the most famous examples of Land Art.",
    "detailedExplanation": "Robert Smithson's 'Spiral Jetty' is a 1,500-foot-long spiral of rocks, earth, and salt crystals constructed in 1970 at Rozel Point on the northeastern shore of Great Salt Lake. This monumental earthwork is considered one of the most important examples of Land Art, a movement that took art out of galleries and into natural landscapes. The sculpture's visibility depends on the lake's water levels, sometimes being completely submerged and other times fully exposed, making it a dynamic work that changes with environmental conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spiral_Jetty",
    "citationTitle": "Wikipedia: Spiral Jetty"
  },
  {
    "id": "8cac8197-5c6e-4706-999c-cca29b87aa61",
    "text": "The bronze sculpture 'Charging Bull' in New York's Financial District was created by which artist?",
    "options": [
      "Arturo Di Modica",
      "Alexander Calder",
      "Louise Bourgeois",
      "Jeff Koons"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Arturo Di Modica created the 'Charging Bull' and installed it guerrilla-style in 1989 without permission.",
    "detailedExplanation": "Arturo Di Modica's 'Charging Bull' was created as an unauthorized guerrilla art installation in December 1989. The Italian-American artist spent $360,000 of his own money to create the 7,100-pound bronze sculpture and secretly placed it near the New York Stock Exchange as a symbol of strength and power of the American people after the 1987 stock market crash. Though initially removed by police, public support led to its permanent installation nearby in Bowling Green Park, where it became an iconic symbol of Wall Street and American capitalism.",
    "citationUrl": "https://en.wikipedia.org/wiki/Charging_Bull",
    "citationTitle": "Wikipedia: Charging Bull"
  },
  {
    "id": "8123625c-7aa5-4833-a28e-7261c1cf96a8",
    "text": "Which bronze sculpture by Auguste Rodin depicts six citizens of Calais who volunteered to sacrifice themselves to save their city during the Hundred Years' War?",
    "options": [
      "The Burghers of Calais",
      "The Citizens of Normandy",
      "The Heroes of Aquitaine",
      "The Martyrs of Orleans"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Burghers of Calais commemorates six citizens who offered their lives to lift the siege of Calais in 1347.",
    "detailedExplanation": "Auguste Rodin's 'The Burghers of Calais' (1889) depicts six prominent citizens who, according to historical accounts, volunteered to be executed by King Edward III of England to save their besieged city in 1347. The sculpture is renowned for its innovative composition, showing the figures at ground level rather than on a traditional pedestal, making them appear to walk among viewers. Rodin's emotional portrayal captures each figure's individual response to their impending sacrifice.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Burghers_of_Calais",
    "citationTitle": "Wikipedia: The Burghers of Calais"
  },
  {
    "id": "358fb63a-4c52-460a-be27-61d40d9f94bc",
    "text": "The ancient Roman statue 'Augustus of Prima Porta' features the emperor pointing in a commanding gesture, but what unusual detail appears at his feet?",
    "options": [
      "A dolphin riding a cupid",
      "A conquered barbarian",
      "A Roman eagle",
      "A bundle of wheat"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "A small cupid riding a dolphin appears at Augustus's right leg, symbolizing his divine ancestry through Venus.",
    "detailedExplanation": "The 'Augustus of Prima Porta' (early 1st century CE) is one of the most famous portraits of Rome's first emperor. The small figure of cupid riding a dolphin at the base serves multiple symbolic purposes: it references Augustus's claimed divine lineage through Venus (cupid's mother), provides structural support for the marble statue, and alludes to the naval victory at Actium. The dolphin specifically connects to Venus's birth from sea foam, reinforcing the divine association.",
    "citationUrl": "https://en.wikipedia.org/wiki/Augustus_of_Prima_Porta",
    "citationTitle": "Wikipedia: Augustus of Prima Porta"
  },
  {
    "id": "1b9be1b7-1e15-4ec5-a935-9ada41c9721c",
    "text": "Which British sculptor created the massive public artwork 'Angel of the North', standing 20 meters tall in Gateshead, England?",
    "options": [
      "Antony Gormley",
      "Henry Moore",
      "Barbara Hepworth",
      "Damien Hirst"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Antony Gormley designed the Angel of the North, which was completed in 1998 and has become an iconic landmark.",
    "detailedExplanation": "Antony Gormley's 'Angel of the North' (1998) stands as one of the largest angel sculptures in the world, with a wingspan of 54 meters. Made from weathering steel (Cor-Ten steel), it was designed to withstand winds of over 100 mph. The sculpture has become a beloved symbol of the North East of England, greeting travelers on the A1 motorway. Gormley is known for his sculptural works that explore the human form and its relationship to space.",
    "citationUrl": "https://en.wikipedia.org/wiki/Angel_of_the_North",
    "citationTitle": "Wikipedia: Angel of the North"
  },
  {
    "id": "9d14d79e-d287-4d11-bbc4-4be92120bd5b",
    "text": "The ancient Greek sculpture 'Discobolus' (Discus Thrower) was originally created by which sculptor around 450 BCE?",
    "options": [
      "Myron",
      "Praxiteles",
      "Phidias",
      "Lysippos"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Myron of Eleutherae created the original bronze Discobolus, known for capturing dynamic movement in stone.",
    "detailedExplanation": "Myron's 'Discobolus' represents a revolutionary moment in ancient Greek sculpture, capturing an athlete in the midst of throwing a discus. The original bronze statue is lost, but it survives through numerous Roman marble copies. Myron was particularly skilled at depicting movement and tension in the human body, and this work exemplifies the Classical period's interest in naturalistic representation combined with idealized human form. The sculpture demonstrates perfect anatomical knowledge and dynamic balance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Discobolus",
    "citationTitle": "Wikipedia: Discobolus"
  },
  {
    "id": "9c1c047e-1cfc-4db2-bc42-fdb1e1ac042b",
    "text": "Constantin Brâncuși's abstract sculpture 'Bird in Space' caused a famous legal dispute in 1928 when U.S. customs officials refused to classify it as what?",
    "options": [
      "Art",
      "A religious symbol",
      "A functional object",
      "A historical artifact"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "U.S. customs argued it wasn't art but a manufactured object, leading to the landmark Brâncuși v. United States case.",
    "detailedExplanation": "When Brâncuși's polished bronze 'Bird in Space' arrived in New York in 1926, customs officials refused to accept it as a work of art, instead classifying it as a dutiable manufactured object because of its abstract nature. This led to the famous court case 'Brâncuși v. United States' (1928), where the artist had to prove his sculpture was indeed art. The case was groundbreaking for establishing legal recognition of abstract art in America, with the court ultimately ruling in favor of Brâncuși.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bird_in_Space",
    "citationTitle": "Wikipedia: Bird in Space"
  }
]