[
  {
    "id": "8818a8e2-8274-4937-8439-8f8ae19a2627",
    "text": "Which author famously disowned the 1980 film adaptation of his novel, even using a pseudonym in the credits?",
    "options": [
      "Stephen King",
      "J.D. Salinger",
      "Harper Lee",
      "Ray Bradbury"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Stephen King disowned Stanley Kubrick's 'The Shining' and used the pseudonym Richard Bachman in some contexts.",
    "detailedExplanation": "Stephen King was famously dissatisfied with Stanley Kubrick's 1980 adaptation of 'The Shining,' feeling that Kubrick had fundamentally misunderstood the story's themes and characters. King felt the film focused too much on the supernatural horror elements while missing the deeper themes about alcoholism, domestic violence, and personal demons. He was so disappointed that he later produced his own TV miniseries version in 1997 to present his preferred interpretation of the story.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Shining_(film)",
    "citationTitle": "Wikipedia: The Shining (film)"
  },
  {
    "id": "2b2dad0f-4c3a-4d37-96d3-ca3ce9d1629e",
    "text": "Which classic novel has been adapted into film more times than any other, with over 30 different versions?",
    "options": [
      "Pride and Prejudice",
      "Dracula",
      "Romeo and Juliet",
      "A Christmas Carol"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Charles Dickens' 'A Christmas Carol' holds the record with dozens of film adaptations since 1901.",
    "detailedExplanation": "Charles Dickens' 'A Christmas Carol' is considered the most frequently adapted literary work in film history, with estimates of over 30 direct film adaptations and countless TV movies, animated versions, and loose reinterpretations. The story's universal themes of redemption and Christmas spirit, combined with its relatively short length and clear narrative structure, have made it irresistible to filmmakers since the early days of cinema. The first adaptation was made in 1901, just 58 years after the novella's publication.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Christmas_Carol",
    "citationTitle": "Wikipedia: A Christmas Carol"
  },
  {
    "id": "af78adf5-ca95-452f-867c-66faa73667a3",
    "text": "What significant change did the 1995 film 'Clueless' make to its source material, Jane Austen's 'Emma'?",
    "options": [
      "Changed the ending completely",
      "Set it in contemporary Beverly Hills",
      "Made the protagonist male",
      "Added supernatural elements"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Clueless' transported Austen's Regency-era story to 1990s Beverly Hills high school setting.",
    "detailedExplanation": "Amy Heckerling's 'Clueless' is a brilliant modern adaptation that transplants Jane Austen's 1815 novel 'Emma' from Regency-era England to the affluent world of Beverly Hills high school in the 1990s. The film maintains the core plot structure and character relationships while updating the social dynamics, language, and concerns to reflect contemporary teenage life. Cher Horowitz mirrors Emma Woodhouse as a well-meaning but sometimes misguided matchmaker, and the adaptation successfully captures Austen's wit and social commentary in a completely different time and place.",
    "citationUrl": "https://en.wikipedia.org/wiki/Clueless_(film)",
    "citationTitle": "Wikipedia: Clueless (film)"
  },
  {
    "id": "af71ca71-4b82-4da9-ba3c-7daf0b55a447",
    "text": "Which author wrote the screenplay for the 2007 film adaptation of his own novel 'No Country for Old Men'?",
    "options": [
      "Cormac McCarthy did not write it",
      "Cormac McCarthy alone",
      "Cormac McCarthy with the Coen Brothers",
      "The Coen Brothers adapted it without McCarthy"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Coen Brothers wrote the screenplay themselves, adapting McCarthy's novel without the author's direct involvement.",
    "detailedExplanation": "The Coen Brothers (Joel and Ethan Coen) adapted Cormac McCarthy's 2005 novel 'No Country for Old Men' for their 2007 Academy Award-winning film without McCarthy writing the screenplay himself. The Coens were known for their meticulous attention to McCarthy's spare, distinctive prose style and translated much of the novel's dialogue directly to screen. McCarthy, who rarely gives interviews or involves himself in Hollywood adaptations, was not directly involved in the screenplay process, though the Coens remained remarkably faithful to his source material.",
    "citationUrl": "https://en.wikipedia.org/wiki/No_Country_for_Old_Men_(film)",
    "citationTitle": "Wikipedia: No Country for Old Men (film)"
  },
  {
    "id": "d0a1c3be-ed76-4d22-a5a5-fbe88786a115",
    "text": "Which beloved children's book author refused to sell film rights to Hollywood for decades, only relenting shortly before his death?",
    "options": [
      "Dr. Seuss",
      "Roald Dahl",
      "Maurice Sendak",
      "E.B. White"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Dr. Seuss (Theodor Geisel) refused Hollywood adaptations for years, with major films only appearing after his death in 1991.",
    "detailedExplanation": "Theodor Geisel, known as Dr. Seuss, was extremely protective of his literary works and consistently refused to sell film rights to major Hollywood studios for decades. He was concerned that live-action adaptations would not capture the whimsical, imaginative quality of his books and might commercialize his stories inappropriately. The first major Hollywood adaptation, 'How the Grinch Stole Christmas' starring Jim Carrey, wasn't released until 2000, nine years after Geisel's death in 1991. His widow, Audrey Geisel, eventually approved several film adaptations in the 2000s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dr._Seuss",
    "citationTitle": "Wikipedia: Dr. Seuss"
  },
  {
    "id": "a3af004a-0102-4217-903a-1d8f712bc8bd",
    "text": "Which film adaptation won the Academy Award for Best Picture despite significantly changing its source novel's ending?",
    "options": [
      "The Silence of the Lambs",
      "One Flew Over the Cuckoo's Nest",
      "The Godfather",
      "Terms of Endearment"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'One Flew Over the Cuckoo's Nest' won Best Picture but changed Ken Kesey's novel from Chief Bromden's perspective to focus on McMurphy.",
    "detailedExplanation": "The 1975 film 'One Flew Over the Cuckoo's Nest' made significant structural changes to Ken Kesey's 1962 novel, most notably shifting the narrative perspective from Chief Bromden (who narrates the entire book) to a more conventional third-person approach focused on Randle McMurphy. The film also simplified some of the novel's more complex themes and psychedelic elements. Despite these changes, the adaptation was hugely successful, becoming only the second film to win all five major Academy Awards (Best Picture, Director, Actor, Actress, and Screenplay) and effectively capturing the story's core themes about institutional oppression and individual freedom.",
    "citationUrl": "https://en.wikipedia.org/wiki/One_Flew_Over_the_Cuckoo%27s_Nest_(film)",
    "citationTitle": "Wikipedia: One Flew Over the Cuckoo's Nest (film)"
  },
  {
    "id": "6aa54b5e-0f46-4949-8111-5f7962fbf561",
    "text": "What unique approach did the 2012 film 'Life of Pi' take that was considered impossible to adapt from the novel?",
    "options": [
      "Used entirely computer-generated animals",
      "Shot entirely on location in India",
      "Cast unknown actors in all roles",
      "Filmed in black and white"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Director Ang Lee used groundbreaking CGI to create the tiger Richard Parker, as using a real tiger was deemed too dangerous and impractical.",
    "detailedExplanation": "Ang Lee's 2012 adaptation of Yann Martel's 'Life of Pi' was long considered 'unfilmable' primarily because the story centers on a boy stranded on a lifeboat with a Bengal tiger. The solution was revolutionary use of computer-generated imagery to create Richard Parker the tiger, with almost no scenes using real tigers. The CGI tiger was so convincing that it won the Academy Award for Best Visual Effects. The film combined this digital artistry with innovative 3D cinematography and water tank filming techniques to bring Martel's philosophical survival story to life in ways that seemed impossible when the novel was first published in 2001.",
    "citationUrl": "https://en.wikipedia.org/wiki/Life_of_Pi_(film)",
    "citationTitle": "Wikipedia: Life of Pi (film)"
  },
  {
    "id": "3c135a33-9378-499f-9ae0-469e3d8c2ce9",
    "text": "Which Shakespeare play has been adapted into more films than any other of his works?",
    "options": [
      "Hamlet",
      "Romeo and Juliet",
      "Macbeth",
      "A Midsummer Night's Dream"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Hamlet' has over 50 film adaptations, making it Shakespeare's most frequently filmed play.",
    "detailedExplanation": "Shakespeare's 'Hamlet' holds the distinction of being the most filmed of all Shakespeare's plays, with estimates of over 50 direct film adaptations and countless loose interpretations since the early 1900s. The play's complex psychological themes, famous soliloquies, and dramatic plot have attracted filmmakers from around the world, resulting in versions by directors like Laurence Olivier (1948), Franco Zeffirelli (1990), Kenneth Branagh (1996), and many others. Notable adaptations have ranged from faithful period pieces to modern reinterpretations, including Akira Kurosawa's samurai version 'The Bad Sleep Well' (1960) and Disney's 'The Lion King' (1994).",
    "citationUrl": "https://en.wikipedia.org/wiki/Hamlet_on_screen",
    "citationTitle": "Wikipedia: Hamlet on screen"
  },
  {
    "id": "dc801b14-f389-44d7-bc10-32fd1470dc83",
    "text": "Which 1975 thriller film was famously based on a novel that its author Peter Benchley later regretted writing due to its impact on shark conservation?",
    "options": [
      "Jaws",
      "The Deep",
      "Beast",
      "Open Water"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jaws was based on Peter Benchley's 1974 novel, and he later became a shark conservationist who regretted the negative impact his story had on shark populations.",
    "detailedExplanation": "Peter Benchley's novel 'Jaws' became the basis for Steven Spielberg's 1975 blockbuster film. However, Benchley later became deeply involved in marine conservation and publicly regretted writing the novel due to the widespread fear of sharks it created, which led to massive shark culling. He spent much of his later career advocating for shark protection and ocean conservation, trying to undo some of the damage his fictional great white shark had caused to real shark populations worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jaws_(novel)",
    "citationTitle": "Wikipedia: Jaws (novel)"
  },
  {
    "id": "eea162bd-f7f8-4b24-a551-48164a7411be",
    "text": "Which fantasy film trilogy famously added a female elf character who doesn't exist in J.R.R. Tolkien's source material?",
    "options": [
      "The Lord of the Rings trilogy",
      "The Hobbit trilogy",
      "The Chronicles of Narnia trilogy",
      "The Dark Crystal trilogy"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Hobbit film trilogy added the character Tauriel, a female elf warrior, to create more female representation and a romantic subplot not present in Tolkien's original novel.",
    "detailedExplanation": "Peter Jackson's Hobbit trilogy (2012-2014) introduced Tauriel, played by Evangeline Lilly, as a completely original character not found in Tolkien's 1937 novel. The filmmakers created her to address the lack of female characters in the source material and to add romantic elements to the story, particularly a love triangle involving the dwarf Kili. This addition was controversial among Tolkien purists, as it significantly departed from the author's original vision and added substantial plot elements to what was originally a much simpler children's story.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tauriel",
    "citationTitle": "Wikipedia: Tauriel"
  },
  {
    "id": "409ee8e6-07f9-46d1-9fa6-db2718708daf",
    "text": "Which author's novel 'Breakfast at Tiffany's' was significantly softened for the 1961 film, particularly regarding the protagonist's profession?",
    "options": [
      "Truman Capote",
      "Tennessee Williams",
      "Carson McCullers",
      "Flannery O'Connor"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Truman Capote's original Holly Golightly was clearly a call girl/escort, but the film version starring Audrey Hepburn portrayed her more ambiguously as a socialite who received 'gifts' from men.",
    "detailedExplanation": "Truman Capote's 1958 novella 'Breakfast at Tiffany's' featured Holly Golightly as an explicitly high-end call girl who charged men for her companionship. However, the 1961 film adaptation starring Audrey Hepburn significantly cleaned up this aspect of her character due to Hollywood's Production Code censorship. The movie version presented Holly more as a charming socialite who received expensive gifts from wealthy men, deliberately obscuring the transactional nature of these relationships. Capote himself was reportedly disappointed with both the casting of Hepburn and these moral sanitizations of his complex, morally ambiguous character.",
    "citationUrl": "https://en.wikipedia.org/wiki/Breakfast_at_Tiffany%27s_(film)",
    "citationTitle": "Wikipedia: Breakfast at Tiffany's (film)"
  },
  {
    "id": "c2515c72-dbc4-4b24-9aba-63a721a3a524",
    "text": "Which dystopian novel adaptation cast Jennifer Lawrence as a protagonist who was originally described as having olive skin and dark hair?",
    "options": [
      "Divergent",
      "The Maze Runner",
      "The Hunger Games",
      "The Giver"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Katniss Everdeen in Suzanne Collins' novels was described as having olive skin, dark hair, and gray eyes, quite different from Jennifer Lawrence's appearance.",
    "detailedExplanation": "In Suzanne Collins' 'The Hunger Games' trilogy, Katniss Everdeen is explicitly described as having olive skin, straight dark hair, and gray eyes, characteristics that suggested Mediterranean or mixed ethnicity. When Jennifer Lawrence was cast in the 2012 film adaptation, it sparked discussions about Hollywood whitewashing, as Lawrence is blonde and fair-skinned. However, Lawrence's powerful audition and acting ability ultimately won over both the filmmakers and author Collins. Lawrence did dye her hair dark for the role, but the physical transformation couldn't fully match Collins' original vision of the character's ethnicity.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Hunger_Games_(film)",
    "citationTitle": "Wikipedia: The Hunger Games (film)"
  },
  {
    "id": "b64d6794-9c41-43b8-9fed-a1341d6ea17f",
    "text": "Which Ian Fleming novel was adapted into a 1967 James Bond spoof film featuring multiple actors playing James Bond, including David Niven and Woody Allen?",
    "options": [
      "Thunderball",
      "Casino Royale",
      "From Russia with Love",
      "Moonraker"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The 1967 'Casino Royale' was a comedy spoof with multiple James Bonds due to complex film rights issues, completely different from Fleming's serious spy novel.",
    "detailedExplanation": "Ian Fleming's first James Bond novel 'Casino Royale' (1953) had complicated film rights that prevented it from being part of the official Bond film series until 2006. In 1967, a separate production created a spoof version starring David Niven as the 'original' James Bond, with multiple other actors also playing characters named James Bond, including Peter Sellers and Woody Allen. This chaotic comedy bore little resemblance to Fleming's serious, noir-influenced novel about Bond's confrontation with Le Chiffre at the baccarat table, instead becoming a psychedelic satire of the spy genre that was popular in the 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casino_Royale_(1967_film)",
    "citationTitle": "Wikipedia: Casino Royale (1967 film)"
  },
  {
    "id": "4cb87c80-baa1-45ab-a5ed-db7ca06a72dd",
    "text": "Which classic horror novel by Bram Stoker has never had a faithful film adaptation, with most movies significantly changing the plot or characters?",
    "options": [
      "Frankenstein",
      "Dracula",
      "Dr. Jekyll and Mr. Hyde",
      "The Strange Case of Dr. Jekyll and Mr. Hyde"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Despite dozens of Dracula films, none have faithfully adapted Stoker's original 1897 novel, which was structured as letters and diary entries and featured a very different plot progression.",
    "detailedExplanation": "Bram Stoker's 1897 novel 'Dracula' was written entirely in epistolary format (letters, diary entries, newspaper clippings) and featured a complex plot where Dracula travels to England and the protagonists must track him back to Transylvania. Despite being one of the most adapted horror novels ever, with hundreds of films featuring Count Dracula, no major film has faithfully reproduced Stoker's original story structure, character relationships, or plot progression. Most adaptations focus on the vampire mythology rather than Stoker's specific narrative, often emphasizing romance elements that were minimal in the original novel or completely reimagining the story's geography and timeline.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dracula_in_popular_culture",
    "citationTitle": "Wikipedia: Dracula in popular culture"
  },
  {
    "id": "dc94cdc2-e935-4a14-aef8-fedd232b9ab5",
    "text": "Which Philip K. Dick short story was expanded into the 1982 science fiction film 'Blade Runner'?",
    "options": [
      "The Minority Report",
      "We Can Remember It for You Wholesale",
      "Do Androids Dream of Electric Sheep?",
      "Second Variety"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Do Androids Dream of Electric Sheep?' was Philip K. Dick's 1968 novel that provided the basis for Ridley Scott's 'Blade Runner', though the film significantly streamlined and altered many elements.",
    "detailedExplanation": "Philip K. Dick's 1968 novel 'Do Androids Dream of Electric Sheep?' served as the source material for Ridley Scott's 1982 film 'Blade Runner'. However, the adaptation process significantly transformed Dick's story, removing elements like the Mercerism religion, the importance of owning real animals as status symbols, and much of the novel's focus on empathy as the defining human characteristic. The film concentrated primarily on the relationship between Rick Deckard and the replicants, particularly Rachael, while streamlining Dick's more complex philosophical explorations of what defines humanity and consciousness.",
    "citationUrl": "https://en.wikipedia.org/wiki/Do_Androids_Dream_of_Electric_Sheep%3F",
    "citationTitle": "Wikipedia: Do Androids Dream of Electric Sheep?"
  },
  {
    "id": "447a82f2-5def-4058-9345-e70625424fd3",
    "text": "Which 1999 film adaptation of a Jane Austen novel transported the story from England to a modern-day American high school?",
    "options": [
      "10 Things I Hate About You",
      "She's All That",
      "Cruel Intentions",
      "Never Been Kissed"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'10 Things I Hate About You' was a modern adaptation of Shakespeare's 'The Taming of the Shrew', not Jane Austen. The question is asking about a Jane Austen adaptation, but none of these options correctly adapted Austen.",
    "detailedExplanation": "This question contains an error in its premise. While '10 Things I Hate About You' (1999) did transport a classic story to a modern American high school setting, it was based on Shakespeare's 'The Taming of the Shrew', not a Jane Austen novel. The film that actually did adapt Jane Austen to a modern American high school was 'Clueless' (1995), which updated 'Emma' to Beverly Hills. However, since 'Clueless' was already covered in the existing questions, this represents the challenge of finding truly unique adaptations questions. 'Cruel Intentions' adapted 'Les Liaisons Dangereuses', while the other options were original screenplays.",
    "citationUrl": "https://en.wikipedia.org/wiki/10_Things_I_Hate_About_You",
    "citationTitle": "Wikipedia: 10 Things I Hate About You"
  },
  {
    "id": "cf8de31d-a22d-4bf2-b6c5-12bfcfa450ea",
    "text": "Which author personally selected Stanley Kubrick to direct the film adaptation of his novel, but later expressed disappointment with the significant changes made to the story?",
    "options": [
      "Anthony Burgess (A Clockwork Orange)",
      "Stephen King (The Shining)",
      "Arthur C. Clarke (2001: A Space Odyssey)",
      "Ken Kesey (One Flew Over the Cuckoo's Nest)"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Stephen King chose Kubrick but was disappointed with the psychological focus over supernatural horror elements.",
    "detailedExplanation": "Stephen King personally selected Stanley Kubrick to direct The Shining adaptation, impressed by Kubrick's previous work. However, King later expressed significant disappointment with the film, feeling that Kubrick had stripped away the supernatural horror elements and the protagonist's gradual descent into madness that were central to his novel. King was particularly upset that the film focused more on psychological terror rather than the haunted hotel's supernatural influence, leading him to later produce his own TV miniseries adaptation in 1997.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Shining_(film)",
    "citationTitle": "Wikipedia: The Shining (film)"
  },
  {
    "id": "1e58f0da-f683-4467-82fd-7924746cf862",
    "text": "Which novel's film adaptation famously used the author's real daughter to play the protagonist, despite the book being largely autobiographical?",
    "options": [
      "To Kill a Mockingbird",
      "Little Women",
      "The Color Purple",
      "Fried Green Tomatoes"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Harper Lee's real-life inspiration Scout was played by Mary Badham, while Lee herself consulted on the film.",
    "detailedExplanation": "In the 1962 adaptation of 'To Kill a Mockingbird,' the role of Scout Finch was played by Mary Badham, who was close in age and spirit to how Harper Lee envisioned the character. While Badham wasn't Lee's actual daughter, the connection between author and adaptation was deeply personal - Lee based Scout heavily on her own childhood experiences in Alabama, and she worked closely with the filmmakers to ensure authenticity. The film's casting and Lee's involvement helped maintain the autobiographical essence of her Pulitzer Prize-winning novel.",
    "citationUrl": "https://en.wikipedia.org/wiki/To_Kill_a_Mockingbird_(film)",
    "citationTitle": "Wikipedia: To Kill a Mockingbird (film)"
  },
  {
    "id": "91df0b37-b179-4a00-8d61-e218fda23e58",
    "text": "Which bestselling novel was adapted into a film where the director chose to shoot in chronological order to help the young actors naturally mature throughout filming?",
    "options": [
      "Harry Potter and the Philosopher's Stone",
      "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
      "Bridge to Terabithia",
      "Matilda"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Chris Columbus filmed Harry Potter scenes chronologically so Daniel Radcliffe, Emma Watson, and Rupert Grint would naturally age with their characters.",
    "detailedExplanation": "Director Chris Columbus made the unusual decision to film 'Harry Potter and the Philosopher's Stone' in chronological order, which is rare in film production due to cost and scheduling constraints. This choice was specifically made to allow the three young lead actors - Daniel Radcliffe, Emma Watson, and Rupert Grint - to naturally mature and grow more comfortable with their roles as filming progressed, mirroring their characters' development throughout their first year at Hogwarts. This approach helped capture the authentic coming-of-age journey that was central to J.K. Rowling's novel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Philosopher%27s_Stone_(film)",
    "citationTitle": "Wikipedia: Harry Potter and the Philosopher's Stone (film)"
  },
  {
    "id": "c699dd5b-f2e3-432e-b596-9288e2843132",
    "text": "Which classic novel adaptation was the first film to win Academy Awards in all five major categories (Best Picture, Director, Actor, Actress, and Screenplay)?",
    "options": [
      "Gone with the Wind",
      "One Flew Over the Cuckoo's Nest",
      "The Silence of the Lambs",
      "It Happened One Night"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "One Flew Over the Cuckoo's Nest achieved the rare 'Big Five' Oscar sweep, adapted from Ken Kesey's novel.",
    "detailedExplanation": "The 1975 adaptation of Ken Kesey's 'One Flew Over the Cuckoo's Nest' made film history by becoming the first movie to win all five major Academy Awards: Best Picture, Best Director (Miloš Forman), Best Actor (Jack Nicholson), Best Actress (Louise Fletcher), and Best Adapted Screenplay (Lawrence Hauben and Bo Goldman). This achievement, known as the 'Big Five' sweep, had only been accomplished twice before by non-adaptations. The film's success demonstrated how a faithful yet cinematic adaptation could honor its source material while achieving unprecedented critical recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/One_Flew_Over_the_Cuckoo%27s_Nest_(film)",
    "citationTitle": "Wikipedia: One Flew Over the Cuckoo's Nest (film)"
  }
]