[
  {
    "id": "13ca1970-85f4-4f96-b95d-5d32fb321012",
    "text": "Which Beyoncé album from 2016 was accompanied by a visual film and featured the hit single 'Formation'?",
    "options": [
      "4",
      "Lemonade",
      "Renaissance",
      "Dangerously in Love"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Lemonade was Beyoncé's 2016 visual album that included 'Formation'.",
    "detailedExplanation": "Released in 2016, Lemonade was Beyoncé's sixth studio album and a groundbreaking visual album that premiered on HBO. The album explored themes of infidelity, feminism, and Black identity, with 'Formation' serving as its lead single. The album was both a commercial and critical success, debuting at number one on the Billboard 200 and earning widespread acclaim for its artistic vision and cultural impact.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lemonade_(Beyonc%C3%A9_album)",
    "citationTitle": "Wikipedia: Lemonade (Beyoncé album)"
  },
  {
    "id": "90f03c62-30de-4fdf-8781-5c82bdbeb837",
    "text": "What was the best-selling digital single of the 2000s, performed by The Black Eyed Peas?",
    "options": [
      "My Humps",
      "I Gotta Feeling",
      "Boom Boom Pow",
      "Where Is the Love?"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'I Gotta Feeling' became the best-selling digital single of the 2000s decade.",
    "detailedExplanation": "Released in 2009, 'I Gotta Feeling' by The Black Eyed Peas became a massive global hit and the best-selling digital single of the 2000s decade. The song topped charts in numerous countries and sold over 15 million digital copies worldwide. It spent 14 consecutive weeks at number one on the Billboard Hot 100 and became synonymous with celebration and party culture of the late 2000s.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Gotta_Feeling",
    "citationTitle": "Wikipedia: I Gotta Feeling"
  },
  {
    "id": "4d1512bb-4d39-46c4-93da-c97757bb0c4b",
    "text": "Which Taylor Swift album marked her transition from country to pop music in 2014?",
    "options": [
      "Red",
      "1989",
      "Reputation",
      "Lover"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "1989 was Taylor Swift's first full pop album, marking her departure from country music.",
    "detailedExplanation": "Released in 2014, 1989 marked Taylor Swift's complete transition from her country music roots to mainstream pop. Named after her birth year, the album was inspired by 1980s synth-pop and featured hits like 'Shake It Off' and 'Blank Space'. The album was both a commercial and critical success, winning the Grammy Award for Album of the Year and establishing Swift as a dominant force in pop music.",
    "citationUrl": "https://en.wikipedia.org/wiki/1989_(Taylor_Swift_album)",
    "citationTitle": "Wikipedia: 1989 (Taylor Swift album)"
  },
  {
    "id": "189781b5-5954-4b62-897d-95218132787d",
    "text": "Which British singer released the album '21' in 2011, featuring the hit single 'Rolling in the Deep'?",
    "options": [
      "Amy Winehouse",
      "Adele",
      "Duffy",
      "Leona Lewis"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Adele released the album '21' which became one of the best-selling albums of all time.",
    "detailedExplanation": "Adele's second studio album '21' was released in 2011 and became a phenomenal global success. The album, named after her age when she wrote most of the songs, featured emotional ballads about heartbreak including 'Rolling in the Deep', 'Someone Like You', and 'Set Fire to the Rain'. It topped charts worldwide, won six Grammy Awards including Album of the Year, and became one of the best-selling albums in music history.",
    "citationUrl": "https://en.wikipedia.org/wiki/21_(Adele_album)",
    "citationTitle": "Wikipedia: 21 (Adele album)"
  },
  {
    "id": "220f3b1a-1dc4-4eb8-8081-fb29679ae06e",
    "text": "What was the name of the virtual band created by Damon Albarn that released hits like 'Feel Good Inc.' in the 2000s?",
    "options": [
      "Blur",
      "Gorillaz",
      "Radiohead",
      "Coldplay"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Gorillaz was the virtual band created by Damon Albarn with animated members.",
    "detailedExplanation": "Gorillaz, created in 1998 by Damon Albarn of Blur and artist Jamie Hewlett, was a groundbreaking virtual band featuring four animated members: 2-D, Murdoc Niccals, Noodle, and Russel Hobbs. Their 2005 album 'Demon Days' featured the massive hit 'Feel Good Inc.' and established them as one of the most successful alternative acts of the 2000s. The band's innovative concept combined music with visual art and storytelling through animated music videos.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gorillaz",
    "citationTitle": "Wikipedia: Gorillaz"
  },
  {
    "id": "6e6308cd-fa5e-4be7-a855-3212e814b242",
    "text": "Which Canadian artist became the first solo artist to have three songs exceed one billion streams on Spotify?",
    "options": [
      "The Weeknd",
      "Drake",
      "Justin Bieber",
      "Shawn Mendes"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Drake achieved this milestone with multiple hit singles across the 2010s.",
    "detailedExplanation": "Drake became the first solo artist to have three songs surpass one billion streams on Spotify, cementing his dominance in the streaming era of music. His hits 'God's Plan', 'In My Feelings', and 'One Dance' all reached this milestone, reflecting his massive global popularity and the shift toward streaming platforms in the 2010s. Drake's success on streaming platforms helped redefine how musical success is measured in the modern era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Drake_(musician)",
    "citationTitle": "Wikipedia: Drake (musician)"
  },
  {
    "id": "e57be0b4-22e1-458d-8836-2c5990ed6b35",
    "text": "What was the name of Lady Gaga's debut album released in 2008?",
    "options": [
      "Born This Way",
      "The Fame",
      "Artpop",
      "Joanne"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'The Fame' was Lady Gaga's debut studio album featuring hits like 'Just Dance' and 'Poker Face'.",
    "detailedExplanation": "Lady Gaga's debut studio album 'The Fame' was released in August 2008 and launched her into global stardom. The album featured hit singles 'Just Dance' and 'Poker Face', both of which topped charts worldwide. The album explored themes of fame, love, and excess, establishing Gaga's unique pop persona and theatrical style. It was both a commercial success and earned her first Grammy Award, setting the stage for her influential career in pop music.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fame",
    "citationTitle": "Wikipedia: The Fame"
  },
  {
    "id": "ead055db-89be-4970-9c51-b342b2140c97",
    "text": "Which South Korean boy band became the first K-pop group to top the Billboard Hot 100 with 'Dynamite' in 2020?",
    "options": [
      "BIGBANG",
      "EXO",
      "BTS",
      "BLACKPINK"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "BTS achieved this historic milestone with their English-language single 'Dynamite'.",
    "detailedExplanation": "BTS made history in 2020 when their single 'Dynamite' became the first song by a South Korean act to debut at number one on the Billboard Hot 100. This achievement marked a significant milestone for K-pop's global expansion and BTS's international success. The disco-pop track, sung entirely in English, was released during the COVID-19 pandemic and aimed to bring joy and energy to fans worldwide, ultimately spending three non-consecutive weeks at the top of the chart.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dynamite_(BTS_song)",
    "citationTitle": "Wikipedia: Dynamite (BTS song)"
  },
  {
    "id": "d25f5c9b-690f-44b5-8cd9-2d5a827e064d",
    "text": "Which song by OutKast spent seven weeks at number one in 2003 and became one of the biggest hits of the decade?",
    "options": [
      "Ms. Jackson",
      "Hey Ya!",
      "The Way You Move",
      "So Fresh, So Clean"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hey Ya! by OutKast dominated the charts in 2003-2004.",
    "detailedExplanation": "OutKast's 'Hey Ya!' was released in 2003 as part of their double album 'Speakerboxxx/The Love Below' and became a massive cultural phenomenon. The song spent seven consecutive weeks at number one on the Billboard Hot 100 and was widely considered one of the defining songs of the 2000s decade, known for its infectious energy and Andre 3000's creative songwriting.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hey_Ya!",
    "citationTitle": "Wikipedia: Hey Ya!"
  },
  {
    "id": "5e6858ae-4e98-49e6-b7d9-612c1e0b5796",
    "text": "What does the 'P!nk' in the singer's stage name originally stand for?",
    "options": [
      "Her favorite color",
      "Mr. Pink from Reservoir Dogs",
      "Pink Floyd",
      "A childhood nickname"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "P!nk got her stage name from the character Mr. Pink in Quentin Tarantino's Reservoir Dogs.",
    "detailedExplanation": "The pop-rock singer P!nk, born Alecia Beth Moore, chose her stage name as a reference to the character Mr. Pink from Quentin Tarantino's 1992 film 'Reservoir Dogs.' She felt the character's attitude matched her own personality. P!nk became one of the most successful artists of the 2000s and 2010s with hits like 'Get the Party Started' and 'Just Give Me a Reason.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Pink_(singer)",
    "citationTitle": "Wikipedia: Pink (singer)"
  },
  {
    "id": "28c9f8ce-6c62-4046-888c-ec47339dd1a1",
    "text": "Which Rihanna song from 2007 was her first number-one hit in the United States?",
    "options": [
      "Umbrella",
      "Disturbia",
      "Take a Bow",
      "Don't Stop the Music"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Umbrella featuring Jay-Z was Rihanna's breakthrough number-one hit in the US.",
    "detailedExplanation": "'Umbrella' featuring Jay-Z marked a major turning point in Rihanna's career, becoming her first number-one hit on the Billboard Hot 100 in 2007. The song spent seven weeks at the top of the charts and established Rihanna as a major pop star. It was from her album 'Good Girl Gone Bad' and became one of the most iconic songs of the late 2000s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Umbrella_(song)",
    "citationTitle": "Wikipedia: Umbrella (song)"
  },
  {
    "id": "cc66428b-fcd2-4d7a-aac5-f1fea36f2fd3",
    "text": "What was the name of Justin Timberlake's first solo album released in 2002?",
    "options": [
      "FutureSex/LoveSounds",
      "The 20/20 Experience",
      "Justified",
      "SexyBack"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Justified was Justin Timberlake's debut solo album after leaving NSYNC.",
    "detailedExplanation": "'Justified' was Justin Timberlake's debut solo album, released in November 2002 after he departed from the boy band NSYNC. The album featured hit singles like 'Cry Me a River' and 'Rock Your Body' and was largely produced by The Neptunes and Timbaland. It established Timberlake as a serious solo artist and earned him multiple Grammy nominations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Justified_(album)",
    "citationTitle": "Wikipedia: Justified (album)"
  },
  {
    "id": "3125e43f-9b57-4ec3-9742-6d91e4542cad",
    "text": "Which social media platform did Justin Bieber use to gain initial fame before being discovered by Scooter Braun?",
    "options": [
      "MySpace",
      "Facebook",
      "YouTube",
      "TikTok"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Justin Bieber was discovered on YouTube where he posted cover songs as a teenager.",
    "detailedExplanation": "Justin Bieber's rise to fame began on YouTube, where he posted videos of himself singing covers of popular songs as a young teenager. Talent manager Scooter Braun discovered Bieber's YouTube videos in 2007 and subsequently arranged for him to meet with Usher, leading to his record deal. This made Bieber one of the first major pop stars to be discovered through social media.",
    "citationUrl": "https://en.wikipedia.org/wiki/Justin_Bieber",
    "citationTitle": "Wikipedia: Justin Bieber"
  },
  {
    "id": "f14fca09-d4cd-4d26-a6d7-b0db739a0b86",
    "text": "What streaming service did Jay-Z launch in 2015 as a competitor to Spotify and Apple Music?",
    "options": [
      "Beats Music",
      "Tidal",
      "Pandora",
      "SoundCloud"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jay-Z launched Tidal as a high-fidelity music streaming service.",
    "detailedExplanation": "Jay-Z acquired and relaunched Tidal in 2015 as a music streaming service that emphasized high-fidelity audio quality and artist ownership. The platform was marketed as being artist-owned and featured exclusive releases from major artists like Beyoncé, Kanye West, and Jay-Z himself. Tidal positioned itself as a premium alternative to other streaming services, though it struggled to compete with Spotify and Apple Music's larger user bases.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tidal_(service)",
    "citationTitle": "Wikipedia: Tidal (service)"
  },
  {
    "id": "b04a2f2b-0349-4542-81dd-bb407f6c988f",
    "text": "Which Katy Perry album from 2010 produced five number-one Billboard Hot 100 singles?",
    "options": [
      "One of the Boys",
      "Teenage Dream",
      "Prism",
      "Witness"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Teenage Dream tied Michael Jackson's record with five number-one singles from one album.",
    "detailedExplanation": "Katy Perry's 'Teenage Dream' album, released in 2010, made music history by producing five number-one singles on the Billboard Hot 100: 'California Gurls,' 'Teenage Dream,' 'Firework,' 'E.T.,' and 'Last Friday Night (T.G.I.F.).' This achievement tied the record previously held by Michael Jackson's 'Thriller' album, making Perry only the second artist to accomplish this feat.",
    "citationUrl": "https://en.wikipedia.org/wiki/Teenage_Dream_(album)",
    "citationTitle": "Wikipedia: Teenage Dream (album)"
  },
  {
    "id": "83ddd214-c0f8-41b3-9e79-b1d91f5220cb",
    "text": "Which artist's 2020 album 'folklore' marked a departure from pop to indie folk and alternative rock?",
    "options": [
      "Lorde",
      "Taylor Swift",
      "Billie Eilish",
      "Lana Del Rey"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Taylor Swift's folklore was a surprise indie folk album that won the Grammy for Album of the Year.",
    "detailedExplanation": "Taylor Swift's eighth studio album 'folklore,' released as a surprise in July 2020 during the COVID-19 pandemic, marked a significant departure from her previous pop sound to indie folk and alternative rock. The album was created in isolation with collaborators Aaron Dessner of The National and Bon Iver's Justin Vernon. It debuted at number one and won the Grammy Award for Album of the Year, showcasing Swift's versatility as a songwriter.",
    "citationUrl": "https://en.wikipedia.org/wiki/Folklore_(Taylor_Swift_album)",
    "citationTitle": "Wikipedia: Folklore (Taylor Swift album)"
  },
  {
    "id": "5b1563a6-11f5-4063-992d-91e2d954c73f",
    "text": "Which reality TV singing competition launched the careers of Kelly Clarkson, Carrie Underwood, and Jennifer Hudson in the 2000s?",
    "options": [
      "The Voice",
      "American Idol",
      "X Factor",
      "America's Got Talent"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "American Idol launched many successful pop careers in the 2000s.",
    "detailedExplanation": "American Idol became a cultural phenomenon in the 2000s, launching the careers of numerous pop stars. Kelly Clarkson won the first season in 2002, Carrie Underwood won season 4 in 2005, and Jennifer Hudson finished seventh in season 3 but went on to major success. The show dominated pop culture and the music industry throughout the decade, creating multiple platinum-selling artists.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_Idol",
    "citationTitle": "Wikipedia: American Idol"
  },
  {
    "id": "c3fe5850-c4d4-4aff-afe6-fd98f65d5b4b",
    "text": "What is the name of the annual music festival founded by Jay-Z that takes place in Philadelphia over Labor Day weekend?",
    "options": [
      "Coachella",
      "Lollapalooza",
      "Made in America",
      "Bonnaroo"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Made in America is Jay-Z's annual festival that started in 2012.",
    "detailedExplanation": "Made in America is a music festival founded by Jay-Z in 2012, taking place annually in Philadelphia over Labor Day weekend. The festival features major pop, hip-hop, and rock acts and has become one of the premier music events in the United States. Jay-Z created the festival as part of his broader entertainment and business empire, bringing together top-tier artists for performances on the Benjamin Franklin Parkway.",
    "citationUrl": "https://en.wikipedia.org/wiki/Made_in_America_Festival",
    "citationTitle": "Wikipedia: Made in America Festival"
  },
  {
    "id": "d84191b2-fce1-409d-9e57-2ad093bb7475",
    "text": "Which pop star famously interrupted Taylor Swift's acceptance speech at the 2009 MTV Video Music Awards?",
    "options": [
      "Drake",
      "Kanye West",
      "Jay-Z",
      "50 Cent"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kanye West interrupted Taylor Swift's speech, creating one of the most memorable VMA moments.",
    "detailedExplanation": "At the 2009 MTV Video Music Awards, Kanye West interrupted Taylor Swift's acceptance speech for Best Female Video, claiming that Beyoncé should have won instead. This incident became one of the most infamous moments in VMA history and sparked years of public feuding and eventual reconciliation between the artists. The moment significantly impacted both artists' careers and public perception.",
    "citationUrl": "https://en.wikipedia.org/wiki/2009_MTV_Video_Music_Awards",
    "citationTitle": "Wikipedia: 2009 MTV Video Music Awards"
  },
  {
    "id": "991f93f1-8f28-490a-8dac-ed26da01da3b",
    "text": "Which Bruno Mars song from 2014 became one of the most-watched music videos on YouTube and topped charts worldwide?",
    "options": [
      "Just the Way You Are",
      "Grenade",
      "Uptown Funk",
      "Locked Out of Heaven"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Uptown Funk featuring Mark Ronson became a massive global hit in 2014-2015.",
    "detailedExplanation": "Uptown Funk, performed by Mark Ronson featuring Bruno Mars, was released in 2014 and became one of the biggest pop hits of the decade. The song topped charts in multiple countries, spent 14 weeks at number one on the Billboard Hot 100, and its music video has billions of views on YouTube. The track's retro funk sound and infectious groove made it a cultural phenomenon and one of the defining pop songs of the 2010s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Uptown_Funk",
    "citationTitle": "Wikipedia: Uptown Funk"
  }
]