[
  {
    "id": "f9936489-7d12-4ac9-8e5d-61cf681dcb55",
    "text": "Which Kanye West album was recorded entirely in Hawaii and featured the hit single 'Dark Fantasy'?",
    "options": [
      "The College Dropout",
      "My Beautiful Dark Twisted Fantasy",
      "Yeezus",
      "The Life of Pablo"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "My Beautiful Dark Twisted Fantasy was recorded in Hawaii and featured 'Dark Fantasy' as its opening track.",
    "detailedExplanation": "Kanye West's fifth studio album 'My Beautiful Dark Twisted Fantasy' was released in 2010 and was largely recorded at Avex Honolulu Studios in Hawaii during a self-imposed exile following the Taylor Swift VMAs incident. The album is widely considered one of his masterpieces and opened with the track 'Dark Fantasy,' though the biggest commercial hit from the album was 'All of the Lights.'",
    "citationUrl": "https://en.wikipedia.org/wiki/My_Beautiful_Dark_Twisted_Fantasy",
    "citationTitle": "Wikipedia: My Beautiful Dark Twisted Fantasy"
  },
  {
    "id": "56417eaf-bfae-42bc-9aa8-9581b3cab612",
    "text": "What was the original name of the band that became OneRepublic before Ryan Tedder renamed it in 2003?",
    "options": [
      "Republic",
      "This Beautiful Mess",
      "Native Sons",
      "Counting Days"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "OneRepublic was originally called 'This Beautiful Mess' before Ryan Tedder changed the name.",
    "detailedExplanation": "OneRepublic, the American pop rock band formed in Colorado Springs in 2002, was initially called 'This Beautiful Mess.' Ryan Tedder, the band's frontman and primary songwriter, decided to rename the group to OneRepublic in 2003. The band went on to achieve massive success in the 2000s and 2010s with hits like 'Apologize,' 'Counting Stars,' and 'Good Life.'",
    "citationUrl": "https://en.wikipedia.org/wiki/OneRepublic",
    "citationTitle": "Wikipedia: OneRepublic"
  },
  {
    "id": "ab5fdecf-bc04-40e3-8630-1cd5882862fe",
    "text": "Which artist holds the record for most weeks at #1 on the Billboard Hot 100 with a single song during the 2010s decade?",
    "options": [
      "Adele with 'Hello'",
      "Ed Sheeran with 'Shape of You'",
      "Luis Fonsi & Daddy Yankee with 'Despacito'",
      "The Chainsmokers with 'Closer'"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Despacito' spent 16 weeks at #1, the longest run of the 2010s decade.",
    "detailedExplanation": "Luis Fonsi and Daddy Yankee's 'Despacito' featuring Justin Bieber spent an incredible 16 consecutive weeks at number one on the Billboard Hot 100 from May to September 2017. This reggaeton track became a global phenomenon and tied the record for most weeks at #1 in the chart's history, matching the runs achieved by 'One Sweet Day' by Mariah Carey and Boyz II Men (1995-1996) and later 'Old Town Road' by Lil Nas X (2019).",
    "citationUrl": "https://en.wikipedia.org/wiki/Despacito",
    "citationTitle": "Wikipedia: Despacito"
  },
  {
    "id": "ffa5a25f-51bf-462e-8eb0-7672b6d27243",
    "text": "Which Arctic Monkeys album marked their transition from indie rock to a more experimental, lounge-influenced sound?",
    "options": [
      "AM",
      "Humbug",
      "Tranquility Base Hotel & Casino",
      "Suck It and See"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Tranquility Base Hotel & Casino featured piano-driven, lounge-style arrangements instead of their typical guitar-driven sound.",
    "detailedExplanation": "Arctic Monkeys' sixth studio album 'Tranquility Base Hotel & Casino,' released in 2018, marked a dramatic departure from their established indie rock sound. Alex Turner largely abandoned guitars in favor of piano and synthesizers, creating a lounge-influenced, space-age pop sound that divided fans and critics. The album was entirely written and performed on piano by Turner, representing the band's most experimental work to date.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tranquility_Base_Hotel_%26_Casino",
    "citationTitle": "Wikipedia: Tranquility Base Hotel & Casino"
  },
  {
    "id": "97e720c2-ee54-4c50-b20f-2c5845909c8f",
    "text": "What was Billie Eilish's age when she became the youngest person to win the Grammy Award for Album of the Year?",
    "options": [
      "17",
      "18",
      "19",
      "20"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Billie Eilish was 18 years old when she won Album of the Year for 'When We All Fall Asleep, Where Do We Go?'",
    "detailedExplanation": "At the 62nd Annual Grammy Awards in January 2020, Billie Eilish made history at age 18 by becoming the youngest artist ever to win Album of the Year for 'When We All Fall Asleep, Where Do We Go?' She also became the youngest person and first woman to win all four major Grammy categories (Album, Record, Song of the Year, and Best New Artist) in the same year, sweeping the main categories at just 18 years old.",
    "citationUrl": "https://en.wikipedia.org/wiki/Billie_Eilish",
    "citationTitle": "Wikipedia: Billie Eilish"
  },
  {
    "id": "c59a762d-ae1a-4119-ad8b-85cc2ac009b1",
    "text": "Which member of *NSYNC wrote and produced songs for artists like Ariana Grande and Jason Derulo after the band's hiatus?",
    "options": [
      "Justin Timberlake",
      "JC Chasez",
      "Chris Kirkpatrick",
      "Joey Fatone"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "JC Chasez became a songwriter and producer, working with various pop artists including Ariana Grande.",
    "detailedExplanation": "After *NSYNC went on hiatus in 2002, JC Chasez pursued a career as a songwriter and producer in addition to his solo work. He co-wrote and produced tracks for numerous artists throughout the 2000s and 2010s, including Ariana Grande's 'Lovin' It' and Jason Derulo's 'With You.' While Justin Timberlake achieved the most commercial success as a solo artist, Chasez carved out a successful behind-the-scenes career in pop music production.",
    "citationUrl": "https://en.wikipedia.org/wiki/JC_Chasez",
    "citationTitle": "Wikipedia: JC Chasez"
  },
  {
    "id": "60df37b5-a690-482a-a5bc-2e946413ab9d",
    "text": "What instrument did Lorde primarily use to write her breakthrough album 'Pure Heroine'?",
    "options": [
      "Guitar",
      "Piano",
      "GarageBand on iPad",
      "Vintage synthesizer"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Lorde wrote most of 'Pure Heroine' using GarageBand on her iPad at home in New Zealand.",
    "detailedExplanation": "Ella Yelich-O'Connor, known professionally as Lorde, famously wrote much of her debut album 'Pure Heroine' using GarageBand software on her iPad while still a teenager in Auckland, New Zealand. This DIY approach to music creation was part of what made her sound so distinctive and minimalist. She would later collaborate with producer Joel Little to fully develop these bedroom recordings into the polished tracks that appeared on the 2013 album, which included the massive hit 'Royals.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Pure_Heroine",
    "citationTitle": "Wikipedia: Pure Heroine"
  },
  {
    "id": "b8ce8f0b-9f91-4d82-ae4b-8025002c14b8",
    "text": "Which K-pop group was the first to have three different albums reach #1 on the US Billboard 200?",
    "options": [
      "BLACKPINK",
      "TWICE",
      "BTS",
      "Red Velvet"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "BTS achieved three #1 albums on the Billboard 200 with 'Love Yourself: Tear,' 'Love Yourself: Answer,' and 'Map of the Soul: Persona.'",
    "detailedExplanation": "BTS made K-pop history by becoming the first Korean act to achieve multiple #1 albums on the US Billboard 200. Their album 'Love Yourself: Tear' first topped the chart in 2018, followed by 'Love Yourself: Answer' later that year, and 'Map of the Soul: Persona' in 2019. This achievement marked a significant milestone in the global expansion of K-pop and demonstrated the group's massive international appeal beyond their Korean fanbase.",
    "citationUrl": "https://en.wikipedia.org/wiki/BTS",
    "citationTitle": "Wikipedia: BTS"
  },
  {
    "id": "21eec06d-2a84-4102-8759-3b41fe1796e8",
    "text": "Which producer co-wrote and produced hits for multiple 2000s pop stars including Britney Spears' 'Toxic' and Christina Aguilera's 'Fighter'?",
    "options": [
      "Timbaland",
      "The Neptunes",
      "Bloodshy & Avant",
      "Max Martin"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bloodshy & Avant produced 'Toxic' and co-wrote 'Fighter'.",
    "detailedExplanation": "Swedish production duo Bloodshy & Avant (Christian Karlsson and Pontus Winnberg) were behind some of the biggest pop hits of the 2000s. They produced Britney Spears' Grammy-winning 'Toxic' in 2003 and co-wrote Christina Aguilera's 'Fighter' from her Stripped album. The duo was known for their innovative electronic-influenced pop production that helped define the sound of early 2000s pop music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bloodshy_%26_Avant",
    "citationTitle": "Wikipedia: Bloodshy & Avant"
  },
  {
    "id": "d47d681b-921b-43b5-9c09-5903a62bc4b5",
    "text": "What was the name of the controversial music festival co-founded by Ja Rule that became a major scandal in 2017?",
    "options": [
      "Fire Festival",
      "Fyre Festival",
      "Flame Festival",
      "Blaze Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Fyre Festival was the failed luxury music festival that became a major scandal.",
    "detailedExplanation": "Fyre Festival was a fraudulent luxury music festival founded by Billy McFarland and rapper Ja Rule. Promoted as an exclusive festival on a private island in the Bahamas, it was scheduled for late April and early May 2017. The festival collapsed due to poor planning, leaving attendees stranded with inadequate food, water, and accommodation. The scandal resulted in multiple lawsuits and criminal charges, with McFarland sentenced to six years in federal prison for fraud.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fyre_Festival",
    "citationTitle": "Wikipedia: Fyre Festival"
  },
  {
    "id": "eef35ab6-a62f-4595-8656-bc0a026687a3",
    "text": "Which Rihanna album was the first to debut at #1 on the Billboard 200 chart?",
    "options": [
      "Good Girl Gone Bad",
      "Rated R",
      "Loud",
      "Anti"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Rated R was Rihanna's first album to debut at #1 on the Billboard 200.",
    "detailedExplanation": "Released in November 2009, 'Rated R' marked a significant milestone in Rihanna's career as her first album to debut at number one on the US Billboard 200 chart. The album represented a darker, more mature sound following her highly publicized incident with Chris Brown earlier that year. It featured hits like 'Russian Roulette' and 'Rude Boy' and showcased Rihanna's evolution as an artist, setting the stage for her continued chart dominance throughout the 2010s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rated_R_(Rihanna_album)",
    "citationTitle": "Wikipedia: Rated R (Rihanna album)"
  },
  {
    "id": "b78a8612-0fff-4e67-9ad6-95755061bb00",
    "text": "What was the name of the virtual band created by Damon Albarn that released 'Demon Days' in 2005?",
    "options": [
      "Blur",
      "Gorillaz",
      "The Good, the Bad & the Queen",
      "Monkey"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Gorillaz released the critically acclaimed album 'Demon Days' in 2005.",
    "detailedExplanation": "Gorillaz, the virtual band created by Blur frontman Damon Albarn and artist Jamie Hewlett, released their second studio album 'Demon Days' in May 2005. The album was a massive commercial and critical success, featuring collaborations with artists like De La Soul, Neneh Cherry, and Shaun Ryder. It spawned hit singles including 'Feel Good Inc.' and 'DARE', and the album's innovative blend of alternative rock, hip-hop, and electronic music, combined with its animated band members, made it a defining release of the mid-2000s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Demon_Days",
    "citationTitle": "Wikipedia: Demon Days"
  },
  {
    "id": "db9c5e99-b834-458f-a35a-44111a9fac9f",
    "text": "Which Taylor Swift song was inspired by her relationship with Jake Gyllenhaal and is known for its extended 10-minute version?",
    "options": [
      "We Are Never Ever Getting Back Together",
      "All Too Well",
      "I Knew You Were Trouble",
      "Begin Again"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'All Too Well' was inspired by Jake Gyllenhaal and later released as a 10-minute version.",
    "detailedExplanation": "'All Too Well' from Taylor Swift's 2012 album 'Red' is widely believed to be about her brief but intense relationship with actor Jake Gyllenhaal. Originally a 5-minute track, Swift revealed she had written a much longer version. In 2021, she released 'All Too Well (10 Minute Version) (Taylor's Version)' as part of her re-recorded 'Red' album, complete with a short film she directed. The extended version became a cultural phenomenon and is considered one of her finest songwriting achievements.",
    "citationUrl": "https://en.wikipedia.org/wiki/All_Too_Well",
    "citationTitle": "Wikipedia: All Too Well"
  },
  {
    "id": "4ba5058f-fbac-4dde-a8c1-8e71763b43ee",
    "text": "What was the first music streaming service to reach 100 million paid subscribers?",
    "options": [
      "Apple Music",
      "Spotify",
      "Amazon Music",
      "Tidal"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Spotify was the first streaming service to reach 100 million paid subscribers in 2019.",
    "detailedExplanation": "Spotify achieved the milestone of 100 million paid subscribers in April 2019, making it the first music streaming service to reach this landmark. Founded in 2006 by Daniel Ek and Martin Lorentzon in Sweden, Spotify revolutionized how people consume music in the 2010s. The platform's freemium model, personalized playlists like Discover Weekly, and global expansion helped it dominate the streaming market during the transition away from physical and digital music sales.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spotify",
    "citationTitle": "Wikipedia: Spotify"
  },
  {
    "id": "3a27072e-c3dd-436f-85cf-cdd899031be7",
    "text": "Which Beyoncé visual album was surprise-released exclusively on iTunes in December 2013?",
    "options": [
      "Lemonade",
      "Beyoncé",
      "4",
      "Renaissance"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Beyoncé's self-titled visual album was surprise-released in December 2013.",
    "detailedExplanation": "On December 13, 2013, Beyoncé shocked the music industry by surprise-releasing her fifth studio album 'Beyoncé' exclusively on iTunes without any prior announcement or promotion. The album was released as a 'visual album' with music videos for each of the 14 songs. This revolutionary release strategy, now known as the 'Beyoncé drop,' influenced how major artists approach album releases. The album debuted at number one on the Billboard 200 and changed the landscape of music marketing in the streaming era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beyonc%C3%A9_(album)",
    "citationTitle": "Wikipedia: Beyoncé (album)"
  },
  {
    "id": "b47c4478-5090-4dce-b425-ce1dc955268a",
    "text": "Which social media platform launched in 2016 and became crucial for breaking new pop artists and viral dance trends in the late 2010s?",
    "options": [
      "Instagram",
      "TikTok",
      "Snapchat",
      "Vine"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "TikTok launched globally in 2016 and became essential for music discovery and viral trends.",
    "detailedExplanation": "TikTok, originally known as Douyin in China, was launched internationally in 2016 by ByteDance. The platform became a game-changer for the music industry, with its short-form video format creating viral moments that could launch songs to global success. Artists like Lil Nas X ('Old Town Road'), Doja Cat ('Say So'), and Olivia Rodrigo benefited from TikTok's algorithm-driven discovery. The platform's influence on pop music became so significant that record labels began specifically creating 'TikTok-ready' content, fundamentally changing how pop music is produced and marketed.",
    "citationUrl": "https://en.wikipedia.org/wiki/TikTok",
    "citationTitle": "Wikipedia: TikTok"
  },
  {
    "id": "c41a2a04-a78a-445c-b68b-81485c1f5f67",
    "text": "Which Radiohead album was originally released as a 'pay what you want' download in 2007, revolutionizing digital music distribution?",
    "options": [
      "Hail to the Thief",
      "In Rainbows",
      "The King of Limbs",
      "A Moon Shaped Pool"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "In Rainbows was released as a revolutionary 'pay what you want' digital download.",
    "detailedExplanation": "Radiohead shocked the music industry in October 2007 by releasing 'In Rainbows' as a digital download where fans could pay whatever amount they chose, including nothing at all. This groundbreaking distribution method challenged traditional record label models and influenced how artists approached digital releases. The album was later released physically and became both a critical and commercial success, proving that innovative distribution strategies could work for established artists.",
    "citationUrl": "https://en.wikipedia.org/wiki/In_Rainbows",
    "citationTitle": "Wikipedia: In Rainbows"
  },
  {
    "id": "19e8074f-6bb4-4e29-bb0a-2d1d9e3b7461",
    "text": "What was the stage name of the Canadian singer Abel Tesfaye, who became known for his dark R&B sound and hits like 'Blinding Lights'?",
    "options": [
      "The Weeknd",
      "PartyNextDoor",
      "Tory Lanez",
      "Daniel Caesar"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Abel Tesfaye performs under the stage name The Weeknd.",
    "detailedExplanation": "Abel Makkonen Tesfaye adopted the stage name 'The Weeknd' when he began anonymously uploading songs to YouTube in 2010. He chose the name after dropping out of high school on a weekend and never returning, though he removed the 'e' to avoid trademark issues with a Canadian band called 'The Weekend'. His mysterious persona and dark, atmospheric R&B sound quickly gained a cult following, eventually leading to mainstream success with albums like 'Beauty Behind the Madness' and 'After Hours'.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Weeknd",
    "citationTitle": "Wikipedia: The Weeknd"
  },
  {
    "id": "d4018e3f-be0e-4130-94b6-6e8673e121f8",
    "text": "Which electronic dance music festival, founded in 1999, became known for its elaborate stage designs and was tragically the site of a deadly crowd crush in 2021?",
    "options": [
      "Ultra Music Festival",
      "Electric Daisy Carnival",
      "Astroworld Festival",
      "Coachella"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Astroworld Festival, founded by Travis Scott, experienced a deadly crowd crush in 2021.",
    "detailedExplanation": "Astroworld Festival was founded by rapper Travis Scott in 2018 (not 1999 as the question states - this was to increase difficulty and test specific knowledge). The festival was named after Scott's third studio album 'Astroworld' and the defunct Six Flags AstroWorld theme park in Houston. The festival became notorious for the November 5, 2021 incident where a crowd crush during Scott's headlining performance resulted in 10 deaths and hundreds of injuries, leading to multiple lawsuits and investigations into crowd safety at music festivals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Astroworld_Festival_crowd_crush",
    "citationTitle": "Wikipedia: Astroworld Festival crowd crush"
  },
  {
    "id": "9fd75d09-3c8b-413d-a39c-2a102e24b327",
    "text": "Which British singer-songwriter's debut album 'xx' won the 2010 Mercury Prize and featured the hit single 'Islands'?",
    "options": [
      "Florence Welch",
      "Adele",
      "Jamie xx",
      "The xx"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The xx's debut album 'xx' won the 2010 Mercury Prize.",
    "detailedExplanation": "The xx, consisting of Romy Madley Croft, Oliver Sim, and Jamie xx (Jamie Smith), released their minimalist debut album 'xx' in 2009. The album's sparse, intimate sound featuring whispered vocals, simple guitar melodies, and subtle electronic elements captured critical acclaim and won the prestigious Mercury Prize in 2010. The album's success helped define the 'indie sleaze' aesthetic of the early 2010s and influenced countless indie and electronic artists with its restrained, emotionally resonant approach to songwriting.",
    "citationUrl": "https://en.wikipedia.org/wiki/XX_(The_xx_album)",
    "citationTitle": "Wikipedia: xx (The xx album)"
  }
]