[
  {
    "id": "36933950-508c-408a-b90d-4def854146f3",
    "text": "Which song by OutKast became a massive hit in 2003 and won the Grammy Award for Best Urban/Alternative Performance?",
    "options": [
      "Ms. Jackson",
      "Hey Ya!",
      "The Way You Move",
      "So Fresh, So Clean"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "\"Hey Ya!\" by OutKast won the Grammy Award for Best Urban/Alternative Performance in 2004.",
    "detailedExplanation": "\"Hey Ya!\" was released in 2003 as part of OutKast's double album \"Speakerboxxx/The Love Below\" and became one of the most iconic songs of the 2000s. The track, performed by André 3000, reached number one on the Billboard Hot 100 and stayed there for nine consecutive weeks. Its innovative blend of funk, rock, and hip-hop, combined with its energetic music video, made it a cultural phenomenon and earned it the Grammy Award for Best Urban/Alternative Performance in 2004.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hey_Ya!",
    "citationTitle": "Wikipedia: Hey Ya!"
  },
  {
    "id": "a8f567e7-77e7-4f5d-96b0-78002c2a523d",
    "text": "Taylor Swift's album '1989' marked her complete transition from which genre to pop music?",
    "options": [
      "Folk",
      "Country",
      "Rock",
      "R&B"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Taylor Swift transitioned from country music to pop with her 2014 album '1989'.",
    "detailedExplanation": "Taylor Swift began her career as a country music artist with albums like 'Taylor Swift' (2006) and 'Fearless' (2008). However, her 2014 album '1989' marked her complete artistic transition to pop music, abandoning country elements entirely. Named after her birth year, the album was inspired by 1980s synth-pop and New Wave music. The transition was both critically and commercially successful, with '1989' winning the Grammy Award for Album of the Year and spawning hits like 'Shake It Off' and 'Blank Space'.",
    "citationUrl": "https://en.wikipedia.org/wiki/1989_(Taylor_Swift_album)",
    "citationTitle": "Wikipedia: 1989 (Taylor Swift album)"
  },
  {
    "id": "02877129-82b3-41c1-8fb6-79c64700478e",
    "text": "Which British singer had a worldwide hit in 2011 with 'Rolling in the Deep'?",
    "options": [
      "Amy Winehouse",
      "Adele",
      "Duffy",
      "Leona Lewis"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Adele's 'Rolling in the Deep' became a massive worldwide hit in 2011 from her album '21'.",
    "detailedExplanation": "'Rolling in the Deep' was the lead single from Adele's second studio album '21', released in 2010 but achieving massive success throughout 2011. The song topped charts in numerous countries including the US, UK, Canada, and Australia. It became one of the best-selling digital singles of all time and won three Grammy Awards including Record of the Year and Song of the Year. The track showcased Adele's powerful vocals and marked her breakthrough into international superstardom.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rolling_in_the_Deep",
    "citationTitle": "Wikipedia: Rolling in the Deep"
  },
  {
    "id": "fa9acedc-dd95-4579-ab89-ffb8f5b7377f",
    "text": "Which K-pop group became the first Korean act to top the Billboard 200 chart with their album 'Love Yourself: Tear' in 2018?",
    "options": [
      "BLACKPINK",
      "EXO",
      "BTS",
      "TWICE"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "BTS made history by becoming the first Korean act to top the Billboard 200 with 'Love Yourself: Tear' in 2018.",
    "detailedExplanation": "BTS (Bangtan Sonyeondan) achieved a historic milestone in May 2018 when their album 'Love Yourself: Tear' debuted at number one on the Billboard 200 chart, making them the first Korean group to achieve this feat. The album sold 135,000 equivalent album units in its first week in the US. This success marked a significant moment for K-pop's global expansion and paved the way for their continued international success, including subsequent number-one albums and their first Billboard Hot 100 number-one single 'Dynamite' in 2020.",
    "citationUrl": "https://en.wikipedia.org/wiki/Love_Yourself:_Tear",
    "citationTitle": "Wikipedia: Love Yourself: Tear"
  },
  {
    "id": "884cc4b3-e102-4c76-8b0f-83bce6361dc3",
    "text": "What was the best-selling digital single of the 2000s decade in the United States?",
    "options": [
      "I Gotta Feeling - Black Eyed Peas",
      "Poker Face - Lady Gaga",
      "Boom Boom Pow - Black Eyed Peas",
      "Right Round - Flo Rida"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'I Gotta Feeling' by Black Eyed Peas was the best-selling digital single of the 2000s in the US.",
    "detailedExplanation": "'I Gotta Feeling' by Black Eyed Peas, released in 2009, became the best-selling digital single of the 2000s decade in the United States with over 5.6 million digital downloads by the end of 2009. The song spent 14 consecutive weeks at number one on the Billboard Hot 100 and became a global anthem for celebration and good times. Its success coincided with the peak of the digital music revolution, as iTunes and legal digital downloads were transforming how people consumed music.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Gotta_Feeling",
    "citationTitle": "Wikipedia: I Gotta Feeling"
  },
  {
    "id": "8f553235-c1be-4170-beb5-5f6bbdd92a42",
    "text": "Which streaming platform launched in 2008 and fundamentally changed how people discover new music through its algorithm-based recommendations?",
    "options": [
      "Apple Music",
      "Spotify",
      "Pandora",
      "SoundCloud"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Spotify launched in 2008 and revolutionized music discovery through its sophisticated recommendation algorithms.",
    "detailedExplanation": "Spotify was founded in Sweden and launched in 2008, initially in Europe before expanding to the United States in 2011. The platform revolutionized music consumption by offering both free ad-supported and premium subscription tiers, but more importantly, it pioneered the use of sophisticated algorithms for music discovery. Features like Discover Weekly, Release Radar, and Daily Mixes use machine learning to analyze listening habits and recommend new music, fundamentally changing how people discover artists and songs compared to traditional radio or music video channels.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spotify",
    "citationTitle": "Wikipedia: Spotify"
  },
  {
    "id": "8fd00569-3d81-4f24-ab00-34e7e3ff3fbf",
    "text": "Which Rihanna song from 2007 was her first to reach number one on the Billboard Hot 100?",
    "options": [
      "Umbrella",
      "Don't Stop the Music",
      "Disturbia",
      "Take a Bow"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Umbrella' featuring Jay-Z was Rihanna's first number-one hit on the Billboard Hot 100 in 2007.",
    "detailedExplanation": "'Umbrella' featuring Jay-Z was released in March 2007 as the lead single from Rihanna's third studio album 'Good Girl Gone Bad'. The song marked a significant turning point in Rihanna's career, transforming her from a Caribbean dancehall artist into a global pop superstar. It spent seven consecutive weeks at number one on the Billboard Hot 100 and topped charts in numerous countries worldwide. The track's success established Rihanna as one of the leading pop artists of the late 2000s and 2010s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Umbrella_(song)",
    "citationTitle": "Wikipedia: Umbrella (song)"
  },
  {
    "id": "da449cc1-d683-40cc-b3ed-7dadbd6316a6",
    "text": "Which artist holds the record for the most simultaneous entries on the Billboard Hot 100 chart, achieved in 2018?",
    "options": [
      "Taylor Swift",
      "Drake",
      "Post Malone",
      "Ariana Grande"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Drake set the record with 27 simultaneous entries on the Billboard Hot 100 in 2018 following the release of his album 'Scorpion'.",
    "detailedExplanation": "In July 2018, Drake shattered the record for most simultaneous Billboard Hot 100 entries when 27 songs from his double album 'Scorpion' appeared on the chart in the same week. This unprecedented achievement was made possible by the album's massive streaming numbers and the way Billboard counts streams toward chart positions. The previous record was 24 songs, which Drake himself had set earlier that year. This feat demonstrated the power of streaming platforms and how they had fundamentally changed chart dynamics in the digital age.",
    "citationUrl": "https://en.wikipedia.org/wiki/Scorpion_(Drake_album)",
    "citationTitle": "Wikipedia: Scorpion (Drake album)"
  },
  {
    "id": "12521b6f-02ab-409a-8611-6436bb3bf822",
    "text": "Which social media platform launched in 2016 and became crucial for breaking pop hits through its short-form videos and dance trends?",
    "options": [
      "Instagram",
      "TikTok",
      "Snapchat",
      "Vine"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "TikTok launched globally in 2016 and revolutionized music promotion through viral dance trends and short clips.",
    "detailedExplanation": "TikTok, originally known as Musical.ly before being acquired by ByteDance, became a game-changer for the music industry in the late 2010s. The platform's algorithm-driven short-form video format allowed songs to go viral through dance challenges, memes, and user-generated content. Artists began creating 'TikTok-ready' hooks, and record labels started monitoring the platform for emerging trends. Songs like 'Old Town Road' by Lil Nas X and 'Savage' by Megan Thee Stallion owe much of their success to TikTok virality.",
    "citationUrl": "https://en.wikipedia.org/wiki/TikTok",
    "citationTitle": "Wikipedia: TikTok"
  },
  {
    "id": "f1e47372-423f-44bf-aa05-322e74cda7f9",
    "text": "What was the name of Beyoncé's surprise visual album released exclusively on iTunes in December 2013?",
    "options": [
      "Lemonade",
      "Beyoncé",
      "4",
      "Renaissance"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Beyoncé's self-titled fifth studio album was released as a surprise visual album in 2013, changing industry release strategies.",
    "detailedExplanation": "Beyoncé's self-titled album, released on December 13, 2013, revolutionized music marketing by dropping without any prior announcement or promotion. The album featured 14 songs with accompanying music videos for each track, creating a complete visual experience. This 'surprise drop' strategy influenced countless artists afterward, including Drake, Frank Ocean, and even Taylor Swift. The album debuted at number one on the Billboard 200 and was praised for its artistic cohesion and innovative release method.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beyonc%C3%A9_(album)",
    "citationTitle": "Wikipedia: Beyoncé (album)"
  },
  {
    "id": "57dd9a6b-50b6-4da3-ae8c-582ba7f78a7b",
    "text": "Which electronic dance music subgenre dominated mainstream pop in the early 2010s, popularized by artists like David Guetta and Calvin Harris?",
    "options": [
      "Dubstep",
      "Progressive House",
      "EDM/Big Room House",
      "Trap"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "EDM, particularly Big Room House, became mainstream in the early 2010s through collaborations with pop artists.",
    "detailedExplanation": "Electronic Dance Music (EDM), specifically the Big Room House subgenre, exploded into mainstream pop culture around 2011-2014. DJs like David Guetta, Calvin Harris, Avicii, and Swedish House Mafia collaborated with major pop artists, creating festival anthems that crossed over to radio success. Songs like 'Titanium,' 'Wake Me Up,' and 'We Found Love' exemplified this trend. The rise coincided with major music festivals becoming cultural phenomena and streaming services making dance music more accessible to general audiences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Electronic_dance_music",
    "citationTitle": "Wikipedia: Electronic dance music"
  },
  {
    "id": "7434b5ba-507f-4a8a-a89a-361f4be7ad1d",
    "text": "Which pop star's 2020 albums 'folklore' and 'evermore' marked a dramatic shift to indie folk and alternative rock sounds?",
    "options": [
      "Ariana Grande",
      "Taylor Swift",
      "Billie Eilish",
      "Dua Lipa"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Taylor Swift surprised fans by pivoting to indie folk with 'folklore' and 'evermore,' both released during the COVID-19 pandemic.",
    "detailedExplanation": "Taylor Swift's eighth and ninth studio albums, 'folklore' (July 2020) and 'evermore' (December 2020), represented a dramatic artistic departure from her previous pop sound. Created during COVID-19 lockdowns with collaborators Aaron Dessner of The National and Bon Iver's Justin Vernon, these albums featured introspective lyrics, acoustic instrumentation, and storytelling from fictional perspectives. 'folklore' won the Grammy Award for Album of the Year, making Swift the first woman to win the award three times, and both albums were praised for their mature songwriting and cohesive artistic vision.",
    "citationUrl": "https://en.wikipedia.org/wiki/Folklore_(Taylor_Swift_album)",
    "citationTitle": "Wikipedia: Folklore (Taylor Swift album)"
  },
  {
    "id": "cd830fbe-0a7b-4c3c-b96f-761b0e3dd70d",
    "text": "Which Canadian artist became known as the 'Queen of Hyperpop' and gained mainstream attention with their 2019 album 'Oil of Every Pearl's Un-Insides'?",
    "options": [
      "Grimes",
      "SOPHIE",
      "Arca",
      "FKA twigs"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "SOPHIE was a pioneering producer and artist who helped define the hyperpop genre and influenced mainstream pop production.",
    "detailedExplanation": "SOPHIE (Samuel Long) was a groundbreaking Scottish producer and artist who became central to the hyperpop movement of the late 2010s. Their 2018 album 'Oil of Every Pearl's Un-Insides' was critically acclaimed and Grammy-nominated, featuring experimental pop sounds that influenced artists like Charli XCX, Kim Petras, and even mainstream acts. SOPHIE's production work combined hyperprocessed vocals, synthetic textures, and deconstructed pop structures. Though they passed away in 2021, their influence on contemporary pop music continues to grow, with hyperpop elements appearing in mainstream releases.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sophie_(musician)",
    "citationTitle": "Wikipedia: Sophie (musician)"
  },
  {
    "id": "2749a18d-6ed8-4e85-9593-309f5f5e4dc1",
    "text": "What was the first music video to reach 1 billion views on YouTube, achieving this milestone in 2012?",
    "options": [
      "Gangnam Style",
      "Baby",
      "Bad Romance",
      "Call Me Maybe"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "PSY's 'Gangnam Style' became the first YouTube video to reach 1 billion views, revolutionizing viral music content.",
    "detailedExplanation": "PSY's 'Gangnam Style' made history by becoming the first YouTube video to surpass 1 billion views in December 2012, just five months after its release. The K-pop song's success was unprecedented for a non-English track, introducing global audiences to Korean pop culture and demonstrating YouTube's power as a music platform. The video's distinctive horse-riding dance became a worldwide phenomenon, spawning countless parodies and covers. Its success paved the way for other K-pop acts to achieve international recognition and highlighted the importance of visual content in music marketing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gangnam_Style",
    "citationTitle": "Wikipedia: Gangnam Style"
  },
  {
    "id": "044557d0-dc65-42d9-8681-9e4b547c1572",
    "text": "Which streaming service, launched by Jay-Z in 2015, positioned itself as an artist-owned platform emphasizing high-quality audio and exclusive content?",
    "options": [
      "Apple Music",
      "Tidal",
      "Deezer",
      "Amazon Music"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tidal was acquired and relaunched by Jay-Z as an artist-owned streaming platform focusing on high-fidelity audio and exclusive releases.",
    "detailedExplanation": "Tidal was acquired by Jay-Z's company in 2015 and relaunched as a subscription-based music streaming service owned by artists. The platform distinguished itself by offering lossless audio quality and exclusive content from major artists like Beyoncé, Kanye West, and Rihanna. Notable exclusive releases included Beyoncé's 'Lemonade' and Kanye West's 'The Life of Pablo.' While it never achieved the subscriber numbers of Spotify or Apple Music, Tidal influenced the industry by demonstrating artists' desire for greater control over their content distribution and higher royalty rates.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tidal_(service)",
    "citationTitle": "Wikipedia: Tidal (service)"
  },
  {
    "id": "45e9f75e-37a6-4dbb-9d06-20150078b4df",
    "text": "Which pop collaboration between Lady Gaga and which artist topped charts worldwide in 2018 and won the Grammy for Best Pop Duo/Group Performance?",
    "options": [
      "Ariana Grande - 'Rain on Me'",
      "Bradley Cooper - 'Shallow'",
      "Tony Bennett - 'I Get a Kick Out of You'",
      "BLACKPINK - 'Sour Candy'"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Shallow' from 'A Star Is Born' became a massive hit and won multiple Grammys for Lady Gaga and Bradley Cooper.",
    "detailedExplanation": "'Shallow,' performed by Lady Gaga and Bradley Cooper from the 2018 film 'A Star Is Born,' became one of the biggest songs of the late 2010s. The track topped charts in over 15 countries and showcased Gaga's vocal range while highlighting Cooper's surprising singing ability. The song won the Grammy Award for Best Pop Duo/Group Performance and the Academy Award for Best Original Song. Its success helped revive interest in movie soundtracks and demonstrated how film music could still achieve massive commercial success in the streaming era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shallow_(Lady_Gaga_and_Bradley_Cooper_song)",
    "citationTitle": "Wikipedia: Shallow (Lady Gaga and Bradley Cooper song)"
  },
  {
    "id": "81d90153-2507-4ab8-ad1d-d208fd52cf29",
    "text": "Which Maroon 5 song from 2011 became one of the best-selling singles of all time and spent 76 weeks on the Billboard Hot 100?",
    "options": [
      "Payphone",
      "Moves Like Jagger",
      "Sugar",
      "Animals"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Moves Like Jagger became a massive global hit and one of the longest-charting singles in Billboard history.",
    "detailedExplanation": "Released in 2011, 'Moves Like Jagger' featuring Christina Aguilera became Maroon 5's biggest hit of the decade. The song spent an impressive 76 weeks on the Billboard Hot 100 chart and became one of the best-selling singles worldwide. Its electronic dance-pop sound marked a significant shift from the band's earlier rock style and helped establish their dominance in mainstream pop music throughout the 2010s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moves_like_Jagger",
    "citationTitle": "Wikipedia: Moves like Jagger"
  },
  {
    "id": "16c4a729-27a9-40c0-865c-b05f321a1c21",
    "text": "Which music festival, founded in 2012, became synonymous with influencer culture and celebrity fashion moments in the 2010s?",
    "options": [
      "Lollapalooza",
      "Bonnaroo",
      "Coachella",
      "Austin City Limits"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Coachella became the premier music festival for celebrity sightings and Instagram-worthy fashion moments.",
    "detailedExplanation": "While Coachella was founded in 1999, it truly exploded in cultural relevance during the 2010s, becoming as much about fashion and social media presence as the music itself. The festival became a launching pad for many pop careers and viral moments, with celebrities and influencers treating it as a fashion showcase. Major pop artists like Beyoncé, Ariana Grande, and Bad Bunny headlined the festival, cementing its status as a cultural touchstone of 2010s pop music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coachella_Valley_Music_and_Arts_Festival",
    "citationTitle": "Wikipedia: Coachella Valley Music and Arts Festival"
  },
  {
    "id": "03bc7303-2257-4943-86a1-1422904bc529",
    "text": "Which Latin pop song by Luis Fonsi featuring Daddy Yankee became the most-watched YouTube video of all time in 2017?",
    "options": [
      "Mi Gente",
      "Despacito",
      "Con Altura",
      "Danza Kuduro"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Despacito broke multiple records and helped popularize Latin pop music globally in the late 2010s.",
    "detailedExplanation": "'Despacito' became a cultural phenomenon in 2017, topping charts in over 45 countries and becoming the most-watched YouTube video of all time. The song's success marked a turning point for Latin music in mainstream pop, paving the way for other Latin artists to achieve global success. A remix featuring Justin Bieber further boosted its popularity in English-speaking markets, demonstrating the growing influence of Latin pop in the global music landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/Despacito",
    "citationTitle": "Wikipedia: Despacito"
  },
  {
    "id": "0419d4e3-dc88-46c0-8e54-b0346f19afe9",
    "text": "Which pop star's halftime show performance at Super Bowl 50 in 2016 sparked widespread controversy and political debate?",
    "options": [
      "Katy Perry",
      "Beyoncé",
      "Lady Gaga",
      "Madonna"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Beyoncé's politically charged performance of 'Formation' during the halftime show generated significant controversy.",
    "detailedExplanation": "Beyoncé's 2016 Super Bowl halftime show performance alongside Coldplay and Bruno Mars became one of the most talked-about and controversial halftime shows ever. Her performance of 'Formation' featured dancers dressed in Black Panther-inspired outfits and included imagery referencing Black Lives Matter and Malcolm X. The performance sparked intense political debate and backlash, but also praise for using the massive platform to make a political statement about racial justice and police brutality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bowl_50_halftime_show",
    "citationTitle": "Wikipedia: Super Bowl 50 halftime show"
  }
]