[
  {
    "id": "66f7a1bd-50f9-4c87-bade-e49ab7dbd57e",
    "text": "Which Formula 1 driver holds the record for the most pole positions in a single season?",
    "options": [
      "Ayrton Senna",
      "Sebastian Vettel",
      "Lewis Hamilton",
      "Max Verstappen"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Sebastian Vettel achieved 15 pole positions in the 2011 season.",
    "detailedExplanation": "Sebastian Vettel set the record for most pole positions in a single Formula 1 season during his dominant 2011 championship campaign with Red Bull Racing. He secured 15 pole positions out of 19 races that season, surpassing the previous record of 14 held by Nigel Mansell from 1992. This remarkable achievement was part of Vettel's second consecutive world championship, demonstrating the superiority of the Red Bull RB7 car and his exceptional qualifying pace throughout the season.",
    "citationUrl": "https://en.wikipedia.org/wiki/2011_Formula_One_World_Championship",
    "citationTitle": "Wikipedia: 2011 Formula One World Championship"
  },
  {
    "id": "de2f5efe-8d95-414a-857e-a5419f57d45e",
    "text": "What is the minimum weight limit for a Formula 1 car including the driver in the 2023 regulations?",
    "options": [
      "730 kg",
      "740 kg",
      "795 kg",
      "798 kg"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The minimum weight for an F1 car including driver is 795 kg as of 2023 regulations.",
    "detailedExplanation": "The FIA increased the minimum weight limit for Formula 1 cars to 795 kilograms (including the driver) for the 2022 season, which continues into 2023. This represents a significant increase from previous years, primarily due to the introduction of new safety measures, larger and heavier 18-inch wheels, and the hybrid power unit components. The weight limit includes all fluids except fuel, and teams must ensure their cars meet this minimum weight requirement during scrutineering. Cars that are underweight can add ballast, but overweight cars face significant competitive disadvantages.",
    "citationUrl": "https://en.wikipedia.org/wiki/Formula_One_technical_regulations",
    "citationTitle": "Wikipedia: Formula One technical regulations"
  },
  {
    "id": "be4cb119-e761-4387-a914-b2f8b1b69900",
    "text": "Which circuit has hosted the most Formula 1 World Championship races in history?",
    "options": [
      "Monaco",
      "Silverstone",
      "Monza",
      "Spa-Francorchamps"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Monza has hosted the most F1 races, having held the Italian Grand Prix since 1950 with only one exception.",
    "detailedExplanation": "The Autodromo Nazionale di Monza in Italy holds the record for hosting the most Formula 1 World Championship races in history. Since the championship began in 1950, Monza has hosted the Italian Grand Prix every year except 1980, when the race was held at Imola due to renovations at Monza. This gives Monza over 70 race hostings, making it the most frequent venue in F1 history. Known as the 'Temple of Speed,' Monza is famous for its high-speed nature, passionate Italian fans, and historic significance in motorsport, having been built in 1922.",
    "citationUrl": "https://en.wikipedia.org/wiki/Autodromo_Nazionale_di_Monza",
    "citationTitle": "Wikipedia: Autodromo Nazionale di Monza"
  },
  {
    "id": "e15f10f3-3d12-4833-90a7-feafb3226800",
    "text": "What was unusual about the 2005 United States Grand Prix at Indianapolis?",
    "options": [
      "It was run in reverse direction",
      "Only 6 cars participated in the race",
      "It was stopped due to terrorism threats",
      "The race was held on a Monday"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Only 6 cars started the 2005 US GP due to Michelin tire safety concerns on the banked turn.",
    "detailedExplanation": "The 2005 United States Grand Prix became one of the most controversial races in Formula 1 history when only six cars participated in the actual race. All teams using Michelin tires (14 cars) withdrew after the formation lap due to safety concerns about their tires on the banked Turn 1 at Indianapolis Motor Speedway. Only the three teams using Bridgestone tires - Ferrari, Jordan, and Minardi - actually raced, creating a farcical situation where fans demanded refunds and F1's reputation in America was severely damaged. The race was technically won by Michael Schumacher, but the event marked the beginning of the end for F1 at Indianapolis.",
    "citationUrl": "https://en.wikipedia.org/wiki/2005_United_States_Grand_Prix",
    "citationTitle": "Wikipedia: 2005 United States Grand Prix"
  },
  {
    "id": "811a2ccd-8b78-4a20-b0f6-55894166b68d",
    "text": "Which Formula 1 constructor has the record for the longest gap between championship victories?",
    "options": [
      "McLaren",
      "Williams",
      "Alpine/Renault",
      "Lotus"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Alpine/Renault had a 26-year gap between their 1995 and 2021 race victories.",
    "detailedExplanation": "Alpine, competing under various Renault-related names, holds the record for the longest gap between Formula 1 race victories. Their last victory before 2021 was at the 1995 Canadian Grand Prix with Olivier Panis driving for Ligier-Renault. The team then endured a 26-year winless streak until Esteban Ocon's surprise victory at the 2021 Hungarian Grand Prix driving for Alpine. This drought encompassed various iterations of the Renault works team, including their complete withdrawal from F1 as a constructor in the late 1990s and their return in 2001, followed by the rebrand to Alpine in 2021.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alpine_F1_Team",
    "citationTitle": "Wikipedia: Alpine F1 Team"
  },
  {
    "id": "68796d53-caa8-4d5b-b267-ec114a0846d9",
    "text": "What is the DRS (Drag Reduction System) activation zone minimum length according to FIA regulations?",
    "options": [
      "400 meters",
      "525 meters",
      "600 meters",
      "800 meters"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "DRS zones must be at least 525 meters long according to FIA technical regulations.",
    "detailedExplanation": "The Drag Reduction System (DRS) zones in Formula 1 must have a minimum length of 525 meters according to FIA technical regulations. DRS was introduced in 2011 to aid overtaking by allowing drivers to open a flap in their rear wing when following another car within one second, reducing drag and increasing straight-line speed by approximately 10-12 km/h. The specific length and placement of DRS zones are determined by the FIA for each circuit, taking into account factors such as safety, overtaking opportunities, and track characteristics. Most circuits have 1-3 DRS zones positioned on long straights.",
    "citationUrl": "https://en.wikipedia.org/wiki/Drag_reduction_system",
    "citationTitle": "Wikipedia: Drag reduction system"
  },
  {
    "id": "3ab1585e-f88d-4b28-ac97-2f23f5c3c11d",
    "text": "Which driver holds the record for the most Formula 1 race starts without ever achieving a podium finish?",
    "options": [
      "Andrea de Cesaris",
      "Nick Heidfeld",
      "Nico Hulkenberg",
      "Chris Amon"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Nico Hulkenberg has the most F1 starts (181+) without a podium finish in his career.",
    "detailedExplanation": "Nico Hulkenberg holds the unfortunate record for the most Formula 1 race starts without ever achieving a podium finish, with over 180 race starts across multiple teams including Williams, Force India, Sauber, Renault, Racing Point, and Aston Martin. Despite being a consistently quick and reliable driver, Hulkenberg has come agonizingly close to podium finishes on several occasions, including multiple fourth-place finishes. This record highlights both his longevity in the sport and the cruel nature of F1, where being in the right car at the right time is crucial for success, regardless of driver talent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nico_H%C3%BClkenberg",
    "citationTitle": "Wikipedia: Nico Hülkenberg"
  },
  {
    "id": "9b846c57-0eca-4080-9fe5-3e65f5c73df2",
    "text": "What is the maximum fuel flow rate allowed for Formula 1 engines during a race?",
    "options": [
      "80 kg/hour",
      "100 kg/hour",
      "110 kg/hour",
      "120 kg/hour"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "F1 engines are limited to a maximum fuel flow rate of 100 kg per hour during races.",
    "detailedExplanation": "Formula 1 engines are restricted to a maximum fuel flow rate of 100 kilograms per hour during races, a regulation introduced with the current hybrid power unit era in 2014. This technical limitation, monitored by sophisticated fuel flow sensors, forces teams to optimize engine efficiency rather than simply burning more fuel for more power. The regulation applies when the engine is operating above 10,500 RPM, and violations result in penalties or disqualification. This fuel flow limit, combined with the maximum race fuel allowance of 110kg, encourages technological development in energy recovery and engine efficiency.",
    "citationUrl": "https://en.wikipedia.org/wiki/Formula_One_engines",
    "citationTitle": "Wikipedia: Formula One engines"
  },
  {
    "id": "ecdbd7cd-9b83-4aa7-8215-80c221afc414",
    "text": "Which Formula 1 driver was posthumously awarded the 1970 World Championship after dying during practice at Monza?",
    "options": [
      "Jochen Rindt",
      "Jim Clark",
      "Ronnie Peterson",
      "Gilles Villeneuve"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jochen Rindt was posthumously awarded the 1970 World Championship after his fatal crash at Monza.",
    "detailedExplanation": "Austrian driver Jochen Rindt was killed during practice for the 1970 Italian Grand Prix at Monza when his Lotus 72 crashed at the Parabolica corner. He had accumulated enough points earlier in the season that no other driver could mathematically overtake him in the championship standings, making him the only driver to win a Formula 1 World Championship posthumously. His widow Nina accepted the championship on his behalf.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jochen_Rindt",
    "citationTitle": "Wikipedia: Jochen Rindt"
  },
  {
    "id": "456951f7-00cf-41ae-ac0b-3ef96d783cc7",
    "text": "What is the name of the curved aerodynamic winglets introduced on F1 car sidepods in 2009 to reduce turbulence?",
    "options": [
      "Shark fins",
      "Barge boards",
      "Turning vanes",
      "Flip-ups"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Turning vanes are small aerodynamic elements designed to manage airflow and reduce turbulence around the sidepods.",
    "detailedExplanation": "Turning vanes are intricate aerodynamic devices that were prominently featured on Formula 1 cars starting in 2009. These small, curved winglets are positioned around the sidepods and other areas of the car to manipulate airflow, reduce turbulent air, and improve overall aerodynamic efficiency. They help direct clean air to crucial areas like the rear wing and floor, playing a vital role in the car's downforce generation and drag reduction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Formula_One_car",
    "citationTitle": "Wikipedia: Formula One car"
  },
  {
    "id": "c05a9c11-cc70-4c51-93af-52af43cbb0e8",
    "text": "Which team holds the record for the most consecutive Formula 1 Constructors' Championships?",
    "options": [
      "McLaren (4)",
      "Ferrari (6)",
      "Mercedes (8)",
      "Red Bull Racing (4)"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Mercedes achieved 8 consecutive Constructors' Championships from 2014 to 2021.",
    "detailedExplanation": "Mercedes-AMG Petronas Formula One Team dominated the hybrid era of Formula 1, winning an unprecedented eight consecutive Constructors' Championships from 2014 through 2021. This streak began with the introduction of the hybrid power units and was built on their superior engine technology and chassis development. The run was finally broken by Red Bull Racing in 2022, but Mercedes' eight-year dominance remains the longest consecutive championship streak in F1 history.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Formula_One_constructors",
    "citationTitle": "Wikipedia: List of Formula One constructors"
  },
  {
    "id": "1d6d3720-8502-445e-b3de-5fe3445c1de5",
    "text": "What was the original name of the Silverstone circuit before it became a permanent racing venue?",
    "options": [
      "RAF Silverstone",
      "Brooklands Aerodrome",
      "Donington Airfield",
      "Brands Hatch Base"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Silverstone was originally RAF Silverstone, a Royal Air Force training airfield during World War II.",
    "detailedExplanation": "Silverstone Circuit began life as RAF Silverstone, a Royal Air Force training airfield built in 1943 during World War II. The airfield was used for training bomber crews and remained active until 1946. The first motor race was held on the perimeter roads of the airfield in 1947, and it hosted the very first Formula 1 World Championship Grand Prix in 1950. The original runway configuration can still be seen today, with parts of the current track following the old perimeter roads of the former RAF base.",
    "citationUrl": "https://en.wikipedia.org/wiki/Silverstone_Circuit",
    "citationTitle": "Wikipedia: Silverstone Circuit"
  },
  {
    "id": "64bab6f6-2d3b-4189-a6ac-e4524f3d69ae",
    "text": "Which Formula 1 team was the first to use a semi-automatic gearbox in competition?",
    "options": [
      "McLaren",
      "Ferrari",
      "Williams",
      "Benetton"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Ferrari introduced the first semi-automatic gearbox in F1 with their 640 model in 1989.",
    "detailedExplanation": "Ferrari revolutionized Formula 1 transmission technology when they introduced the first semi-automatic gearbox with their 640 car in 1989. The system allowed drivers to change gears using paddle shifters behind the steering wheel without using a clutch pedal, except for starting from a standstill. This innovation was initially unreliable but provided a significant advantage when it worked, as drivers could keep both hands on the wheel while shifting. The technology quickly spread throughout the grid and became standard in modern Formula 1.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ferrari_640",
    "citationTitle": "Wikipedia: Ferrari 640"
  },
  {
    "id": "97ae9eb6-2456-4cc2-80cd-04fc07ab91d1",
    "text": "What is the maximum number of power unit elements a Formula 1 driver can use in a season before receiving grid penalties?",
    "options": [
      "2 of each component",
      "3 of each component",
      "4 of each component",
      "5 of each component"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Drivers are allowed 3 of each power unit component (ICE, TC, MGU-H, MGU-K, ES, CE) per season without penalty.",
    "detailedExplanation": "Under current Formula 1 regulations, each driver is allocated three of each power unit component for the entire season: Internal Combustion Engine (ICE), Turbocharger (TC), Motor Generator Unit-Heat (MGU-H), Motor Generator Unit-Kinetic (MGU-K), Energy Store (ES), and Control Electronics (CE). If a driver exceeds this allocation and uses a fourth or subsequent component of any type, they receive grid penalties for that race weekend. This rule was implemented to control costs and encourage reliability development in the hybrid power units.",
    "citationUrl": "https://en.wikipedia.org/wiki/Formula_One_regulations",
    "citationTitle": "Wikipedia: Formula One regulations"
  },
  {
    "id": "ddf0b669-cd27-41f9-b6a7-a99f50b2e7c5",
    "text": "Which Formula 1 driver scored points in their first 7 consecutive races, a record for rookies?",
    "options": [
      "Lewis Hamilton",
      "Kimi Räikkönen",
      "Fernando Alonso",
      "Charles Leclerc"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Lewis Hamilton scored points in his first 7 races as a rookie in 2007, setting a record for consecutive points finishes to start a career.",
    "detailedExplanation": "Lewis Hamilton made an extraordinary debut in Formula 1 during the 2007 season, scoring points in his first seven consecutive races with McLaren. Starting with a third-place finish at the Australian Grand Prix, Hamilton consistently finished in the points-paying positions through the Spanish Grand Prix. This remarkable streak as a rookie contributed to him finishing second in the championship in his debut season, just one point behind Kimi Räikkönen. His immediate success was unprecedented for a rookie and demonstrated his exceptional talent from the very beginning of his F1 career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lewis_Hamilton",
    "citationTitle": "Wikipedia: Lewis Hamilton"
  },
  {
    "id": "e4caeb1f-429b-4e2b-be6f-dd960776f334",
    "text": "What does the black flag with an orange circle mean in Formula 1 racing?",
    "options": [
      "Immediate disqualification",
      "Mechanical problem - return to pits",
      "Unsporting behavior warning",
      "Final lap indicator"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The black flag with orange circle indicates a mechanical problem and orders the driver to return to the pits immediately.",
    "detailedExplanation": "The black flag with an orange circle is one of the most serious flags in Formula 1, indicating that race officials have spotted a mechanical problem with a car that could pose a safety risk. When shown to a driver, it means they must return to the pits immediately for inspection and repairs. Common reasons for this flag include loose bodywork, damaged wings, fluid leaks, or any mechanical issue that could endanger the driver or other competitors. The driver must comply immediately and cannot continue racing until the problem is resolved and cleared by the stewards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Racing_flags",
    "citationTitle": "Wikipedia: Racing flags"
  },
  {
    "id": "a3bedc58-961d-4963-bdf1-2caa931e5b3c",
    "text": "Which Formula 1 team was disqualified from an entire season after being found guilty of spying on a rival team's technical data?",
    "options": [
      "McLaren in 2007",
      "Ferrari in 2019",
      "Red Bull in 2021",
      "Renault in 2009"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "McLaren was excluded from the 2007 Constructors' Championship and fined $100 million for the Ferrari spy scandal.",
    "detailedExplanation": "In 2007, McLaren was found guilty of possessing confidential Ferrari technical documents in what became known as 'Spygate.' The FIA excluded McLaren from the 2007 Constructors' Championship and imposed a record $100 million fine, though their drivers Lewis Hamilton and Fernando Alonso were allowed to continue competing for the Drivers' Championship. This remains one of the most severe punishments in Formula 1 history.",
    "citationUrl": "https://en.wikipedia.org/wiki/2007_Formula_One_espionage_controversy",
    "citationTitle": "Wikipedia: 2007 Formula One espionage controversy"
  },
  {
    "id": "173aa740-fb16-4a41-8309-07571ea471dc",
    "text": "What is the name of the chicane at Monza that was removed in 2000 to increase overtaking opportunities?",
    "options": [
      "Variante del Rettifilo",
      "Variante della Roggia",
      "Variante Ascari",
      "Variante Goodyear"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Variante del Rettifilo chicane was removed from Monza's main straight in 2000.",
    "detailedExplanation": "The Variante del Rettifilo was a chicane located on Monza's famous long back straight (Rettifilo Tribune). It was installed in 1972 for safety reasons to reduce speeds on the straight, but was removed in 2000 to restore the circuit's high-speed character and create more overtaking opportunities. This change allowed cars to reach higher speeds and made racing more exciting, though it also increased the challenge for drivers and the importance of slipstreaming.",
    "citationUrl": "https://en.wikipedia.org/wiki/Monza_Circuit",
    "citationTitle": "Wikipedia: Monza Circuit"
  },
  {
    "id": "4c909237-f26e-4c7e-bc23-85805a0c3ab3",
    "text": "Which Formula 1 driver famously won the 1961 World Championship despite only winning one race that season?",
    "options": [
      "Phil Hill",
      "Wolfgang von Trips",
      "Stirling Moss",
      "Jim Clark"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Phil Hill won the 1961 championship with just one victory, benefiting from consistent point finishes and Wolfgang von Trips' fatal accident.",
    "detailedExplanation": "Phil Hill won the 1961 Formula 1 World Championship despite winning only the Italian Grand Prix that year. His championship was secured under tragic circumstances when his Ferrari teammate Wolfgang von Trips, who was leading the championship, was killed in a crash at Monza along with 15 spectators. Hill's consistent point-scoring throughout the season, including multiple second and third-place finishes, was enough to secure the title. He became the first American to win the Formula 1 World Championship.",
    "citationUrl": "https://en.wikipedia.org/wiki/1961_Formula_One_World_Championship",
    "citationTitle": "Wikipedia: 1961 Formula One World Championship"
  },
  {
    "id": "ad7ab489-928f-42ad-942d-b12b4979ac0d",
    "text": "What revolutionary aerodynamic concept did the Lotus 78 introduce to Formula 1 in 1977?",
    "options": [
      "Ground effect",
      "Active suspension",
      "Blown diffuser",
      "F-duct system"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Lotus 78 introduced ground effect aerodynamics, using shaped underbody tunnels to create downforce.",
    "detailedExplanation": "The Lotus 78, designed by Colin Chapman and introduced in 1977, pioneered the use of ground effect aerodynamics in Formula 1. The car featured specially shaped sidepods and underbody tunnels that accelerated airflow beneath the car, creating a low-pressure area that sucked the car to the track surface. This generated enormous amounts of downforce without the drag penalty of traditional wings. The concept was so effective that it dominated F1 until ground effect cars were banned in 1983 for safety reasons, as the sudden loss of downforce could cause catastrophic accidents.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lotus_78",
    "citationTitle": "Wikipedia: Lotus 78"
  }
]