[
  {
    "id": "e143bf30-85df-4d02-b3d2-b2170e2a8743",
    "text": "Which author became the first person to decline the Nobel Prize in Literature in 1964?",
    "options": [
      "Jean-Paul Sartre",
      "Albert Camus",
      "Samuel Beckett",
      "Pablo Neruda"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Jean-Paul Sartre declined the Nobel Prize in Literature in 1964 to maintain his independence as a writer.",
    "detailedExplanation": "French philosopher and writer Jean-Paul Sartre was awarded the Nobel Prize in Literature in 1964 'for his work which, rich in ideas and filled with the spirit of freedom and the quest for truth, has exerted a far-reaching influence on our age.' However, he became the first person to voluntarily decline the prize, stating that he wanted to maintain his independence and avoid being associated with any institutional or political influences that might affect his writing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Paul_Sartre",
    "citationTitle": "Wikipedia: Jean-Paul Sartre"
  },
  {
    "id": "453ade61-a033-4cbc-847a-9706056f4ee0",
    "text": "Who was the first woman to win the Nobel Prize in Literature?",
    "options": [
      "Virginia Woolf",
      "Selma Lagerlöf",
      "Pearl S. Buck",
      "Toni Morrison"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Swedish author Selma Lagerlöf became the first woman to win the Nobel Prize in Literature in 1909.",
    "detailedExplanation": "Selma Lagerlöf, a Swedish author, made history in 1909 when she became the first woman to be awarded the Nobel Prize in Literature. She was recognized 'in appreciation of the lofty idealism, vivid imagination and spiritual perception that characterize her writings.' Lagerlöf was known for her novels and short stories, including 'The Wonderful Adventures of Nils,' which became a classic of children's literature worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Selma_Lagerl%C3%B6f",
    "citationTitle": "Wikipedia: Selma Lagerlöf"
  },
  {
    "id": "16a8ebf7-951d-479a-88fb-b056b119bc17",
    "text": "In which year was the Nobel Prize in Literature first awarded?",
    "options": [
      "1895",
      "1900",
      "1901",
      "1905"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Nobel Prize in Literature was first awarded in 1901, along with the other original Nobel Prizes.",
    "detailedExplanation": "The Nobel Prize in Literature was first awarded in 1901, the same year as the other original Nobel Prizes (Physics, Chemistry, Physiology or Medicine, and Peace). The first recipient was French poet Sully Prudhomme, who was awarded the prize 'in special recognition of his poetic composition, which gives evidence of lofty idealism, artistic perfection and a rare combination of the qualities of both heart and intellect.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "db220f80-de16-49f6-bba3-c128d01466ac",
    "text": "Which author won the Nobel Prize in Literature twice?",
    "options": [
      "William Faulkner",
      "Ernest Hemingway",
      "Winston Churchill",
      "No one has won twice"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "No author has ever won the Nobel Prize in Literature twice; it is awarded only once to each recipient.",
    "detailedExplanation": "Unlike some other Nobel Prizes where individuals have won multiple times (such as Marie Curie winning in both Physics and Chemistry), no author has ever been awarded the Nobel Prize in Literature twice. The Swedish Academy awards the prize to each recipient only once in their lifetime. While some authors like William Faulkner and Ernest Hemingway were certainly prolific and influential enough to potentially merit multiple awards, the tradition and rules of the prize limit each person to a single award.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "a7bbb304-07f4-4bc5-a6b8-2126f174a222",
    "text": "Who is the youngest person ever to win the Nobel Prize in Literature?",
    "options": [
      "Rudyard Kipling",
      "Albert Camus",
      "Toni Morrison",
      "Bob Dylan"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Rudyard Kipling won the Nobel Prize in Literature in 1907 at age 41, making him the youngest recipient.",
    "detailedExplanation": "Rudyard Kipling remains the youngest winner of the Nobel Prize in Literature, receiving the award in 1907 at the age of 41. The British author was recognized 'in consideration of the power of observation, originality of imagination, virility of ideas and remarkable talent for narration which characterize the creations of this world-famous author.' Kipling was known for works such as 'The Jungle Book,' 'Kim,' and poems like 'If—' and 'Gunga Din.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Rudyard_Kipling",
    "citationTitle": "Wikipedia: Rudyard Kipling"
  },
  {
    "id": "7b1dfa99-f5c2-44e3-8756-5dd8315f8ac0",
    "text": "Which organization awards the Nobel Prize in Literature?",
    "options": [
      "Norwegian Nobel Committee",
      "Royal Swedish Academy of Sciences",
      "Swedish Academy",
      "Nobel Foundation"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Swedish Academy is responsible for selecting and awarding the Nobel Prize in Literature.",
    "detailedExplanation": "The Swedish Academy, founded in 1786, is the institution responsible for awarding the Nobel Prize in Literature. Located in Stockholm, Sweden, the Academy consists of 18 members who are elected for life. They review nominations and select the laureate each year based on the criterion established in Alfred Nobel's will: the person who 'shall have produced in the field of literature the most outstanding work in an ideal direction.' This is different from other Nobel Prizes, which are awarded by different Swedish and Norwegian institutions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Swedish_Academy",
    "citationTitle": "Wikipedia: Swedish Academy"
  },
  {
    "id": "ce9bc418-548f-43cf-94ae-90af1271d1a5",
    "text": "Who was the first American to win the Nobel Prize in Literature?",
    "options": [
      "Mark Twain",
      "Sinclair Lewis",
      "Eugene O'Neill",
      "Ernest Hemingway"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Sinclair Lewis became the first American to win the Nobel Prize in Literature in 1930.",
    "detailedExplanation": "Sinclair Lewis was awarded the Nobel Prize in Literature in 1930, becoming the first American to receive this honor. He was recognized 'for his vigorous and graphic art of description and his ability to create, with wit and humor, new types of characters.' Lewis was known for novels such as 'Main Street,' 'Babbitt,' and 'Arrowsmith,' which provided satirical portrayals of American middle-class life and values in the early 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sinclair_Lewis",
    "citationTitle": "Wikipedia: Sinclair Lewis"
  },
  {
    "id": "11e6a609-c7bf-4fa4-a631-7c5f5e9aefc0",
    "text": "In which years was the Nobel Prize in Literature NOT awarded during the 20th century?",
    "options": [
      "1914, 1918, 1935, 1940-1943",
      "1917, 1920, 1939-1945",
      "1914-1918, 1939-1945",
      "1940-1943 only"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Nobel Prize in Literature was not awarded in 1914, 1918, 1935, and 1940-1943 due to world wars and other circumstances.",
    "detailedExplanation": "The Nobel Prize in Literature has been withheld several times throughout its history, primarily during periods of global conflict. In the 20th century, the prize was not awarded in 1914 and 1918 (during World War I), in 1935 (no suitable candidate was found), and from 1940-1943 (during World War II). These gaps in awarding reflect the disruption caused by global conflicts and the difficulty of maintaining normal academic and cultural activities during wartime periods.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "0e90417c-e1d7-4f22-a1cb-091a12f29b9a",
    "text": "Which country has produced the most Nobel Prize in Literature winners?",
    "options": [
      "United States",
      "France",
      "United Kingdom",
      "Germany"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "France has produced the most Nobel Literature laureates with 15 winners.",
    "detailedExplanation": "France leads all countries in Nobel Prize in Literature winners with 15 laureates, including famous authors like André Gide, Albert Camus, and Jean-Paul Sartre. The United States follows with 12 winners, then the United Kingdom with 11. This reflects France's significant literary tradition and cultural influence on world literature throughout the 19th and 20th centuries.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Nobel_Prize_in_Literature_winners",
    "citationTitle": "Wikipedia: List of Nobel Prize in Literature winners"
  },
  {
    "id": "15ed9eec-9b8e-485c-ac7f-a0bc4118113b",
    "text": "What is the monetary value of the Nobel Prize in Literature as of 2023?",
    "options": [
      "5 million Swedish kronor",
      "8 million Swedish kronor",
      "11 million Swedish kronor",
      "15 million Swedish kronor"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Nobel Prize comes with 11 million Swedish kronor (approximately $1 million USD).",
    "detailedExplanation": "Since 2020, each Nobel Prize has been worth 11 million Swedish kronor, which is approximately $1 million USD depending on exchange rates. This represents an increase from 10 million kronor in previous years. The prize money comes from the original bequest of Alfred Nobel and the investment returns on the Nobel Foundation's funds. Winners also receive a gold medal and a diploma.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize",
    "citationTitle": "Wikipedia: Nobel Prize"
  },
  {
    "id": "6ea0d628-dbcc-4820-a4df-f70e53b5305c",
    "text": "Which author won the Nobel Prize in Literature in 2016 and was initially controversial for being primarily known as a musician?",
    "options": [
      "Leonard Cohen",
      "Bob Dylan",
      "Paul Simon",
      "Joni Mitchell"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Bob Dylan won the 2016 Nobel Prize in Literature for his poetic expressions within the American song tradition.",
    "detailedExplanation": "Bob Dylan's selection for the 2016 Nobel Prize in Literature was initially controversial because he was primarily known as a singer-songwriter rather than a traditional author. The Swedish Academy honored him 'for having created new poetic expressions within the great American song tradition.' Dylan initially remained silent about the award and didn't attend the ceremony, though he eventually accepted it and delivered his required lecture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bob_Dylan",
    "citationTitle": "Wikipedia: Bob Dylan"
  },
  {
    "id": "b7ae0a40-4151-4133-a4be-d7c78db8a151",
    "text": "In which city is the Nobel Prize in Literature traditionally awarded?",
    "options": [
      "Oslo",
      "Copenhagen",
      "Stockholm",
      "Helsinki"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Nobel Prize in Literature is awarded in Stockholm, Sweden.",
    "detailedExplanation": "All Nobel Prizes except the Peace Prize are awarded in Stockholm, Sweden, following the will of Alfred Nobel. The ceremony takes place annually on December 10th, the anniversary of Nobel's death, at the Stockholm Concert Hall. The Swedish Academy, which selects the Literature winner, is also based in Stockholm. Only the Nobel Peace Prize is awarded in Oslo, Norway.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_ceremony",
    "citationTitle": "Wikipedia: Nobel Prize ceremony"
  },
  {
    "id": "f69288cb-1403-40ea-aa46-8b9985c8ef9f",
    "text": "Which Japanese author became the first from Japan to win the Nobel Prize in Literature?",
    "options": [
      "Haruki Murakami",
      "Kenzaburō Ōe",
      "Yasunari Kawabata",
      "Yukio Mishima"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Yasunari Kawabata won in 1968, becoming Japan's first Nobel Literature laureate.",
    "detailedExplanation": "Yasunari Kawabata won the Nobel Prize in Literature in 1968, making him the first Japanese author to receive this honor. He was recognized 'for his narrative mastery, which with great sensibility expresses the essence of the Japanese mind.' Kawabata was known for works like 'Snow Country' and 'The Sound of the Mountain.' Kenzaburō Ōe would later become Japan's second Literature Nobel winner in 1994.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yasunari_Kawabata",
    "citationTitle": "Wikipedia: Yasunari Kawabata"
  },
  {
    "id": "3e482ca6-5761-4434-9d98-3d59852d5cb7",
    "text": "How many people can share the Nobel Prize in Literature in a single year?",
    "options": [
      "Only one person",
      "Up to two people",
      "Up to three people",
      "Up to four people"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Nobel Prize in Literature can only be awarded to one person per year.",
    "detailedExplanation": "Unlike some other Nobel Prizes which can be shared by up to three recipients, the Nobel Prize in Literature is awarded to only one person each year. This reflects the individual nature of literary achievement and authorship. The prize recognizes a single author's entire body of work or outstanding contribution to literature, making it inherently personal and individual rather than collaborative.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "a16fa5af-c895-4bab-a82a-19bfcd3fa662",
    "text": "Which author wrote 'One Hundred Years of Solitude' and won the Nobel Prize in Literature in 1982?",
    "options": [
      "Mario Vargas Llosa",
      "Gabriel García Márquez",
      "Pablo Neruda",
      "Octavio Paz"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Gabriel García Márquez won the 1982 Nobel Prize and wrote the masterpiece 'One Hundred Years of Solitude.'",
    "detailedExplanation": "Gabriel García Márquez, the Colombian author, won the Nobel Prize in Literature in 1982 for his novels and short stories, particularly for pioneering magical realism. His most famous work, 'One Hundred Years of Solitude,' is considered one of the most significant novels of the 20th century. The Swedish Academy praised him for his 'novels and short stories, in which the fantastic and the realistic are combined in a richly composed world of imagination.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Gabriel_Garc%C3%ADa_M%C3%A1rquez",
    "citationTitle": "Wikipedia: Gabriel García Márquez"
  },
  {
    "id": "26ed22a5-9dc7-4c48-8848-8526239fbc02",
    "text": "What happens if a Nobel Prize in Literature winner dies before receiving the prize?",
    "options": [
      "The prize is cancelled for that year",
      "It goes to the runner-up",
      "The family can still accept it",
      "A new winner is chosen"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "If a laureate dies after the announcement but before the ceremony, the family can accept the prize posthumously.",
    "detailedExplanation": "According to Nobel Prize rules established in 1974, if a laureate dies after the prize has been announced but before the award ceremony, the prize can still be awarded posthumously and accepted by their family. However, if a candidate dies before the announcement, they cannot be considered for the prize. This rule ensures that those who have been officially recognized can still receive their honor even if they pass away in the months between announcement and ceremony.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize",
    "citationTitle": "Wikipedia: Nobel Prize"
  },
  {
    "id": "6750e020-5813-4e8a-8788-4a616d71177b",
    "text": "Which author won the Nobel Prize in Literature in 2020 while living as a relative unknown, surprising the literary world?",
    "options": [
      "Louise Glück",
      "Olga Tokarczuk",
      "Peter Handke",
      "Kazuo Ishiguro"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Louise Glück won in 2020, surprising many as she was relatively unknown outside poetry circles.",
    "detailedExplanation": "American poet Louise Glück was awarded the 2020 Nobel Prize in Literature 'for her unmistakable poetic voice that with austere beauty makes individual existence universal.' Her selection surprised many in the literary world, as she was not widely known outside of poetry circles and academic settings. Glück's work is characterized by its stark, personal style and exploration of themes like trauma, desire, and nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Louise_Gl%C3%BCck",
    "citationTitle": "Wikipedia: Louise Glück"
  },
  {
    "id": "d4802b05-4d9e-4a8c-a5fe-d208c17bea8c",
    "text": "Which Nobel Prize in Literature winner is famous for the quote 'The Nobel Prize is run by a self-perpetuating clique of Swedes'?",
    "options": [
      "Doris Lessing",
      "V.S. Naipaul",
      "Harold Pinter",
      "José Saramago"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Doris Lessing made this critical comment about the Swedish Academy after winning in 2007.",
    "detailedExplanation": "British author Doris Lessing, who won the Nobel Prize in Literature in 2007, was known for her outspoken criticism of the Swedish Academy's selection process. She famously described the Nobel Prize as being 'run by a self-perpetuating clique of Swedes,' highlighting concerns about the insular nature of the selection committee. Despite her criticism, she accepted the prize, which recognized her as 'that epicist of the female experience, who with scepticism, fire and visionary power has subjected a divided civilisation to scrutiny.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Doris_Lessing",
    "citationTitle": "Wikipedia: Doris Lessing"
  },
  {
    "id": "a2f4fe9a-b6e3-4db4-baf8-a5d444ce43e1",
    "text": "Which Nobel Prize in Literature winner created the detective character Commissario Brunetti?",
    "options": [
      "Henning Mankell",
      "Donna Leon",
      "Stieg Larsson",
      "None of these authors won the Nobel Prize"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "None of these crime writers have won the Nobel Prize in Literature, despite their popularity.",
    "detailedExplanation": "This is a trick question highlighting how the Nobel Prize in Literature has historically overlooked popular genre fiction. Donna Leon created Commissario Brunetti, Henning Mankell created Kurt Wallander, and Stieg larsson wrote the Millennium series, but none have won the Nobel Prize. The Swedish Academy has traditionally favored literary fiction over genre works like crime novels, though this has been a subject of ongoing debate about whether popular literature deserves recognition alongside more experimental or 'literary' works.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "20214f6e-4707-41b0-83ba-cf0dacd05ddc",
    "text": "In what month is the Nobel Prize in Literature typically announced each year?",
    "options": [
      "September",
      "October",
      "November",
      "December"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Nobel Prize in Literature is typically announced in October each year.",
    "detailedExplanation": "The Nobel Prize in Literature is traditionally announced in October each year by the Swedish Academy in Stockholm. The announcement usually takes place in the second week of October, though the exact date can vary. This timing allows for the formal award ceremony to take place on December 10th, which is the anniversary of Alfred Nobel's death. The October announcement gives the winner and the Nobel Foundation time to prepare for the prestigious ceremony and associated events in Stockholm.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  }
]