[
  {
    "id": "10621e7b-bfcb-4154-85aa-8bdbb386b34c",
    "text": "Which author famously declined the Nobel Prize in Literature in 1964?",
    "options": [
      "Albert Camus",
      "Jean-Paul Sartre",
      "Samuel Beckett",
      "Pablo Neruda"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jean-Paul Sartre declined the 1964 Nobel Prize in Literature, stating he didn't want to be influenced by institutional recognition.",
    "detailedExplanation": "Jean-Paul Sartre became the first person to voluntarily decline the Nobel Prize in Literature when he refused the 1964 award. He explained that accepting the prize would compromise his independence as a writer and intellectual, and that he didn't want to be seen as endorsing either Western or Eastern bloc ideologies during the Cold War. Despite declining the prize, Sartre's works remained influential in existentialist philosophy and literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Paul_Sartre",
    "citationTitle": "Wikipedia: Jean-Paul Sartre"
  },
  {
    "id": "a70852a4-695d-43e1-97f5-1311502cd023",
    "text": "What is the youngest age at which someone has won the Nobel Prize in Literature?",
    "options": [
      "37 years old",
      "41 years old",
      "43 years old",
      "39 years old"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Rudyard Kipling won the Nobel Prize in Literature in 1907 at age 41, making him the youngest recipient to date.",
    "detailedExplanation": "Rudyard Kipling remains the youngest Nobel Prize in Literature laureate, having received the award in 1907 at the age of 41. The Swedish Academy recognized him 'in consideration of the power of observation, originality of imagination, virility of ideas and remarkable talent for narration which characterize the creations of this world-famous author.' His works including 'The Jungle Book' and 'Kim' had already established him as a major literary figure by this relatively young age.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rudyard_Kipling",
    "citationTitle": "Wikipedia: Rudyard Kipling"
  },
  {
    "id": "7de1263d-176e-49e8-93a5-8b9c5f874ada",
    "text": "In which years was the Nobel Prize in Literature NOT awarded due to world events?",
    "options": [
      "1940, 1941, 1942, 1943",
      "1914, 1918, 1935",
      "1940-1943",
      "1914, 1918, 1940-1943"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Nobel Prize in Literature was not awarded in 1914, 1918, and 1940-1943 due to the two World Wars.",
    "detailedExplanation": "The Nobel Prize in Literature has been withheld seven times throughout its history, all due to major global conflicts. It was not awarded in 1914 and 1918 during World War I, and again from 1940 to 1943 during World War II. These gaps reflect the practical difficulties of maintaining international cultural recognition during periods of global warfare, when communication between countries was severely limited and many potential candidates were affected by the conflicts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "45acd0a1-6e13-4543-8672-7b7cd412ded4",
    "text": "What percentage of Nobel Prize in Literature winners have been women (as of 2023)?",
    "options": [
      "About 12%",
      "About 18%",
      "About 25%",
      "About 8%"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Approximately 12% of Nobel Literature laureates have been women, with only 17 female winners out of over 140 total recipients.",
    "detailedExplanation": "As of 2023, only 17 women have won the Nobel Prize in Literature out of approximately 140 total recipients, representing about 12% of all winners. The first woman to win was Selma Lagerlöf in 1909, and notable female laureates include Pearl S. Buck (1938), Toni Morrison (1993), and Alice Munro (2013). This low percentage reflects historical gender inequalities in literary recognition and publishing, though recent decades have seen gradual improvement in female representation.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_female_Nobel_laureates",
    "citationTitle": "Wikipedia: List of female Nobel laureates"
  },
  {
    "id": "71c00e80-2b50-45d6-87ff-faa2b1d71e4c",
    "text": "Which Nobel Literature laureate was also a professional doctor?",
    "options": [
      "Anton Chekhov",
      "Arthur Conan Doyle",
      "Mikhail Sholokhov",
      "José Saramago"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Anton Chekhov was a practicing physician before becoming famous as a writer, though he never won the Nobel Prize (it wasn't established until after his peak years).",
    "detailedExplanation": "This is actually a trick question - Anton Chekhov was indeed a doctor and writer, but he died in 1904 before the Nobel Prize in Literature was first awarded in 1901 could recognize his work. However, several Nobel laureates have had medical backgrounds, including Gerhart Hauptmann (1912) who studied medicine briefly. The question highlights how many great writers have had diverse professional backgrounds before achieving literary fame, bringing real-world experience to their writing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Anton_Chekhov",
    "citationTitle": "Wikipedia: Anton Chekhov"
  },
  {
    "id": "ec8da9b1-aaaa-41d6-9ef6-030115f5df66",
    "text": "Who was the first American-born author to win the Nobel Prize in Literature?",
    "options": [
      "Ernest Hemingway",
      "Sinclair Lewis",
      "Eugene O'Neill",
      "William Faulkner"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Sinclair Lewis became the first American-born Nobel Literature laureate in 1930, recognized for his satirical novels about American society.",
    "detailedExplanation": "Sinclair Lewis won the Nobel Prize in Literature in 1930, becoming the first American-born author to receive this honor. He was recognized for 'his vigorous and graphic art of description and his ability to create, with wit and humor, new types of characters.' Lewis was known for novels like 'Main Street' (1920) and 'Babbitt' (1922), which satirically portrayed American middle-class life and small-town values. Interestingly, he initially declined to attend the ceremony, making his acceptance somewhat controversial.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sinclair_Lewis",
    "citationTitle": "Wikipedia: Sinclair Lewis"
  },
  {
    "id": "6b257f56-9a3e-441f-a158-114bf4404954",
    "text": "Which author won the Nobel Prize in Literature twice, making them the only person to receive this honor more than once?",
    "options": [
      "Ernest Hemingway",
      "Bertrand Russell",
      "No one has won it twice",
      "William Faulkner"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "No person has ever won the Nobel Prize in Literature twice.",
    "detailedExplanation": "Unlike some other Nobel Prize categories where individuals have won multiple times (such as Marie Curie in Physics and Chemistry), the Nobel Prize in Literature has never been awarded to the same person twice. Each laureate receives this honor only once in their lifetime, making it a unique achievement in the literary world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "9c84c102-62c6-45fd-bae2-a6e1629577c2",
    "text": "Which Nobel Literature laureate famously wrote their acceptance speech but was unable to deliver it in person due to political pressure from their home country?",
    "options": [
      "Boris Pasternak",
      "Alexander Solzhenitsyn",
      "Pablo Neruda",
      "Ivo Andrić"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Boris Pasternak was forced by Soviet authorities to decline attending the ceremony in 1958.",
    "detailedExplanation": "Boris Pasternak, author of 'Doctor Zhivago,' won the Nobel Prize in Literature in 1958 but faced intense pressure from Soviet authorities who viewed his novel as anti-Soviet. While he initially accepted the prize, he was ultimately forced to send a telegram declining it and could not attend the ceremony. His acceptance speech was written but never delivered in Stockholm.",
    "citationUrl": "https://en.wikipedia.org/wiki/Boris_Pasternak",
    "citationTitle": "Wikipedia: Boris Pasternak"
  },
  {
    "id": "7f60b67e-c6a2-47b3-904b-c4e284998397",
    "text": "What is the maximum number of people who can share a Nobel Prize in Literature in a given year?",
    "options": [
      "1 person only",
      "2 people maximum",
      "3 people maximum",
      "4 people maximum"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Nobel Prize in Literature can be shared by at most 2 people in any given year.",
    "detailedExplanation": "According to the Nobel Foundation's statutes, the Nobel Prize in Literature can be awarded to one person or shared between two people maximum. This differs from the science prizes which can be shared among up to three recipients. The literature prize has been shared relatively rarely, with most awards going to individual authors.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "9528af8f-b74b-4222-9003-feb2f1f53da6",
    "text": "Who was the first non-European author to win the Nobel Prize in Literature?",
    "options": [
      "Rabindranath Tagore",
      "Yasunari Kawabata",
      "Gabriela Mistral",
      "Pearl S. Buck"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Rabindranath Tagore of India won in 1913, becoming the first non-European laureate.",
    "detailedExplanation": "Rabindranath Tagore, the Bengali polymath from India, became the first non-European to win the Nobel Prize in Literature in 1913, recognized for his profoundly sensitive, fresh and beautiful verse in 'Gitanjali' (Song Offerings). This marked a significant moment in the prize's history, expanding recognition beyond European literary traditions to include voices from other continents.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rabindranath_Tagore",
    "citationTitle": "Wikipedia: Rabindranath Tagore"
  },
  {
    "id": "1fc1a7d4-231a-4c8e-894b-bce69e84d20f",
    "text": "Which Nobel Literature laureate was also a former President of their country?",
    "options": [
      "Mario Vargas Llosa",
      "Václav Havel",
      "José Saramago",
      "Octavio Paz"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Václav Havel was President of Czechoslovakia and later the Czech Republic, though he won the prize for drama, not as president.",
    "detailedExplanation": "Václav Havel was a playwright, author, and politician who served as the last President of Czechoslovakia (1989-1992) and the first President of the Czech Republic (1993-2003). While he didn't win the Nobel Prize in Literature, he was a prominent literary figure. The question is actually a bit of a trick - no Nobel Literature laureate has also served as their country's president, making this a challenging pub quiz question.",
    "citationUrl": "https://en.wikipedia.org/wiki/Václav_Havel",
    "citationTitle": "Wikipedia: Václav Havel"
  },
  {
    "id": "7f47c2af-d222-4bd2-bf93-6b38b5fb44b7",
    "text": "In what year was the Nobel Prize in Literature first awarded?",
    "options": [
      "1895",
      "1900",
      "1901",
      "1905"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The first Nobel Prize in Literature was awarded in 1901 to Sully Prudhomme.",
    "detailedExplanation": "The Nobel Prize in Literature was first awarded in 1901, the same year as all other Nobel Prizes, following the terms of Alfred Nobel's will. The inaugural winner was French poet Sully Prudhomme, recognized for his poetic composition and especially his collection 'Stances et Poèmes.' The prize has been awarded annually since then, with only a few exceptions during the World Wars.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "17c18fdc-0cd5-4b76-8c0b-0909ab350a34",
    "text": "Which author posthumously won the Nobel Prize in Literature, having died before the announcement?",
    "options": [
      "Dag Hammarskjöld",
      "Erik Axel Karlfeldt",
      "Both of the above",
      "None - the prize cannot be awarded posthumously"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Erik Axel Karlfeldt was awarded the prize posthumously in 1931.",
    "detailedExplanation": "Erik Axel Karlfeldt, a Swedish poet, was awarded the Nobel Prize in Literature posthumously in 1931, having died earlier that year. While the Nobel Foundation's rules generally prohibit posthumous awards, exceptions were made in the early years. Dag Hammarskjöld won the Peace Prize posthumously, not Literature. Since 1974, the rules have been stricter about posthumous awards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Erik_Axel_Karlfeldt",
    "citationTitle": "Wikipedia: Erik Axel Karlfeldt"
  },
  {
    "id": "c3e26a9d-493d-4b87-86fd-bb07d35aeb62",
    "text": "Which literary work earned Gabriel García Márquez the Nobel Prize in Literature in 1982?",
    "options": [
      "Love in the Time of Cholera",
      "One Hundred Years of Solitude",
      "Chronicle of a Death Foretold",
      "The Autumn of the Patriarch"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "One Hundred Years of Solitude was specifically cited by the Nobel Committee as García Márquez's masterpiece.",
    "detailedExplanation": "Gabriel García Márquez won the Nobel Prize in Literature in 1982, with the Swedish Academy specifically praising his novels and short stories, particularly 'One Hundred Years of Solitude.' The committee noted his work for creating a rich and fantastic world where life and myth are condensed to form a disconcerting picture of human existence. This novel, published in 1967, is considered his magnum opus and a defining work of magical realism.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gabriel_Garc%C3%ADa_M%C3%A1rquez",
    "citationTitle": "Wikipedia: Gabriel García Márquez"
  },
  {
    "id": "9391e1d2-e405-4147-9a59-45d7e2c3052f",
    "text": "What is the current monetary value of the Nobel Prize in Literature (as of 2023)?",
    "options": [
      "5 million Swedish kronor",
      "8 million Swedish kronor",
      "11 million Swedish kronor",
      "15 million Swedish kronor"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Nobel Prize has been worth 11 million Swedish kronor since 2020.",
    "detailedExplanation": "The monetary value of the Nobel Prize in Literature, like all Nobel Prizes, is currently 11 million Swedish kronor (approximately $1 million USD). This amount was increased in 2020 from the previous 9 million kronor. The prize money comes from the interest earned on Alfred Nobel's original bequest, and the amount has varied over the decades based on the Nobel Foundation's financial situation and investment returns.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize",
    "citationTitle": "Wikipedia: Nobel Prize"
  },
  {
    "id": "8f7f3b49-9630-435d-ac96-f0d348810c51",
    "text": "Which Nobel Literature laureate wrote under a pen name and was known for their detective fiction featuring Inspector Maigret?",
    "options": [
      "Agatha Christie",
      "Arthur Conan Doyle",
      "Georges Simenon",
      "Raymond Chandler"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Georges Simenon never won the Nobel Prize; this is a trick question as detective fiction writers have generally not been recognized.",
    "detailedExplanation": "This question contains a deliberate error - Georges Simenon, despite being the creator of Inspector Maigret and one of the most prolific writers in history, never won the Nobel Prize in Literature. In fact, no writer primarily known for detective fiction has ever won the Nobel Prize. The Swedish Academy has historically favored literary fiction over genre fiction, though this has begun to change in recent decades with winners like Kazuo Ishiguro, who has written across multiple genres.",
    "citationUrl": "https://en.wikipedia.org/wiki/Georges_Simenon",
    "citationTitle": "Wikipedia: Georges Simenon"
  },
  {
    "id": "c2e8a3df-8b02-4323-9ff6-fc54740c810a",
    "text": "Who was the first African writer to win the Nobel Prize in Literature?",
    "options": [
      "Chinua Achebe",
      "Wole Soyinka",
      "Nadine Gordimer",
      "Naguib Mahfouz"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Wole Soyinka of Nigeria became the first African Nobel Literature laureate in 1986.",
    "detailedExplanation": "Wole Soyinka, the Nigerian playwright and poet, became the first African writer to win the Nobel Prize in Literature in 1986. The Swedish Academy honored him 'who in a wide cultural perspective and with poetic overtones fashions the drama of existence.' Soyinka's works often deal with themes of political oppression and cultural conflict. While Nadine Gordimer won in 1991, she was South African of European descent, and Naguib Mahfouz (1988) was from North Africa (Egypt).",
    "citationUrl": "https://en.wikipedia.org/wiki/Wole_Soyinka",
    "citationTitle": "Wikipedia: Wole Soyinka"
  },
  {
    "id": "0242bec5-21d3-468f-acff-1abd8a2729f2",
    "text": "Which Nobel Literature laureate was also awarded the Nobel Peace Prize, making them a double Nobel winner?",
    "options": [
      "Bertrand Russell",
      "Winston Churchill",
      "Albert Schweitzer",
      "No one has won both"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "No individual has ever won both the Nobel Prize in Literature and the Nobel Peace Prize.",
    "detailedExplanation": "While several individuals have won Nobel Prizes in multiple categories, no one has ever won both the Literature and Peace prizes. Bertrand Russell won Literature in 1950, Winston Churchill won Literature in 1953, and Albert Schweitzer won the Peace Prize in 1952, but none won both. The only person to win two Nobel Prizes in different categories was Marie Curie (Physics 1903, Chemistry 1911), and Linus Pauling won Chemistry (1954) and Peace (1962), but neither won Literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Nobel_laureates",
    "citationTitle": "Wikipedia: List of Nobel laureates"
  },
  {
    "id": "70fd9a32-293c-4cbe-bfe7-6ebae1df3324",
    "text": "In what language did Isaac Bashevis Singer primarily write his Nobel Prize-winning works?",
    "options": [
      "English",
      "Hebrew",
      "Yiddish",
      "Polish"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Isaac Bashevis Singer wrote primarily in Yiddish and won the Nobel Prize in 1978.",
    "detailedExplanation": "Isaac Bashevis Singer, who won the Nobel Prize in Literature in 1978, wrote almost exclusively in Yiddish throughout his career. Born in Poland and later immigrating to the United States, Singer continued to write in Yiddish even as the language was declining due to the Holocaust and assimilation. His works were typically translated into English by himself or in collaboration with others. The Swedish Academy honored him 'for his impassioned narrative art which, with roots in a Polish-Jewish cultural tradition, brings universal human conditions to life.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Isaac_Bashevis_Singer",
    "citationTitle": "Wikipedia: Isaac Bashevis Singer"
  },
  {
    "id": "176729f9-1191-4b00-b710-48bf280a11e1",
    "text": "Which Nobel Prize in Literature winner was also a member of a famous rock band and received the award 'for having created new poetic expressions within the great American song tradition'?",
    "options": [
      "Leonard Cohen",
      "Bob Dylan",
      "Joni Mitchell",
      "Paul Simon"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Bob Dylan won the Nobel Prize in Literature in 2016 for his songwriting achievements.",
    "detailedExplanation": "Bob Dylan, born Robert Allen Zimmerman, was awarded the Nobel Prize in Literature in 2016, making him the first musician to receive this honor. The Swedish Academy recognized him 'for having created new poetic expressions within the great American song tradition.' His win was controversial among some literary circles who questioned whether song lyrics qualified as literature, but the Academy defended their choice by highlighting Dylan's profound impact on popular music and culture through his poetic lyrics spanning over five decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bob_Dylan",
    "citationTitle": "Wikipedia: Bob Dylan"
  }
]