[
  {
    "id": "87348537-f229-4c47-be76-4a5ce63bf468",
    "text": "Which reality TV show features contestants living in a house while being watched 24/7 by cameras?",
    "options": [
      "Big Brother",
      "The Amazing Race",
      "Project Runway",
      "Top Chef"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Big Brother is famous for its 24/7 surveillance format with houseguests living together.",
    "detailedExplanation": "Big Brother, which premiered in 1999, is a reality competition show where contestants live in a specially constructed house that is isolated from the outside world. The house is fitted with dozens of cameras and microphones to record the contestants' every move 24 hours a day. The show's format involves contestants being gradually eliminated through voting until one winner remains to claim a cash prize.",
    "citationUrl": "https://en.wikipedia.org/wiki/Big_Brother_(franchise)",
    "citationTitle": "Wikipedia: Big Brother (franchise)"
  },
  {
    "id": "9f438a8c-1b50-4b32-9bf4-cbaacc94bdfe",
    "text": "On which reality show would you hear the phrase 'You're fired!'?",
    "options": [
      "Hell's Kitchen",
      "The Apprentice",
      "Survivor",
      "The Bachelor"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Donald Trump's catchphrase 'You're fired!' became iconic on The Apprentice.",
    "detailedExplanation": "The Apprentice, which first aired in 2004, featured business magnate Donald Trump as the host who would eliminate contestants with his signature phrase 'You're fired!' The show involved candidates competing in business-related challenges for the opportunity to work for Trump's organization. The catchphrase became so associated with Trump and the show that it entered popular culture and was widely recognized even by those who didn't watch the program.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Apprentice_(American_TV_series)",
    "citationTitle": "Wikipedia: The Apprentice (American TV series)"
  },
  {
    "id": "0709b2fe-fd70-402d-b08d-e7272c00780f",
    "text": "Which reality show involves contestants competing in cooking challenges judged by Gordon Ramsay?",
    "options": [
      "Top Chef",
      "MasterChef",
      "Chopped",
      "Iron Chef"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "MasterChef is the reality cooking show hosted and judged by Gordon Ramsay.",
    "detailedExplanation": "MasterChef, in its various international versions, features celebrity chef Gordon Ramsay as the main judge and mentor. The show brings together amateur home cooks who compete in various culinary challenges, from mystery box challenges to pressure tests. Ramsay is known for his passionate and sometimes fiery personality on the show, providing both harsh criticism and encouraging guidance to help contestants improve their cooking skills throughout the competition.",
    "citationUrl": "https://en.wikipedia.org/wiki/MasterChef",
    "citationTitle": "Wikipedia: MasterChef"
  },
  {
    "id": "fef99762-6c17-4288-8996-426a62465094",
    "text": "What is the name of the island where contestants compete on the reality show Survivor?",
    "options": [
      "Tribal Island",
      "Immunity Island",
      "The location varies each season",
      "Survivor Island"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Survivor films in different exotic locations around the world each season.",
    "detailedExplanation": "Survivor doesn't have one fixed location but instead films in different exotic locations around the world for each season. Over the years, the show has been filmed in places like Borneo, the Australian Outback, Africa, Thailand, Pearl Islands, Fiji, and many other tropical locations. This variety in settings keeps the show fresh and presents contestants with different environmental challenges, from dealing with monsoons to desert conditions, making each season unique in terms of the survival aspect.",
    "citationUrl": "https://en.wikipedia.org/wiki/Survivor_(American_TV_series)",
    "citationTitle": "Wikipedia: Survivor (American TV series)"
  },
  {
    "id": "f8f9985c-ec8c-4e5a-90c1-9591c951d8af",
    "text": "Which family became famous for their reality show 'Keeping Up with the Kardashians'?",
    "options": [
      "The Osbournes",
      "The Kardashian-Jenners",
      "The Hiltons",
      "The Trumps"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Kardashian-Jenner family starred in the long-running reality series.",
    "detailedExplanation": "Keeping Up with the Kardashians premiered in 2007 and followed the personal and professional lives of the Kardashian-Jenner family, including Kim, Kourtney, Khloé Kardashian, and their half-sisters Kendall and Kylie Jenner, along with their mother Kris Jenner. The show ran for 20 seasons and ended in 2021, making it one of the longest-running reality series in television history. The family's fame from the show launched numerous business ventures, spin-offs, and made them major influences in popular culture and social media.",
    "citationUrl": "https://en.wikipedia.org/wiki/Keeping_Up_with_the_Kardashians",
    "citationTitle": "Wikipedia: Keeping Up with the Kardashians"
  },
  {
    "id": "8e1be86c-e43c-4fcd-b738-0a29f4a2e7b7",
    "text": "What do contestants receive roses on in the reality dating show The Bachelor?",
    "options": [
      "During group dates",
      "At rose ceremonies",
      "When they arrive at the mansion",
      "On their birthday"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Rose ceremonies are the elimination format where roses are given to continuing contestants.",
    "detailedExplanation": "In The Bachelor, rose ceremonies are the dramatic elimination rounds where the bachelor gives roses to the contestants he wants to continue dating. Those who don't receive a rose must leave the show immediately. These ceremonies typically take place at the end of each episode and are often the most tense moments, as contestants wait to see if they'll be chosen to stay. The rose has become an iconic symbol of the franchise, representing the bachelor's romantic interest and the contestant's continuation in the competition.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bachelor_(American_TV_series)",
    "citationTitle": "Wikipedia: The Bachelor (American TV series)"
  },
  {
    "id": "dcbfd401-2c84-4fe8-95f1-80e20648fffb",
    "text": "Which reality competition show features teams racing around the world?",
    "options": [
      "The Amazing Race",
      "Around the World in 80 Ways",
      "Global Challenge",
      "World Race"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Amazing Race is the reality show where teams compete in a race around the world.",
    "detailedExplanation": "The Amazing Race, which premiered in 2001, is an adventure reality competition where teams of two race around the world, visiting multiple countries and completing various physical and mental challenges at each destination. Teams must navigate using different modes of transportation including planes, trains, automobiles, and boats. The first team to reach the final destination wins a substantial cash prize. The show has won multiple Emmy Awards and has been praised for showcasing different cultures and locations around the globe.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Amazing_Race_(American_TV_series)",
    "citationTitle": "Wikipedia: The Amazing Race (American TV series)"
  },
  {
    "id": "23694e6d-3e7e-4e10-a389-5bf770346ec7",
    "text": "What is the prize typically awarded to the winner of reality competition shows like Survivor or Big Brother?",
    "options": [
      "A new car",
      "$1 million",
      "A vacation package",
      "$100,000"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Most major reality competition shows award $1 million to their winners.",
    "detailedExplanation": "The standard grand prize for winning major reality competition shows like Survivor, Big Brother, and The Amazing Race is typically $1 million (though this is usually before taxes). This substantial prize money became the standard for reality competitions as it creates high stakes that make for compelling television. The million-dollar prize was popularized by the success of Who Wants to Be a Millionaire and became the benchmark for reality TV competitions, representing a life-changing amount that motivates contestants to endure the challenges and strategic gameplay required to win.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reality_television",
    "citationTitle": "Wikipedia: Reality television"
  },
  {
    "id": "b0c0bb30-05e3-4b32-b26b-ccb032303ac0",
    "text": "Which reality TV show features contestants living in a house while being filmed 24/7?",
    "options": [
      "The Bachelor",
      "Big Brother",
      "Survivor",
      "The Amazing Race"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Big Brother is the reality show where contestants live in a house under constant surveillance.",
    "detailedExplanation": "Big Brother is a reality television franchise that originated in the Netherlands in 1997. The show features a group of contestants, called 'housemates,' who live together in a specially constructed house that is isolated from the outside world. They are continuously monitored by television cameras and personal audio microphones throughout their stay. The format has been adapted in numerous countries worldwide and remains one of the most recognizable reality TV concepts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Big_Brother_(franchise)",
    "citationTitle": "Wikipedia: Big Brother (franchise)"
  },
  {
    "id": "5e997336-f6d1-4cac-8120-3f7dfcda0114",
    "text": "Which reality dating show features a single person choosing from multiple suitors with a final rose ceremony?",
    "options": [
      "Love Island",
      "The Bachelor",
      "Married at First Sight",
      "90 Day Fiancé"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Bachelor features a single man choosing from multiple women contestants, culminating in a rose ceremony.",
    "detailedExplanation": "The Bachelor is an American reality television dating game show that debuted in 2002. The show features a single bachelor who starts with a pool of romantic interests from whom he is expected to select a wife. During the course of the season, the bachelor eliminates candidates through rose ceremonies, where he gives roses to the women he wants to continue dating. The show concludes with the bachelor proposing to his final choice. The franchise also includes The Bachelorette, which reverses the gender roles.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bachelor_(American_TV_series)",
    "citationTitle": "Wikipedia: The Bachelor (American TV series)"
  },
  {
    "id": "314327a3-d568-4a91-a8ae-a71b563a5a9b",
    "text": "What is the name of the island where contestants compete on the reality show 'Survivor'?",
    "options": [
      "The location changes each season",
      "Survivor Island",
      "Tribal Island",
      "Immunity Island"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Survivor films in different exotic locations around the world each season, not on a single named island.",
    "detailedExplanation": "Survivor is an American reality competition show that has been filming in various locations around the world since 2000. The show has been filmed in numerous countries including Malaysia, Australia, Kenya, Nicaragua, Philippines, Fiji, and many others. Each season takes place in a different exotic location, often on islands or coastal areas. The specific location becomes part of the season's title, such as 'Survivor: Borneo' or 'Survivor: Fiji.' The changing locations are a key feature of the show's format.",
    "citationUrl": "https://en.wikipedia.org/wiki/Survivor_(American_TV_series)",
    "citationTitle": "Wikipedia: Survivor (American TV series)"
  },
  {
    "id": "976c5c3b-5014-4073-a947-cf57b6fab954",
    "text": "Which celebrity chef is known for his fiery temper on reality cooking shows?",
    "options": [
      "Jamie Oliver",
      "Gordon Ramsay",
      "Emeril Lagasse",
      "Bobby Flay"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Gordon Ramsay is famous for his explosive temper and harsh criticism on shows like Hell's Kitchen.",
    "detailedExplanation": "Gordon Ramsay is a British celebrity chef who has become internationally famous for his fiery personality and harsh criticism on reality cooking shows. He is best known for hosting Hell's Kitchen, where he is notorious for his intense outbursts and colorful language when contestants make mistakes. Ramsay has also hosted other reality shows including MasterChef, Kitchen Nightmares, and Hotel Hell. Despite his tough exterior on television, he is a highly accomplished chef with multiple Michelin stars and successful restaurants worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gordon_Ramsay",
    "citationTitle": "Wikipedia: Gordon Ramsay"
  },
  {
    "id": "a7d2d87b-a8e6-4e4a-bcf3-3f223e712340",
    "text": "What does the winner of 'American Idol' traditionally receive as their prize?",
    "options": [
      "A million dollars in cash",
      "A recording contract",
      "A new car",
      "A college scholarship"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "American Idol winners traditionally receive a recording contract to launch their music career.",
    "detailedExplanation": "American Idol is a singing competition reality show that premiered in 2002. The winner of each season traditionally receives a recording contract with a major record label, which was originally with 19 Recordings/RCA Records. While the specific details of contracts have varied over the years, the primary prize has consistently been the opportunity to launch a professional recording career. Many winners have gone on to achieve significant commercial success, including Kelly Clarkson, Carrie Underwood, and Jennifer Hudson.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_Idol",
    "citationTitle": "Wikipedia: American Idol"
  },
  {
    "id": "c0bb44d1-570a-4cde-b56b-08cc236f76db",
    "text": "Which family became famous for their reality show that premiered in 2007?",
    "options": [
      "The Osbournes",
      "The Kardashians",
      "The Hiltons",
      "The Trumps"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Kardashians became famous through 'Keeping Up with the Kardashians,' which premiered in 2007.",
    "detailedExplanation": "'Keeping Up with the Kardashians' premiered on October 14, 2007, on the E! network and ran for 20 seasons until 2021. The show followed the personal and professional lives of the Kardashian-Jenner family, including Kim, Kourtney, Khloé Kardashian, and their mother Kris Jenner, along with Kylie and Kendall Jenner. The show became a cultural phenomenon and launched the family members into international celebrity status, leading to numerous business ventures, endorsements, and spin-off shows.",
    "citationUrl": "https://en.wikipedia.org/wiki/Keeping_Up_with_the_Kardashians",
    "citationTitle": "Wikipedia: Keeping Up with the Kardashians"
  },
  {
    "id": "3c99b5d1-1a1c-4340-9c79-4ff891be1548",
    "text": "What is the grand prize typically awarded to the winner of 'Survivor'?",
    "options": [
      "$500,000",
      "$1 million",
      "$250,000",
      "$2 million"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The winner of Survivor receives $1 million as the grand prize.",
    "detailedExplanation": "Survivor awards its winner a grand prize of $1 million (before taxes). This prize amount has remained consistent throughout most of the show's run since it premiered in 2000. In addition to the million-dollar prize for the winner, the runner-up typically receives $100,000, and the third-place finalist receives $85,000. There are also smaller prizes given throughout the season for individual challenge wins. The million-dollar prize has become one of the most recognizable prize amounts in reality television.",
    "citationUrl": "https://en.wikipedia.org/wiki/Survivor_(American_TV_series)",
    "citationTitle": "Wikipedia: Survivor (American TV series)"
  },
  {
    "id": "7c519597-8eed-40a4-896f-197a47b77f13",
    "text": "Which reality TV show features contestants living in a house while being constantly filmed and voting each other out?",
    "options": [
      "The Bachelor",
      "Big Brother",
      "Survivor",
      "The Amazing Race"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Big Brother is the reality show where contestants live in a house under constant surveillance.",
    "detailedExplanation": "Big Brother is a reality television franchise that originated in the Netherlands in 1999. The show features contestants, called 'housemates' or 'houseguests,' living together in a specially constructed house that is isolated from the outside world. They are continuously monitored by television cameras and personal audio microphones. Throughout the series, housemates are evicted by public vote or by their fellow housemates until only one remains to win the cash prize.",
    "citationUrl": "https://en.wikipedia.org/wiki/Big_Brother_(franchise)",
    "citationTitle": "Wikipedia: Big Brother (franchise)"
  },
  {
    "id": "292894f9-e5f5-47c6-b1e1-8e27dcf7b97a",
    "text": "On which reality show would you hear the famous phrase 'You're fired!'?",
    "options": [
      "Hell's Kitchen",
      "The Apprentice",
      "Project Runway",
      "Top Chef"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Donald Trump's catchphrase 'You're fired!' became iconic on The Apprentice.",
    "detailedExplanation": "The Apprentice is a reality television program that judges the business skills of a group of contestants. The show was originally hosted by Donald Trump from 2004 to 2015, who became famous for his dramatic delivery of the elimination phrase 'You're fired!' at the end of each episode. The phrase became so associated with Trump and the show that it entered popular culture and was widely recognized even by people who didn't watch the program regularly.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Apprentice_(American_TV_series)",
    "citationTitle": "Wikipedia: The Apprentice (American TV series)"
  },
  {
    "id": "a4b12386-826a-4152-8b19-5ff396c675b7",
    "text": "Which reality dating show features one person choosing from multiple suitors and giving out roses?",
    "options": [
      "Love Island",
      "The Bachelor",
      "Married at First Sight",
      "90 Day Fiancé"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Bachelor is famous for its rose ceremony format where contestants receive roses to stay on the show.",
    "detailedExplanation": "The Bachelor is an American dating and relationship reality television series that premiered in 2002. The show revolves around a single bachelor who starts with a pool of romantic interests from whom he is expected to select a wife through an elimination process. The signature element of the show is the rose ceremony, where the bachelor gives roses to the women he wants to keep on the show, while those who don't receive roses are eliminated. The phrase 'Will you accept this rose?' has become synonymous with the franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bachelor_(American_TV_series)",
    "citationTitle": "Wikipedia: The Bachelor (American TV series)"
  },
  {
    "id": "6d751b2a-c531-4d14-844a-78364e80026c",
    "text": "Which reality show features teams racing around the world completing challenges for a million-dollar prize?",
    "options": [
      "Survivor",
      "The Amazing Race",
      "Big Brother",
      "Fear Factor"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Amazing Race involves teams traveling globally and completing challenges in different countries.",
    "detailedExplanation": "The Amazing Race is an American reality competition show in which teams of two race around the world in competition with other teams. The race is divided into legs, with each leg requiring teams to deduce clues, navigate themselves in foreign areas, interact with locals, and perform physical and mental challenges that often highlight aspects of a country's culture, history, or geography. Teams are progressively eliminated at the end of most legs, while the first team to arrive at the final destination wins the grand prize of one million dollars.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Amazing_Race_(American_TV_series)",
    "citationTitle": "Wikipedia: The Amazing Race (American TV series)"
  },
  {
    "id": "b75c9f71-71d7-41fc-9391-d42ea71a9e9a",
    "text": "Which chef is known for shouting 'Get out!' and 'This is raw!' on his reality cooking show?",
    "options": [
      "Jamie Oliver",
      "Gordon Ramsay",
      "Emeril Lagasse",
      "Bobby Flay"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Gordon Ramsay is famous for his explosive temper and harsh critiques on Hell's Kitchen and other cooking shows.",
    "detailedExplanation": "Gordon Ramsay is a British celebrity chef who became internationally famous not just for his cooking skills, but for his fiery temperament and sharp tongue on various reality cooking shows, particularly Hell's Kitchen. His explosive reactions to poor cooking, including shouting phrases like 'Get out!', 'This is raw!', and various profanities, have become his trademark. Despite his harsh demeanor on competitive cooking shows, Ramsay has built a global restaurant empire and has appeared on numerous television programs, making him one of the most recognizable celebrity chefs in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gordon_Ramsay",
    "citationTitle": "Wikipedia: Gordon Ramsay"
  }
]