[
  {
    "id": "ed6d22b7-11c7-4950-af8a-2bcf04a672be",
    "text": "Which reality TV show holds the Guinness World Record for the most watched reality TV series finale of all time?",
    "options": [
      "American Idol",
      "The Bachelor",
      "Survivor",
      "Big Brother"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "American Idol's Season 1 finale in 2002 drew 22.8 million viewers.",
    "detailedExplanation": "American Idol's first season finale on September 4, 2002, where Kelly Clarkson was crowned the winner over Justin Guarini, attracted 22.8 million viewers and holds the Guinness World Record for the most watched reality TV series finale. This milestone established American Idol as a cultural phenomenon and paved the way for the explosion of reality television in the 2000s.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_Idol_(season_1)",
    "citationTitle": "Wikipedia: American Idol (season 1)"
  },
  {
    "id": "4a1cffc9-33d9-4638-b2b1-4f7ee688b3d3",
    "text": "In the original Dutch version of 'Big Brother,' what was the name of the first winner who took home the prize in 1999?",
    "options": [
      "Bart Spring in 't Veld",
      "Willem Held",
      "Sabine Wendel",
      "Ruud Gullit"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bart Spring in 't Veld won the first ever Big Brother competition in the Netherlands.",
    "detailedExplanation": "Bart Spring in 't Veld became the first person in history to win Big Brother when he claimed victory in the original Dutch version that aired from September to December 1999. The show was created by John de Mol and launched the global Big Brother franchise that would eventually span over 60 countries. Bart's victory marked the beginning of a new era in reality television.",
    "citationUrl": "https://en.wikipedia.org/wiki/Big_Brother_(Dutch_season_1)",
    "citationTitle": "Wikipedia: Big Brother (Dutch season 1)"
  },
  {
    "id": "c6a4c3eb-9fac-4c2c-82b4-3f70d5b6a010",
    "text": "Which reality show contestant became infamous for the 'Purple Wedding' episode and later admitted the entire romance was fake?",
    "options": [
      "Vienna Girardi",
      "Courtney Robertson",
      "Bentley Williams",
      "Jake Pavelka"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bentley Williams from The Bachelorette admitted his feelings for Ashley Hebert were fabricated.",
    "detailedExplanation": "Bentley Williams appeared on Ashley Hebert's season of The Bachelorette in 2011 and became one of reality TV's most notorious villains. He was caught on camera making disparaging comments about Ashley while pretending to be interested in her. The 'Purple Wedding' reference relates to his manipulative behavior throughout the season. Williams later admitted in interviews that his romantic interest was entirely fabricated for television drama.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bachelorette_(season_7)",
    "citationTitle": "Wikipedia: The Bachelorette (season 7)"
  },
  {
    "id": "f3939900-2d3f-4a82-bdb8-fd67314ae90c",
    "text": "What was the original cash prize amount for the winner of the first season of 'Survivor' in 2000?",
    "options": [
      "$500,000",
      "$750,000",
      "$1,000,000",
      "$1,500,000"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The winner of Survivor has always received $1,000,000 since the first season.",
    "detailedExplanation": "When Survivor: Borneo premiered in 2000, the show offered an unprecedented $1,000,000 prize to the sole survivor, which was won by Richard Hatch. This massive prize amount was revolutionary for reality television at the time and helped establish Survivor as must-see TV. The million-dollar prize has remained constant throughout the show's run, though it's worth noting that after taxes, winners typically receive around $600,000.",
    "citationUrl": "https://en.wikipedia.org/wiki/Survivor:_Borneo",
    "citationTitle": "Wikipedia: Survivor: Borneo"
  },
  {
    "id": "852d5f4e-fb11-4ad1-8658-d2a99d87bd47",
    "text": "Which reality TV show was created by Mike Fleiss and premiered as a response to the dating show 'The Bachelor'?",
    "options": [
      "Love Island",
      "The Bachelorette",
      "Temptation Island",
      "Dating in the Dark"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Bachelorette was created by Mike Fleiss as a spin-off of The Bachelor he also created.",
    "detailedExplanation": "Mike Fleiss created The Bachelorette in 2003 as a spin-off of The Bachelor, which he had also created in 2002. The show was developed partly as a response to criticism that The Bachelor was male-centric, giving women the power to choose from multiple male suitors. The first Bachelorette was Trista Rehn, a runner-up from the first season of The Bachelor, and her season proved the concept could work with reversed gender roles.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bachelorette",
    "citationTitle": "Wikipedia: The Bachelorette"
  },
  {
    "id": "b5fa4b4f-3450-4246-b621-3b6197f0c495",
    "text": "In 'The Real World: San Francisco' (1994), which cast member became the first openly HIV-positive person featured as a main character on reality TV?",
    "options": [
      "Pedro Zamora",
      "Dan Renzi",
      "Puck Rainey",
      "Rachel Campos"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Pedro Zamora was an HIV-positive AIDS educator who appeared on The Real World: San Francisco.",
    "detailedExplanation": "Pedro Zamora appeared on The Real World: San Francisco in 1994 and became groundbreaking television as the first openly HIV-positive main character on reality TV. Zamora was an AIDS educator and activist who used his platform on the show to educate viewers about HIV/AIDS and safe sex practices. His relationship with Sean Sasser was also notable as one of the first same-sex relationships prominently featured on reality television. Zamora died from AIDS-related complications just hours after the season finale aired.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pedro_Zamora",
    "citationTitle": "Wikipedia: Pedro Zamora"
  },
  {
    "id": "ff77e0ae-ca87-40b5-bc4e-74bb0084d61c",
    "text": "Which reality competition show was originally created by Eli Holzman and is known for featuring aspiring entrepreneurs pitching to wealthy investors?",
    "options": [
      "The Profit",
      "Shark Tank",
      "The Apprentice",
      "Dragons' Den"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Shark Tank was created by Eli Holzman, based on the Japanese format 'Dragons' Den.'",
    "detailedExplanation": "Shark Tank was created by Eli Holzman and premiered on ABC in 2009. The show is based on the international format 'Dragons' Den,' which originated in Japan as 'Money no Tora' (Tigers of Money). In Shark Tank, entrepreneurs pitch their business ideas to a panel of wealthy investors (the 'sharks') hoping to secure investment deals. The show has become hugely successful and has spawned numerous international versions while launching many successful businesses.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shark_Tank",
    "citationTitle": "Wikipedia: Shark Tank"
  },
  {
    "id": "718585a4-2db9-4bd4-a300-8eee014bb812",
    "text": "What was the name of the controversial reality show that aired for only one season in 2003, where participants competed for a multi-million dollar inheritance from a deceased millionaire?",
    "options": [
      "The Will",
      "Family Fortune",
      "Inheritance Island",
      "The Estate"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Will was a short-lived CBS reality show about competing for an inheritance.",
    "detailedExplanation": "The Will was a reality television series that aired on CBS for one season in 2005 (not 2003 as stated in the question). The show featured potential heirs competing for the inheritance of Bill Long, a recently deceased Arizona rancher worth over $2 million. Contestants had to prove themselves worthy through various challenges and family evaluations. The show was controversial due to its premise of essentially competing over a dead person's money and was criticized for being in poor taste, leading to its quick cancellation.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Will_(TV_series)",
    "citationTitle": "Wikipedia: The Will (TV series)"
  },
  {
    "id": "e5757869-ed5e-411f-acc4-d0233a6ea49a",
    "text": "Which reality TV show holds the Guinness World Record for the longest-running reality TV series, having premiered in 1999?",
    "options": [
      "Survivor",
      "Big Brother (Netherlands)",
      "The Real World",
      "Expedition Robinson"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Big Brother (Netherlands) holds the Guinness World Record as the longest-running reality TV series.",
    "detailedExplanation": "Big Brother Netherlands, which premiered on September 16, 1999, holds the official Guinness World Record for the longest-running reality television series. The show was created by John de Mol and has spawned numerous international versions. While other reality shows like The Real World started earlier, Big Brother Netherlands has maintained continuous production longer than any other reality series, making it the official record holder according to Guinness World Records.",
    "citationUrl": "https://en.wikipedia.org/wiki/Big_Brother_(Dutch_TV_series)",
    "citationTitle": "Wikipedia: Big Brother (Dutch TV series)"
  },
  {
    "id": "6a01c4e2-7a05-4774-91d0-6565dcc80395",
    "text": "In what year did 'An American Family' air on PBS, widely considered the first reality TV show?",
    "options": [
      "1971",
      "1973",
      "1975",
      "1969"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'An American Family' aired on PBS in 1973 and is widely considered the first reality television show.",
    "detailedExplanation": "'An American Family' premiered on PBS on January 11, 1973, and ran for 12 episodes. The show followed the Loud family of Santa Barbara, California, for seven months in 1971, with cameras capturing their daily lives. The series is widely credited as being the first reality television show, predating modern reality TV by decades. The show was groundbreaking for its intimate portrayal of family life, including the parents' divorce and their son Lance's openly gay lifestyle, making it a cultural milestone in television history.",
    "citationUrl": "https://en.wikipedia.org/wiki/An_American_Family",
    "citationTitle": "Wikipedia: An American Family"
  },
  {
    "id": "732edea0-230d-4cc2-b033-8b91c0109b5d",
    "text": "Which contestant from 'The Bachelor' season 11 went on to become the host of 'The Bachelorette' and other reality shows?",
    "options": [
      "Kaitlyn Bristowe",
      "JoJo Fletcher",
      "Tayshia Adams",
      "None - no contestant became a host"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "No contestant from The Bachelor season 11 became a host of reality shows; the season featured Brad Womack.",
    "detailedExplanation": "The Bachelor season 11 aired in 2007 and featured Brad Womack, who famously rejected both finalists, DeAnna Pappas and Jenni Croft. Neither of these contestants went on to host reality shows. DeAnna Pappas did become The Bachelorette in season 4, but she was not a host of the show. The question is designed to be tricky, as many Bachelor/Bachelorette contestants have gone on to host various shows, but none specifically from season 11. Kaitlyn Bristowe, JoJo Fletcher, and Tayshia Adams were all from different seasons and different circumstances regarding hosting roles.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bachelor_(American_season_11)",
    "citationTitle": "Wikipedia: The Bachelor (American season 11)"
  },
  {
    "id": "3e7c5071-5215-4203-a7fd-307a14ca471a",
    "text": "What was the original name of the reality show that became 'Keeping Up with the Kardashians' during development?",
    "options": [
      "Life with the Kardashians",
      "The Kardashian Family",
      "Krazy Kardashians",
      "Living Kardashian"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The show was originally titled 'Krazy Kardashians' during development before becoming 'Keeping Up with the Kardashians'.",
    "detailedExplanation": "During the development phase of what would become one of reality TV's most successful franchises, the show was originally titled 'Krazy Kardashians.' The name was later changed to 'Keeping Up with the Kardashians' before it premiered on E! in October 2007. The show was created by Ryan Seacrest Productions and Bunim/Murray Productions, and ran for 20 seasons until 2021. The original title reflected the chaotic nature of the family's lives that producers wanted to capture, but the final title better conveyed the ongoing, documentary-style approach the show would take.",
    "citationUrl": "https://en.wikipedia.org/wiki/Keeping_Up_with_the_Kardashians",
    "citationTitle": "Wikipedia: Keeping Up with the Kardashians"
  },
  {
    "id": "6d33966a-bda2-4cdb-b020-2e9a526ee01e",
    "text": "Which reality competition show was the first to offer a $1 million prize to its winner?",
    "options": [
      "Survivor",
      "Who Wants to Be a Millionaire",
      "The Price is Right",
      "Fear Factor"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Survivor was the first reality competition show to offer a $1 million prize when it premiered in 2000.",
    "detailedExplanation": "When Survivor premiered on CBS on May 31, 2000, it became the first reality competition show to offer a $1 million grand prize to its winner. The show, adapted from the Swedish series 'Expedition Robinson,' revolutionized reality television by combining survival elements with strategic gameplay for an unprecedented prize amount. While 'Who Wants to Be a Millionaire' offered the same amount, it was a game show rather than a reality competition. Survivor's million-dollar prize became a standard for major reality competitions that followed, establishing the benchmark for high-stakes reality TV.",
    "citationUrl": "https://en.wikipedia.org/wiki/Survivor_(American_TV_series)",
    "citationTitle": "Wikipedia: Survivor (American TV series)"
  },
  {
    "id": "d41cd627-0368-48dd-aba1-96a61146d821",
    "text": "What is the maximum number of days contestants have stayed in the Big Brother house in a single US season?",
    "options": [
      "99 days",
      "102 days",
      "85 days",
      "92 days"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The longest Big Brother US season lasted 102 days during Big Brother 6 in 2005.",
    "detailedExplanation": "Big Brother 6, which aired in 2005, holds the record for the longest Big Brother US season at 102 days. The season ran from July 7 to September 20, 2005, and was notable for its intense rivalries and strategic gameplay. The season featured the famous 'Sovereign Six' alliance and included memorable contestants like Janelle Pierzina and Rachel Plencner. Most Big Brother US seasons typically run between 70-100 days, but season 6's extended length was due to scheduling and the compelling drama that kept audiences engaged throughout the extended run.",
    "citationUrl": "https://en.wikipedia.org/wiki/Big_Brother_6_(American_season)",
    "citationTitle": "Wikipedia: Big Brother 6 (American season)"
  },
  {
    "id": "2a2d84be-d29c-4a0a-80bb-9415d7aa7cd9",
    "text": "Which country's version of 'The Voice' was the original format that all international versions are based on?",
    "options": [
      "United States",
      "Netherlands",
      "United Kingdom",
      "Australia"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Voice originated in the Netherlands as 'The Voice of Holland' in 2010, created by John de Mol.",
    "detailedExplanation": "The Voice format was originally created in the Netherlands by John de Mol and Roel van Velzen, premiering as 'The Voice of Holland' on RTL 4 on September 17, 2010. The show's innovative concept of blind auditions with coaches turning their chairs became an instant success. The format was then licensed internationally, with the American version premiering on NBC in 2011. John de Mol, who also created Big Brother, designed The Voice's unique format that has since been adapted in over 180 countries, making it one of the most successful reality TV format exports from the Netherlands.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Voice_of_Holland",
    "citationTitle": "Wikipedia: The Voice of Holland"
  },
  {
    "id": "bbe090c3-de31-4d6c-8ff7-cacc4fb67046",
    "text": "What was the prize for the winner of the first season of 'RuPaul's Drag Race' in 2009?",
    "options": [
      "$100,000 and a crown",
      "$25,000 and a photo shoot",
      "$50,000 and a car",
      "$75,000 and makeup products"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The first season winner received $25,000 cash and a photo shoot with renowned photographer Mike Ruiz.",
    "detailedExplanation": "When RuPaul's Drag Race premiered on Logo TV in 2009, the prize package for the first winner, BeBe Zahara Benet, was significantly smaller than current seasons. The winner received $25,000 in cash and a photo shoot with Mike Ruiz, along with the title of 'America's Next Drag Superstar.' The show's budget and prizes have grown substantially over the years, with current winners receiving $100,000 and additional prizes. The first season had only 9 episodes and 9 contestants, a much smaller scale compared to later seasons, but it established the foundation for what would become a global phenomenon and multiple Emmy Award-winning series.",
    "citationUrl": "https://en.wikipedia.org/wiki/RuPaul%27s_Drag_Race_(season_1)",
    "citationTitle": "Wikipedia: RuPaul's Drag Race (season 1)"
  },
  {
    "id": "48363145-0c77-4567-ae55-b092529d3248",
    "text": "Which reality TV show holds the Guinness World Record for the most Emmy nominations for a reality series in a single year?",
    "options": [
      "RuPaul's Drag Race",
      "The Amazing Race",
      "Top Chef",
      "Project Runway"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "RuPaul's Drag Race received 12 Emmy nominations in 2021, setting the record.",
    "detailedExplanation": "RuPaul's Drag Race made Emmy history in 2021 when it received 12 nominations across various categories, breaking the record for most Emmy nominations for a reality series in a single year. The show has been a consistent Emmy contender since moving to VH1, winning multiple Outstanding Competition Program awards and individual recognition for RuPaul as host.",
    "citationUrl": "https://en.wikipedia.org/wiki/RuPaul%27s_Drag_Race",
    "citationTitle": "Wikipedia: RuPaul's Drag Race"
  },
  {
    "id": "89655602-f114-4446-bb6a-ba875a5f63dc",
    "text": "What was the name of the controversial dating reality show that aired for only one season in 2003, where a woman had to choose between 20 millionaire bachelors, only to discover in the finale that none were actually millionaires?",
    "options": [
      "Joe Millionaire",
      "Average Joe",
      "For Love or Money",
      "The Millionaire Matchmaker"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Joe Millionaire featured construction worker Evan Marriott posing as a millionaire to 20 women.",
    "detailedExplanation": "Joe Millionaire was a reality dating show that aired on Fox in 2003, featuring construction worker Evan Marriott who was presented to 20 female contestants as a multi-millionaire. The twist was revealed in the finale that he was not wealthy at all. Despite the deception, the winning contestant Zora Andrich chose to stay with him, and they shared a $1 million prize. The show was hugely popular but controversial due to its premise of deception.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Millionaire",
    "citationTitle": "Wikipedia: Joe Millionaire"
  },
  {
    "id": "fe92cc84-9073-4793-b393-b2bc43b7eb6a",
    "text": "Which reality TV personality became the youngest self-made billionaire in history according to Forbes, largely due to their cosmetics company?",
    "options": [
      "Kim Kardashian",
      "Kylie Jenner",
      "Rihanna",
      "Jessica Simpson"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Kylie Jenner was named the youngest self-made billionaire by Forbes in 2019 due to Kylie Cosmetics.",
    "detailedExplanation": "Kylie Jenner, who rose to fame on the reality show 'Keeping Up with the Kardashians,' was declared the world's youngest self-made billionaire by Forbes in March 2019 at age 21. Her wealth was attributed primarily to her cosmetics company, Kylie Cosmetics, which she launched in 2015. However, Forbes later revised their assessment in 2020, questioning the 'self-made' designation and the actual valuation of her company.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kylie_Jenner",
    "citationTitle": "Wikipedia: Kylie Jenner"
  },
  {
    "id": "42a4a1c9-2b82-4322-b854-e1fedf605dd5",
    "text": "What was unique about the third season of 'The Bachelor' in 2003 that had never happened before in the franchise?",
    "options": [
      "The bachelor was a widower",
      "The bachelor chose neither finalist",
      "It was filmed entirely outside the US",
      "The bachelor was over 40 years old"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Andrew Firestone chose neither Jen Schefft nor Kirsten Buschbacher in the finale, breaking franchise precedent.",
    "detailedExplanation": "The third season of The Bachelor, featuring Andrew Firestone, made franchise history when he became the first bachelor to not propose to either of his final two contestants. In the finale, instead of choosing between Jen Schefft and Kirsten Buschbacher with a proposal, Firestone simply asked Schefft to continue dating him without an engagement. This unprecedented decision shocked viewers and established that bachelors weren't obligated to propose, setting a precedent for future seasons.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Bachelor_(American_season_3)",
    "citationTitle": "Wikipedia: The Bachelor (American season 3)"
  }
]