[
  {
    "id": "92253819-53c1-4b01-93e6-4d398c4a7bdc",
    "text": "In which romantic comedy does Hugh Grant play a bumbling British bookstore owner who falls for a famous American actress?",
    "options": [
      "Four Weddings and a Funeral",
      "Notting Hill",
      "Love Actually",
      "Bridget Jones's Diary"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Notting Hill features Hugh Grant as William Thacker, who owns a travel bookstore in London.",
    "detailedExplanation": "Notting Hill (1999) stars Hugh Grant as William Thacker, a mild-mannered owner of a travel bookstore in the London neighborhood of Notting Hill, who meets and falls in love with Anna Scott, a famous American movie star played by Julia Roberts. The film was written by Richard Curtis and became one of the highest-grossing British films of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Notting_Hill_(film)",
    "citationTitle": "Wikipedia: Notting Hill (film)"
  },
  {
    "id": "2e251e83-4c26-4ce2-af40-c64da6463b14",
    "text": "What object does Meg Ryan's character famously fake in the deli scene from 'When Harry Met Sally'?",
    "options": [
      "A sneeze",
      "An orgasm",
      "A phone call",
      "A heart attack"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The famous deli scene features Sally demonstrating how women can fake orgasms.",
    "detailedExplanation": "In one of the most iconic scenes in romantic comedy history, Meg Ryan's character Sally Albright demonstrates to Billy Crystal's Harry Burns how easily women can fake orgasms by loudly faking one in the middle of Katz's Delicatessen in New York City. The scene ends with another customer telling the waitress, 'I'll have what she's having.' This line was actually delivered by director Rob Reiner's mother, Estelle Reiner.",
    "citationUrl": "https://en.wikipedia.org/wiki/When_Harry_Met_Sally",
    "citationTitle": "Wikipedia: When Harry Met Sally"
  },
  {
    "id": "64826da4-42e6-480f-8ee9-e75d8f501722",
    "text": "In 'The Princess Bride', what is the name of the 'mostly dead' swordsman seeking revenge for his father's murder?",
    "options": [
      "Westley",
      "Inigo Montoya",
      "Fezzik",
      "Prince Humperdinck"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Inigo Montoya is the Spanish swordsman whose father was killed by the six-fingered man.",
    "detailedExplanation": "Inigo Montoya, played by Mandy Patinkin, is the Spanish swordsman in The Princess Bride (1987) who has spent years perfecting his sword fighting skills to avenge his father's death at the hands of Count Rugen, the six-fingered man. His famous line 'Hello, my name is Inigo Montoya. You killed my father. Prepare to die' has become one of the most quoted lines in cinema history.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Princess_Bride_(film)",
    "citationTitle": "Wikipedia: The Princess Bride (film)"
  },
  {
    "id": "ff6b02e3-fa2d-4e62-b278-dad74792c65a",
    "text": "Which romantic comedy features the line 'Nobody puts Baby in a corner'?",
    "options": [
      "Ghost",
      "Dirty Dancing",
      "Pretty Woman",
      "An Officer and a Gentleman"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "This iconic line is spoken by Patrick Swayze's character Johnny Castle in Dirty Dancing.",
    "detailedExplanation": "Dirty Dancing (1987) features Patrick Swayze as Johnny Castle, a dance instructor at a resort in the 1960s, who delivers the famous line 'Nobody puts Baby in a corner' when he rescues Jennifer Grey's character Frances 'Baby' Houseman from sitting alone at a table during the final dance scene. The film became a cultural phenomenon and launched the careers of both lead actors while popularizing dance-focused romantic stories.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dirty_Dancing",
    "citationTitle": "Wikipedia: Dirty Dancing"
  },
  {
    "id": "3fe216d8-ee63-4002-8b98-da99d0acdac8",
    "text": "In 'Sleepless in Seattle', on top of which famous New York landmark do the main characters finally meet?",
    "options": [
      "Statue of Liberty",
      "Brooklyn Bridge",
      "Empire State Building",
      "Central Park"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The climactic meeting takes place on the observation deck of the Empire State Building.",
    "detailedExplanation": "Sleepless in Seattle (1993) builds up to the romantic meeting between Tom Hanks' Sam Baldwin and Meg Ryan's Annie Reed on the observation deck of the Empire State Building on Valentine's Day. This location was chosen as a tribute to the classic 1957 film 'An Affair to Remember,' which the characters reference throughout the movie. The Empire State Building meeting has since become an iconic romantic movie trope.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sleepless_in_Seattle",
    "citationTitle": "Wikipedia: Sleepless in Seattle"
  },
  {
    "id": "d5b842d4-b5fc-4be4-b2bf-2778aa2d9816",
    "text": "What profession does Julia Roberts' character have in 'Pretty Woman'?",
    "options": [
      "Waitress",
      "Shop assistant",
      "Prostitute",
      "Secretary"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Julia Roberts plays Vivian Ward, a prostitute who enters into a business arrangement with a wealthy businessman.",
    "detailedExplanation": "In Pretty Woman (1990), Julia Roberts plays Vivian Ward, a prostitute working on Hollywood Boulevard who is hired by wealthy businessman Edward Lewis (Richard Gere) to accompany him to social events for a week. The film was originally written as a dark drama about prostitution but was transformed into a romantic comedy, becoming one of the highest-grossing romantic comedies of all time and launching Roberts to superstardom.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pretty_Woman",
    "citationTitle": "Wikipedia: Pretty Woman"
  },
  {
    "id": "21ab3f45-dc8d-45e6-9768-730c1ee686a3",
    "text": "Which actress starred opposite Matthew McConaughey in 'How to Lose a Guy in 10 Days'?",
    "options": [
      "Kate Hudson",
      "Jennifer Lopez",
      "Sandra Bullock",
      "Reese Witherspoon"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kate Hudson plays Andie Anderson, a magazine writer trying to drive away a man in 10 days.",
    "detailedExplanation": "How to Lose a Guy in 10 Days (2003) stars Kate Hudson as Andie Anderson, a magazine writer who bets she can make any man fall out of love with her in 10 days, while Matthew McConaughey plays Ben Barry, an advertising executive who bets he can make any woman fall in love with him in the same timeframe. The film was based on a book by Michele Alexander and Jeannie Long and became a box office success despite mixed critical reviews.",
    "citationUrl": "https://en.wikipedia.org/wiki/How_to_Lose_a_Guy_in_10_Days",
    "citationTitle": "Wikipedia: How to Lose a Guy in 10 Days"
  },
  {
    "id": "158627a5-7cff-44e0-b9dd-9ae855821ebc",
    "text": "In '10 Things I Hate About You', which Shakespeare play is the movie loosely based on?",
    "options": [
      "Romeo and Juliet",
      "Much Ado About Nothing",
      "The Taming of the Shrew",
      "A Midsummer Night's Dream"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The film is a modern adaptation of Shakespeare's 'The Taming of the Shrew.'",
    "detailedExplanation": "10 Things I Hate About You (1999) is a loose modern adaptation of William Shakespeare's play 'The Taming of the Shrew,' transposed to a contemporary American high school setting. Julia Stiles plays Kat Stratford (the 'shrew' character), while Heath Ledger plays Patrick Verona, who is paid to court her. The film cleverly incorporates many elements and character parallels from the original play while creating a successful teen romantic comedy that launched several careers.",
    "citationUrl": "https://en.wikipedia.org/wiki/10_Things_I_Hate_About_You",
    "citationTitle": "Wikipedia: 10 Things I Hate About You"
  },
  {
    "id": "f3bd53cc-7397-4e23-89b9-eb219de75da3",
    "text": "Which romantic comedy features Jennifer Aniston and Adam Sandler pretending to be married while on vacation in Hawaii?",
    "options": [
      "Just Go with It",
      "The Wedding Singer",
      "50 First Dates",
      "Blended"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Just Go with It follows Adam Sandler's character who enlists Jennifer Aniston to pose as his soon-to-be ex-wife during a Hawaiian getaway.",
    "detailedExplanation": "Just Go with It is a 2011 romantic comedy where Adam Sandler plays a plastic surgeon who convinces his assistant (Jennifer Aniston) to pose as his estranged wife to cover up a lie he told his much-younger girlfriend. The charade extends to a family vacation in Hawaii where the fake relationships become increasingly complicated before true love prevails.",
    "citationUrl": "https://en.wikipedia.org/wiki/Just_Go_with_It",
    "citationTitle": "Wikipedia: Just Go with It"
  },
  {
    "id": "2fda4e4d-b59a-4d84-b446-2909ee161a23",
    "text": "In 'Clueless', what is the name of Alicia Silverstone's wealthy, fashion-obsessed character?",
    "options": [
      "Brittany",
      "Cher",
      "Amber",
      "Tai"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Cher Horowitz is the main character in Clueless, a popular Beverly Hills teenager who becomes a matchmaker.",
    "detailedExplanation": "Cher Horowitz, played by Alicia Silverstone, is the protagonist of the 1995 romantic comedy Clueless. She's a wealthy, popular high school student in Beverly Hills who lives a privileged lifestyle and becomes involved in matchmaking her friends and teachers. The character is loosely based on Emma Woodhouse from Jane Austen's novel Emma.",
    "citationUrl": "https://en.wikipedia.org/wiki/Clueless_(film)",
    "citationTitle": "Wikipedia: Clueless (film)"
  },
  {
    "id": "8825984c-75ab-4ad4-8c5f-531f0fcda8d5",
    "text": "Which romantic comedy features Sandra Bullock as an FBI agent who goes undercover at a beauty pageant?",
    "options": [
      "The Proposal",
      "Miss Congeniality",
      "Two Weeks Notice",
      "The Heat"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Miss Congeniality stars Sandra Bullock as FBI Special Agent Gracie Hart who goes undercover at the Miss United States beauty pageant.",
    "detailedExplanation": "Miss Congeniality is a 2000 romantic comedy action film where Sandra Bullock plays Gracie Hart, a tomboyish FBI agent who must go undercover as a contestant in the Miss United States beauty pageant to prevent a terrorist attack. The film shows her transformation from a tough agent into a polished beauty queen while she develops romantic feelings for her fellow agent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Miss_Congeniality_(film)",
    "citationTitle": "Wikipedia: Miss Congeniality (film)"
  },
  {
    "id": "ac5d4f37-dee0-4232-9cff-17ffcf7d288f",
    "text": "In 'My Big Fat Greek Wedding', what is the father's supposed cure-all remedy for everything?",
    "options": [
      "Olive oil",
      "Windex",
      "Ouzo",
      "Feta cheese"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Gus Portokalos, the Greek father, believes Windex can cure any ailment and fix any problem.",
    "detailedExplanation": "In My Big Fat Greek Wedding, the character Gus Portokalos (played by Michael Constantine) is obsessed with Windex glass cleaner, which he believes has miraculous healing properties. Throughout the film, he sprays Windex on various ailments and problems, claiming it can cure everything from pimples to psoriasis. This running gag became one of the most memorable aspects of the 2002 romantic comedy.",
    "citationUrl": "https://en.wikipedia.org/wiki/My_Big_Fat_Greek_Wedding",
    "citationTitle": "Wikipedia: My Big Fat Greek Wedding"
  },
  {
    "id": "e6fb5e10-91a5-4940-b968-68df57b385ca",
    "text": "Which 1990s romantic comedy features a weather forecaster who gets stuck reliving the same day over and over?",
    "options": [
      "Groundhog Day",
      "While You Were Sleeping",
      "French Kiss",
      "You've Got Mail"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Groundhog Day stars Bill Murray as a weatherman trapped in a time loop, reliving February 2nd repeatedly.",
    "detailedExplanation": "Groundhog Day is a 1993 romantic comedy fantasy film starring Bill Murray as Phil Connors, an arrogant Pittsburgh TV weatherman who becomes trapped in a supernatural time loop, forcing him to relive Groundhog Day repeatedly until he learns to become a better person and wins the love of his producer Rita, played by Andie MacDowell.",
    "citationUrl": "https://en.wikipedia.org/wiki/Groundhog_Day_(film)",
    "citationTitle": "Wikipedia: Groundhog Day (film)"
  },
  {
    "id": "a3c26e48-17b5-4095-9fa7-0fc3be0ead46",
    "text": "In 'Bridget Jones's Diary', which two actors play the men competing for Bridget's affections?",
    "options": [
      "Colin Firth and Jude Law",
      "Hugh Grant and Colin Firth",
      "Hugh Grant and Jude Law",
      "Colin Firth and Ralph Fiennes"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hugh Grant plays Daniel Cleaver and Colin Firth plays Mark Darcy, both vying for Bridget's love.",
    "detailedExplanation": "In Bridget Jones's Diary (2001), Renée Zellweger's character finds herself torn between two very different men: her charming but unreliable boss Daniel Cleaver (Hugh Grant) and the seemingly arrogant but ultimately decent barrister Mark Darcy (Colin Firth). The love triangle forms the central conflict of this romantic comedy based on Helen Fielding's novel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bridget_Jones%27s_Diary_(film)",
    "citationTitle": "Wikipedia: Bridget Jones's Diary (film)"
  },
  {
    "id": "0717a6f8-5731-4fed-b32c-7aa6084b3cff",
    "text": "Which romantic comedy features Drew Barrymore as a wedding reporter who has 'never been kissed'?",
    "options": [
      "Never Been Kissed",
      "The Wedding Singer",
      "50 First Dates",
      "Ever After"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Never Been Kissed stars Drew Barrymore as Josie Geller, a journalist who goes undercover at a high school.",
    "detailedExplanation": "Never Been Kissed is a 1999 romantic comedy starring Drew Barrymore as Josie Geller, a copy editor at the Chicago Sun-Times who gets her first assignment as an undercover reporter at a local high school. Having been unpopular in her own high school experience, she gets a second chance at teenage life while developing feelings for her English teacher, played by Michael Vartan.",
    "citationUrl": "https://en.wikipedia.org/wiki/Never_Been_Kissed",
    "citationTitle": "Wikipedia: Never Been Kissed"
  },
  {
    "id": "c7a1c4ad-a85d-437d-9453-ea086fdd06b3",
    "text": "In 'Four Weddings and a Funeral', what song does Elton John perform at the funeral?",
    "options": [
      "Your Song",
      "Candle in the Wind",
      "Love Is in the Air",
      "Can You Feel the Love Tonight"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Elton John performs 'Your Song' at Gareth's funeral in the film.",
    "detailedExplanation": "In Four Weddings and a Funeral (1994), Elton John makes a cameo appearance performing his classic song 'Your Song' at the funeral of Gareth, one of the main characters. This emotional scene occurs during the 'funeral' portion of the film's title, providing a touching musical moment during the somber occasion. The song choice was particularly poignant as it's one of Elton John's most beloved romantic ballads.",
    "citationUrl": "https://en.wikipedia.org/wiki/Four_Weddings_and_a_Funeral",
    "citationTitle": "Wikipedia: Four Weddings and a Funeral"
  },
  {
    "id": "2f8fed98-8b6b-4359-bf68-f44c5a6d29af",
    "text": "In which romantic comedy does Tom Hanks play a widowed father who finds love through letters to a radio show host?",
    "options": [
      "You've Got Mail",
      "Sleepless in Seattle",
      "Big",
      "Philadelphia"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tom Hanks plays Sam Baldwin, a widowed father in 'Sleepless in Seattle'.",
    "detailedExplanation": "In 'Sleepless in Seattle' (1993), Tom Hanks plays Sam Baldwin, a recently widowed architect who moves to Seattle with his young son. His son calls a radio talk show on Christmas Eve, leading to Sam sharing his feelings about his late wife on air. This broadcast touches many listeners, including Annie Reed (Meg Ryan) in Baltimore, who becomes enamored with his story and eventually seeks him out.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sleepless_in_Seattle",
    "citationTitle": "Wikipedia: Sleepless in Seattle"
  },
  {
    "id": "148bb219-6993-48e9-92e4-560b136461ff",
    "text": "Which romantic comedy features Reese Witherspoon as a Harvard Law student trying to win back her ex-boyfriend?",
    "options": [
      "Sweet Home Alabama",
      "Legally Blonde",
      "Election",
      "Walk the Line"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Reese Witherspoon plays Elle Woods in 'Legally Blonde', who enrolls at Harvard Law School to win back Warner.",
    "detailedExplanation": "In 'Legally Blonde' (2001), Reese Witherspoon plays Elle Woods, a fashion-obsessed sorority girl who enrolls at Harvard Law School in an attempt to win back her ex-boyfriend Warner Huntington III. Initially motivated by romance, Elle discovers her own legal talents and self-worth, ultimately graduating as class valedictorian and finding success on her own terms while also finding new love.",
    "citationUrl": "https://en.wikipedia.org/wiki/Legally_Blonde",
    "citationTitle": "Wikipedia: Legally Blonde"
  },
  {
    "id": "06bf0ec7-199c-4b1b-b0fc-9d9c124167ed",
    "text": "In 'Love Actually', which British actor plays the Prime Minister who falls for his staff member Natalie?",
    "options": [
      "Colin Firth",
      "Hugh Grant",
      "Liam Neeson",
      "Alan Rickman"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hugh Grant plays the newly elected Prime Minister David who falls for Natalie, played by Martine McCutcheon.",
    "detailedExplanation": "'Love Actually' (2003) features Hugh Grant as David, the newly elected British Prime Minister who develops feelings for Natalie, a member of his household staff played by Martine McCutcheon. Their storyline is one of ten interconnected love stories in the film, culminating in David's famous declaration of love and his awkward dance scene to 'Jump (For My Love)' by The Pointer Sisters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Love_Actually",
    "citationTitle": "Wikipedia: Love Actually"
  },
  {
    "id": "05b5e5b9-3bcd-4663-a550-39b44b4de909",
    "text": "Which romantic comedy features Jennifer Lopez as a wedding planner who falls for the groom of one of her clients?",
    "options": [
      "Maid in Manhattan",
      "The Wedding Planner",
      "Shall We Dance?",
      "Monster-in-Law"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jennifer Lopez stars in 'The Wedding Planner' as Mary Fiore, who falls for Dr. Steve Edison, her client's fiancé.",
    "detailedExplanation": "In 'The Wedding Planner' (2001), Jennifer Lopez plays Mary Fiore, a successful wedding planner in San Francisco who prides herself on creating perfect weddings while neglecting her own love life. She falls for Steve Edison (Matthew McConaughey) after he saves her from a runaway dumpster, only to discover later that he is the groom in the biggest wedding she's ever been hired to plan, creating a complicated love triangle.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wedding_Planner",
    "citationTitle": "Wikipedia: The Wedding Planner"
  }
]