[
  {
    "id": "dad602a3-b3ca-4251-a905-1e009e61190b",
    "text": "In 'The Princess Bride' (1987), what is the name of the six-fingered man who killed Inigo Montoya's father?",
    "options": [
      "Count Rugen",
      "Prince Humperdinck",
      "Vizzini",
      "Miracle Max"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Count Rugen is the six-fingered man whom Inigo has been seeking to avenge his father's death.",
    "detailedExplanation": "Count Rugen, played by Christopher Guest, is the primary antagonist in Inigo Montoya's subplot. When Inigo was a child, his father Domingo Montoya was commissioned to make a sword for a six-fingered man. When Domingo wouldn't sell it, Count Rugen killed him, leading to Inigo's famous line 'Hello, my name is Inigo Montoya. You killed my father. Prepare to die.' This revenge plot is one of the film's most memorable elements.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Princess_Bride_(film)",
    "citationTitle": "Wikipedia: The Princess Bride (film)"
  },
  {
    "id": "cded9530-cd6e-4092-9f62-d38eef34e3a7",
    "text": "Which romantic comedy was the first film to feature the now-famous 'fake orgasm scene' in a restaurant?",
    "options": [
      "Annie Hall",
      "When Harry Met Sally",
      "Sleepless in Seattle",
      "The Way We Were"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'When Harry Met Sally' featured the iconic fake orgasm scene at Katz's Delicatessen, performed by Meg Ryan.",
    "detailedExplanation": "The famous scene in 'When Harry Met Sally' (1989) where Sally (Meg Ryan) fakes an orgasm in Katz's Delicatessen to prove a point to Harry (Billy Crystal) has become one of the most parodied and referenced scenes in romantic comedy history. The scene ends with an elderly woman at another table telling the waitress 'I'll have what she's having,' a line delivered by director Rob Reiner's mother, Estelle Reiner. The scene was largely improvised by Meg Ryan.",
    "citationUrl": "https://en.wikipedia.org/wiki/When_Harry_Met_Sally...",
    "citationTitle": "Wikipedia: When Harry Met Sally..."
  },
  {
    "id": "f1a1de66-b467-431e-806c-16344f5b0b42",
    "text": "In 'Notting Hill' (1999), what type of shop does Hugh Grant's character William Thacker own?",
    "options": [
      "Antique books",
      "Travel guides",
      "Rare vinyl records",
      "Vintage clothing"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "William Thacker owns a travel bookshop in Notting Hill, which serves as the meet-cute location with Anna Scott.",
    "detailedExplanation": "William Thacker's travel bookshop is central to the plot of 'Notting Hill,' as it's where he first encounters famous actress Anna Scott (Julia Roberts) when she visits to buy a book. The shop is portrayed as struggling financially, which emphasizes the contrast between William's ordinary life and Anna's glamorous Hollywood existence. The actual bookshop used for filming was a real travel bookshop called 'The Travel Bookshop' on Blenheim Crescent in Notting Hill, London.",
    "citationUrl": "https://en.wikipedia.org/wiki/Notting_Hill_(film)",
    "citationTitle": "Wikipedia: Notting Hill (film)"
  },
  {
    "id": "8353a3f2-b56c-4a62-947d-94f524b5ee8a",
    "text": "Which 1950s romantic comedy starring Marilyn Monroe was based on the play 'The Seven Year Itch' by George Axelrod?",
    "options": [
      "Some Like It Hot",
      "Gentlemen Prefer Blondes",
      "The Seven Year Itch",
      "How to Marry a Millionaire"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'The Seven Year Itch' (1955) was directly adapted from George Axelrod's Broadway play of the same name.",
    "detailedExplanation": "'The Seven Year Itch' (1955), directed by Billy Wilder, was adapted from George Axelrod's successful Broadway play that ran from 1952-1955. The film is famous for the iconic scene of Marilyn Monroe's dress being blown up by air from a subway grate, which became one of the most recognizable images in cinema history. The play and film explore themes of marital temptation and middle-age crisis, with Monroe playing 'The Girl' who becomes the object of a married man's fantasies during his wife's summer absence.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Seven_Year_Itch",
    "citationTitle": "Wikipedia: The Seven Year Itch"
  },
  {
    "id": "6ed7ffa9-a5d8-4139-a24e-624f0509c367",
    "text": "In 'Roman Holiday' (1953), what is the profession of Gregory Peck's character Joe Bradley?",
    "options": [
      "Diplomat",
      "Tour guide",
      "American newspaper reporter",
      "Embassy attaché"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Joe Bradley is an American newspaper reporter working in Rome who discovers Princess Ann's true identity.",
    "detailedExplanation": "Gregory Peck's character Joe Bradley is an American correspondent for the American News Service in Rome. When he encounters Princess Ann (Audrey Hepburn) during her secret escape from royal duties, he initially doesn't recognize her but gradually realizes her true identity. This creates the central conflict of the film - his professional instinct to get an exclusive story versus his growing feelings for her. The character's profession as a journalist is crucial to the plot, as it provides both the opportunity for their adventure and the moral dilemma that drives the story's conclusion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roman_Holiday",
    "citationTitle": "Wikipedia: Roman Holiday"
  },
  {
    "id": "0e0c6f36-ac99-4d50-893b-717b1196211b",
    "text": "Which romantic comedy features the line 'Nobody puts Baby in a corner' and was originally titled 'I Was a Teenage Mambo Queen'?",
    "options": [
      "Flashdance",
      "Footloose",
      "Dirty Dancing",
      "Saturday Night Fever"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Dirty Dancing' features this iconic line delivered by Patrick Swayze's character Johnny Castle.",
    "detailedExplanation": "'Dirty Dancing' (1987) underwent several title changes during development, with 'I Was a Teenage Mambo Queen' being one of the early working titles, along with others like 'Dirty Dancing' and 'Baby It's You.' The famous line 'Nobody puts Baby in a corner' is delivered by Johnny Castle (Patrick Swayze) to Baby's father before taking Baby (Jennifer Grey) to dance in the final scene. This line has become one of the most quoted movie lines in popular culture and represents Johnny's declaration of Baby's worth and independence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dirty_Dancing",
    "citationTitle": "Wikipedia: Dirty Dancing"
  },
  {
    "id": "b9f6af08-a63c-4071-9efd-10fa63bed33c",
    "text": "In 'Sleepless in Seattle' (1993), which classic romantic film do the characters repeatedly reference and watch?",
    "options": [
      "Casablanca",
      "An Affair to Remember",
      "Gone with the Wind",
      "The Way We Were"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'An Affair to Remember' (1957) is the classic film that inspires the Empire State Building meeting in 'Sleepless in Seattle.'",
    "detailedExplanation": "'An Affair to Remember' serves as a crucial plot device in 'Sleepless in Seattle.' Annie (Meg Ryan) and her friend Becky watch the 1957 Cary Grant and Deborah Kerr film, and Annie becomes emotional during the ending. The film's famous Empire State Building rendezvous becomes the inspiration for Annie and Sam's (Tom Hanks) eventual meeting. The movie-within-a-movie technique was used by director Nora Ephron to create a romantic framework and give the audience a shared cultural reference point for the type of grand romantic gesture the film was attempting to recreate.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sleepless_in_Seattle",
    "citationTitle": "Wikipedia: Sleepless in Seattle"
  },
  {
    "id": "5c6ebd28-d3b8-43ef-9428-a9e7b4198a4c",
    "text": "Which British romantic comedy was written by Richard Curtis and features Hugh Grant as a character who attends multiple social events mentioned in the title?",
    "options": [
      "Love Actually",
      "Four Weddings and a Funeral",
      "Notting Hill",
      "About Time"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Four Weddings and a Funeral' follows Charles (Hugh Grant) as he attends four weddings and one funeral.",
    "detailedExplanation": "'Four Weddings and a Funeral' (1994) was Richard Curtis's breakthrough screenplay, launching both his career and Hugh Grant's rise to romantic comedy stardom. The film literally follows Charles (Grant) and his friends through four different weddings and one funeral, with each event serving as a milestone in his relationship with Carrie (Andie MacDowell). The structure was innovative for romantic comedies, using these social gatherings to advance the plot over an extended timeframe. The film was a massive international success and established the template for British romantic comedies of the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Four_Weddings_and_a_Funeral",
    "citationTitle": "Wikipedia: Four Weddings and a Funeral"
  },
  {
    "id": "f875d624-5b59-496d-872d-440768d20f32",
    "text": "In 'When Harry Met Sally' (1989), what is the name of the song performed by Harry Connick Jr. that became a hit single from the soundtrack?",
    "options": [
      "It Had to Be You",
      "Let's Call the Whole Thing Off",
      "But Not for Me",
      "The Way You Look Tonight"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Harry Connick Jr. performed 'It Had to Be You' which became his signature song from the film.",
    "detailedExplanation": "Harry Connick Jr. not only acted in 'When Harry Met Sally' but also performed several songs on the soundtrack. His rendition of 'It Had to Be You' became a major hit single and helped establish him as a mainstream recording artist. The song perfectly captured the film's romantic themes and became synonymous with the movie itself.",
    "citationUrl": "https://en.wikipedia.org/wiki/When_Harry_Met_Sally",
    "citationTitle": "Wikipedia: When Harry Met Sally"
  },
  {
    "id": "233f6bfc-7263-4bbc-a444-426b94d08da2",
    "text": "Which 1995 romantic comedy starring Sandra Bullock was originally written as a drama but was rewritten as a comedy at her suggestion?",
    "options": [
      "While You Were Sleeping",
      "Speed",
      "The Net",
      "A Time to Kill"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Sandra Bullock suggested 'While You Were Sleeping' be rewritten as a romantic comedy instead of a drama.",
    "detailedExplanation": "The original script for 'While You Were Sleeping' was written as a drama about a lonely woman who pretends to be engaged to a man in a coma. Sandra Bullock saw the comedic potential in the premise and worked with the writers to transform it into the beloved romantic comedy that became a box office hit and established her as a leading lady in the genre.",
    "citationUrl": "https://en.wikipedia.org/wiki/While_You_Were_Sleeping_(film)",
    "citationTitle": "Wikipedia: While You Were Sleeping"
  },
  {
    "id": "b8e3db19-a203-4193-b73a-f6029441cb0d",
    "text": "In 'My Best Friend's Wedding' (1997), what Dionne Warwick song does the cast famously sing together in the restaurant scene?",
    "options": [
      "I Say a Little Prayer",
      "Walk on By",
      "Do You Know the Way to San Jose",
      "That's What Friends Are For"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The memorable restaurant scene features the cast singing 'I Say a Little Prayer' by Dionne Warwick.",
    "detailedExplanation": "One of the most memorable scenes in 'My Best Friend's Wedding' occurs when Cameron Diaz's character Kimmy starts singing 'I Say a Little Prayer' in a restaurant, and the entire dining room joins in. This spontaneous musical moment became iconic and was praised for its joyful, unrehearsed feeling, though it was actually carefully choreographed by director P.J. Hogan.",
    "citationUrl": "https://en.wikipedia.org/wiki/My_Best_Friend%27s_Wedding",
    "citationTitle": "Wikipedia: My Best Friend's Wedding"
  },
  {
    "id": "f07cdcdf-ddc6-4f40-ba76-e1bcd5059d60",
    "text": "Which classic screwball comedy starring Katharine Hepburn and Cary Grant features a leopard named Baby?",
    "options": [
      "Bringing Up Baby",
      "His Girl Friday",
      "The Philadelphia Story",
      "Holiday"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Bringing Up Baby' (1938) features a tame leopard named Baby as a central plot element.",
    "detailedExplanation": "'Bringing Up Baby' is considered one of the greatest screwball comedies of all time, starring Katharine Hepburn as a free-spirited heiress and Cary Grant as a paleontologist. The plot revolves around a series of mishaps involving a tame leopard named Baby, a missing dinosaur bone, and romantic complications. Despite initially flopping at the box office, it's now regarded as a masterpiece of the genre.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bringing_Up_Baby",
    "citationTitle": "Wikipedia: Bringing Up Baby"
  },
  {
    "id": "c03ba741-034a-4189-9e26-788397719efa",
    "text": "In 'Pretty Woman' (1990), what was the original dark ending of the script before it was rewritten as a romantic comedy?",
    "options": [
      "Edward throws Vivian out of the car",
      "Vivian dies in a car accident",
      "Edward marries someone else",
      "Vivian returns to drugs"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The original script ended with Edward throwing Vivian out of his car and driving away, leaving her on the street.",
    "detailedExplanation": "The original script for 'Pretty Woman' was titled '3000' and was much darker, focusing on class differences and exploitation. The original ending had Edward coldly throwing Vivian out of his car after their week together, with no romantic resolution. Disney executives insisted on a happier ending, transforming it into the fairy tale romance that became a massive hit and launched Julia Roberts to stardom.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pretty_Woman",
    "citationTitle": "Wikipedia: Pretty Woman"
  },
  {
    "id": "7f1c481a-a78f-4695-b79d-cce78a887cff",
    "text": "Which 1989 romantic comedy was the first film where Meg Ryan and Tom Hanks appeared together before their famous pairing in later films?",
    "options": [
      "Joe Versus the Volcano",
      "Sleepless in Seattle",
      "You've Got Mail",
      "When Harry Met Sally"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Joe Versus the Volcano' (1990) was actually their first collaboration, preceding 'Sleepless in Seattle.'",
    "detailedExplanation": "While most people associate Meg Ryan and Tom Hanks with 'Sleepless in Seattle' and 'You've Got Mail,' their first film together was actually 'Joe Versus the Volcano' in 1990. This quirky romantic comedy, where Ryan plays three different characters opposite Hanks' hypochondriac office worker, was a commercial disappointment but developed a cult following. Their chemistry in this film led to their casting in the more successful romantic comedies that followed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Versus_the_Volcano",
    "citationTitle": "Wikipedia: Joe Versus the Volcano"
  },
  {
    "id": "effb4238-ab0d-4267-b689-95b2e9706119",
    "text": "In 'The Proposal' (2009), Sandra Bullock's character Margaret claims to be from which location to avoid deportation?",
    "options": [
      "Alaska",
      "Canada",
      "Vermont",
      "Maine"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Margaret claims her fake engagement requires a trip to Alaska to meet her fiancé's family.",
    "detailedExplanation": "In 'The Proposal,' Sandra Bullock plays Margaret Tate, a Canadian executive facing deportation who forces her assistant Andrew (Ryan Reynolds) into a fake engagement. To make their story believable, they travel to Andrew's family home in Sitka, Alaska. The Alaskan setting provides both comedic fish-out-of-water scenarios for Margaret and a picturesque backdrop for their developing romance, with much of the film actually shot in Massachusetts and New York.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Proposal_(2009_film)",
    "citationTitle": "Wikipedia: The Proposal (2009 film)"
  },
  {
    "id": "70887561-f7c4-42ca-a410-8eb2a854abb6",
    "text": "Which director is known for the romantic comedy trilogy 'Before Sunrise,' 'Before Sunset,' and 'Before Midnight'?",
    "options": [
      "Richard Linklater",
      "Cameron Crowe",
      "Nancy Meyers",
      "Nora Ephron"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Richard Linklater directed the acclaimed 'Before' trilogy spanning nearly two decades.",
    "detailedExplanation": "Richard Linklater directed the critically acclaimed 'Before' trilogy, featuring Ethan Hawke and Julie Delpy as Jesse and Céline. The films were released nine years apart: 'Before Sunrise' (1995), 'Before Sunset' (2004), and 'Before Midnight' (2013). This unique approach allowed audiences to watch the characters and actors age naturally over nearly two decades, creating an unprecedented realistic portrayal of a relationship's evolution in cinema.",
    "citationUrl": "https://en.wikipedia.org/wiki/Before_trilogy",
    "citationTitle": "Wikipedia: Before trilogy"
  },
  {
    "id": "a176ea4b-73dd-4970-802e-feef71636310",
    "text": "In 'Some Like It Hot' (1959), what are the names of the all-female band that Tony Curtis and Jack Lemmon's characters join while in drag?",
    "options": [
      "Sweet Sue and Her Society Syncopators",
      "Betty Lou and Her Blue Notes",
      "Dolly Dawn and Her Dawn Patrol",
      "Sally Sweet and Her Sweethearts"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Sweet Sue and Her Society Syncopators is the all-female band in the film.",
    "detailedExplanation": "In Billy Wilder's classic romantic comedy 'Some Like It Hot,' Tony Curtis and Jack Lemmon's characters disguise themselves as women to escape the mob and join Sweet Sue and Her Society Syncopators, an all-female traveling band. This setup leads to the romantic complications when both men fall for Marilyn Monroe's character Sugar 'Sue' Kowalczyk, the band's ukulele player and vocalist. The film is often cited as one of the greatest comedies of all time and was selected as the funniest American film by the American Film Institute.",
    "citationUrl": "https://en.wikipedia.org/wiki/Some_Like_It_Hot",
    "citationTitle": "Wikipedia: Some Like It Hot"
  },
  {
    "id": "112b3ef4-9141-4c2c-aa4b-88cec489c316",
    "text": "Which romantic comedy features Reese Witherspoon as a Harvard Law student and was originally titled 'Blonde Justice'?",
    "options": [
      "Sweet Home Alabama",
      "Legally Blonde",
      "Just Like Heaven",
      "How Do You Know"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Legally Blonde was originally titled 'Blonde Justice' during development.",
    "detailedExplanation": "'Legally Blonde' (2001) was originally conceived under the title 'Blonde Justice' before the studio changed it to the more memorable current title. The film follows Elle Woods, played by Reese Witherspoon, as she enrolls at Harvard Law School to win back her ex-boyfriend, only to discover her own potential as a lawyer. The movie was based on a novel by Amanda Brown, who drew from her own experiences at Stanford Law School. Witherspoon's performance became iconic and launched a successful franchise including a sequel and Broadway musical.",
    "citationUrl": "https://en.wikipedia.org/wiki/Legally_Blonde",
    "citationTitle": "Wikipedia: Legally Blonde"
  },
  {
    "id": "6eba2c7a-4020-42f5-9924-367cc0e509be",
    "text": "In 'Annie Hall' (1977), what unusual cinematic technique does Woody Allen's character use to directly address the audience about his relationship anxieties?",
    "options": [
      "Voice-over narration",
      "Breaking the fourth wall",
      "Dream sequences",
      "Animated flashbacks"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Woody Allen's character frequently breaks the fourth wall by speaking directly to the camera and audience.",
    "detailedExplanation": "'Annie Hall' revolutionized romantic comedies through Woody Allen's innovative use of breaking the fourth wall, where his character Alvy Singer directly addresses the audience throughout the film to share his neuroses and observations about relationships. This technique, combined with non-linear storytelling, subtitled inner thoughts, and the famous scene where Allen pulls Marshall McLuhan into frame to settle an argument, created a new template for intelligent romantic comedies. The film won four Academy Awards including Best Picture, making it a rare comedy to achieve such recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Annie_Hall",
    "citationTitle": "Wikipedia: Annie Hall"
  },
  {
    "id": "cb8801dc-6296-4445-b679-85a1619c95a8",
    "text": "Which 1934 screwball comedy starring Clark Gable and Claudette Colbert was the first film to win all five major Academy Awards (Best Picture, Director, Actor, Actress, and Screenplay)?",
    "options": [
      "It Happened One Night",
      "The Thin Man",
      "Twentieth Century",
      "My Man Godfrey"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'It Happened One Night' was the first film to sweep the 'Big Five' Academy Award categories.",
    "detailedExplanation": "'It Happened One Night' (1934), directed by Frank Capra, made Oscar history by becoming the first film to win all five major Academy Awards: Best Picture, Best Director, Best Actor (Clark Gable), Best Actress (Claudette Colbert), and Best Adapted Screenplay. This romantic comedy about a runaway heiress and a newspaper reporter helped establish many of the conventions of the screwball comedy genre. The famous hitchhiking scene where Colbert's character lifts her skirt to stop a car became one of cinema's most memorable moments, and the film's success helped establish Columbia Pictures as a major studio.",
    "citationUrl": "https://en.wikipedia.org/wiki/It_Happened_One_Night",
    "citationTitle": "Wikipedia: It Happened One Night"
  }
]