[
  {
    "id": "ec5f982b-a83c-4d5a-931b-372f5c62abd9",
    "text": "In which 1989 romantic comedy does Meg Ryan famously fake an orgasm in Katz's Delicatessen?",
    "options": [
      "Sleepless in Seattle",
      "When Harry Met Sally",
      "You've Got Mail",
      "Joe Versus the Volcano"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The famous deli scene occurs in 'When Harry Met Sally' (1989).",
    "detailedExplanation": "The iconic fake orgasm scene in Katz's Delicatessen is from 'When Harry Met Sally' (1989), directed by Rob Reiner and written by Nora Ephron. Meg Ryan's character Sally demonstrates to Billy Crystal's Harry how women can fake orgasms, culminating in an older woman (played by director Rob Reiner's mother) telling the waitress 'I'll have what she's having.' This scene became one of the most memorable moments in romantic comedy history.",
    "citationUrl": "https://en.wikipedia.org/wiki/When_Harry_Met_Sally",
    "citationTitle": "Wikipedia: When Harry Met Sally"
  },
  {
    "id": "80aa96a5-70a3-4a71-b5fd-0a9cf79cbb79",
    "text": "Which 2003 romantic comedy features Hugh Grant as the British Prime Minister who falls for his household staff member?",
    "options": [
      "Notting Hill",
      "Four Weddings and a Funeral",
      "Love Actually",
      "Bridget Jones's Diary"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hugh Grant plays the Prime Minister in 'Love Actually' (2003).",
    "detailedExplanation": "'Love Actually' (2003), written and directed by Richard Curtis, features Hugh Grant as David, the newly elected British Prime Minister who develops feelings for Natalie, played by Martine McCutcheon, a member of his domestic staff at 10 Downing Street. The film is an ensemble romantic comedy that weaves together multiple love stories set in the weeks leading up to Christmas in London.",
    "citationUrl": "https://en.wikipedia.org/wiki/Love_Actually",
    "citationTitle": "Wikipedia: Love Actually"
  },
  {
    "id": "d5fa422e-00bb-4361-94a6-dcb4bc1d9dfe",
    "text": "What is the name of the bookstore owner played by Hugh Grant in 'Notting Hill' (1999)?",
    "options": [
      "William Thacker",
      "Charles Hartwell",
      "David Mitchell",
      "Henry Dashwood"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hugh Grant's character is named William Thacker.",
    "detailedExplanation": "In 'Notting Hill' (1999), Hugh Grant plays William Thacker, a bumbling travel bookstore owner in the London neighborhood of Notting Hill who accidentally spills orange juice on famous American actress Anna Scott, played by Julia Roberts. The character's ordinary, self-deprecating nature contrasts sharply with Anna's celebrity status, creating the central romantic tension of the film written by Richard Curtis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Notting_Hill_(film)",
    "citationTitle": "Wikipedia: Notting Hill (film)"
  },
  {
    "id": "feb26047-f7a0-4a96-992a-6c596e935edb",
    "text": "Which actress starred opposite Tom Hanks in both 'Sleepless in Seattle' (1993) and 'You've Got Mail' (1998)?",
    "options": [
      "Julia Roberts",
      "Sandra Bullock",
      "Meg Ryan",
      "Drew Barrymore"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Meg Ryan co-starred with Tom Hanks in both films.",
    "detailedExplanation": "Meg Ryan and Tom Hanks formed one of the most beloved romantic comedy pairings of the 1990s, starring together in both 'Sleepless in Seattle' (1993) and 'You've Got Mail' (1998). Both films were directed by Nora Ephron and showcased the duo's excellent on-screen chemistry. Interestingly, in 'Sleepless in Seattle,' their characters barely share any screen time together until the very end of the film, yet their romantic connection is palpable throughout.",
    "citationUrl": "https://en.wikipedia.org/wiki/Meg_Ryan",
    "citationTitle": "Wikipedia: Meg Ryan"
  },
  {
    "id": "ff1ff536-6c9b-4060-a01b-b6850cc5946c",
    "text": "In 'The Princess Bride' (1987), what is the name of the supposedly deadly poison used in the battle of wits scene?",
    "options": [
      "Iocane powder",
      "Rodenticide",
      "Nightshade extract",
      "Hemlock dust"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The fictional poison is called iocane powder.",
    "detailedExplanation": "In 'The Princess Bride' (1987), Vizzini (Wallace Shawn) engages in a battle of wits with the Man in Black (Cary Elwes) involving iocane powder, described as 'odorless, tasteless, dissolves instantly in liquid, and is among the more deadly poisons known to man.' The scene is a clever example of the film's wit and logic puzzles, as the Man in Black reveals he had built up an immunity to iocane powder over years, making both goblets safe to drink.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Princess_Bride_(film)",
    "citationTitle": "Wikipedia: The Princess Bride (film)"
  },
  {
    "id": "fe95ce04-4086-4b2b-8045-606f9303dbb5",
    "text": "Which 1990 romantic comedy features Julia Roberts as a prostitute who is hired by Richard Gere's wealthy businessman character?",
    "options": [
      "My Best Friend's Wedding",
      "Pretty Woman",
      "Runaway Bride",
      "Sleeping with the Enemy"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Pretty Woman' (1990) features this plot premise.",
    "detailedExplanation": "'Pretty Woman' (1990), directed by Garry Marshall, stars Julia Roberts as Vivian Ward, a prostitute from Hollywood Boulevard who is hired by wealthy businessman Edward Lewis (Richard Gere) to accompany him to social events for a week. The film was originally conceived as a much darker drama but was transformed into a romantic fairy tale. Roberts' performance earned her an Academy Award nomination for Best Actress and established her as one of Hollywood's biggest stars.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pretty_Woman",
    "citationTitle": "Wikipedia: Pretty Woman"
  },
  {
    "id": "84d102b0-9f86-4134-99dd-12bc62e7ad82",
    "text": "What profession does Sandra Bullock's character have in 'While You Were Sleeping' (1995)?",
    "options": [
      "Florist",
      "Librarian",
      "Transit token collector",
      "Coffee shop owner"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "She works as a transit token collector for the Chicago L.",
    "detailedExplanation": "In 'While You Were Sleeping' (1995), Sandra Bullock plays Lucy Eleanor Moderatz, a lonely transit token collector who works in a booth for the Chicago 'L' rapid transit system. Her character's mundane job becomes central to the plot when she saves her secret crush Peter Callaghan (Peter Gallagher) from falling onto the train tracks, leading to a case of mistaken identity where his family believes she is his fiancée while he's in a coma.",
    "citationUrl": "https://en.wikipedia.org/wiki/While_You_Were_Sleeping_(film)",
    "citationTitle": "Wikipedia: While You Were Sleeping (film)"
  },
  {
    "id": "b3c7ece8-2f1c-4c6b-ada2-369eb0e42bbf",
    "text": "Which romantic comedy trope describes the common plot device where two characters who initially dislike each other eventually fall in love?",
    "options": [
      "Meet cute",
      "Enemies to lovers",
      "Love triangle",
      "Fake relationship"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The 'enemies to lovers' trope describes characters who start as adversaries.",
    "detailedExplanation": "The 'enemies to lovers' trope is a fundamental romantic comedy convention where two characters begin with mutual dislike, antagonism, or rivalry before gradually developing romantic feelings. This trope can be traced back to Shakespeare's 'Much Ado About Nothing' and is exemplified in films like 'The Taming of the Shrew' adaptations, '10 Things I Hate About You,' and 'You've Got Mail.' The tension and banter between initially hostile characters often creates compelling chemistry and character development.",
    "citationUrl": "https://en.wikipedia.org/wiki/Enemies_to_lovers",
    "citationTitle": "Wikipedia: Enemies to lovers"
  },
  {
    "id": "1d8791a7-b999-4020-b50b-7ad53ccb45e7",
    "text": "Which 1993 romantic comedy features Bill Murray reliving the same day repeatedly until he wins over Andie MacDowell?",
    "options": [
      "Stripes",
      "Groundhog Day",
      "What About Bob?",
      "Quick Change"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Groundhog Day stars Bill Murray as a weatherman trapped in a time loop.",
    "detailedExplanation": "Groundhog Day is a 1993 romantic comedy starring Bill Murray as Phil Connors, a cynical TV weatherman who finds himself trapped in a time loop, reliving February 2nd in Punxsutawney, Pennsylvania. He initially uses this situation for selfish purposes but eventually learns to better himself and win the love of his producer Rita, played by Andie MacDowell. The film has become a cultural touchstone and is often cited as one of the greatest romantic comedies ever made.",
    "citationUrl": "https://en.wikipedia.org/wiki/Groundhog_Day_(film)",
    "citationTitle": "Wikipedia: Groundhog Day (film)"
  },
  {
    "id": "58deb683-665f-4b73-bd7a-3cc2752c79ed",
    "text": "In 'My Big Fat Greek Wedding' (2002), what is the name of the Greek restaurant owned by the bride's family?",
    "options": [
      "Dancing Zorba's",
      "Athena's Kitchen",
      "Parthenon Palace",
      "The Acropolis"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Dancing Zorba's is the family restaurant where Toula works before her transformation.",
    "detailedExplanation": "My Big Fat Greek Wedding follows Toula Portokalos, a Greek-American woman who works at her family's restaurant called Dancing Zorba's. The film, written by and starring Nia Vardalos, became a surprise box office hit and was nominated for an Academy Award for Best Original Screenplay. The restaurant serves as an important setting that represents Toula's traditional Greek family life before she begins to pursue her own dreams and romance with Ian Miller.",
    "citationUrl": "https://en.wikipedia.org/wiki/My_Big_Fat_Greek_Wedding",
    "citationTitle": "Wikipedia: My Big Fat Greek Wedding"
  },
  {
    "id": "e5ef6c87-b285-4543-bdab-3fcc8dfac0a7",
    "text": "Which actor played the male lead opposite Drew Barrymore in both 'The Wedding Singer' (1998) and '50 First Dates' (2004)?",
    "options": [
      "Ben Stiller",
      "Adam Sandler",
      "Steve Carell",
      "Will Ferrell"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Adam Sandler starred with Drew Barrymore in both romantic comedies.",
    "detailedExplanation": "Adam Sandler and Drew Barrymore formed a popular romantic comedy pairing, starring together in The Wedding Singer (1998) where Sandler plays a wedding singer in the 1980s, and 50 First Dates (2004) where he plays a marine biologist trying to win over Barrymore's character who has short-term memory loss. Their on-screen chemistry made both films successful, and they later reunited for the comedy Blended in 2014.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wedding_Singer",
    "citationTitle": "Wikipedia: The Wedding Singer"
  },
  {
    "id": "c0210d52-a826-4ef4-b553-99b44992775f",
    "text": "What is the name of the dating agency featured in 'Hitch' (2005) starring Will Smith?",
    "options": [
      "Love Solutions",
      "The Date Doctor",
      "Cupid's Arrow",
      "Romance Remedies"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Will Smith's character Alex 'Hitch' Hitchens is known as 'The Date Doctor.'",
    "detailedExplanation": "In Hitch, Will Smith plays Alex 'Hitch' Hitchens, a professional dating consultant known as 'The Date Doctor' who helps awkward men woo the women of their dreams. The film explores themes of authenticity in relationships when Hitch's methods backfire with gossip columnist Sara Melas, played by Eva Mendes. The movie was a commercial success and showcased Smith's range in the romantic comedy genre.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hitch_(film)",
    "citationTitle": "Wikipedia: Hitch (film)"
  },
  {
    "id": "c370ecc4-e4d5-4fe3-9bc3-7af2eb4f71a5",
    "text": "Which 1987 romantic comedy features Patrick Swayze as a dance instructor at a Catskills resort?",
    "options": [
      "Ghost",
      "Road House",
      "Dirty Dancing",
      "Point Break"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Dirty Dancing stars Patrick Swayze as Johnny Castle, a dance instructor.",
    "detailedExplanation": "Dirty Dancing is set in the summer of 1963 at a Catskills resort where Patrick Swayze plays Johnny Castle, a working-class dance instructor who becomes romantically involved with Frances 'Baby' Houseman, played by Jennifer Grey. The film became a cultural phenomenon, featuring the iconic line 'Nobody puts Baby in a corner' and the hit song 'Time of My Life.' It launched Swayze to stardom and remains one of the most beloved romantic dramas of the 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dirty_Dancing",
    "citationTitle": "Wikipedia: Dirty Dancing"
  },
  {
    "id": "b02941e6-9920-4d6e-a9b2-ef62d5262825",
    "text": "In 'Bridget Jones's Diary' (2001), which two actors play Bridget's competing love interests?",
    "options": [
      "Hugh Grant and Colin Firth",
      "Hugh Grant and Jude Law",
      "Colin Firth and Ralph Fiennes",
      "Hugh Grant and Matthew McConaughey"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hugh Grant plays Daniel Cleaver and Colin Firth plays Mark Darcy.",
    "detailedExplanation": "Bridget Jones's Diary features Renée Zellweger as the titular character caught between two very different men: Hugh Grant as her charming but unreliable boss Daniel Cleaver, and Colin Firth as the seemingly stuffy but ultimately decent barrister Mark Darcy. The film is loosely based on Jane Austen's Pride and Prejudice, with Firth notably having played Mr. Darcy in the 1995 BBC adaptation of that novel, creating a meta-textual element to his casting.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bridget_Jones%27s_Diary_(film)",
    "citationTitle": "Wikipedia: Bridget Jones's Diary (film)"
  },
  {
    "id": "1f4fc7eb-24eb-444d-b4a6-109676284d41",
    "text": "Which 1999 romantic comedy features Julia Stiles as a high school student whose dating is controlled by her older sister's dating life?",
    "options": [
      "She's All That",
      "10 Things I Hate About You",
      "Never Been Kissed",
      "Can't Hardly Wait"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "10 Things I Hate About You is a modern adaptation of Shakespeare's The Taming of the Shrew.",
    "detailedExplanation": "10 Things I Hate About You stars Julia Stiles as Kat Stratford, a strong-willed teenager whose younger sister Bianca cannot date until Kat does, according to their father's rule. The film is a clever modern adaptation of Shakespeare's The Taming of the Shrew, set in a Seattle high school. Heath Ledger plays Patrick Verona, who is paid to date Kat so that Bianca can date Cameron. The movie launched several careers and became a defining teen romantic comedy of the late 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/10_Things_I_Hate_About_You",
    "citationTitle": "Wikipedia: 10 Things I Hate About You"
  },
  {
    "id": "44b26026-5d80-4dad-95f1-f9f8ae41f9ea",
    "text": "What song does Adam Sandler's character sing to Drew Barrymore on the airplane in 'The Wedding Singer'?",
    "options": [
      "Love Stinks",
      "Grow Old with You",
      "Wedding Singer Blues",
      "True Love Ways"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Robbie sings the original song 'Grow Old with You' to Julia on the airplane.",
    "detailedExplanation": "In the climactic scene of The Wedding Singer, Adam Sandler's character Robbie Hart sings an original song called 'Grow Old with You' to Julia (Drew Barrymore) while on an airplane to Las Vegas, where she's heading to marry her fiancé Glenn. The heartfelt performance, accompanied by other passengers and flight attendants, serves as Robbie's final romantic gesture to win Julia back. The song was written specifically for the film and became one of its most memorable moments.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wedding_Singer",
    "citationTitle": "Wikipedia: The Wedding Singer"
  },
  {
    "id": "7b874018-9ab1-45c2-bf80-683d02c5155b",
    "text": "Which 1995 romantic comedy features Sandra Bullock as a lonely transit worker who saves her crush from an oncoming train?",
    "options": [
      "Speed",
      "While You Were Sleeping",
      "Miss Congeniality",
      "Two Weeks Notice"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "While You Were Sleeping features Sandra Bullock as Lucy, a transit worker who saves Peter from falling onto train tracks.",
    "detailedExplanation": "While You Were Sleeping (1995) stars Sandra Bullock as Lucy Eleanor Moderatz, a lonely Chicago Transit Authority token collector who has a crush on a handsome commuter named Peter. When Peter is mugged and falls onto the train tracks, Lucy saves his life but he falls into a coma. Through a misunderstanding at the hospital, his family believes Lucy is his fiancée, leading to romantic complications when she falls for his brother Jack instead.",
    "citationUrl": "https://en.wikipedia.org/wiki/While_You_Were_Sleeping_(film)",
    "citationTitle": "Wikipedia: While You Were Sleeping (film)"
  },
  {
    "id": "3d988c92-6ff6-4546-ac37-3404675238e5",
    "text": "In the 2004 romantic comedy '13 Going on 30', what magazine does Jennifer Garner's adult character work for?",
    "options": [
      "Cosmopolitan",
      "Vogue",
      "Poise",
      "Elle"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "In 13 Going on 30, Jennifer Garner's character Jenna Rink works as an editor at the fictional fashion magazine called Poise.",
    "detailedExplanation": "13 Going on 30 features Jennifer Garner as Jenna Rink, who magically transforms from a 13-year-old girl in 1987 to a 30-year-old woman in 2004. In her adult life, she discovers she's become a successful editor at Poise, a high-end fashion magazine. The fictional magazine serves as the backdrop for much of the adult storyline, where Jenna must navigate her career while trying to reconnect with her childhood best friend Matt, played by Mark Ruffalo.",
    "citationUrl": "https://en.wikipedia.org/wiki/13_Going_on_30",
    "citationTitle": "Wikipedia: 13 Going on 30"
  },
  {
    "id": "3690aa26-67f7-4fc6-afff-b73926cdef54",
    "text": "Which 1986 romantic comedy directed by Rob Reiner explores whether men and women can be 'just friends'?",
    "options": [
      "The Princess Bride",
      "When Harry Met Sally",
      "Sleepless in Seattle",
      "An Officer and a Gentleman"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "When Harry Met Sally, directed by Rob Reiner in 1989 (not 1986), famously explores the central question of whether men and women can maintain platonic friendships.",
    "detailedExplanation": "When Harry Met Sally (1989), directed by Rob Reiner and written by Nora Ephron, centers around the evolving relationship between Harry Burns (Billy Crystal) and Sally Albright (Meg Ryan). The film begins with Harry's assertion that men and women cannot be friends because 'the sex part always gets in the way.' The movie follows their relationship over several years as they transition from acquaintances to friends to lovers, ultimately challenging and exploring Harry's initial premise about platonic relationships between the sexes.",
    "citationUrl": "https://en.wikipedia.org/wiki/When_Harry_Met_Sally...",
    "citationTitle": "Wikipedia: When Harry Met Sally..."
  },
  {
    "id": "77670f1a-8593-4968-81f7-b4032edfdf2e",
    "text": "In 'Crazy, Stupid, Love' (2011), what pickup technique does Ryan Gosling's character teach Steve Carell's character?",
    "options": [
      "The 'neg' strategy",
      "How to be the 'perfect gentleman'",
      "The art of confident conversation",
      "How to dress better and approach women"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Ryan Gosling's character Jacob teaches Cal (Steve Carell) how to improve his appearance, confidence, and approach to meeting women, starting with a complete makeover.",
    "detailedExplanation": "In Crazy, Stupid, Love, Ryan Gosling plays Jacob Palmer, a smooth ladies' man who takes pity on the recently divorced and awkward Cal Weaver (Steve Carell). Jacob's mentorship begins with a complete transformation of Cal's appearance - new clothes, better grooming, and improved posture - before teaching him how to approach and talk to women with confidence. The makeover montage and Jacob's coaching sessions form a central part of the film's plot, as Cal learns to navigate the dating world after his long marriage ends.",
    "citationUrl": "https://en.wikipedia.org/wiki/Crazy,_Stupid,_Love",
    "citationTitle": "Wikipedia: Crazy, Stupid, Love"
  }
]