[
  {
    "id": "0b09c39c-5374-4ad3-8c49-3d28af3b5e6e",
    "text": "What is the name of the ancient Sith homeworld that serves as the hidden base for Emperor Palpatine's Final Order fleet in 'The Rise of Skywalker'?",
    "options": [
      "Korriban",
      "Exegol",
      "Dromund Kaas",
      "Ziost"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Exegol is the hidden Sith world where Palpatine built his Final Order fleet.",
    "detailedExplanation": "Exegol is a hidden Sith world located in the Unknown Regions that serves as the secret base for Emperor Palpatine's Final Order fleet in 'The Rise of Skywalker'. This dark planet is home to the Sith Eternal cult and contains massive Star Destroyer shipyards. While Korriban, Dromund Kaas, and Ziost are all significant Sith worlds from Star Wars lore, Exegol is specifically the world featured in the sequel trilogy's conclusion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Exegol",
    "citationTitle": "Wikipedia: Exegol"
  },
  {
    "id": "e9797ffa-a6a6-4efc-aa3d-45869eb6f034",
    "text": "Which actor portrayed Grand Moff Tarkin using CGI recreation in 'Rogue One: A Star Wars Story'?",
    "options": [
      "The performance was entirely CGI with no actor",
      "Guy Henry",
      "Ben Mendelsohn",
      "Forest Whitaker"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Guy Henry provided the physical performance and motion capture for the CGI-recreated Tarkin.",
    "detailedExplanation": "Guy Henry, a British actor known for his work in 'Harry Potter' films, provided the physical performance and motion capture reference for the CGI recreation of Grand Moff Tarkin in 'Rogue One'. Since Peter Cushing, who originally played Tarkin, had passed away in 1994, Industrial Light & Magic used advanced CGI technology combined with Henry's performance to bring the character back to life. This was one of the most ambitious digital resurrections of a deceased actor in cinema history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rogue_One",
    "citationTitle": "Wikipedia: Rogue One"
  },
  {
    "id": "4f46471d-f3be-407e-898b-c5434b7eb95b",
    "text": "In 'The Empire Strikes Back', what is the name of the asteroid field where the Millennium Falcon hides?",
    "options": [
      "Hoth Asteroid Field",
      "Anoat Asteroid Field",
      "Kessel Asteroid Field",
      "Corellian Asteroid Field"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Anoat Asteroid Field is where Han Solo pilots the Falcon to evade Imperial forces.",
    "detailedExplanation": "The Anoat Asteroid Field is the treacherous asteroid field near the planet Anoat where Han Solo pilots the Millennium Falcon to escape Imperial pursuit in 'The Empire Strikes Back'. This is where the famous scene occurs with Han navigating through the asteroids while C-3PO states the odds of successfully navigating an asteroid field. The field is also home to the space slug (exogorth) that nearly devours the Falcon when they hide in what they believe is a cave.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Empire_Strikes_Back",
    "citationTitle": "Wikipedia: The Empire Strikes Back"
  },
  {
    "id": "0005076b-7c07-4c1c-ad29-0d67fcfae078",
    "text": "What is the designation of the clone trooper unit led by Commander Cody in 'Revenge of the Sith'?",
    "options": [
      "501st Legion",
      "212th Attack Battalion",
      "104th Battalion",
      "327th Star Corps"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Commander Cody led the 212th Attack Battalion under Obi-Wan Kenobi.",
    "detailedExplanation": "The 212th Attack Battalion was an elite clone trooper unit of the Grand Army of the Republic, led by Clone Commander Cody (CC-2224) and served under Jedi General Obi-Wan Kenobi during the Clone Wars. This unit is prominently featured in 'Revenge of the Sith' during the Battle of Utapau, where Cody receives Order 66 and orders his troops to fire on Obi-Wan. The 212th was known for their distinctive orange markings and their expertise in assault operations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Clone_trooper",
    "citationTitle": "Wikipedia: Clone trooper"
  },
  {
    "id": "d0d00d4e-db97-4b9f-adee-4ea42edc2f54",
    "text": "Which planet serves as the capital of the New Republic in 'The Force Awakens' before being destroyed by Starkiller Base?",
    "options": [
      "Coruscant",
      "Chandrila",
      "Hosnian Prime",
      "Mon Cala"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Hosnian Prime was the New Republic capital when Starkiller Base destroyed the system.",
    "detailedExplanation": "Hosnian Prime was the capital planet of the New Republic during the sequel trilogy era. Unlike the Empire which maintained a permanent capital on Coruscant, the New Republic rotated its capital among member worlds, and Hosnian Prime was serving in this capacity when the First Order's Starkiller Base weapon destroyed the entire Hosnian system in 'The Force Awakens'. This devastating attack effectively decapitated the New Republic government and military leadership, leaving the galaxy vulnerable to First Order conquest.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Force_Awakens",
    "citationTitle": "Wikipedia: The Force Awakens"
  },
  {
    "id": "bf6847cd-98ad-4d4a-b586-c4e8cf568aa4",
    "text": "What is the name of the Jedi Temple Guard who becomes the Grand Inquisitor in 'Star Wars Rebels'?",
    "options": [
      "Barriss Offee",
      "The character's original name was never revealed",
      "Prosset Dibs",
      "Cin Drallig"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Grand Inquisitor's identity as a former Temple Guard was revealed, but his original name remains unknown.",
    "detailedExplanation": "The Grand Inquisitor, the primary antagonist of the first season of 'Star Wars Rebels', was revealed to be a former Jedi Temple Guard who fell to the dark side after Order 66. While his past as a Temple Guard was confirmed in the series, particularly in episodes dealing with Kanan's past and the fall of the Jedi Temple, his original name and specific identity before becoming an Inquisitor has never been officially revealed in canon. This adds to the tragic anonymity of the Temple Guards who served the Jedi Order.",
    "citationUrl": "https://en.wikipedia.org/wiki/Star_Wars_Rebels",
    "citationTitle": "Wikipedia: Star Wars Rebels"
  },
  {
    "id": "3a4778dc-1923-47de-8321-c50ceb7300ae",
    "text": "In 'The Mandalorian', what is the name of the metal that is sacred to Mandalorian culture?",
    "options": [
      "Durasteel",
      "Cortosis",
      "Beskar",
      "Phrik"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Beskar is the sacred Mandalorian metal used to forge their armor.",
    "detailedExplanation": "Beskar, also known as Mandalorian iron or Mandalorian steel, is an extremely durable metallic alloy that is sacred to Mandalorian culture. In 'The Mandalorian' series, beskar is highly prized for its ability to deflect lightsaber strikes and blaster fire, making it ideal for crafting Mandalorian armor. The metal is central to the plot of the series, as the protagonist trades beskar ingots obtained from Imperial remnants to have armor forged by the Armorer. The cultural and spiritual significance of beskar to the Mandalorians is emphasized throughout the show.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Mandalorian",
    "citationTitle": "Wikipedia: The Mandalorian"
  },
  {
    "id": "627e8d73-7e26-491f-87bf-a071e6f58d8a",
    "text": "What is the name of the ancient weapon that Ezra Bridger discovers in the Jedi Temple on Lothal?",
    "options": [
      "The Darksaber",
      "A Jedi Holocron",
      "The Lothal Temple Lightsaber",
      "A Sith Holocron"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Ezra discovers a Jedi Holocron in the Lothal Temple, which becomes crucial to his training.",
    "detailedExplanation": "In 'Star Wars Rebels', Ezra Bridger discovers a Jedi Holocron in the ancient Jedi Temple on Lothal. This pyramid-shaped device contains the recorded knowledge and teachings of ancient Jedi Masters and can only be opened by Force-sensitive individuals. The holocron becomes instrumental in Ezra's Jedi training under Kanan Jarrus and later becomes a key plot element when paired with a Sith holocron. The Lothal Temple itself is revealed to be connected to a network of Jedi temples across the galaxy and plays a crucial role in the series' mythology.",
    "citationUrl": "https://en.wikipedia.org/wiki/Star_Wars_Rebels",
    "citationTitle": "Wikipedia: Star Wars Rebels"
  },
  {
    "id": "daa1a7d4-f90d-44ba-a3d4-de6f336ebfd9",
    "text": "In The Empire Strikes Back, what is the name of the asteroid field where Han Solo hides the Millennium Falcon?",
    "options": [
      "Hoth Asteroid Belt",
      "Anoat Asteroid Field",
      "Kessel Asteroid Cluster",
      "Corellian Asteroid Field"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Anoat Asteroid Field is where Han Solo performs his famous asteroid navigation sequence.",
    "detailedExplanation": "The Anoat Asteroid Field is located in the Anoat sector of the Outer Rim Territories. In The Empire Strikes Back, Han Solo famously navigates the Millennium Falcon through this treacherous asteroid field to evade Imperial pursuit, landing inside the gullet of a space slug (exogorth) living within one of the larger asteroids. C-3PO famously calculates the odds of successfully navigating an asteroid field as 3,720 to 1.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Empire_Strikes_Back",
    "citationTitle": "Wikipedia: The Empire Strikes Back"
  },
  {
    "id": "110f3acf-24b2-4af5-a24e-f1cf6a260627",
    "text": "What is the birth name of Emperor Palpatine before he became a Sith Lord?",
    "options": [
      "Sheev Palpatine",
      "Cosinga Palpatine",
      "Darth Sidious",
      "Palatine Sheev"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Sheev Palpatine was the Emperor's original name before taking the Sith title Darth Sidious.",
    "detailedExplanation": "Sheev Palpatine was born on the planet Naboo and served as its senator in the Galactic Republic before orchestrating his rise to Supreme Chancellor and eventually Emperor. His first name 'Sheev' was officially revealed in the 2014 novel 'Tarkin' by James Luceno, though it had been hinted at in earlier expanded universe materials. Cosinga Palpatine was actually his father's name in Legends continuity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Palpatine",
    "citationTitle": "Wikipedia: Palpatine"
  },
  {
    "id": "716b4541-aa31-4bd5-a71b-144330f2a81b",
    "text": "Which ancient Jedi is credited with creating the first lightsaber according to Star Wars lore?",
    "options": [
      "Revan",
      "The First Blade",
      "Tarre Vizsla",
      "Arca Jeth"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The First Blade is the legendary figure credited with creating the original lightsaber design.",
    "detailedExplanation": "According to Star Wars canon, particularly referenced in 'The Clone Wars' animated series, the First Blade was an ancient Jedi who created the first lightsaber. This legendary figure's weapon became known as the first lightsaber, though details about this individual remain largely mysterious. Tarre Vizsla was the first Mandalorian Jedi who created the Darksaber, while Revan was an ancient Jedi/Sith from the Old Republic era, but neither created the first lightsaber.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lightsaber",
    "citationTitle": "Wikipedia: Lightsaber"
  },
  {
    "id": "63c0259c-d053-45ac-9978-fa6bc5b375d0",
    "text": "What is the maximum number of podracers that participated in the Boonta Eve Classic podrace in The Phantom Menace?",
    "options": [
      "8 podracers",
      "12 podracers",
      "16 podracers",
      "20 podracers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Twelve podracers started the Boonta Eve Classic race that Anakin Skywalker won.",
    "detailedExplanation": "The Boonta Eve Classic podrace on Tatooine featured twelve participants, including young Anakin Skywalker. The race was organized by Jabba the Hutt and included notable racers such as Sebulba (Anakin's main rival), Gasgano, Aldar Beedo, and others. Several racers were eliminated during the dangerous three-lap race through Beggar's Canyon, with Anakin ultimately becoming the first human to win a podrace due to his Force-enhanced reflexes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Star_Wars:_Episode_I_%E2%80%93_The_Phantom_Menace",
    "citationTitle": "Wikipedia: Star Wars: Episode I – The Phantom Menace"
  },
  {
    "id": "a53176e0-99f5-46e5-aadf-52cba7404b0f",
    "text": "In Return of the Jedi, what is the designation of the Imperial shuttle that Luke Skywalker and his team use to infiltrate Endor?",
    "options": [
      "Shuttle Tydirium",
      "Shuttle Lambda",
      "Shuttle Endor",
      "Shuttle Phantom"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Shuttle Tydirium was the stolen Imperial shuttle used by the Rebel strike team.",
    "detailedExplanation": "The Tydirium was a Lambda-class T-4a shuttle stolen by the Rebel Alliance and used by Luke Skywalker, Han Solo, Princess Leia, Chewbacca, and others to secretly land on the forest moon of Endor. The shuttle was equipped with the proper Imperial clearance codes, allowing it to pass through the Imperial fleet's blockade. The mission was crucial to the Rebellion's plan to destroy the second Death Star by deactivating the shield generator protecting it.",
    "citationUrl": "https://en.wikipedia.org/wiki/Return_of_the_Jedi",
    "citationTitle": "Wikipedia: Return of the Jedi"
  },
  {
    "id": "4eca9f07-fcc6-4bad-ab52-bfff5b934dce",
    "text": "What is the name of the Twi'lek Jedi Master who served on the Jedi Council during the Clone Wars?",
    "options": [
      "Aayla Secura",
      "Orn Free Taa",
      "Hera Syndulla",
      "Adi Gallia"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Aayla Secura was the blue-skinned Twi'lek Jedi Master who sat on the Jedi Council.",
    "detailedExplanation": "Aayla Secura was a female Twi'lek Jedi Master who served during the final years of the Galactic Republic. She was trained by Quinlan Vos and served as a Jedi General during the Clone Wars. Secura was present during several key battles and served on the Jedi Council. She was ultimately killed on Felucia during Order 66 when her clone troopers turned on her. Adi Gallia was also a Jedi Master on the Council but was a Tholothian, not a Twi'lek.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_characters",
    "citationTitle": "Wikipedia: List of Star Wars characters"
  },
  {
    "id": "451a3ffa-b604-4b5b-a727-327e62363e01",
    "text": "What type of creature is Admiral Ackbar in the Star Wars universe?",
    "options": [
      "Quarren",
      "Mon Calamari",
      "Nautolan",
      "Dac Salamander"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Admiral Ackbar is a Mon Calamari, an aquatic species from the planet Mon Cala.",
    "detailedExplanation": "Admiral Ackbar belongs to the Mon Calamari species, an aquatic humanoid race from the ocean world of Mon Cala (formerly known as Mon Calamari). The Mon Calamari are known for their excellent shipbuilding skills and their distinctive salmon-colored skin and large eyes. Ackbar served as the Supreme Commander of the Rebel Alliance fleet and was instrumental in the Battle of Endor. The Mon Calamari share their homeworld with the Quarren, another aquatic species, but Ackbar is definitively Mon Calamari.",
    "citationUrl": "https://en.wikipedia.org/wiki/Admiral_Ackbar",
    "citationTitle": "Wikipedia: Admiral Ackbar"
  },
  {
    "id": "449455e7-7527-457e-bec0-9cae96016e6d",
    "text": "In the original trilogy, what is the model number of the protocol droid C-3PO?",
    "options": [
      "3PO-series protocol droid",
      "C-3PO unit designation",
      "3PO human-cyborg relations",
      "No specific model given"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "C-3PO is specifically described as a '3PO human-cyborg relations' unit.",
    "detailedExplanation": "C-3PO's full designation in the original Star Wars films refers to him as a '3PO human-cyborg relations' droid, indicating his specialization in facilitating communication and interaction between different species and cultures. This designation emphasizes his primary function as a protocol droid designed for diplomatic and translation services. While later expanded universe materials provided more detailed technical specifications, the original films established this as his core identity and purpose within the Star Wars universe.",
    "citationUrl": "https://en.wikipedia.org/wiki/C-3PO",
    "citationTitle": "Wikipedia: C-3PO"
  },
  {
    "id": "28c6ba94-537b-4aff-acdf-2aaa68e78c5a",
    "text": "What is the name of the ancient Sith homeworld that appears in The Rise of Skywalker?",
    "options": [
      "Korriban",
      "Exegol",
      "Dromund Kaas",
      "Ziost"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Exegol is the hidden Sith world where Emperor Palpatine built his Final Order fleet.",
    "detailedExplanation": "Exegol is a dark desert planet hidden in the Unknown Regions that served as the secret stronghold of the Sith Eternal and Emperor Palpatine during his exile. The planet housed a massive fleet of Xyston-class Star Destroyers called the Final Order and featured ancient Sith architecture including a massive amphitheater where Palpatine operated from. While Korriban, Dromund Kaas, and Ziost were all Sith worlds in the Expanded Universe/Legends continuity, Exegol is the canonical Sith homeworld featured in the sequel trilogy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Exegol",
    "citationTitle": "Wikipedia: Exegol"
  },
  {
    "id": "9d74c79e-53e5-4ba2-9d4d-ec3080ba64ec",
    "text": "Which actor provided the voice of Grand Admiral Thrawn in Star Wars Rebels?",
    "options": [
      "Benedict Cumberbatch",
      "Lars Mikkelsen",
      "Charles Dance",
      "Hugo Weaving"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Lars Mikkelsen voiced the blue-skinned Chiss Grand Admiral throughout Star Wars Rebels.",
    "detailedExplanation": "Lars Mikkelsen, the Danish actor known for his roles in House of Cards and Sherlock, provided the distinctive cultured voice of Grand Admiral Thrawn throughout the animated series Star Wars Rebels. His performance brought Timothy Zahn's beloved character from the novels into canon, capturing Thrawn's calculated intelligence and tactical brilliance. Mikkelsen's portrayal was so well-received that he was later cast to play Thrawn in live-action in The Mandalorian and Ahsoka series, making him one of the few actors to transition from voice work to live-action in the same Star Wars role.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lars_Mikkelsen",
    "citationTitle": "Wikipedia: Lars Mikkelsen"
  },
  {
    "id": "1a386b70-ee91-47d4-ad56-c98648c6ab52",
    "text": "What is the maximum number of podracers that competed in the Boonta Eve Classic podrace in The Phantom Menace?",
    "options": [
      "8",
      "12",
      "22",
      "16"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Twenty-two podracers started the Boonta Eve Classic, though several crashed during the race.",
    "detailedExplanation": "The Boonta Eve Classic podrace featured 22 competitors at the starting line, making it a massive spectacle on Tatooine. Notable racers included Anakin Skywalker (the only human), Sebulba (the defending champion), Gasgano, Ody Mandrell, and Ben Quadinaros. The race was particularly dangerous, with several podracers crashing or being eliminated during the three-lap course through Beggar's Canyon, the Laguna Caves, and various other treacherous terrain around Mos Espa. The large field of racers emphasized both the popularity of the sport and the dangerous nature that made it unsuitable for most humans due to their slower reflexes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Podrace",
    "citationTitle": "Wikipedia: Podrace"
  },
  {
    "id": "672e8884-97e4-48fb-a288-d54f4b0958b6",
    "text": "What was the original working title for Return of the Jedi during production?",
    "options": [
      "Fall of the Empire",
      "Revenge of the Jedi",
      "Rise of Skywalker",
      "Dawn of the Force"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The film was called 'Revenge of the Jedi' until late in production when Lucas changed it because Jedi don't seek revenge.",
    "detailedExplanation": "Return of the Jedi was originally titled 'Revenge of the Jedi' throughout most of its production, with promotional materials, crew jackets, and even some early posters featuring this title. George Lucas changed the title shortly before release because he felt that 'revenge' was not an appropriate concept for the Jedi, who represented the light side of the Force and would not seek vengeance. The word 'return' better reflected Luke's journey to becoming a true Jedi and the return of the Jedi Order to the galaxy. Interestingly, Lucas would later use 'Revenge of the Sith' for Episode III, as it appropriately described the dark side's actions rather than the Jedi's.",
    "citationUrl": "https://en.wikipedia.org/wiki/Return_of_the_Jedi",
    "citationTitle": "Wikipedia: Return of the Jedi"
  }
]