[
  {
    "id": "969fb113-cc2c-4468-95ab-adeaac9e8b8f",
    "text": "Who composed the original Star Wars film score?",
    "options": [
      "Hans Zimmer",
      "Danny Elfman",
      "John Williams",
      "James Horner"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "John Williams composed the iconic Star Wars scores, including the famous main theme.",
    "detailedExplanation": "John Williams created one of the most recognizable film scores in cinema history for Star Wars. His symphonic approach, featuring leitmotifs for different characters and themes, helped define the epic scope of the saga. Williams composed music for all nine main saga films, winning an Academy Award for the original 1977 film. His themes for characters like Darth Vader (Imperial March), Princess Leia, and Luke Skywalker have become cultural touchstones that are instantly recognizable worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_of_Star_Wars",
    "citationTitle": "Wikipedia: Music of Star Wars"
  },
  {
    "id": "699e8839-6d8a-4ba6-af42-4426a38f1227",
    "text": "On which planet do we first meet Yoda in The Empire Strikes Back?",
    "options": [
      "Endor",
      "Hoth",
      "Dagobah",
      "Tatooine"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Yoda lived in exile on the swamp planet Dagobah, where Luke trained with him.",
    "detailedExplanation": "Dagobah is a remote, swampy planet where the Jedi Master Yoda chose to live in exile following the fall of the Republic and the Jedi purge. The planet's strong connection to the Force and its remote location made it an ideal hiding place. Luke Skywalker crash-landed there while seeking Yoda for Jedi training, as instructed by Obi-Wan's spirit. The planet's mystical atmosphere, filled with strange creatures and Force visions, provided the perfect setting for Luke's initial Jedi training in The Empire Strikes Back.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dagobah",
    "citationTitle": "Wikipedia: Dagobah"
  },
  {
    "id": "28579813-d4e9-4356-ba3c-b9180fd4bd86",
    "text": "What color is Mace Windu's lightsaber?",
    "options": [
      "Blue",
      "Green",
      "Purple",
      "Red"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Mace Windu wielded a unique purple lightsaber, the only one of its color in the films.",
    "detailedExplanation": "Mace Windu's purple lightsaber was unique among the Jedi shown in the Star Wars films. This distinctive color choice was actually a request by actor Samuel L. Jackson, who wanted to be able to spot himself during the large battle scenes in Attack of the Clones. In-universe, the purple blade represents Windu's mastery of both light and dark side techniques through his use of Vaapad, a dangerous lightsaber combat form that channels controlled aggression while remaining on the light side of the Force.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mace_Windu",
    "citationTitle": "Wikipedia: Mace Windu"
  },
  {
    "id": "129eff28-0e29-43fe-8638-bf8b900522d1",
    "text": "Which actor played Obi-Wan Kenobi in the original trilogy?",
    "options": [
      "Ewan McGregor",
      "Alec Guinness",
      "Harrison Ford",
      "Mark Hamill"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sir Alec Guinness portrayed the older Obi-Wan Kenobi in the original Star Wars trilogy.",
    "detailedExplanation": "Sir Alec Guinness, the distinguished British actor, played Obi-Wan Kenobi (also known as Ben Kenobi) in the original Star Wars trilogy. Despite initially being skeptical about the project, Guinness delivered a memorable performance as Luke's mentor and the hermit who revealed the truth about the Force and Luke's heritage. His portrayal brought gravitas and wisdom to the role, helping to ground the fantastical elements of the story. Guinness received an Academy Award nomination for Best Supporting Actor for his performance in the original 1977 film.",
    "citationUrl": "https://en.wikipedia.org/wiki/Obi-Wan_Kenobi",
    "citationTitle": "Wikipedia: Obi-Wan Kenobi"
  },
  {
    "id": "0bbf1525-6eac-40a2-b6c5-c652fac8b91f",
    "text": "What is the name of the ice planet featured at the beginning of The Empire Strikes Back?",
    "options": [
      "Bespin",
      "Hoth",
      "Alderaan",
      "Coruscant"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hoth is the frozen planet where the Rebel Alliance established Echo Base.",
    "detailedExplanation": "Hoth is a remote ice planet that served as the location for the Rebel Alliance's Echo Base at the beginning of The Empire Strikes Back. The planet's harsh, frozen environment provided natural camouflage for the hidden rebel base, but it was eventually discovered by Imperial probe droids. The Battle of Hoth became one of the most iconic sequences in Star Wars, featuring the memorable AT-AT walker assault on the rebel base. The planet is inhabited by dangerous creatures like wampas, one of which attacked Luke Skywalker early in the film.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hoth",
    "citationTitle": "Wikipedia: Hoth"
  },
  {
    "id": "991f1784-4d02-407e-84b0-b4a574135571",
    "text": "In Return of the Jedi, what is the name of Jabba the Hutt's sail barge?",
    "options": [
      "Khetanna",
      "Executor",
      "Finalizer",
      "Supremacy"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Khetanna was Jabba's luxury sail barge that was destroyed during the rescue of Han Solo.",
    "detailedExplanation": "The Khetanna was Jabba the Hutt's personal luxury sail barge, a massive repulsorlift pleasure craft used for entertainment and transportation across Tatooine's desert landscape. In Return of the Jedi, Jabba used the barge to transport his entourage to the Great Pit of Carkoon to execute Luke Skywalker, Han Solo, and Chewbacca by feeding them to the sarlacc. However, the execution became a rescue mission when Luke revealed his plan, ultimately resulting in the destruction of the Khetanna and Jabba's death at the hands of Princess Leia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jabba_the_Hutt",
    "citationTitle": "Wikipedia: Jabba the Hutt"
  },
  {
    "id": "9a6ad3cd-2f6f-42e5-9e43-55a6bece9413",
    "text": "Which planet is Luke Skywalker's home world?",
    "options": [
      "Hoth",
      "Tatooine",
      "Coruscant",
      "Dagobah"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tatooine is the desert planet where Luke Skywalker was raised by his aunt and uncle.",
    "detailedExplanation": "Tatooine is a harsh desert world orbiting twin suns in the galaxy's Outer Rim Territories. Luke Skywalker grew up here on his Uncle Owen and Aunt Beru's moisture farm, dreaming of adventure beyond the sandy dunes. The planet also served as Anakin Skywalker's childhood home, making it significant to the Skywalker family saga.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tatooine",
    "citationTitle": "Wikipedia: Tatooine"
  },
  {
    "id": "e75cfe92-3bf5-41b7-be6a-d6dd02297ad6",
    "text": "Who composed the music for the Star Wars films?",
    "options": [
      "Danny Elfman",
      "Hans Zimmer",
      "John Williams",
      "James Horner"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "John Williams composed the iconic Star Wars musical scores.",
    "detailedExplanation": "John Williams created the memorable orchestral scores for the Star Wars saga, including the famous main theme, 'Imperial March' (Darth Vader's theme), and 'Princess Leia's Theme.' His work on Star Wars earned him multiple Academy Award nominations and wins, and the music has become synonymous with the franchise's epic space opera atmosphere.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_of_Star_Wars",
    "citationTitle": "Wikipedia: Music of Star Wars"
  },
  {
    "id": "21c05e1b-0016-4908-ac48-b64cab054f09",
    "text": "In which episode does Anakin Skywalker become Darth Vader?",
    "options": [
      "Episode II: Attack of the Clones",
      "Episode III: Revenge of the Sith",
      "Episode IV: A New Hope",
      "Episode I: The Phantom Menace"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Anakin's transformation into Darth Vader occurs in Episode III: Revenge of the Sith.",
    "detailedExplanation": "In Episode III: Revenge of the Sith, Anakin Skywalker's fall to the dark side reaches its climax. Manipulated by Emperor Palpatine and driven by fear of losing Padmé, Anakin pledges himself to the Sith and is given the name Darth Vader. After his lightsaber duel with Obi-Wan on Mustafar leaves him severely injured, he is reconstructed in the iconic black armor that defines the character.",
    "citationUrl": "https://en.wikipedia.org/wiki/Star_Wars:_Episode_III_%E2%80%93_Revenge_of_the_Sith",
    "citationTitle": "Wikipedia: Star Wars: Episode III – Revenge of the Sith"
  },
  {
    "id": "6b5010d1-cd7d-49dd-b237-a61db4a0dd7c",
    "text": "What is the name of the ice planet where the Rebel Alliance has a base in The Empire Strikes Back?",
    "options": [
      "Bespin",
      "Endor",
      "Hoth",
      "Kamino"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hoth is the ice planet where the Rebels establish Echo Base.",
    "detailedExplanation": "Hoth is a remote ice planet in the Outer Rim where the Rebel Alliance establishes Echo Base after the destruction of the Death Star. The planet's harsh, frozen environment provides natural concealment from the Empire. The film opens with the famous Battle of Hoth, where Imperial AT-AT walkers assault the Rebel base, forcing the Alliance to evacuate.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hoth",
    "citationTitle": "Wikipedia: Hoth"
  },
  {
    "id": "e512cc9a-a689-4af5-93bd-ce2bf4188165",
    "text": "Who kills Jabba the Hutt?",
    "options": [
      "Luke Skywalker",
      "Han Solo",
      "Princess Leia",
      "Lando Calrissian"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Princess Leia kills Jabba the Hutt using the chain he used to enslave her.",
    "detailedExplanation": "In Return of the Jedi, Princess Leia is captured and forced to serve as Jabba the Hutt's slave, chained to his throne. During the chaos of Luke Skywalker's rescue mission aboard Jabba's sail barge, Leia uses the very chain that bound her to strangle the crime lord, killing him and freeing herself. This moment represents both literal and symbolic liberation for her character.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jabba_the_Hutt",
    "citationTitle": "Wikipedia: Jabba the Hutt"
  },
  {
    "id": "b03ffd5a-7887-4c3f-b3c3-17ffe2533a6d",
    "text": "Which planet is Luke Skywalker from?",
    "options": [
      "Alderaan",
      "Coruscant",
      "Tatooine",
      "Hoth"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Luke Skywalker was raised on the desert planet Tatooine by his aunt and uncle.",
    "detailedExplanation": "Tatooine is a desert planet in the Outer Rim Territories with twin suns. Luke Skywalker was brought here as an infant and raised by his aunt Beru and uncle Owen Lars on their moisture farm. The planet is controlled by the Hutts and is known for its lawlessness, podracing, and harsh desert environment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tatooine",
    "citationTitle": "Wikipedia: Tatooine"
  },
  {
    "id": "44ae6f75-fa24-473b-b175-29c1a296c1ae",
    "text": "In 'The Empire Strikes Back,' what does Darth Vader reveal to Luke?",
    "options": [
      "That Leia is his sister",
      "That he is Luke's father",
      "That the Emperor is his master",
      "That Obi-Wan lied to him"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Vader reveals that he is Luke's father during their lightsaber duel in Cloud City.",
    "detailedExplanation": "One of cinema's most famous plot twists occurs when Darth Vader reveals to Luke Skywalker that he is his father during their lightsaber duel in the carbon-freezing chamber on Cloud City. This revelation fundamentally changes Luke's understanding of his past and sets up the central conflict for the remainder of the original trilogy.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Empire_Strikes_Back",
    "citationTitle": "Wikipedia: The Empire Strikes Back"
  },
  {
    "id": "c01287f0-27d2-45d4-806d-442f5f71c215",
    "text": "What is the weapon of choice for Jedi Knights?",
    "options": [
      "Blaster rifle",
      "Vibroblade",
      "Lightsaber",
      "Force pike"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Lightsabers are the traditional weapons of Jedi and Sith.",
    "detailedExplanation": "A lightsaber is an elegant weapon consisting of a hilt that projects a blade of pure energy. Each Jedi constructs their own lightsaber as part of their training, including finding and attuning a kyber crystal that powers the weapon. The color of the blade often reflects the wielder's connection to the Force, with blue and green being common for Jedi, and red typically used by Sith.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lightsaber",
    "citationTitle": "Wikipedia: Lightsaber"
  },
  {
    "id": "25e68837-1258-42e4-a41c-6f484dec2955",
    "text": "What is the name of the ice planet where the Rebel Alliance has a base in 'The Empire Strikes Back'?",
    "options": [
      "Dagobah",
      "Endor",
      "Hoth",
      "Bespin"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hoth is the ice planet where the Rebels established Echo Base.",
    "detailedExplanation": "Hoth is a remote ice planet in the Outer Rim where the Rebel Alliance established Echo Base after the destruction of the Death Star. The planet is inhabited by creatures like tauntauns and wampas. The Empire discovers the base and launches a ground assault using AT-AT walkers, forcing the Rebels to evacuate in one of the saga's most memorable battle sequences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hoth",
    "citationTitle": "Wikipedia: Hoth"
  },
  {
    "id": "f518ecca-a3aa-42e4-a591-a1f33d1729eb",
    "text": "Who played Princess Leia in the original Star Wars trilogy?",
    "options": [
      "Natalie Portman",
      "Carrie Fisher",
      "Daisy Ridley",
      "Keira Knightley"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Carrie Fisher portrayed Princess Leia in the original trilogy.",
    "detailedExplanation": "Carrie Fisher played Princess Leia Organa throughout the original Star Wars trilogy and reprised the role in the sequel trilogy. Her portrayal of the strong-willed princess and later general became an iconic character in science fiction, inspiring generations of fans. Fisher's performance helped establish Leia as one of cinema's most memorable heroines, combining royal dignity with rebel determination.",
    "citationUrl": "https://en.wikipedia.org/wiki/Princess_Leia",
    "citationTitle": "Wikipedia: Princess Leia"
  },
  {
    "id": "709ff07f-e93d-46fa-bff7-a2d7b71e85dc",
    "text": "Which actor played Obi-Wan Kenobi in the prequel trilogy?",
    "options": [
      "Alec Guinness",
      "Ewan McGregor",
      "Liam Neeson",
      "Hayden Christensen"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Ewan McGregor portrayed young Obi-Wan Kenobi in Episodes I-III.",
    "detailedExplanation": "Scottish actor Ewan McGregor took on the role of Obi-Wan Kenobi in the prequel trilogy (Episodes I, II, and III), portraying the character as a younger Jedi Knight and later Master. McGregor studied Alec Guinness's performance from the original trilogy to maintain continuity with the older version of the character, and has since reprised the role in the Disney+ series 'Obi-Wan Kenobi'.",
    "citationUrl": "https://en.wikipedia.org/wiki/Obi-Wan_Kenobi",
    "citationTitle": "Wikipedia: Obi-Wan Kenobi"
  },
  {
    "id": "5ed33022-6970-4cff-a13a-0bd6d2cd081c",
    "text": "On which planet do we first encounter Ewoks?",
    "options": [
      "Tatooine",
      "Hoth",
      "Endor",
      "Dagobah"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Ewoks are native to the forest moon of Endor.",
    "detailedExplanation": "The Ewoks first appear in 'Return of the Jedi' (Episode VI) on the forest moon of Endor, where they encounter Princess Leia and later help the Rebel Alliance in their fight against the Empire. These small, furry, bear-like creatures live in tree villages and initially mistake C-3PO for a deity. The forest moon of Endor serves as the location for the climactic ground battle while the space battle occurs above.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ewok",
    "citationTitle": "Wikipedia: Ewok"
  },
  {
    "id": "ab5feb44-7082-4891-b230-71a8d5c3fd86",
    "text": "What is the name of the ice planet where the Rebel Alliance establishes their base at the beginning of 'The Empire Strikes Back'?",
    "options": [
      "Dagobah",
      "Hoth",
      "Endor",
      "Tatooine"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hoth is the ice planet featured at the beginning of The Empire Strikes Back.",
    "detailedExplanation": "Hoth is a remote ice planet in the Star Wars universe that serves as the location for the Rebel Alliance's Echo Base at the beginning of The Empire Strikes Back. The planet is characterized by its harsh, frozen climate and is inhabited by creatures like wampas and tauntauns. The famous Battle of Hoth takes place here, where Imperial AT-AT walkers attack the rebel base, forcing the Alliance to evacuate.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hoth",
    "citationTitle": "Wikipedia: Hoth"
  },
  {
    "id": "a86c4b6e-cc51-4a55-9a81-23f9867c1b7c",
    "text": "Which actor portrayed the character Mace Windu in the Star Wars prequel trilogy?",
    "options": [
      "Laurence Fishburne",
      "Samuel L. Jackson",
      "Morgan Freeman",
      "James Earl Jones"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Samuel L. Jackson played Mace Windu in Episodes I, II, and III.",
    "detailedExplanation": "Samuel L. Jackson portrayed Mace Windu, a senior member of the Jedi High Council, in the Star Wars prequel trilogy (Episodes I-III). Windu is known for his distinctive purple lightsaber and his role as one of the most powerful Jedi Masters. Jackson specifically requested the purple lightsaber to make his character stand out in the large lightsaber battle scenes. The character meets his demise in Revenge of the Sith when he is killed by Emperor Palpatine with assistance from Anakin Skywalker.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mace_Windu",
    "citationTitle": "Wikipedia: Mace Windu"
  }
]