[
  {
    "id": "e5130e23-70d7-4b9e-ba4c-1e9d00e8a89a",
    "text": "Which country has appeared in the most FIFA World Cup finals without ever winning the tournament?",
    "options": [
      "Netherlands",
      "Argentina",
      "Croatia",
      "Sweden"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Netherlands has reached three World Cup finals (1974, 1978, 2010) but never won.",
    "detailedExplanation": "The Netherlands is famously known as the greatest team never to win a World Cup, having reached the finals three times in 1974, 1978, and 2010, losing each time. They lost to West Germany in 1974, Argentina in 1978, and Spain in 2010. Despite producing legendary players and playing attractive football, the Dutch have been unlucky in finals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Netherlands_national_football_team",
    "citationTitle": "Wikipedia: Netherlands national football team"
  },
  {
    "id": "7630c9fd-26ec-4218-a9ea-1a3e29c45514",
    "text": "In which year was the FIFA World Cup first televised in color?",
    "options": [
      "1966",
      "1970",
      "1974",
      "1978"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The 1970 World Cup in Mexico was the first to be broadcast in color television.",
    "detailedExplanation": "The 1970 FIFA World Cup in Mexico was a watershed moment for football broadcasting, being the first World Cup to be transmitted via satellite and shown in color on television. This tournament featured Brazil's legendary team with Pelé and is often considered one of the greatest World Cups ever, partly due to the enhanced viewing experience that color television provided to global audiences.",
    "citationUrl": "https://en.wikipedia.org/wiki/1970_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 1970 FIFA World Cup"
  },
  {
    "id": "ddc932ca-1d8a-47f7-9141-67ec313dd849",
    "text": "What is the record for most goals scored by a single player in one World Cup tournament?",
    "options": [
      "11 goals",
      "13 goals",
      "15 goals",
      "17 goals"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Just Fontaine of France scored 13 goals in the 1958 World Cup, a record that still stands.",
    "detailedExplanation": "Just Fontaine's record of 13 goals in the 1958 World Cup in Sweden remains one of football's most unbreakable records. The French striker achieved this feat in just six matches, averaging over two goals per game. Fontaine's record is particularly impressive considering the modern tournament format makes it extremely difficult for any player to score at such a rate across multiple matches.",
    "citationUrl": "https://en.wikipedia.org/wiki/Just_Fontaine",
    "citationTitle": "Wikipedia: Just Fontaine"
  },
  {
    "id": "322ad6c7-db55-4e98-913a-e9c744ece7d7",
    "text": "Which stadium has hosted the most FIFA World Cup final matches?",
    "options": [
      "Wembley Stadium",
      "Maracanã Stadium",
      "Estadio Azteca",
      "Rose Bowl"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Maracanã Stadium in Rio de Janeiro has hosted two World Cup finals (1950 and 2014).",
    "detailedExplanation": "The Maracanã Stadium in Rio de Janeiro, Brazil, has the distinction of hosting two FIFA World Cup finals. The first was in 1950 when Uruguay defeated Brazil 2-1 in what Brazilians call the 'Maracanaço' - one of the biggest upsets in World Cup history. The stadium hosted its second final in 2014 when Germany defeated Argentina 1-0, making it the only venue to host multiple World Cup finals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maracan%C3%A3_Stadium",
    "citationTitle": "Wikipedia: Maracanã Stadium"
  },
  {
    "id": "84e0eb53-3242-40eb-9c42-ad3c60ba20f6",
    "text": "Which World Cup introduced the penalty shootout to decide knockout matches?",
    "options": [
      "1970 Mexico",
      "1974 West Germany",
      "1978 Argentina",
      "1982 Spain"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Penalty shootouts were first used at the 1974 World Cup in West Germany.",
    "detailedExplanation": "The 1974 FIFA World Cup in West Germany was the first to introduce penalty shootouts as a method to decide knockout matches that remained tied after extra time. Prior to this, matches were decided by coin toss or replay. The first World Cup penalty shootout actually occurred in 1982 between West Germany and France in the semi-final, as no knockout matches in 1974 or 1978 required shootouts.",
    "citationUrl": "https://en.wikipedia.org/wiki/1974_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 1974 FIFA World Cup"
  },
  {
    "id": "3e500396-16a6-4115-a7dc-547aa941e5a3",
    "text": "Which country scored the fastest goal in World Cup history?",
    "options": [
      "Turkey",
      "South Korea",
      "Germany",
      "Brazil"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Turkey's Hakan Şükür scored after 11 seconds against South Korea in the 2002 third-place play-off.",
    "detailedExplanation": "Hakan Şükür of Turkey scored the fastest goal in FIFA World Cup history just 11 seconds after kickoff in the third-place play-off match against South Korea at the 2002 World Cup. This record-breaking goal helped Turkey secure a 3-2 victory and third place in the tournament, which was their best-ever World Cup performance. The goal came from a quick move straight from the kickoff.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hakan_%C5%9E%C3%BCk%C3%BCr",
    "citationTitle": "Wikipedia: Hakan Şükür"
  },
  {
    "id": "bcb0d65c-d398-44d0-b5e9-40a42d96d8a1",
    "text": "Which World Cup was the first to feature 32 teams in the final tournament?",
    "options": [
      "1994 USA",
      "1998 France",
      "2002 Japan/South Korea",
      "2006 Germany"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The 1998 World Cup in France was the first to expand to 32 teams from the previous 24.",
    "detailedExplanation": "The 1998 FIFA World Cup in France marked a significant expansion in the tournament format, increasing from 24 teams (used since 1982) to 32 teams. This expansion allowed for better representation from all confederations and created the familiar format of eight groups of four teams each, followed by knockout rounds. The format remained at 32 teams through 2022, with the 2026 World Cup set to expand further to 48 teams.",
    "citationUrl": "https://en.wikipedia.org/wiki/1998_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 1998 FIFA World Cup"
  },
  {
    "id": "afdd0f45-9f91-4aad-a22c-b1dee0d64224",
    "text": "Who is the oldest player to ever appear in a FIFA World Cup match?",
    "options": [
      "Alfredo Talavera (45 years)",
      "Essam El-Hadary (45 years)",
      "Faryd Mondragón (43 years)",
      "Pat Jennings (41 years)"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Egypt's goalkeeper Essam El-Hadary was 45 years and 161 days old when he played at the 2018 World Cup.",
    "detailedExplanation": "Essam El-Hadary became the oldest player in World Cup history when he appeared for Egypt against Saudi Arabia at the 2018 World Cup in Russia at age 45 years and 161 days. The veteran goalkeeper not only broke the age record but also saved a penalty in the match. His appearance was particularly significant as it came during Egypt's first World Cup appearance since 1990, alongside star player Mohamed Salah.",
    "citationUrl": "https://en.wikipedia.org/wiki/Essam_El-Hadary",
    "citationTitle": "Wikipedia: Essam El-Hadary"
  },
  {
    "id": "4a1bcfde-5df3-44db-9353-3c6c88508fb0",
    "text": "What was unique about the 1950 FIFA World Cup final tournament format?",
    "options": [
      "It was decided by a round-robin group instead of a single final match",
      "It was the first World Cup with extra time",
      "It featured the first World Cup hat-trick",
      "It was played entirely indoors"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The 1950 World Cup was decided by a final round-robin group of four teams rather than a traditional knockout final.",
    "detailedExplanation": "The 1950 FIFA World Cup in Brazil featured a unique tournament format where the final stage consisted of a round-robin group of four teams (Brazil, Uruguay, Sweden, and Spain) rather than a traditional single final match. Uruguay won the tournament by defeating Brazil 2-1 in the final group match at the Maracanã Stadium, which is often referred to as the 'de facto final' due to the dramatic circumstances and the fact that Brazil only needed a draw to win the tournament.",
    "citationUrl": "https://en.wikipedia.org/wiki/1950_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 1950 FIFA World Cup"
  },
  {
    "id": "5fe34857-1405-414a-9d81-44bfa6cd6b5c",
    "text": "Which FIFA World Cup was boycotted by most African nations in protest?",
    "options": [
      "1966 World Cup in England",
      "1970 World Cup in Mexico",
      "1974 World Cup in West Germany",
      "1978 World Cup in Argentina"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Most African nations boycotted the 1966 World Cup due to FIFA's decision to allocate only one qualification spot for Africa, Asia, and Oceania combined.",
    "detailedExplanation": "The 1966 FIFA World Cup in England was boycotted by most African nations in protest against FIFA's qualification system. FIFA had allocated only one qualifying spot for the combined regions of Africa, Asia, and Oceania, which African nations considered discriminatory. As a result, 15 of the 16 African nations withdrew from qualification, with only South Africa remaining (though they were later banned due to apartheid). This boycott led to significant changes in FIFA's qualification allocation for future tournaments, giving Africa more representation.",
    "citationUrl": "https://en.wikipedia.org/wiki/1966_FIFA_World_Cup_qualification",
    "citationTitle": "Wikipedia: 1966 FIFA World Cup qualification"
  },
  {
    "id": "159c8db5-a2eb-4390-b953-3f86544885c6",
    "text": "Who was the first player to score in five different World Cup tournaments?",
    "options": [
      "Pelé",
      "Miroslav Klose",
      "Marta",
      "Cristiano Ronaldo"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Marta of Brazil was the first player to score in five different World Cups (2003, 2007, 2011, 2015, 2019) in women's football.",
    "detailedExplanation": "Marta, the Brazilian women's football legend, became the first player in FIFA World Cup history (men's or women's) to score in five different World Cup tournaments. She scored in the Women's World Cups of 2003, 2007, 2011, 2015, and 2019. Cristiano Ronaldo later achieved this feat in men's football at the 2022 World Cup in Qatar, but Marta had already set this remarkable record years earlier. She is widely regarded as one of the greatest women's football players of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marta_(footballer)",
    "citationTitle": "Wikipedia: Marta (footballer)"
  },
  {
    "id": "d3b92aa1-4f4e-44c1-8ff5-3971df36e0b7",
    "text": "Which World Cup featured the infamous 'Hand of God' goal?",
    "options": [
      "1982 World Cup in Spain",
      "1986 World Cup in Mexico",
      "1990 World Cup in Italy",
      "1994 World Cup in USA"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Diego Maradona's 'Hand of God' goal occurred during the 1986 World Cup quarter-final between Argentina and England.",
    "detailedExplanation": "The 'Hand of God' goal occurred during the 1986 FIFA World Cup in Mexico, in the quarter-final match between Argentina and England on June 22, 1986. Diego Maradona scored by punching the ball into the net with his left hand, which went unnoticed by the referee. Maradona later described it as being scored 'a little with the head of Maradona, and a little with the hand of God.' In the same match, Maradona also scored what is often called the 'Goal of the Century,' dribbling past five English players. Argentina went on to win the tournament.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_hand_of_God",
    "citationTitle": "Wikipedia: The hand of God"
  },
  {
    "id": "efd5f5d9-6a87-46da-9427-ce559492eb3b",
    "text": "What was the original name of the FIFA World Cup trophy before it was renamed?",
    "options": [
      "The Golden Globe",
      "The Jules Rimet Trophy",
      "The FIFA Championship Cup",
      "The International Football Prize"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The original World Cup trophy was called the Jules Rimet Trophy, named after the FIFA president who organized the first World Cup.",
    "detailedExplanation": "The original FIFA World Cup trophy was called the Jules Rimet Trophy, named after Jules Rimet, the FIFA president who organized the first World Cup in 1930. The trophy was awarded from 1930 to 1970. According to the original rules, any country that won the World Cup three times would keep the trophy permanently. Brazil achieved this feat by winning in 1958, 1962, and 1970, so they kept the Jules Rimet Trophy. A new trophy, simply called the FIFA World Cup Trophy, was created for the 1974 tournament and is still used today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jules_Rimet_Trophy",
    "citationTitle": "Wikipedia: Jules Rimet Trophy"
  },
  {
    "id": "fb886eab-a764-47c9-9609-1f09e352297e",
    "text": "Which country hosted the first FIFA World Cup in 1930?",
    "options": [
      "Brazil",
      "Argentina",
      "Uruguay",
      "Chile"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Uruguay hosted and won the first FIFA World Cup in 1930.",
    "detailedExplanation": "Uruguay hosted the inaugural FIFA World Cup in 1930. The tournament was held from July 13-30, 1930, and featured 13 teams. Uruguay was chosen as the host nation partly because they were celebrating the centenary of their independence and had won the football gold medal at the 1928 Olympics. The final was played at the Estadio Centenario in Montevideo, where Uruguay defeated Argentina 4-2 to become the first-ever World Cup winners. Many European teams declined to participate due to the long journey to South America.",
    "citationUrl": "https://en.wikipedia.org/wiki/1930_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 1930 FIFA World Cup"
  },
  {
    "id": "ed0398d6-91f4-4aa8-ad33-043527ce7779",
    "text": "Which World Cup was the first to be held in multiple countries?",
    "options": [
      "2002 Japan/South Korea",
      "1994 USA",
      "2006 Germany",
      "2010 South Africa"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The 2002 World Cup was co-hosted by Japan and South Korea, making it the first World Cup held in multiple countries.",
    "detailedExplanation": "The 2002 FIFA World Cup was the first World Cup to be jointly hosted by two countries: Japan and South Korea. This was also the first World Cup held in Asia. The tournament featured 32 teams and ran from May 31 to June 30, 2002. Matches were played in 10 cities across both countries, with the final held in Yokohama, Japan, where Brazil defeated Germany 2-0. The joint hosting was significant as it marked FIFA's willingness to share hosting duties between nations and opened up new markets in Asia for the World Cup.",
    "citationUrl": "https://en.wikipedia.org/wiki/2002_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 2002 FIFA World Cup"
  },
  {
    "id": "93783003-c415-4256-b447-2a17dba00f0c",
    "text": "Which player holds the record for the most FIFA World Cup appearances across different tournaments?",
    "options": [
      "Lothar Matthäus",
      "Diego Maradona",
      "Pelé",
      "Miroslav Klose"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Lothar Matthäus appeared in 5 World Cups (1982-1998) and played 25 matches total.",
    "detailedExplanation": "German midfielder and defender Lothar Matthäus holds the record for most World Cup tournaments played, appearing in five consecutive World Cups from 1982 to 1998. He also holds the record for most World Cup matches played with 25 games. His longevity and consistent performance for Germany over 16 years made him one of the most recognizable faces in World Cup history, captaining Germany to victory in 1990.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lothar_Matth%C3%A4us",
    "citationTitle": "Wikipedia: Lothar Matthäus"
  },
  {
    "id": "e2fc6316-9b6c-45d7-bf01-e87c8fbddd03",
    "text": "Which World Cup introduced the use of red and yellow cards for the first time?",
    "options": [
      "1966 England",
      "1970 Mexico",
      "1974 West Germany",
      "1978 Argentina"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The 1970 World Cup in Mexico was the first to use the yellow and red card system.",
    "detailedExplanation": "The yellow and red card system was introduced at the 1970 FIFA World Cup in Mexico, following its invention by English referee Ken Aston. The idea came to Aston while he was stuck in traffic at a red light, realizing that a color-coded system would provide clear communication that transcended language barriers. This system revolutionized football officiating and has remained largely unchanged since its introduction.",
    "citationUrl": "https://en.wikipedia.org/wiki/1970_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 1970 FIFA World Cup"
  },
  {
    "id": "c9cbc1c6-a35e-4bf9-aabd-dd5d2ee990ca",
    "text": "What is the highest attendance figure ever recorded for a FIFA World Cup match?",
    "options": [
      "173,850",
      "199,854",
      "210,000",
      "225,268"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "199,854 people attended the 1950 World Cup final between Brazil and Uruguay at Maracanã Stadium.",
    "detailedExplanation": "The highest attendance for a World Cup match was 199,854 at the Estádio do Maracanã in Rio de Janeiro for the decisive final match of the 1950 World Cup between Brazil and Uruguay on July 16, 1950. This figure remains unofficial as exact counting methods weren't as precise as today, but it's widely accepted as the record. The match is remembered not just for the attendance but for Uruguay's shocking 2-1 victory over heavily favored Brazil, silencing the massive home crowd.",
    "citationUrl": "https://en.wikipedia.org/wiki/1950_FIFA_World_Cup_Final",
    "citationTitle": "Wikipedia: 1950 FIFA World Cup Final"
  },
  {
    "id": "94a42d1f-14f7-45b0-b7f7-9b605c4efe88",
    "text": "Which country was awarded hosting rights for a World Cup but was later stripped of them due to political reasons?",
    "options": [
      "Colombia (1986)",
      "Chile (1962)",
      "Mexico (1970)",
      "South Africa (1998)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Colombia was awarded the 1986 World Cup but withdrew in 1982 due to economic problems, with Mexico taking over as host.",
    "detailedExplanation": "Colombia was originally awarded the rights to host the 1986 FIFA World Cup in 1974, but in November 1982, the Colombian government announced it could not afford to host the tournament due to economic difficulties and concerns about civil unrest. FIFA then awarded the hosting rights to Mexico, making it the first country to host the World Cup twice. The decision came just four years before the tournament, creating significant logistical challenges for the reorganization.",
    "citationUrl": "https://en.wikipedia.org/wiki/1986_FIFA_World_Cup",
    "citationTitle": "Wikipedia: 1986 FIFA World Cup"
  },
  {
    "id": "a17b1d71-7104-4cf5-8f68-8d6c24d99d8a",
    "text": "Which team holds the record for the most consecutive World Cup victories?",
    "options": [
      "Brazil (11 wins)",
      "Germany (10 wins)",
      "Italy (9 wins)",
      "Argentina (8 wins)"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Brazil won 11 consecutive World Cup matches between 2002 and 2006.",
    "detailedExplanation": "Brazil holds the record for most consecutive World Cup match victories with 11 wins. This streak began during the 2002 World Cup in South Korea and Japan, where they won their final four matches to claim the title, and continued through their first seven matches of the 2006 World Cup in Germany before being eliminated by France in the quarterfinals. This remarkable run showcased Brazil's dominance during the early 2000s under coach Luiz Felipe Scolari and later Carlos Alberto Parreira.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brazil_at_the_FIFA_World_Cup",
    "citationTitle": "Wikipedia: Brazil at the FIFA World Cup"
  }
]