[
  {
    "id": "3b3cde09-014d-408c-be4c-0b4c48e663ee",
    "text": "Which player holds the record for the most consecutive Grand Slam finals appearances?",
    "options": [
      "Roger Federer",
      "Chris Evert",
      "Ivan Lendl",
      "Martina Navratilova"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Chris Evert reached 34 consecutive Grand Slam finals from 1971 to 1983.",
    "detailedExplanation": "Chris Evert holds one of tennis's most remarkable records by reaching 34 consecutive Grand Slam finals between 1971 and 1983. This incredible streak of consistency lasted over a decade and demonstrates her exceptional ability to perform at the highest level across all surfaces. During this period, she won 18 of those 34 finals, showcasing not just her ability to reach finals but also to win them at an extraordinary rate.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chris_Evert",
    "citationTitle": "Wikipedia: Chris Evert"
  },
  {
    "id": "57de3795-62e1-464a-8936-ccbc6d574876",
    "text": "What unique distinction does the 1969 tennis season hold in Grand Slam history?",
    "options": [
      "First year with tiebreakers at all Grand Slams",
      "Last year before the Open Era began",
      "First year professionals could compete at all four Grand Slams",
      "First year prize money exceeded $1 million total"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "1969 was the first year all four Grand Slams were open to professional players, completing the transition to the Open Era.",
    "detailedExplanation": "The 1969 tennis season marked a pivotal moment in Grand Slam history as it was the first year that all four major tournaments - Australian Open, French Open, Wimbledon, and US Open - were open to professional players. While the Open Era technically began in 1968, the Australian Open didn't join until 1969. This transition ended the amateur-only era and allowed the world's best players, regardless of their professional status, to compete in all Grand Slam events for the first time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Open_Era",
    "citationTitle": "Wikipedia: Open Era"
  },
  {
    "id": "eb79c786-3a79-4007-8d50-cc5c4a9aa81b",
    "text": "Which Grand Slam tournament was the last to introduce a fifth-set tiebreaker?",
    "options": [
      "Australian Open",
      "French Open",
      "Wimbledon",
      "US Open"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The French Open introduced a fifth-set tiebreaker (first to 10 points) in 2022, making it the last Grand Slam to do so.",
    "detailedExplanation": "The French Open was the final Grand Slam to abandon the traditional advantage set format in the deciding set. In 2022, Roland Garros introduced a fifth-set tiebreaker played to 10 points (with a two-point margin) when the set reaches 6-6. This change brought the French Open in line with the other Grand Slams, though each uses slightly different tiebreaker formats. Wimbledon uses a first-to-7 tiebreaker at 12-12 in the fifth set, while the Australian and US Opens use different variations.",
    "citationUrl": "https://en.wikipedia.org/wiki/French_Open",
    "citationTitle": "Wikipedia: French Open"
  },
  {
    "id": "7d52e864-9362-4a50-8edb-d5c1bafade49",
    "text": "Who was the first unseeded player to win a Grand Slam men's singles title in the Open Era?",
    "options": [
      "Mark Edmondson",
      "Goran Ivanišević",
      "Mats Wilander",
      "Boris Becker"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Mark Edmondson won the 1976 Australian Open as an unseeded player, the first to achieve this feat in the Open Era.",
    "detailedExplanation": "Mark Edmondson achieved a remarkable feat by becoming the first unseeded player to win a Grand Slam men's singles title in the Open Era when he captured the 1976 Australian Open. The Australian defeated defending champion John Newcombe in the final. This victory was particularly surprising as Edmondson was ranked outside the world's top 200 at the time. His triumph came during an era when the Australian Open was held in December and many top players skipped the tournament, but it remains an official Grand Slam victory and historic milestone.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mark_Edmondson",
    "citationTitle": "Wikipedia: Mark Edmondson"
  },
  {
    "id": "9fc5a58f-54d5-4a91-a2ea-ea33d83c0ae9",
    "text": "What is the maximum number of Grand Slam singles titles that can theoretically be won in a calendar year?",
    "options": [
      "4",
      "5",
      "6",
      "8"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Five Grand Slam singles titles could theoretically be won if a player wins all four majors plus the Australian Open held in both January and December.",
    "detailedExplanation": "Due to scheduling changes in Grand Slam tennis history, there was a unique period where five Grand Slam singles titles could theoretically be won in a single calendar year. This occurred because the Australian Open switched from December to January, creating situations where the tournament was held twice in the same calendar year (December and the following January). The most notable instance was in 1977, when the Australian Open was held in both December 1977 and January 1978. While no player has ever achieved this feat, it remains theoretically possible during such transition years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Australian_Open",
    "citationTitle": "Wikipedia: Australian Open"
  },
  {
    "id": "279a9df7-3e29-4428-854d-cccc319adddd",
    "text": "Which player holds the record for the longest gap between first and last Grand Slam singles titles?",
    "options": [
      "Ken Rosewall",
      "Andrés Gimeno",
      "Flavia Pennetta",
      "Francesca Schiavone"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Ken Rosewall won his first Grand Slam in 1953 and his last in 1972, a gap of 19 years.",
    "detailedExplanation": "Ken Rosewall holds the remarkable record for the longest span between first and last Grand Slam singles titles, with a gap of 19 years between his first major victory at the 1953 Australian Open and his final triumph at the 1972 Australian Open. This extraordinary longevity is even more impressive considering that Rosewall was banned from Grand Slam competition for several years during his prime when he turned professional, as the tournaments were amateur-only at the time. His career spanned both the amateur and Open Era, demonstrating exceptional skill and fitness across nearly two decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ken_Rosewall",
    "citationTitle": "Wikipedia: Ken Rosewall"
  },
  {
    "id": "cd2bf9d7-760c-494a-adcc-7913ef545d5c",
    "text": "What unique surface characteristic distinguished the US Open from 1975 to 1977?",
    "options": [
      "It was played on clay courts",
      "It used green-colored Har-Tru courts",
      "It was played on indoor carpet",
      "It used a unique blue hard court surface"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "From 1975-1977, the US Open was played on green-colored Har-Tru clay courts at Forest Hills.",
    "detailedExplanation": "During a brief but notable period from 1975 to 1977, the US Open was played on distinctive green-colored Har-Tru clay courts at the West Side Tennis Club in Forest Hills. This surface was unique among Grand Slams and created a different playing experience compared to the traditional red clay used at the French Open. The green Har-Tru was an American-developed clay surface that played somewhat faster than European red clay. In 1978, the tournament moved to its current home at Flushing Meadows and switched to hard courts, ending this unique chapter in US Open history.",
    "citationUrl": "https://en.wikipedia.org/wiki/US_Open_(tennis)",
    "citationTitle": "Wikipedia: US Open (tennis)"
  },
  {
    "id": "7a334fc3-fa78-4209-83c4-bccf2a67841d",
    "text": "Which Grand Slam was the first to introduce electronic line calling (Hawk-Eye) for all courts?",
    "options": [
      "US Open",
      "Australian Open",
      "Wimbledon",
      "French Open"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Australian Open became the first Grand Slam to use electronic line calling on all courts in 2021.",
    "detailedExplanation": "The 2021 Australian Open made tennis history by becoming the first Grand Slam tournament to implement electronic line calling (using Hawk-Eye Live technology) on all courts, completely eliminating human line judges. This decision was initially driven by COVID-19 restrictions to reduce the number of people on court, but the technology proved so successful that it has been retained. The system uses multiple cameras to track ball placement with millimeter precision, providing instant calls without the need for player challenges. This innovation marked a significant technological advancement in professional tennis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Australian_Open",
    "citationTitle": "Wikipedia: Australian Open"
  },
  {
    "id": "882199ea-a264-485b-a04b-fe78878e813c",
    "text": "Which player achieved the extremely rare feat of winning all four Grand Slam doubles titles (men's, women's, and mixed) in a single calendar year?",
    "options": [
      "Martina Navratilova",
      "Margaret Court",
      "Doris Hart",
      "Frank Sedgman"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Doris Hart accomplished this remarkable feat in 1951.",
    "detailedExplanation": "Doris Hart achieved one of tennis's rarest accomplishments in 1951 by winning all four Grand Slam tournaments in doubles competitions across all categories - men's doubles (mixed), women's doubles, and mixed doubles. This 'Triple Crown' across all four majors in a single year has been achieved by very few players in tennis history, making it even rarer than the traditional Grand Slam in singles.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doris_Hart",
    "citationTitle": "Wikipedia: Doris Hart"
  },
  {
    "id": "fc7f09f4-2aec-46a6-98db-8cfea1b2024f",
    "text": "What was the prize money for the men's singles champion at the very first Wimbledon Championships in 1877?",
    "options": [
      "25 guineas",
      "12 guineas",
      "50 guineas",
      "There was no prize money"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The first Wimbledon champion Spencer Gore received 12 guineas.",
    "detailedExplanation": "Spencer Gore, who won the inaugural Wimbledon Championships in 1877, received prize money of 12 guineas (equivalent to roughly £1,500 today). The tournament was originally called 'The Championships' and was held at the All England Croquet and Lawn Tennis Club. Only 22 players entered the first tournament, and Gore's victory established him as the first Wimbledon champion in tennis history.",
    "citationUrl": "https://en.wikipedia.org/wiki/1877_Wimbledon_Championship",
    "citationTitle": "Wikipedia: 1877 Wimbledon Championship"
  },
  {
    "id": "9df8f7a8-4d36-44ab-9855-e2ee6e98f8b3",
    "text": "Which Grand Slam tournament holds the record for the highest single-day attendance figure in tennis history?",
    "options": [
      "Wimbledon",
      "US Open",
      "French Open",
      "Australian Open"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The US Open set the record with over 74,000 spectators in a single day.",
    "detailedExplanation": "The US Open holds the record for the highest single-day attendance at a tennis tournament, with over 74,000 spectators recorded during peak days at the USTA Billie Jean King National Tennis Center. The tournament's location in New York and its hard court surface, combined with night sessions and multiple courts running simultaneously, allows for maximum capacity crowds that exceed other Grand Slam venues.",
    "citationUrl": "https://en.wikipedia.org/wiki/US_Open_(tennis)",
    "citationTitle": "Wikipedia: US Open (tennis)"
  },
  {
    "id": "4f381c40-93ab-4ff0-8e63-72b4a7e2858d",
    "text": "Before the Open Era began in 1968, which Grand Slam was the only one to allow both amateur and professional players to compete together?",
    "options": [
      "French Open",
      "US Open",
      "Australian Open",
      "None - all were amateur only"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The French Open briefly allowed pros and amateurs to compete together in 1968 before the official Open Era.",
    "detailedExplanation": "The French Open was actually the first Grand Slam tournament to open its doors to professional players, doing so in May 1968, which marked the beginning of the Open Era. While all Grand Slam tournaments had previously been restricted to amateur players only, the French Tennis Federation made the groundbreaking decision to allow professionals to compete alongside amateurs, ending decades of separation between the two groups in major championship tennis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Open_Era",
    "citationTitle": "Wikipedia: Open Era"
  },
  {
    "id": "d0da3a8d-bd65-4eb8-b967-bab39412dbd2",
    "text": "Which player holds the record for the most Grand Slam match wins without ever winning a singles title?",
    "options": [
      "David Ferrer",
      "Ivan Lendl",
      "Ilie Năstase",
      "David Nalbandian"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "David Ferrer won 224 Grand Slam matches but never captured a singles title.",
    "detailedExplanation": "David Ferrer, the Spanish tennis player, holds the unfortunate record of most Grand Slam match victories (224) without ever winning a singles title. Despite reaching the French Open final in 2013 and multiple semifinals across all four majors, Ferrer's consistent high-level play throughout his career earned him numerous match wins but he was unable to capture an elusive major title, often falling to players like Rafael Nadal, Novak Djokovic, and Roger Federer during their dominant periods.",
    "citationUrl": "https://en.wikipedia.org/wiki/David_Ferrer",
    "citationTitle": "Wikipedia: David Ferrer"
  },
  {
    "id": "2df14910-2f24-47a6-b26e-3a18b0a3bf47",
    "text": "What unusual scheduling distinction did the Australian Open hold from 1977 to 1985?",
    "options": [
      "It was played twice per year",
      "It was played in March",
      "It was cancelled entirely",
      "It rotated between cities"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Australian Open was held twice in 1977 (January and December) and then annually in December until moving to January in 1987.",
    "detailedExplanation": "From 1977 to 1985, the Australian Open had an unusual scheduling arrangement where it was held in December rather than January. This change was implemented to attract more international players and avoid conflicts with the other Grand Slams. Most notably, in 1977, the tournament was actually held twice - once in January (the traditional time) and once in December, creating a unique year with two Australian Opens. The tournament returned to its current January slot in 1987.",
    "citationUrl": "https://en.wikipedia.org/wiki/Australian_Open",
    "citationTitle": "Wikipedia: Australian Open"
  },
  {
    "id": "138f5acb-ac5f-49c1-9702-77521282da20",
    "text": "Which Grand Slam tournament was the first to introduce equal prize money for men's and women's singles champions?",
    "options": [
      "US Open",
      "Australian Open",
      "Wimbledon",
      "French Open"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The US Open introduced equal prize money in 1973, becoming the first Grand Slam to do so.",
    "detailedExplanation": "The US Open became the first Grand Slam tournament to offer equal prize money to men's and women's singles champions in 1973, largely due to the advocacy of Billie Jean King and the threat of a women's boycott. This groundbreaking decision came during the height of the women's liberation movement and was a significant milestone for gender equality in professional sports. The other Grand Slams followed suit much later, with Wimbledon being the last to introduce equal prize money in 2007.",
    "citationUrl": "https://en.wikipedia.org/wiki/US_Open_(tennis)",
    "citationTitle": "Wikipedia: US Open (tennis)"
  },
  {
    "id": "20e29424-3363-4dee-bf20-719d61b13a6a",
    "text": "In which year did all four Grand Slam tournaments first use the same type of tennis ball (pressurized) for the first time in the Open Era?",
    "options": [
      "1982",
      "1989",
      "1995",
      "2001"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "By 1989, all Grand Slams had switched to pressurized tennis balls, standardizing equipment across the majors.",
    "detailedExplanation": "The year 1989 marked the first time that all four Grand Slam tournaments used pressurized tennis balls, creating greater standardization across the major championships. Prior to this, different tournaments used different types of balls, which could significantly affect playing conditions and player performance. The French Open was the last to make the switch to pressurized balls, completing the standardization process that helped create more consistent playing conditions across all four major tournaments.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tennis_ball",
    "citationTitle": "Wikipedia: Tennis ball"
  },
  {
    "id": "31a485e3-296b-4300-bac2-66138a8f422e",
    "text": "Which Grand Slam tournament has been played at the most different venues throughout its history?",
    "options": [
      "US Open",
      "French Open",
      "Wimbledon",
      "Australian Open"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The US Open has been played at seven different venues since 1881.",
    "detailedExplanation": "The US Open has had the most nomadic history among Grand Slams, having been played at seven different venues: Newport Casino (1881-1914), West Side Tennis Club at Forest Hills (1915-1920, 1924-1977), Germantown Cricket Club (1921-1923), and finally the USTA Billie Jean King National Tennis Center in Flushing Meadows since 1978. In contrast, Wimbledon has remained at the All England Club since 1877, the French Open has been at Roland Garros since 1928, and the Australian Open has only moved between three cities.",
    "citationUrl": "https://en.wikipedia.org/wiki/US_Open_(tennis)",
    "citationTitle": "Wikipedia: US Open (tennis)"
  },
  {
    "id": "6dcb6431-a3c9-42ee-9afe-15f5cf1d9324",
    "text": "What is the shortest completed Grand Slam singles final in terms of games played in the Open Era?",
    "options": [
      "18 games",
      "12 games",
      "15 games",
      "21 games"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 1988 French Open women's final between Steffi Graf and Natasha Zvereva lasted only 18 games (6-0, 6-0).",
    "detailedExplanation": "The shortest Grand Slam singles final in the Open Era was the 1988 French Open women's final, where Steffi Graf defeated Natasha Zvereva 6-0, 6-0 in just 18 games and 32 minutes. This remains one of the most dominant performances in Grand Slam final history. Graf was at the peak of her powers during her Golden Slam year, and Zvereva, despite being a talented player who would go on to win 12 Grand Slam doubles titles, was completely overwhelmed on that day.",
    "citationUrl": "https://en.wikipedia.org/wiki/1988_French_Open_%E2%80%93_Women%27s_Singles",
    "citationTitle": "Wikipedia: 1988 French Open – Women's Singles"
  },
  {
    "id": "61ba80e9-bd47-4cc2-b047-4ea7d46d1afe",
    "text": "Which Grand Slam tournament was the first to introduce a retractable roof over its main court?",
    "options": [
      "Wimbledon",
      "Australian Open",
      "US Open",
      "French Open"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Australian Open installed a retractable roof over Rod Laver Arena in 1988.",
    "detailedExplanation": "The Australian Open was the pioneer in Grand Slam roof technology, installing the first retractable roof over Rod Laver Arena (then called Centre Court) in 1988. This innovation was particularly important for the Australian Open due to Melbourne's unpredictable weather conditions and extreme heat. Wimbledon didn't add its retractable roof to Centre Court until 2009, while the US Open installed roofs over Arthur Ashe Stadium and Louis Armstrong Stadium much later (2016 and 2018 respectively). The French Open only recently added a retractable roof to Court Philippe Chatrier in 2020.",
    "citationUrl": "https://en.wikipedia.org/wiki/Australian_Open",
    "citationTitle": "Wikipedia: Australian Open"
  },
  {
    "id": "01aa2436-e345-4bc1-a8ed-aeaae5bad3af",
    "text": "Which player holds the record for the most Grand Slam singles titles won after turning 30 years old?",
    "options": [
      "Roger Federer",
      "Novak Djokovic",
      "Rafael Nadal",
      "Serena Williams"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Novak Djokovic has won 12 Grand Slam singles titles after turning 30.",
    "detailedExplanation": "Novak Djokovic holds the remarkable record for most Grand Slam singles titles won after age 30, with 12 titles. This achievement highlights his incredible longevity and ability to maintain peak performance well into his thirties. Djokovic turned 30 in May 2017 and continued his dominance, winning multiple titles at each Grand Slam venue. This record is particularly impressive considering the physical demands of modern tennis and demonstrates how sports science and training methods have evolved to extend careers at the highest level.",
    "citationUrl": "https://en.wikipedia.org/wiki/Novak_Djokovic",
    "citationTitle": "Wikipedia: Novak Djokovic"
  }
]