[
  {
    "id": "2bc9884f-b1b8-47a3-9222-f6a8f7eca7ab",
    "text": "Which tennis player holds the record for most men's Grand Slam singles titles with 24?",
    "options": [
      "Roger Federer",
      "Rafael Nadal",
      "Novak Djokovic",
      "Pete Sampras"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Novak Djokovic holds the men's record with 24 Grand Slam singles titles.",
    "detailedExplanation": "Novak Djokovic surpassed the previous record holders by winning his 23rd Grand Slam at the 2023 French Open and his 24th at the 2023 US Open. This achievement made him the most successful male tennis player in terms of Grand Slam singles titles, overtaking Rafael Nadal (22 titles) and Roger Federer (20 titles). His victories span across all four Grand Slam tournaments, making him one of only eight men to achieve the Career Grand Slam.",
    "citationUrl": "https://en.wikipedia.org/wiki/Novak_Djokovic",
    "citationTitle": "Wikipedia: Novak Djokovic"
  },
  {
    "id": "cd09e6da-d275-4d0f-8e7e-74b613ca8f14",
    "text": "What is the surface type used at the French Open (Roland Garros)?",
    "options": [
      "Hard court",
      "Grass",
      "Clay",
      "Carpet"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The French Open is played on clay courts, making it unique among the Grand Slams.",
    "detailedExplanation": "The French Open at Roland Garros is the only Grand Slam tournament played on clay courts. Clay is the slowest surface in professional tennis, made from crushed brick or stone, which creates a distinctive red color. The surface significantly affects gameplay, producing higher bounces and slower ball speeds, which tends to favor baseline players with strong topspin. This is why players like Rafael Nadal, known as the 'King of Clay,' have dominated this tournament, with Nadal winning it a record 14 times.",
    "citationUrl": "https://en.wikipedia.org/wiki/French_Open",
    "citationTitle": "Wikipedia: French Open"
  },
  {
    "id": "15fc29d7-7055-4c23-ab55-3b095ac3c548",
    "text": "Which Grand Slam tournament is known for its traditional all-white dress code?",
    "options": [
      "US Open",
      "Australian Open",
      "Wimbledon",
      "French Open"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Wimbledon maintains a strict all-white clothing policy for all players.",
    "detailedExplanation": "Wimbledon is famous for its traditional all-white dress code, which has been enforced since the tournament began in 1877. The All England Lawn Tennis and Croquet Club's dress code states that players must wear clothing that is 'almost entirely white,' with very limited exceptions for small amounts of color trim. This tradition stems from the Victorian era when white clothing was associated with leisure activities of the upper class. The rule is strictly enforced, and players have been asked to change clothing that doesn't comply with the regulations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wimbledon_Championships",
    "citationTitle": "Wikipedia: Wimbledon Championships"
  },
  {
    "id": "0f8082e8-f6f5-429f-ae3d-a1886f227523",
    "text": "In which city is the US Open tennis tournament held?",
    "options": [
      "Los Angeles",
      "Miami",
      "New York",
      "Boston"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The US Open is held in New York, specifically in Queens at the USTA Billie Jean King National Tennis Center.",
    "detailedExplanation": "The US Open takes place annually in New York City, specifically in the borough of Queens at the USTA Billie Jean King National Tennis Center in Flushing Meadows Corona Park. The tournament moved to this location in 1978, and the facility was later renamed in honor of tennis legend Billie Jean King in 2006. The venue features hard courts and is known for its electric atmosphere, particularly in the main stadium, Arthur Ashe Stadium, which is the largest tennis stadium in the world with a capacity of over 23,000 spectators.",
    "citationUrl": "https://en.wikipedia.org/wiki/US_Open_(tennis)",
    "citationTitle": "Wikipedia: US Open (tennis)"
  },
  {
    "id": "219dbeb7-fc3e-4c1f-adf3-d4404067615e",
    "text": "Who was the last player to achieve a Calendar Year Grand Slam in men's singles?",
    "options": [
      "Rod Laver",
      "Don Budge",
      "Novak Djokovic",
      "Roger Federer"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Rod Laver completed the Calendar Year Grand Slam in 1969, and remains the last man to achieve this feat.",
    "detailedExplanation": "Rod Laver of Australia is the last male player to win all four Grand Slam tournaments in a single calendar year, achieving this remarkable feat in 1969. Remarkably, Laver actually accomplished the Calendar Year Grand Slam twice - first as an amateur in 1962, and then again as a professional in 1969. The Calendar Year Grand Slam is considered one of tennis's greatest achievements, requiring a player to win the Australian Open, French Open, Wimbledon, and US Open all in the same year. Since Laver's 1969 achievement, no male player has managed to repeat this extraordinary accomplishment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rod_Laver",
    "citationTitle": "Wikipedia: Rod Laver"
  },
  {
    "id": "10867efd-ffda-4512-a23e-36f9c10efb98",
    "text": "Which female tennis player holds the record for most Grand Slam singles titles in the Open Era?",
    "options": [
      "Martina Navratilova",
      "Chris Evert",
      "Steffi Graf",
      "Serena Williams"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Serena Williams holds the Open Era record with 23 Grand Slam singles titles.",
    "detailedExplanation": "Serena Williams holds the record for most Grand Slam singles titles in the Open Era (since 1968) with 23 titles. Her Grand Slam victories span from 1999 to 2017, including 7 Wimbledon titles, 6 US Open titles, 3 French Open titles, and 7 Australian Open titles. This achievement places her just one title behind Margaret Court's all-time record of 24 Grand Slam singles titles, though Court won 13 of her titles before the Open Era began. Williams' dominance across nearly two decades makes her one of the greatest tennis players of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Serena_Williams",
    "citationTitle": "Wikipedia: Serena Williams"
  },
  {
    "id": "7a5d0f66-32a2-43f3-9b38-202f8b1198dc",
    "text": "What is the term for winning all four Grand Slam tournaments, but not necessarily in the same calendar year?",
    "options": [
      "Career Grand Slam",
      "Golden Slam",
      "Super Slam",
      "Major Slam"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "A Career Grand Slam refers to winning all four Grand Slam tournaments over the course of a career.",
    "detailedExplanation": "The Career Grand Slam is achieved when a tennis player wins all four Grand Slam tournaments (Australian Open, French Open, Wimbledon, and US Open) at any point during their career, regardless of whether they occur in the same calendar year. This is distinguished from the Calendar Year Grand Slam, where all four titles must be won within a single year. Only a select few players have achieved the Career Grand Slam in singles, including Rod Laver, Don Budge, Roy Emerson, Andre Agassi, Roger Federer, Rafael Nadal, and Novak Djokovic in men's tennis, and Maureen Connolly, Doris Hart, Shirley Fry Irvin, Margaret Court, Billie Jean King, Chris Evert, Martina Navratilova, Steffi Graf, and Serena Williams in women's tennis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grand_Slam_(tennis)",
    "citationTitle": "Wikipedia: Grand Slam (tennis)"
  },
  {
    "id": "a1758122-9387-4844-8586-cdb00a31a0f6",
    "text": "Which Grand Slam tournament was the last to allow professional players to compete alongside amateurs?",
    "options": [
      "French Open",
      "Wimbledon",
      "US Open",
      "Australian Open"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Wimbledon was the last Grand Slam to become 'open' to professionals in 1968, marking the start of the Open Era.",
    "detailedExplanation": "Wimbledon was actually the first Grand Slam tournament to allow professional players to compete alongside amateurs, not the last. In 1968, Wimbledon became the first Grand Slam to 'go open,' allowing both amateur and professional players to compete together for the first time. This historic decision marked the beginning of the Open Era in tennis. The other Grand Slam tournaments quickly followed suit that same year, with the French Open also becoming open in 1968. This change revolutionized professional tennis by ending the artificial distinction between amateur and professional players and allowing the world's best players to compete against each other regardless of their status.",
    "citationUrl": "https://en.wikipedia.org/wiki/Open_Era",
    "citationTitle": "Wikipedia: Open Era"
  },
  {
    "id": "d953bc51-cff6-4ffb-a36a-d329055928ef",
    "text": "Which player achieved the rare feat of winning all four Grand Slam tournaments in a single calendar year twice?",
    "options": [
      "Steffi Graf",
      "Martina Navratilova",
      "Chris Evert",
      "Serena Williams"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Steffi Graf accomplished the Calendar Year Grand Slam in both 1988 and 1989.",
    "detailedExplanation": "Steffi Graf is the only player in tennis history to achieve the Calendar Year Grand Slam twice, winning all four major tournaments in consecutive years (1988 and 1989). In 1988, she also won the Olympic gold medal, completing what is known as the 'Golden Slam.' Her dominance during this period is considered one of the greatest achievements in tennis history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Steffi_Graf",
    "citationTitle": "Wikipedia: Steffi Graf"
  },
  {
    "id": "3d244920-3eb3-4292-a977-785f7951c2f1",
    "text": "What is the maximum number of sets that can be played in a men's Grand Slam singles final?",
    "options": [
      "3 sets",
      "4 sets",
      "5 sets",
      "6 sets"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Men's Grand Slam singles matches are best-of-five sets, so the maximum is 5 sets.",
    "detailedExplanation": "Men's Grand Slam singles matches are played in a best-of-five sets format, meaning a player must win three sets to claim victory. This can result in matches lasting up to five sets if the score reaches 2-2 in sets. Women's Grand Slam singles matches, by contrast, are best-of-three sets. This format difference has been a longstanding tradition in professional tennis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grand_Slam_(tennis)",
    "citationTitle": "Wikipedia: Grand Slam (tennis)"
  },
  {
    "id": "ae58f577-4eb3-4662-94e6-aa2ef6a1b637",
    "text": "Which Grand Slam tournament has the largest stadium by seating capacity?",
    "options": [
      "Wimbledon's Centre Court",
      "US Open's Arthur Ashe Stadium",
      "French Open's Court Philippe-Chatrier",
      "Australian Open's Rod Laver Arena"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Arthur Ashe Stadium at the US Open has a capacity of approximately 23,771, making it the largest tennis stadium in the world.",
    "detailedExplanation": "Arthur Ashe Stadium, the main venue for the US Open in Flushing Meadows, New York, is the largest tennis stadium in the world with a seating capacity of 23,771. Named after the American tennis champion Arthur Ashe, the stadium opened in 1997 and features a retractable roof that was added in 2016. Its massive size reflects the US Open's status as one of the most attended annual sporting events in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arthur_Ashe_Stadium",
    "citationTitle": "Wikipedia: Arthur Ashe Stadium"
  },
  {
    "id": "2b5ef352-4872-4769-a0b6-29e8455e3558",
    "text": "In which decade did the Australian Open switch from being played on grass to hard courts?",
    "options": [
      "1970s",
      "1980s",
      "1990s",
      "2000s"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Australian Open switched from grass to hard courts in 1988.",
    "detailedExplanation": "The Australian Open underwent a significant transformation in 1988 when it moved from the Kooyong Lawn Tennis Club (grass courts) to Melbourne Park and switched to hard courts. This change was part of modernizing the tournament and occurred alongside the move to a new, larger venue. The switch made the Australian Open unique among Grand Slams as it became the only one played on hard courts at that time, helping to establish its distinct identity in the tennis calendar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Australian_Open",
    "citationTitle": "Wikipedia: Australian Open"
  },
  {
    "id": "1ed47e15-e45c-4cf8-b4bb-816cb7e00983",
    "text": "Which player holds the record for most consecutive Grand Slam singles titles won?",
    "options": [
      "Martina Navratilova with 6",
      "Steffi Graf with 6",
      "Novak Djokovic with 4",
      "Serena Williams with 4"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Martina Navratilova won six consecutive Grand Slam singles titles from 1983-1984.",
    "detailedExplanation": "Martina Navratilova holds the record for most consecutive Grand Slam singles titles with six straight victories spanning from Wimbledon 1983 through the US Open 1984. This incredible streak included Wimbledon 1983, US Open 1983, Australian Open 1983 (played in December), French Open 1984, Wimbledon 1984, and US Open 1984. This achievement showcases her dominance across all surfaces and her exceptional consistency during the peak of her career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Martina_Navratilova",
    "citationTitle": "Wikipedia: Martina Navratilova"
  },
  {
    "id": "38c4d1b2-58c0-4b8d-b2a5-1f744c9f1f28",
    "text": "What is the minimum age a player must be to compete in Grand Slam qualifying tournaments?",
    "options": [
      "14 years old",
      "15 years old",
      "16 years old",
      "18 years old"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Players must be at least 14 years old to compete in Grand Slam qualifying events.",
    "detailedExplanation": "According to professional tennis regulations, players must be at least 14 years old to participate in Grand Slam qualifying tournaments. This age restriction is part of player development guidelines designed to ensure young athletes are physically and mentally prepared for the demands of professional competition. While 14-year-olds can compete in qualifying, there are additional restrictions on the number of professional tournaments younger players can enter each year to protect their development and education.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tennis_regulations",
    "citationTitle": "Wikipedia: Tennis regulations"
  },
  {
    "id": "80f06135-633d-4b82-a05d-bf564df31ce6",
    "text": "Which Grand Slam was the first to introduce a tiebreak system?",
    "options": [
      "Wimbledon",
      "US Open",
      "French Open",
      "Australian Open"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The US Open was the first Grand Slam to adopt the tiebreak system in 1970.",
    "detailedExplanation": "The US Open pioneered the use of tiebreaks in Grand Slam tennis when it introduced the system in 1970. The tiebreak was invented by James Van Alen and was designed to prevent excessively long sets and matches. Other Grand Slams gradually adopted tiebreak systems over the following years, though each has maintained slightly different rules. Notably, Wimbledon was the last to fully embrace tiebreaks and still uses unique rules for its final sets compared to other tournaments.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tiebreaker_(tennis)",
    "citationTitle": "Wikipedia: Tiebreaker (tennis)"
  },
  {
    "id": "fa4aec35-f5ef-47df-856b-04631f45ed5f",
    "text": "How many different players have achieved the Career Grand Slam in men's singles during the Open Era?",
    "options": [
      "6 players",
      "8 players",
      "10 players",
      "12 players"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Eight men have completed the Career Grand Slam in singles during the Open Era (since 1968).",
    "detailedExplanation": "Since the beginning of the Open Era in 1968, eight men have achieved the Career Grand Slam in singles by winning all four major tournaments at least once during their careers. These players are: Rod Laver, Andre Agassi, Roger Federer, Rafael Nadal, Novak Djokovic, Roy Emerson (who completed it during the Open Era though he started before), Ken Rosewall, and Don Budge's wins also count. This exclusive group represents the elite of men's tennis, as winning on all four different surfaces and conditions requires exceptional versatility and longevity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grand_Slam_(tennis)",
    "citationTitle": "Wikipedia: Grand Slam (tennis)"
  },
  {
    "id": "b117f6d4-e294-4db1-9fbd-07dc9e144937",
    "text": "Which Grand Slam tournament awards the Venus Rosewater Dish to its women's singles champion?",
    "options": [
      "Wimbledon",
      "French Open",
      "US Open",
      "Australian Open"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Wimbledon awards the Venus Rosewater Dish to the women's singles champion, while the men's champion receives the Challenge Cup.",
    "detailedExplanation": "The Venus Rosewater Dish is the iconic silver salver trophy presented to the Ladies' Singles champion at Wimbledon. Dating back to 1886, the trophy features ornate engravings and mythological figures around Venus, the Roman goddess of beauty. Unlike other Grand Slams where winners keep their trophies, Wimbledon champions receive replica trophies while the originals remain at the All England Club. The men's equivalent is the Challenge Cup, creating Wimbledon's unique tradition of gender-specific historic trophies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wimbledon_Championships",
    "citationTitle": "Wikipedia: Wimbledon Championships"
  },
  {
    "id": "6d88159e-bd5b-48ed-ab47-d9e8f1b30a3a",
    "text": "What is the prize money difference policy between men's and women's singles champions called when they receive equal amounts?",
    "options": [
      "Equal Prize Initiative",
      "Gender Parity Rule",
      "Equal Prize Money",
      "Fair Play Policy"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Equal prize money refers to the policy where male and female champions receive identical prize amounts at Grand Slam tournaments.",
    "detailedExplanation": "Equal prize money at Grand Slam tournaments was a significant milestone in tennis gender equality. The US Open was the first to implement this in 1973, followed by the Australian Open in 2001, the French Open in 2006, and finally Wimbledon in 2007. Before this policy, female players often received significantly less prize money than their male counterparts, despite generating similar television ratings and attendance. The implementation of equal prize money across all four Grand Slams marked a major victory for gender equality in professional sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Equal_prize_money",
    "citationTitle": "Wikipedia: Equal prize money"
  },
  {
    "id": "f3328f98-8985-4674-ac82-2cdb76d7358a",
    "text": "Which Grand Slam tournament moved from Forest Hills to its current location in 1978?",
    "options": [
      "Australian Open",
      "French Open",
      "US Open",
      "Wimbledon"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The US Open moved from Forest Hills to Flushing Meadows (USTA Billie Jean King National Tennis Center) in 1978.",
    "detailedExplanation": "The US Open underwent a significant relocation in 1978, moving from the West Side Tennis Club in Forest Hills, Queens, to the newly constructed USTA National Tennis Center in Flushing Meadows, also in Queens. This move was necessitated by the tournament's growing popularity and the need for larger facilities. The new venue provided more courts, greater spectator capacity, and better infrastructure. The facility was later renamed the USTA Billie Jean King National Tennis Center in 2006 to honor the tennis legend's contributions to the sport and gender equality.",
    "citationUrl": "https://en.wikipedia.org/wiki/US_Open_(tennis)",
    "citationTitle": "Wikipedia: US Open (tennis)"
  },
  {
    "id": "0750b1f1-9f3a-44d3-acbf-c7d4426d41f7",
    "text": "What is the name of the statistical achievement when a player reaches the semifinals or better at all four Grand Slams in a single year?",
    "options": [
      "Grand Slam Streak",
      "Major Semifinals Sweep",
      "Grand Slam Consistency",
      "No official term exists"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "There is no widely recognized official statistical term for reaching the semifinals at all four Grand Slams in one year, unlike the defined 'Grand Slam' achievement.",
    "detailedExplanation": "While tennis has well-defined terms for major achievements like the 'Grand Slam' (winning all four majors) and 'Career Grand Slam' (winning each major at least once), there is no universally accepted official term for reaching the semifinals or better at all four Grand Slams in a single year. Tennis commentators and analysts sometimes refer to such consistency in various ways, but unlike the clearly defined major milestones, this particular achievement lacks standardized terminology. This reflects how tennis terminology has evolved around the most prestigious accomplishments rather than intermediate consistency measures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grand_Slam_(tennis)",
    "citationTitle": "Wikipedia: Grand Slam (tennis)"
  }
]