[
  {
    "id": "ba356d16-e97d-4e86-a75a-585ba55711c0",
    "text": "Which spice is derived from the dried stigmas of a flower and is known as the world's most expensive spice by weight?",
    "options": [
      "Cardamom",
      "Saffron",
      "Vanilla",
      "Cinnamon"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Saffron comes from the dried stigmas of the Crocus sativus flower and can cost over $5,000 per pound.",
    "detailedExplanation": "Saffron is harvested from the flower of Crocus sativus, commonly known as the 'saffron crocus.' Each flower produces only three stigmas, which must be hand-picked during a brief harvest season. It takes around 150 flowers to produce just 1 gram of saffron, making it incredibly labor-intensive to harvest. This scarcity, combined with its distinctive flavor and golden color, makes saffron the most expensive spice in the world by weight.",
    "citationUrl": "https://en.wikipedia.org/wiki/Saffron",
    "citationTitle": "Wikipedia: Saffron"
  },
  {
    "id": "4845bda6-3dbf-4df9-85d7-8028b707f6d3",
    "text": "What is the primary active compound in black pepper that gives it its characteristic heat?",
    "options": [
      "Capsaicin",
      "Piperine",
      "Allicin",
      "Gingerol"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Piperine is the alkaloid compound responsible for black pepper's sharp, biting heat.",
    "detailedExplanation": "Piperine is an alkaloid compound that makes up about 5-9% of black pepper by mass. Unlike capsaicin (found in chili peppers), piperine creates a different type of heat sensation - more of a sharp, biting sensation rather than a burning one. Piperine also has potential health benefits and can enhance the absorption of certain nutrients and medications. The compound is concentrated in the outer layer of the peppercorn, which is why white pepper (with the outer layer removed) is milder than black pepper.",
    "citationUrl": "https://en.wikipedia.org/wiki/Piperine",
    "citationTitle": "Wikipedia: Piperine"
  },
  {
    "id": "fcc4e30f-f299-4eba-bce9-795e0c267d35",
    "text": "Which spice blend is traditionally used in Middle Eastern cuisine and typically contains sumac, thyme, and sesame seeds?",
    "options": [
      "Harissa",
      "Za'atar",
      "Baharat",
      "Dukkah"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Za'atar is a Middle Eastern spice blend featuring sumac, thyme, sesame seeds, and salt.",
    "detailedExplanation": "Za'atar is a popular Middle Eastern spice blend that varies by region but typically includes dried thyme, sumac, toasted sesame seeds, and salt. The sumac provides a tangy, lemony flavor, while the thyme adds an earthy herbaceous note. Za'atar is commonly mixed with olive oil and used as a dip for bread, sprinkled on flatbreads, or used to season vegetables and meats. The blend has been used in Middle Eastern cuisine for thousands of years and is particularly popular in Palestinian, Lebanese, Syrian, and Jordanian cooking.",
    "citationUrl": "https://en.wikipedia.org/wiki/Za%27atar",
    "citationTitle": "Wikipedia: Za'atar"
  },
  {
    "id": "caed4c8f-7ebb-4d8c-852f-7a53bce7939b",
    "text": "What part of the nutmeg seed produces the spice called mace?",
    "options": [
      "The inner kernel",
      "The outer shell",
      "The seed coating (aril)",
      "The stem attachment"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Mace is the reddish aril (seed covering) that surrounds the nutmeg seed inside the fruit.",
    "detailedExplanation": "Mace and nutmeg both come from the same plant, Myristica fragrans. The nutmeg tree produces a fruit that splits open to reveal a seed covered by a bright red, lacy covering called an aril. This aril is dried and becomes mace, while the seed inside becomes nutmeg. Mace has a more delicate, slightly sweeter flavor compared to nutmeg and is often used in lighter-colored dishes where the appearance matters. Both spices were historically so valuable that they sparked colonial wars and trade disputes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mace_(spice)",
    "citationTitle": "Wikipedia: Mace (spice)"
  },
  {
    "id": "ce37dc13-b060-4e78-86c5-0f39bbeb58fc",
    "text": "Which spice is known as 'liquid smoke' when processed and was historically used as currency in some cultures?",
    "options": [
      "Paprika",
      "Cardamom",
      "Peppercorns",
      "Star anise"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Peppercorns were so valuable they were used as currency and are sometimes processed into liquid smoke flavoring.",
    "detailedExplanation": "Black peppercorns were incredibly valuable in ancient and medieval times, often called 'black gold' and literally used as currency in some transactions. They were so prized that they were sometimes used to pay rent, dowries, and taxes. The Romans particularly valued pepper, and it was one of the most sought-after spices that drove the spice trade routes. While the 'liquid smoke' reference is less common, pepper extracts and essences are used in food processing. The high value of pepper was due to its long journey from India and Southeast Asia to European markets.",
    "citationUrl": "https://en.wikipedia.org/wiki/Black_pepper",
    "citationTitle": "Wikipedia: Black pepper"
  },
  {
    "id": "f8f324c5-0cb7-419c-9a23-ac1f9b633747",
    "text": "What gives turmeric its distinctive bright yellow color?",
    "options": [
      "Beta-carotene",
      "Curcumin",
      "Lutein",
      "Riboflavin"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Curcumin is the active compound in turmeric responsible for its bright yellow color and potential health benefits.",
    "detailedExplanation": "Curcumin is the primary bioactive compound in turmeric, making up about 2-8% of most turmeric preparations. This polyphenolic compound not only gives turmeric its distinctive bright yellow-orange color but is also responsible for many of turmeric's studied health benefits, including anti-inflammatory and antioxidant properties. Curcumin is so potent as a colorant that turmeric has been used as a natural dye for thousands of years, and it can permanently stain clothing and surfaces. The compound is fat-soluble, which is why turmeric is often consumed with oil or black pepper to enhance absorption.",
    "citationUrl": "https://en.wikipedia.org/wiki/Curcumin",
    "citationTitle": "Wikipedia: Curcumin"
  },
  {
    "id": "e7902084-e1af-4757-8b92-e27d94a4bacc",
    "text": "Which spice blend is essential to Cajun and Creole cooking and typically contains cayenne, paprika, and garlic powder?",
    "options": [
      "Old Bay",
      "Cajun seasoning",
      "Herbes de Provence",
      "Garam masala"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Cajun seasoning is the signature spice blend of Louisiana cuisine, featuring cayenne pepper, paprika, and garlic powder among other spices.",
    "detailedExplanation": "Cajun seasoning is a spice blend that originated in Louisiana and is fundamental to both Cajun and Creole cuisines. While recipes vary, it typically includes cayenne pepper, paprika, garlic powder, onion powder, oregano, thyme, and black pepper. The blend reflects the multicultural influences on Louisiana cooking, combining French, Spanish, African, and Native American flavor profiles. It's used to season everything from jambalaya and gumbo to blackened fish and shrimp. The heat level can vary significantly depending on the amount of cayenne used.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cajun_cuisine",
    "citationTitle": "Wikipedia: Cajun cuisine"
  },
  {
    "id": "b3b52c04-8252-4ac9-84bb-d7d5243ecef2",
    "text": "What is the Scoville rating range for jalapeño peppers?",
    "options": [
      "1,000-4,000 SHU",
      "2,500-8,000 SHU",
      "15,000-30,000 SHU",
      "50,000-100,000 SHU"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Jalapeño peppers typically range from 2,500 to 8,000 Scoville Heat Units (SHU).",
    "detailedExplanation": "The Scoville scale measures the heat level of peppers and spicy foods based on their capsaicin content. Jalapeño peppers, one of the most popular chili peppers in North American cuisine, typically range from 2,500 to 8,000 Scoville Heat Units (SHU). This places them in the mild to moderate heat category - significantly hotter than bell peppers (0 SHU) but much milder than serrano peppers (10,000-25,000 SHU) or habaneros (100,000-350,000 SHU). The heat can vary depending on growing conditions, with stress factors like drought often increasing capsaicin production.",
    "citationUrl": "https://en.wikipedia.org/wiki/Scoville_scale",
    "citationTitle": "Wikipedia: Scoville scale"
  },
  {
    "id": "e640749b-77d1-4935-b18a-706bfa2f7612",
    "text": "Which spice is made from grinding dried red peppers and is the national spice of Hungary?",
    "options": [
      "Cayenne",
      "Paprika",
      "Chili powder",
      "Chipotle"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Paprika is Hungary's national spice, made from grinding dried sweet or hot peppers.",
    "detailedExplanation": "Paprika is deeply associated with Hungarian cuisine and culture, where it's considered the national spice. Made from grinding dried capsicum peppers, it can range from sweet and mild to hot and spicy. Hungarian paprika is particularly prized for its quality and distinctive flavor, and the spice plays a central role in traditional dishes like goulash and chicken paprikash.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paprika",
    "citationTitle": "Wikipedia: Paprika"
  },
  {
    "id": "77914779-0dc7-4f50-bca5-9cbe296dbe47",
    "text": "What is the name of the French spice blend that typically contains herbs like thyme, rosemary, and oregano?",
    "options": [
      "Bouquet garni",
      "Herbes de Provence",
      "Quatre épices",
      "Fines herbes"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Herbes de Provence is a traditional French herb mixture containing dried herbs typical of the Provence region.",
    "detailedExplanation": "Herbes de Provence is a blend of dried herbs that originated in the southeastern French region of Provence. The traditional mixture typically includes thyme, rosemary, oregano, and sometimes lavender, marjoram, and savory. This aromatic blend is commonly used to season grilled foods, roasted vegetables, and Mediterranean dishes, capturing the essence of the French countryside in its flavor profile.",
    "citationUrl": "https://en.wikipedia.org/wiki/Herbes_de_Provence",
    "citationTitle": "Wikipedia: Herbes de Provence"
  },
  {
    "id": "a3641dc0-d922-4afc-b1cf-bd92374197c1",
    "text": "Which spice comes from the bark of an evergreen tree and was once more valuable than gold in ancient Rome?",
    "options": [
      "Cardamom",
      "Cinnamon",
      "Star anise",
      "Cloves"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Cinnamon comes from the inner bark of evergreen trees and was extremely valuable in ancient times.",
    "detailedExplanation": "Cinnamon is harvested from the inner bark of several species of evergreen trees in the Cinnamomum family. In ancient Rome and throughout medieval Europe, cinnamon was so precious that it was worth more than gold by weight. The spice had to be transported along dangerous trade routes from Sri Lanka and Southern India, making it extremely expensive and a symbol of wealth and luxury.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cinnamon",
    "citationTitle": "Wikipedia: Cinnamon"
  },
  {
    "id": "37418d33-d9d9-4d11-b962-158a7de2eee3",
    "text": "What is the main flavoring agent in traditional Indian garam masala that gives it its sweet, warm taste?",
    "options": [
      "Coriander",
      "Cumin",
      "Cinnamon",
      "Cardamom"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Cinnamon is typically the dominant sweet, warming spice in garam masala blends.",
    "detailedExplanation": "Garam masala, meaning 'warm spice mixture' in Hindi, is a blend of ground spices commonly used in Indian cuisine. While recipes vary by region and family tradition, cinnamon is typically one of the primary ingredients that provides the characteristic sweet and warming flavor. The blend usually also includes cardamom, cloves, black peppercorns, and bay leaves, but cinnamon's sweet warmth tends to be the most prominent flavor note.",
    "citationUrl": "https://en.wikipedia.org/wiki/Garam_masala",
    "citationTitle": "Wikipedia: Garam masala"
  },
  {
    "id": "3724e059-ab5e-4ef3-bdd1-fbd08f3b83b9",
    "text": "Which aromatic seed spice is known as 'the queen of spices' and is native to the Western Ghats of India?",
    "options": [
      "Fennel",
      "Cardamom",
      "Coriander",
      "Fenugreek"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Cardamom is called 'the queen of spices' and originates from India's Western Ghats region.",
    "detailedExplanation": "Cardamom, particularly green cardamom, is known as 'the queen of spices' (with black pepper being 'the king'). This highly aromatic spice is indigenous to the forests of the Western Ghats in southern India, where it has been cultivated for thousands of years. The spice consists of small seed pods containing black seeds with an intense, slightly sweet flavor that's used in both sweet and savory dishes across Indian, Middle Eastern, and Scandinavian cuisines.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cardamom",
    "citationTitle": "Wikipedia: Cardamom"
  },
  {
    "id": "377416a0-153e-412d-ac6b-c5409b258108",
    "text": "What type of plant produces vanilla beans, making vanilla the second most expensive spice after saffron?",
    "options": [
      "A tropical tree",
      "A climbing orchid",
      "A ground vine",
      "A flowering shrub"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Vanilla comes from the seed pods of a climbing orchid plant, specifically Vanilla planifolia.",
    "detailedExplanation": "Vanilla beans are produced by Vanilla planifolia, a species of climbing orchid native to Mexico. The vanilla orchid is the only orchid that produces an edible fruit. The labor-intensive process of hand-pollinating the flowers and curing the beans for months makes vanilla the second most expensive spice in the world after saffron. The complex cultivation and processing requirements explain why real vanilla is so much more costly than artificial vanilla flavoring.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vanilla",
    "citationTitle": "Wikipedia: Vanilla"
  },
  {
    "id": "d249114a-3d8f-411c-90af-3ece32a8584c",
    "text": "Which Japanese spice blend contains seven ingredients and traditionally includes orange peel and red chili pepper?",
    "options": [
      "Furikake",
      "Shichimi togarashi",
      "Wasabi powder",
      "Gomashio"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Shichimi togarashi, meaning 'seven-flavor chili pepper,' is a traditional Japanese spice blend.",
    "detailedExplanation": "Shichimi togarashi, also known simply as shichimi, is a popular Japanese spice mixture that literally translates to 'seven-flavor chili pepper.' The traditional blend typically includes red chili pepper, orange peel, black sesame seeds, white sesame seeds, hemp seeds, ground ginger, and nori (seaweed). This versatile seasoning adds heat and complex flavor to dishes like ramen, udon, grilled meats, and tempura.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shichimi",
    "citationTitle": "Wikipedia: Shichimi"
  },
  {
    "id": "a2d7093a-eea6-4845-b6c1-64db72a8e41d",
    "text": "Which spice is produced by grinding dried smoked jalapeño peppers?",
    "options": [
      "Ancho",
      "Chipotle",
      "Guajillo",
      "Pasilla"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Chipotle is made from jalapeño peppers that have been smoke-dried and then ground into powder.",
    "detailedExplanation": "Chipotle is a spice made from jalapeño peppers that have been smoke-dried using traditional methods. The name comes from the Nahuatl word 'chilpoctli,' meaning 'smoked chili.' The smoking process not only preserves the peppers but also imparts a distinctive smoky flavor that's different from fresh jalapeños. Chipotle peppers and powder are staples in Mexican and Tex-Mex cuisine, adding both heat and a rich, smoky depth to dishes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chipotle",
    "citationTitle": "Wikipedia: Chipotle"
  },
  {
    "id": "1f17d2f1-9d86-48d9-9d40-9f1a6814b2cb",
    "text": "Which spice is known as 'false saffron' and is commonly used as a cheaper substitute for saffron in rice dishes?",
    "options": [
      "Annatto",
      "Safflower",
      "Turmeric",
      "Paprika"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Safflower is known as 'false saffron' and is used as a saffron substitute.",
    "detailedExplanation": "Safflower (Carthamus tinctorius) produces petals that can be dried and used as a spice, often called 'false saffron' or 'bastard saffron.' While it doesn't have the same complex flavor profile as true saffron, it provides a similar golden color to dishes at a fraction of the cost. It has been used historically in many cuisines as an economical alternative to saffron, particularly in rice dishes and various Middle Eastern and Mediterranean preparations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Safflower",
    "citationTitle": "Wikipedia: Safflower"
  },
  {
    "id": "3447c167-e291-4bc2-afca-23270d5d70dc",
    "text": "What is the traditional method used to harvest pink peppercorns that distinguishes them from true pepper?",
    "options": [
      "Hand-picked when fully ripe",
      "Dried in volcanic sand",
      "Fermented in salt water",
      "Freeze-dried immediately after picking"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Pink peppercorns are hand-picked when fully ripe and are not true pepper at all.",
    "detailedExplanation": "Pink peppercorns come from the Peruvian pepper tree (Schinus molle) or Brazilian pepper tree (Schinus terebinthifolius), not from the Piper nigrum plant that produces true black, white, and green peppercorns. These delicate berries must be hand-picked when fully ripe to maintain their distinctive pink color and mild, sweet flavor with subtle peppery notes. They're much more fragile than true peppercorns and have a completely different botanical origin, belonging to the cashew family rather than the pepper family.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pink_peppercorn",
    "citationTitle": "Wikipedia: Pink peppercorn"
  },
  {
    "id": "d88d5833-cacc-4650-8288-886146d06ed0",
    "text": "Which spice blend is traditionally burned as incense in Ethiopian coffee ceremonies and contains fenugreek and bishop's weed?",
    "options": [
      "Mitmita",
      "Berbere",
      "Baharat",
      "Ras el hanout"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Berbere is the Ethiopian spice blend used in coffee ceremonies and contains fenugreek and bishop's weed.",
    "detailedExplanation": "Berbere is Ethiopia's most famous spice blend, containing up to 20 different spices including fenugreek, bishop's weed (ajwain), cardamom, coriander, and various chilies. Beyond its culinary uses in dishes like doro wat, berbere plays a ceremonial role in Ethiopian culture, particularly during traditional coffee ceremonies where it may be burned as incense. The blend varies by region and family, with each having their own closely guarded recipe passed down through generations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Berbere",
    "citationTitle": "Wikipedia: Berbere"
  },
  {
    "id": "58bdfb59-02d0-4abe-8b57-06a774947b32",
    "text": "What causes the numbing sensation associated with Sichuan peppercorns, which is different from the heat of chili peppers?",
    "options": [
      "Capsaicin compounds",
      "Hydroxy-alpha-sanshool",
      "Essential menthol oils",
      "Piperine alkaloids"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Hydroxy-alpha-sanshool in Sichuan peppercorns causes the distinctive numbing sensation.",
    "detailedExplanation": "Sichuan peppercorns contain a compound called hydroxy-alpha-sanshool, which creates a unique tingling, numbing sensation known as 'má' in Chinese cuisine. This is completely different from the burning heat of capsaicin found in chili peppers. The sanshool compound actually activates touch receptors in the mouth, creating a buzzing, electric-like sensation that can make the tongue feel numb. This distinctive effect is prized in Sichuan cuisine and is often paired with chili heat to create the famous 'málà' (numbing-spicy) flavor profile.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sichuan_pepper",
    "citationTitle": "Wikipedia: Sichuan pepper"
  }
]