[
  {
    "id": "ca7946cc-2f70-4f47-ad3c-f48e6edfaf0c",
    "text": "What does the 'ML' in the ML programming language family (like Standard ML and OCaml) stand for?",
    "options": [
      "Machine Learning",
      "Meta Language",
      "Mathematical Logic",
      "Markup Language"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "ML stands for 'Meta Language', referring to its original purpose as a meta-language for theorem proving.",
    "detailedExplanation": "ML (Meta Language) was originally developed in the 1970s by Robin Milner at the University of Edinburgh as part of the Logic for Computable Functions (LCF) theorem prover project. It was designed to be a meta-language for manipulating and proving theorems. The language introduced many concepts that are now common in functional programming, including type inference and algebraic data types.",
    "citationUrl": "https://en.wikipedia.org/wiki/ML_(programming_language)",
    "citationTitle": "Wikipedia: ML (programming language)"
  },
  {
    "id": "a90ddf38-93e3-4e44-b74f-740a99a9e0c7",
    "text": "Which programming language introduced the concept of 'monkey patching' as a core feature?",
    "options": [
      "Ruby",
      "Python",
      "JavaScript",
      "Smalltalk"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Ruby popularized monkey patching, allowing developers to modify existing classes and modules at runtime.",
    "detailedExplanation": "Ruby made monkey patching a prominent feature by allowing developers to reopen and modify any class, including built-in classes, at runtime. This flexibility became a defining characteristic of Ruby's metaprogramming capabilities. While other languages like Smalltalk had similar concepts earlier, Ruby brought this technique into mainstream programming and the term 'monkey patching' became widely associated with Ruby's approach to dynamic modification of classes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Monkey_patch",
    "citationTitle": "Wikipedia: Monkey patch"
  },
  {
    "id": "7817e6cf-605e-4e0b-a407-3595791aa456",
    "text": "What unusual characteristic does the esoteric programming language 'Malbolge' have that makes it extremely difficult to program in?",
    "options": [
      "Programs can only contain prime numbers",
      "The instruction set changes as the program runs",
      "All variables must be declared backwards",
      "Code must be written in hexadecimal only"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Malbolge's instruction set rotates and changes as the program executes, making it nearly impossible to write programs by hand.",
    "detailedExplanation": "Malbolge, created by Ben Olmstead in 1998, is considered one of the most difficult programming languages ever created. Its defining feature is that the instruction set undergoes a complex rotation after each instruction is executed, meaning that the same memory location will execute different operations as the program runs. This self-modifying nature, combined with other deliberately obfuscated design choices, makes it extremely challenging to write meaningful programs. The first Malbolge program wasn't written by a human but was generated by a computer search algorithm.",
    "citationUrl": "https://en.wikipedia.org/wiki/Malbolge",
    "citationTitle": "Wikipedia: Malbolge"
  },
  {
    "id": "7cde2581-af82-4f2b-81b6-ef9cd67ea72e",
    "text": "Which programming language uses the term 'homoiconicity' as one of its fundamental design principles?",
    "options": [
      "Haskell",
      "Lisp",
      "Prolog",
      "Erlang"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Lisp is homoiconic, meaning its code is represented as the same data structures that the language manipulates (lists).",
    "detailedExplanation": "Homoiconicity means that the program structure is similar to its syntax, and the language's data structures can represent the program itself. In Lisp, both code and data are represented as lists (S-expressions), making it possible to manipulate code as data and vice versa. This property enables powerful metaprogramming capabilities and makes features like macros natural and elegant in Lisp. The term comes from 'homo' (same) and 'icon' (representation), literally meaning 'same representation'.",
    "citationUrl": "https://en.wikipedia.org/wiki/Homoiconicity",
    "citationTitle": "Wikipedia: Homoiconicity"
  },
  {
    "id": "6f0da468-b921-4fd5-b57d-504f03cd334f",
    "text": "What is the name of the memory management technique that Go programming language uses instead of traditional garbage collection?",
    "options": [
      "Reference counting",
      "Tricolor concurrent collection",
      "Stack allocation only",
      "Manual memory management"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Go uses a tricolor concurrent garbage collector that can run concurrently with the program execution.",
    "detailedExplanation": "Go employs a tricolor concurrent garbage collector, which is a sophisticated form of garbage collection that can run concurrently with the main program threads. The 'tricolor' refers to the algorithm's approach of marking objects as white (not yet examined), gray (examined but may reference white objects), or black (examined and all references are to gray or black objects). This concurrent approach minimizes stop-the-world pauses that are common in traditional garbage collectors, making Go suitable for systems programming while maintaining memory safety.",
    "citationUrl": "https://en.wikipedia.org/wiki/Go_(programming_language)",
    "citationTitle": "Wikipedia: Go (programming language)"
  },
  {
    "id": "d09c3a40-1619-4e3d-b48b-7dd87717af07",
    "text": "Which programming language was specifically designed to have 'no undefined behavior' as a core design goal?",
    "options": [
      "Rust",
      "Swift",
      "Zig",
      "Crystal"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Rust was designed with memory safety as a primary goal, eliminating undefined behavior through its ownership system.",
    "detailedExplanation": "Rust was explicitly designed to eliminate undefined behavior, which is a major source of security vulnerabilities and bugs in systems programming languages like C and C++. Rust achieves this through its ownership system, borrowing rules, and lifetime tracking, which prevent common issues like buffer overflows, use-after-free errors, and data races at compile time. The language's motto includes 'fast, reliable, productive—pick three' because traditionally you could only achieve two of these properties, but Rust aims to provide all three by eliminating undefined behavior without sacrificing performance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rust_(programming_language)",
    "citationTitle": "Wikipedia: Rust (programming language)"
  },
  {
    "id": "0a7aeeb3-944c-4408-bf92-1c67a7198f91",
    "text": "What does the 'P' in PHP originally stood for before it became a recursive acronym?",
    "options": [
      "Personal",
      "Public",
      "Portable",
      "Practical"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "PHP originally stood for 'Personal Home Page' before it was changed to the recursive 'PHP: Hypertext Preprocessor'.",
    "detailedExplanation": "PHP was originally created by Rasmus Lerdorf in 1994 as 'Personal Home Page', a set of Common Gateway Interface (CGI) binaries written in C to track visits to his online resume. As the language evolved and gained more features, it was renamed to 'PHP: Hypertext Preprocessor' in 1997, making it a recursive acronym where the 'P' stands for 'PHP' itself. This change reflected the language's evolution from a personal tool to a general-purpose server-side scripting language.",
    "citationUrl": "https://en.wikipedia.org/wiki/PHP",
    "citationTitle": "Wikipedia: PHP"
  },
  {
    "id": "f6c8d468-2a5e-42cd-a3d4-248b22160224",
    "text": "Which programming language was created by Anders Hejlsberg who also designed Turbo Pascal and Delphi?",
    "options": [
      "Java",
      "C#",
      "Swift",
      "Kotlin"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "C# was created by Anders Hejlsberg at Microsoft, who previously designed Turbo Pascal and Delphi at Borland.",
    "detailedExplanation": "Anders Hejlsberg is a prominent programming language designer who created Turbo Pascal in the 1980s and later Delphi at Borland. After joining Microsoft in 1996, he led the development of C# as part of the .NET framework initiative. His experience with Pascal and Object Pascal heavily influenced C#'s design, particularly in areas like type safety and structured programming concepts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Anders_Hejlsberg",
    "citationTitle": "Wikipedia: Anders Hejlsberg"
  },
  {
    "id": "aa7b04b6-14a9-4cd8-a209-4b102122dcb6",
    "text": "What is the maximum number of dimensions an array can have in FORTRAN 90?",
    "options": [
      "5",
      "7",
      "9",
      "15"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "FORTRAN 90 allows arrays to have a maximum of 7 dimensions.",
    "detailedExplanation": "FORTRAN 90 introduced significant enhancements to array handling compared to earlier versions of FORTRAN. While earlier versions were limited to 3 dimensions, FORTRAN 90 expanded this capability to allow up to 7 dimensions for arrays. This was a substantial improvement for scientific computing applications that often require multi-dimensional data structures for mathematical modeling and numerical analysis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fortran_95_language_features",
    "citationTitle": "Wikipedia: Fortran 95 language features"
  },
  {
    "id": "0038e4b5-2fbf-4807-b75a-5f24e0cab7f6",
    "text": "Which programming language introduced the concept of 'traits' that was later adopted by languages like Rust and Scala?",
    "options": [
      "Smalltalk",
      "Self",
      "Perl",
      "Squeak"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Smalltalk introduced traits as a mechanism for fine-grained code reuse, later adopted by modern languages.",
    "detailedExplanation": "Traits were first introduced in Smalltalk as a way to achieve fine-grained code reuse without the problems associated with multiple inheritance. The concept was later formalized and adopted by several modern programming languages including Scala, Rust, and PHP. Traits provide a way to share methods between classes in a controlled manner, offering more flexibility than single inheritance while avoiding the complexity and ambiguity of multiple inheritance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Trait_(computer_science)",
    "citationTitle": "Wikipedia: Trait (computer science)"
  },
  {
    "id": "81269938-fab5-48f5-82e5-843492b9e023",
    "text": "In which year was the first version of the Python programming language released to the public?",
    "options": [
      "1989",
      "1991",
      "1993",
      "1995"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Python 0.9.0 was released in February 1991 by Guido van Rossum.",
    "detailedExplanation": "Python was created by Guido van Rossum at the Centrum Wiskunde & Informatica (CWI) in the Netherlands. The first version made available to the public was Python 0.9.0, released in February 1991. Development began in the late 1980s as a successor to the ABC programming language. The language was named after the British comedy group Monty Python's Flying Circus, reflecting van Rossum's desire to make programming fun and accessible.",
    "citationUrl": "https://en.wikipedia.org/wiki/Python_(programming_language)",
    "citationTitle": "Wikipedia: Python (programming language)"
  },
  {
    "id": "7fc5aa77-adc4-44b0-94b7-1b22557726b4",
    "text": "Which programming language uses the keyword 'fn' to declare functions?",
    "options": [
      "Go",
      "Rust",
      "Swift",
      "Dart"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Rust uses 'fn' as the keyword to declare functions.",
    "detailedExplanation": "Rust uses the 'fn' keyword to declare functions, which is part of its concise syntax design. This differs from many other languages that use longer keywords like 'function' (JavaScript, PHP) or 'def' (Python). The 'fn' syntax in Rust is followed by the function name, parameters in parentheses, an optional return type after an arrow (->), and the function body in curly braces. This syntax choice reflects Rust's philosophy of being both expressive and concise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rust_(programming_language)",
    "citationTitle": "Wikipedia: Rust (programming language)"
  },
  {
    "id": "1cce0cb6-1069-4ecd-9257-1f84fd3ca2c5",
    "text": "What is the name of the virtual machine that Erlang code runs on?",
    "options": [
      "EVM",
      "BEAM",
      "OTP",
      "GenServer"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "BEAM (Bogdan's Erlang Abstract Machine) is the virtual machine that executes Erlang bytecode.",
    "detailedExplanation": "BEAM stands for Bogdan's Erlang Abstract Machine, named after Bogdan Hausman who developed it. It's the virtual machine that executes Erlang bytecode and is designed specifically for concurrent, fault-tolerant applications. BEAM provides lightweight processes (actors), message passing, and hot code swapping capabilities that make Erlang suitable for building highly available distributed systems. The same VM also runs Elixir and other languages that compile to BEAM bytecode.",
    "citationUrl": "https://en.wikipedia.org/wiki/BEAM_(Erlang_virtual_machine)",
    "citationTitle": "Wikipedia: BEAM (Erlang virtual machine)"
  },
  {
    "id": "5dbd5b7f-8b09-45bb-986f-fe1d949fdec1",
    "text": "Which programming language was the first to implement lexical scoping (static scoping) as we know it today?",
    "options": [
      "LISP",
      "ALGOL 60",
      "COBOL",
      "FORTRAN"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "ALGOL 60 was the first programming language to implement proper lexical scoping.",
    "detailedExplanation": "ALGOL 60, developed in 1960, was the first programming language to implement lexical scoping (also known as static scoping) in the form we recognize today. In lexical scoping, the scope of variables is determined by where they are declared in the source code, and inner scopes can access variables from outer scopes. This was a significant advancement over dynamic scoping used in earlier languages, as it made programs more predictable and easier to understand. ALGOL 60's scoping rules influenced virtually all subsequent programming languages.",
    "citationUrl": "https://en.wikipedia.org/wiki/ALGOL_60",
    "citationTitle": "Wikipedia: ALGOL 60"
  },
  {
    "id": "8f947c6f-82dd-428f-989d-62c3a4cfab37",
    "text": "What does the 'R' in the R programming language specifically stand for?",
    "options": [
      "Research",
      "Ross and Robert (creators' names)",
      "Regression",
      "Random"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "R is named after its creators Ross Ihaka and Robert Gentleman, both names starting with 'R'.",
    "detailedExplanation": "The R programming language was created by Ross Ihaka and Robert Gentleman at the University of Auckland, New Zealand, in the early 1990s. The name 'R' serves a dual purpose: it references both creators' first names (Ross and Robert) and it's also a play on the name of the S programming language, which R was designed to be compatible with. R was initially developed as a free software implementation of S, focusing on statistical computing and graphics.",
    "citationUrl": "https://en.wikipedia.org/wiki/R_(programming_language)",
    "citationTitle": "Wikipedia: R (programming language)"
  },
  {
    "id": "abfe9879-0b80-41a0-bc88-46ae8817f6a1",
    "text": "Which programming language was originally developed at Bell Labs and shares its name with a single letter of the alphabet?",
    "options": [
      "B",
      "C",
      "D",
      "K"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "The B programming language was developed by Ken Thompson at Bell Labs around 1969.",
    "detailedExplanation": "The B programming language was created by Ken Thompson at Bell Labs around 1969 as a simplified version of BCPL. It was designed for early Unix systems and served as a direct predecessor to the C programming language. Despite its historical significance in the development of modern programming languages, B is now largely obsolete, having been superseded by C which added data typing and other improvements.",
    "citationUrl": "https://en.wikipedia.org/wiki/B_(programming_language)",
    "citationTitle": "Wikipedia: B (programming language)"
  },
  {
    "id": "af2e7b7a-be23-49b4-b7f3-fcdd433d20fe",
    "text": "What is the maximum number of characters allowed in a variable name in COBOL?",
    "options": [
      "30",
      "50",
      "64",
      "100"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "COBOL variable names (data names) can be up to 30 characters long.",
    "detailedExplanation": "In COBOL (Common Business-Oriented Language), variable names, officially called 'data names,' are limited to a maximum of 30 characters. This constraint has been consistent across most COBOL standards since its early development in the late 1950s. The names must begin with a letter and can contain letters, digits, and hyphens, but cannot end with a hyphen. This limitation reflects COBOL's origins in the era of punched cards and early computer systems with more restrictive memory and processing constraints.",
    "citationUrl": "https://en.wikipedia.org/wiki/COBOL",
    "citationTitle": "Wikipedia: COBOL"
  },
  {
    "id": "30f45256-fe4a-4f0a-86a7-9f641c8d2340",
    "text": "Which programming language uses the file extension '.clj' for its source code files?",
    "options": [
      "Common Lisp",
      "Clojure",
      "CLU",
      "Clean"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Clojure uses the .clj file extension for its source code files.",
    "detailedExplanation": "Clojure, created by Rich Hickey and first released in 2007, uses the '.clj' file extension for its source code files. Clojure is a dynamic, functional programming language that runs on the Java Virtual Machine (JVM) and is a dialect of Lisp. The language emphasizes immutability, concurrency, and functional programming principles. While Common Lisp typically uses '.lisp' or '.lsp' extensions, and CLU and Clean have their own conventions, the '.clj' extension is distinctly associated with Clojure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Clojure",
    "citationTitle": "Wikipedia: Clojure"
  },
  {
    "id": "8e70127c-bd87-4076-b6d0-f74eb6e99aed",
    "text": "In which programming language would you encounter the 'Option' type as a built-in feature for handling null values?",
    "options": [
      "Java",
      "Scala",
      "Python",
      "JavaScript"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Scala has a built-in Option type that provides a safe way to handle potentially null or absent values.",
    "detailedExplanation": "Scala features the Option type as a fundamental part of its standard library for safely handling values that might be absent or null. The Option type is an abstract class with two subclasses: Some (which contains a value) and None (which represents the absence of a value). This approach eliminates null pointer exceptions and makes code more explicit about when values might be missing. While Java 8 introduced Optional as a similar concept, it's not as deeply integrated into the language as Scala's Option type, which is used extensively throughout Scala's standard library and idiomatic Scala code.",
    "citationUrl": "https://en.wikipedia.org/wiki/Scala_(programming_language)",
    "citationTitle": "Wikipedia: Scala (programming language)"
  },
  {
    "id": "e8539589-e538-487f-8191-d999256d3062",
    "text": "Which programming language was designed specifically for teaching programming concepts and is named after a French mathematician and philosopher?",
    "options": [
      "Pascal",
      "Ada",
      "Haskell",
      "Turing"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "hard",
    "explanation": "Pascal was named after Blaise Pascal, the French mathematician and philosopher.",
    "detailedExplanation": "Pascal was developed by Niklaus Wirth in 1970 and named after Blaise Pascal (1623-1662), the famous French mathematician, physicist, and philosopher who invented an early mechanical calculator called the Pascaline. The Pascal programming language was specifically designed as a teaching tool to encourage good programming practices and structured programming. It became widely used in computer science education during the 1970s and 1980s. While Ada was named after Ada Lovelace, Haskell after Haskell Curry, and Turing after Alan Turing, Pascal specifically honors the French polymath Blaise Pascal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pascal_(programming_language)",
    "citationTitle": "Wikipedia: Pascal (programming language)"
  }
]