[
  {
    "id": "b3884dfe-a9fe-4c4a-8a27-929ce79cea75",
    "text": "Which world leader holds the record for the longest continuous time in power in modern history, serving for over 40 years until his death in 2017?",
    "options": [
      "Muammar Gaddafi",
      "Fidel Castro",
      "Robert Mugabe",
      "Hosni Mubarak"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Fidel Castro ruled Cuba for 47 years (1959-2006) before stepping down due to illness.",
    "detailedExplanation": "Fidel Castro came to power in Cuba following the Cuban Revolution in 1959 and remained in control until 2006 when illness forced him to transfer power to his brother Raúl. His 47-year reign makes him one of the longest-serving non-royal leaders in modern history. While other dictators like Gaddafi and Mugabe had long reigns, Castro's continuous rule from 1959 to 2006 surpasses them all.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fidel_Castro",
    "citationTitle": "Wikipedia: Fidel Castro"
  },
  {
    "id": "5019a4ac-017a-48e1-9a79-bd88fc1439b3",
    "text": "Who was the first female Prime Minister in the world, taking office in 1960?",
    "options": [
      "Golda Meir",
      "Margaret Thatcher",
      "Sirimavo Bandaranaike",
      "Indira Gandhi"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Sirimavo Bandaranaike of Sri Lanka became the world's first female Prime Minister in 1960.",
    "detailedExplanation": "Sirimavo Bandaranaike broke the ultimate glass ceiling when she became Prime Minister of Sri Lanka (then Ceylon) in 1960, making her the world's first female head of government. She came to power following the assassination of her husband, Prime Minister S.W.R.D. Bandaranaike. She served three separate terms and paved the way for other female leaders worldwide, including Indira Gandhi and Golda Meir who followed years later.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sirimavo_Bandaranaike",
    "citationTitle": "Wikipedia: Sirimavo Bandaranaike"
  },
  {
    "id": "dfeb8827-5624-4f07-a645-2aef53cf311b",
    "text": "Which Russian Tsar earned the nickname 'The Liberator' for freeing over 20 million serfs in 1861?",
    "options": [
      "Alexander I",
      "Alexander II",
      "Nicholas I",
      "Alexander III"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Alexander II freed the serfs in 1861 through the Emancipation Reform, earning him the title 'Tsar Liberator.'",
    "detailedExplanation": "Alexander II of Russia implemented sweeping reforms during his reign (1855-1881), most notably the Emancipation Reform of 1861 which freed approximately 23 million serfs from bondage. This monumental act of liberation earned him the historical nickname 'The Liberator' or 'Tsar Liberator.' Despite his reforms, he was assassinated by revolutionaries in 1881, highlighting the complex political tensions of the era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alexander_II_of_Russia",
    "citationTitle": "Wikipedia: Alexander II of Russia"
  },
  {
    "id": "9ab812df-ab69-4485-bc7b-e14ae9a76274",
    "text": "Who was the youngest person ever elected as President of the United States at age 43?",
    "options": [
      "Bill Clinton",
      "Barack Obama",
      "Theodore Roosevelt",
      "John F. Kennedy"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "JFK was elected at 43, though Theodore Roosevelt was younger when he assumed the presidency through succession.",
    "detailedExplanation": "John F. Kennedy was elected President in 1960 at the age of 43, making him the youngest person ever elected to the office. While Theodore Roosevelt was younger when he became President at age 42, he assumed the role through succession after McKinley's assassination rather than through election. Kennedy's youth, charisma, and vigor became defining characteristics of his presidency and political appeal during the 1960 campaign against Richard Nixon.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_F._Kennedy",
    "citationTitle": "Wikipedia: John F. Kennedy"
  },
  {
    "id": "19bff4a8-24e6-4ffb-ac53-ea3c1222d9a9",
    "text": "Which ancient Egyptian pharaoh ruled for approximately 66 years, making her one of the longest-reigning monarchs in history?",
    "options": [
      "Cleopatra VII",
      "Hatshepsut",
      "Nefertiti",
      "Pepi II"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Pepi II ruled for about 66 years during Egypt's Old Kingdom period, one of the longest reigns in history.",
    "detailedExplanation": "Pepi II Neferkare ruled ancient Egypt for approximately 66 years during the Sixth Dynasty of the Old Kingdom (c. 2278-2184 BCE). He ascended to the throne as a child and his extraordinarily long reign is considered one of the longest in human history. His extended rule, while impressive, may have contributed to the decline of centralized power that eventually led to the collapse of the Old Kingdom period in Egyptian history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pepi_II_Neferkare",
    "citationTitle": "Wikipedia: Pepi II Neferkare"
  },
  {
    "id": "e6942a26-2c68-4475-980b-182e1215018c",
    "text": "Which leader famously said 'I have nothing to offer but blood, toil, tears and sweat' in their first speech as Prime Minister?",
    "options": [
      "Franklin D. Roosevelt",
      "Charles de Gaulle",
      "Winston Churchill",
      "Clement Attlee"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Churchill delivered this famous line in his first speech to the House of Commons as PM on May 13, 1940.",
    "detailedExplanation": "Winston Churchill delivered this iconic phrase during his first speech as Prime Minister to the House of Commons on May 13, 1940, just three days after assuming office during World War II. The speech came at a critical moment when Nazi Germany was advancing across Europe and Britain faced the possibility of invasion. This phrase became one of the most memorable and rallying calls of the war, exemplifying Churchill's unflinching determination and honest assessment of the challenges ahead.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blood,_toil,_tears_and_sweat",
    "citationTitle": "Wikipedia: Blood, toil, tears and sweat"
  },
  {
    "id": "f99e09f0-f4ce-4c04-aa0b-f8654bc1e235",
    "text": "Who was the first African-American to serve as Secretary of State of the United States?",
    "options": [
      "Condoleezza Rice",
      "Colin Powell",
      "Eric Holder",
      "Susan Rice"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Colin Powell served as Secretary of State from 2001-2005 under George W. Bush, breaking this significant barrier.",
    "detailedExplanation": "Colin Powell made history when he was appointed as the 65th Secretary of State by President George W. Bush in 2001, becoming the first African-American to hold this prestigious cabinet position. A retired four-star general and former Chairman of the Joint Chiefs of Staff, Powell served from 2001 to 2005 during crucial years including the aftermath of 9/11 and the lead-up to the Iraq War. Condoleezza Rice later became the second African-American Secretary of State, succeeding Powell in 2005.",
    "citationUrl": "https://en.wikipedia.org/wiki/Colin_Powell",
    "citationTitle": "Wikipedia: Colin Powell"
  },
  {
    "id": "98a81916-4c92-4a49-ba4d-b50110f937ec",
    "text": "Which Roman Emperor was known for making his horse Incitatus a consul, demonstrating his alleged madness and contempt for the Senate?",
    "options": [
      "Nero",
      "Caligula",
      "Commodus",
      "Caracalla"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Emperor Caligula allegedly planned to make his beloved horse Incitatus a consul, though this may have been intended as an insult to the Senate.",
    "detailedExplanation": "Emperor Caligula (Gaius Julius Caesar Augustus Germanicus) ruled from 37-41 CE and was notorious for his eccentric and tyrannical behavior. According to historical accounts by Suetonius and Cassius Dio, Caligula treated his horse Incitatus with extraordinary luxury and allegedly planned to make the horse a consul. While some historians debate whether this actually occurred or was intended as a satirical insult to the Roman Senate, the story has become emblematic of Caligula's erratic rule and contempt for traditional Roman institutions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Caligula",
    "citationTitle": "Wikipedia: Caligula"
  },
  {
    "id": "79f7cc8c-651a-45a5-8234-c5303eb668ae",
    "text": "Which Chinese Emperor ordered the construction of the Terracotta Army and unified China for the first time in 221 BCE?",
    "options": [
      "Emperor Wu",
      "Qin Shi Huang",
      "Emperor Kangxi",
      "Tang Taizong"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Qin Shi Huang was the first Emperor of unified China and commissioned the famous Terracotta Army.",
    "detailedExplanation": "Qin Shi Huang (259-210 BCE) was the first emperor to unify China under the Qin Dynasty in 221 BCE. He is famous for standardizing currency, measurements, and writing systems across China, as well as beginning construction of what would become the Great Wall. His tomb near Xi'an contains the famous Terracotta Army, thousands of life-sized clay soldiers buried to protect him in the afterlife.",
    "citationUrl": "https://en.wikipedia.org/wiki/Qin_Shi_Huang",
    "citationTitle": "Wikipedia: Qin Shi Huang"
  },
  {
    "id": "4ddcfc29-4381-4628-8532-7691c007c159",
    "text": "Which South African President served only one term from 1994-1999 after spending 27 years in prison?",
    "options": [
      "Thabo Mbeki",
      "F.W. de Klerk",
      "Nelson Mandela",
      "Jacob Zuma"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Nelson Mandela served as South Africa's first Black president from 1994-1999 after his release from 27 years of imprisonment.",
    "detailedExplanation": "Nelson Mandela was imprisoned from 1962 to 1990 for his anti-apartheid activities. After his release, he led negotiations to end apartheid and became South Africa's first Black president in the country's first fully democratic elections in 1994. Despite pressure to serve longer, Mandela voluntarily stepped down after one five-year term in 1999, setting an important precedent for democratic transitions in Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nelson_Mandela",
    "citationTitle": "Wikipedia: Nelson Mandela"
  },
  {
    "id": "25802491-b48b-4f9c-bb6c-713c8622188d",
    "text": "Which French military leader crowned himself Emperor in 1804 and was later exiled to the island of Elba?",
    "options": [
      "Louis XIV",
      "Napoleon Bonaparte",
      "Charles de Gaulle",
      "Charlemagne"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Napoleon Bonaparte crowned himself Emperor of France in 1804 and was first exiled to Elba in 1814.",
    "detailedExplanation": "Napoleon Bonaparte rose to power during the French Revolution and crowned himself Emperor of the French in 1804. He conquered much of continental Europe before suffering defeats that led to his first exile to the Mediterranean island of Elba in 1814. He famously escaped for the 'Hundred Days' before his final defeat at Waterloo and subsequent exile to the remote island of Saint Helena, where he died in 1821.",
    "citationUrl": "https://en.wikipedia.org/wiki/Napoleon",
    "citationTitle": "Wikipedia: Napoleon"
  },
  {
    "id": "588a569b-fe5c-4064-bd88-4606c0deb8af",
    "text": "Which Indian Prime Minister was assassinated by her own Sikh bodyguards in 1984?",
    "options": [
      "Indira Gandhi",
      "Rajiv Gandhi",
      "Jawaharlal Nehru",
      "Atal Bihari Vajpayee"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Indira Gandhi was assassinated by two of her Sikh bodyguards on October 31, 1984.",
    "detailedExplanation": "Indira Gandhi served as Prime Minister of India from 1966-1977 and again from 1980 until her assassination in 1984. She was killed by two of her Sikh bodyguards, Satwant Singh and Beant Singh, in retaliation for Operation Blue Star, a military action she had ordered against Sikh separatists in the Golden Temple in Amritsar earlier that year. Her assassination triggered anti-Sikh riots across India.",
    "citationUrl": "https://en.wikipedia.org/wiki/Indira_Gandhi",
    "citationTitle": "Wikipedia: Indira Gandhi"
  },
  {
    "id": "af59154a-afde-4976-8f4b-c3a9038077ef",
    "text": "Which Byzantine Emperor is known for codifying Roman law into the 'Corpus Juris Civilis' around 529-534 CE?",
    "options": [
      "Constantine I",
      "Justinian I",
      "Theodosius I",
      "Basil II"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Justinian I commissioned the Corpus Juris Civilis, a comprehensive codification of Roman law.",
    "detailedExplanation": "Emperor Justinian I (r. 527-565 CE) undertook a massive legal reform project that resulted in the Corpus Juris Civilis (Body of Civil Law), also known as the Justinian Code. This codification of Roman law became the foundation of legal systems throughout much of Europe and remains influential in modern civil law systems. Justinian also attempted to reconquer the Western Roman Empire and oversaw the construction of the Hagia Sophia in Constantinople.",
    "citationUrl": "https://en.wikipedia.org/wiki/Justinian_I",
    "citationTitle": "Wikipedia: Justinian I"
  },
  {
    "id": "66339f2e-c63a-4fff-97ce-c369cd1ad382",
    "text": "Which German Chancellor served from 1982 to 1998 and oversaw German reunification?",
    "options": [
      "Willy Brandt",
      "Helmut Schmidt",
      "Helmut Kohl",
      "Angela Merkel"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Helmut Kohl was Chancellor of West Germany and later unified Germany during the reunification period.",
    "detailedExplanation": "Helmut Kohl served as Chancellor of West Germany from 1982 to 1990, then as Chancellor of unified Germany from 1990 to 1998. He played a crucial role in German reunification after the fall of the Berlin Wall in 1989, working closely with Soviet leader Mikhail Gorbachev and other world leaders. Kohl was also instrumental in the creation of the European Union and the introduction of the Euro currency.",
    "citationUrl": "https://en.wikipedia.org/wiki/Helmut_Kohl",
    "citationTitle": "Wikipedia: Helmut Kohl"
  },
  {
    "id": "81d8154c-adf3-4cfc-8920-d3d7b23ed4a2",
    "text": "Which Ottoman Sultan conquered Constantinople in 1453, effectively ending the Byzantine Empire?",
    "options": [
      "Suleiman the Magnificent",
      "Mehmed II",
      "Selim I",
      "Bayezid II"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Mehmed II, known as 'the Conqueror,' captured Constantinople in 1453, ending the Byzantine Empire.",
    "detailedExplanation": "Mehmed II (1432-1481) earned the title 'the Conqueror' (Fatih) for his capture of Constantinople on May 29, 1453. This conquest ended the thousand-year Byzantine Empire and established Ottoman control over the crucial link between Europe and Asia. Mehmed was only 21 years old at the time of this historic victory. He renamed the city Istanbul and made it the capital of the Ottoman Empire, transforming the Hagia Sophia from a church into a mosque.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mehmed_the_Conqueror",
    "citationTitle": "Wikipedia: Mehmed the Conqueror"
  },
  {
    "id": "a07d7129-c944-46ce-b850-1fb3ddb88ae7",
    "text": "Which Cuban revolutionary leader served as Prime Minister and later President from 1959 until 2008?",
    "options": [
      "Che Guevara",
      "Fulgencio Batista",
      "Fidel Castro",
      "Raúl Castro"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Fidel Castro led the Cuban Revolution and ruled Cuba for nearly 50 years until stepping down in 2008.",
    "detailedExplanation": "Fidel Castro led the revolutionary movement that overthrew the Batista government in 1959. He served as Prime Minister from 1959-1976 and then as President from 1976-2008, making him one of the longest-serving leaders in modern history. His communist government survived the Bay of Pigs invasion, the Cuban Missile Crisis, and decades of US economic embargo. Castro officially stepped down due to illness in 2008, transferring power to his brother Raúl.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fidel_Castro",
    "citationTitle": "Wikipedia: Fidel Castro"
  },
  {
    "id": "1b55b212-f0c0-4395-a25d-49aa588c0781",
    "text": "Which leader established the Non-Aligned Movement during the Cold War and served as President of Yugoslavia from 1953 until his death in 1980?",
    "options": [
      "Alexander Dubček",
      "Josip Broz Tito",
      "Nicolae Ceaușescu",
      "Enver Hoxha"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Josip Broz Tito was the founding father of Yugoslavia and a key figure in the Non-Aligned Movement.",
    "detailedExplanation": "Josip Broz Tito served as the President of Yugoslavia from 1953 until his death in 1980. He was instrumental in establishing the Non-Aligned Movement in 1961 alongside leaders like Nehru of India and Nasser of Egypt, creating a bloc of nations that refused to align with either the US or Soviet Union during the Cold War. Tito successfully maintained Yugoslavia's independence from Soviet control after breaking with Stalin in 1948, making him one of the most significant leaders of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Josip_Broz_Tito",
    "citationTitle": "Wikipedia: Josip Broz Tito"
  },
  {
    "id": "cf1c62e7-b4de-44c5-8ecb-394ebf885c16",
    "text": "Which Persian King launched the first invasion of Greece in 492 BCE, leading to the famous Battle of Marathon?",
    "options": [
      "Cyrus the Great",
      "Darius I",
      "Xerxes I",
      "Artaxerxes I"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Darius I initiated the first Persian invasion of Greece, which culminated in the Battle of Marathon in 490 BCE.",
    "detailedExplanation": "Darius I, also known as Darius the Great, ruled the Persian Empire from 522 to 486 BCE and launched the first Persian invasion of Greece in 492 BCE. This campaign was motivated by his desire to punish Athens and Eretria for their support of the Ionian Revolt. The invasion ultimately led to the famous Battle of Marathon in 490 BCE, where the Athenians achieved a stunning victory against the much larger Persian force. His son Xerxes I would later launch the second Persian invasion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Darius_I",
    "citationTitle": "Wikipedia: Darius I"
  },
  {
    "id": "c5a4a7a0-4216-4674-8738-a20ada31a55c",
    "text": "Which British Prime Minister was known as 'The Iron Duke' and defeated Napoleon at the Battle of Waterloo before entering politics?",
    "options": [
      "Robert Peel",
      "Duke of Wellington",
      "Lord Melbourne",
      "Earl Grey"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Duke of Wellington earned the nickname 'The Iron Duke' and served as Prime Minister after his military career.",
    "detailedExplanation": "Arthur Wellesley, 1st Duke of Wellington, earned the nickname 'The Iron Duke' for his military prowess and later his firm political leadership. He famously defeated Napoleon at the Battle of Waterloo in 1815, ending the Napoleonic Wars. Wellington transitioned to politics and served as Prime Minister from 1828 to 1830, during which he reluctantly passed the Catholic Emancipation Act. He remains unique as one of the few British Prime Ministers to have achieved such military distinction before entering politics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arthur_Wellesley,_1st_Duke_of_Wellington",
    "citationTitle": "Wikipedia: Arthur Wellesley, 1st Duke of Wellington"
  },
  {
    "id": "8e0a96c1-6f06-46ad-af18-f1b7f4d18d8c",
    "text": "Which Aztec Emperor was captured by Hernán Cortés in 1519 and died in Spanish custody in 1520, leading to the fall of the Aztec Empire?",
    "options": [
      "Moctezuma II",
      "Itzcóatl",
      "Axayacatl",
      "Tizoc"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Moctezuma II was the Aztec Emperor who was captured by Cortés and died in Spanish custody.",
    "detailedExplanation": "Moctezuma II (also spelled Montezuma) ruled the Aztec Empire from 1502 to 1520 and was at the height of its power when Spanish conquistadors arrived. When Hernán Cortés landed in Mexico in 1519, Moctezuma initially received him peacefully, possibly believing he was the returning god Quetzalcoatl. However, Cortés took Moctezuma captive and used him as a puppet ruler. Moctezuma died in 1520 while in Spanish custody - whether from stones thrown by his own people during a riot or murdered by the Spanish remains disputed. His capture and death marked the beginning of the end for the Aztec Empire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moctezuma_II",
    "citationTitle": "Wikipedia: Moctezuma II"
  }
]