[
  {
    "id": "ad55e390-91c0-4a55-89f5-975a37d4f010",
    "text": "What protein-rich ingredient made from wheat gluten is commonly called 'wheat meat' in vegetarian cuisine?",
    "options": [
      "Tempeh",
      "Seitan",
      "Tofu",
      "Textured vegetable protein"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Seitan is made from wheat gluten and is often called 'wheat meat' due to its chewy, meat-like texture.",
    "detailedExplanation": "Seitan is a traditional East Asian food made from wheat gluten, the main protein in wheat. It has been used in Buddhist vegetarian cuisine for centuries and is prized for its chewy, meat-like texture. The name 'seitan' was coined by Japanese macrobiotics advocate George Ohsawa in the 1960s, though the food itself dates back much further. It's commonly used as a meat substitute in various dishes and can be seasoned and prepared in numerous ways.",
    "citationUrl": "https://en.wikipedia.org/wiki/Seitan",
    "citationTitle": "Wikipedia: Seitan"
  },
  {
    "id": "e86f3bed-9892-402e-9fd3-25fdeae59844",
    "text": "Which B vitamin is most commonly deficient in vegan diets and typically requires supplementation?",
    "options": [
      "B1 (Thiamine)",
      "B6 (Pyridoxine)",
      "B9 (Folate)",
      "B12 (Cobalamin)"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Vitamin B12 is primarily found in animal products, making it the most common deficiency concern for vegans.",
    "detailedExplanation": "Vitamin B12 (cobalamin) is essential for proper red blood cell formation, neurological function, and DNA synthesis. It's naturally found almost exclusively in animal products, as it's produced by bacteria that live in the digestive systems of animals. While some plant foods may contain trace amounts through bacterial contamination or fortification, vegans are at high risk of B12 deficiency without proper supplementation or consumption of fortified foods. Health organizations universally recommend B12 supplementation for vegans.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vitamin_B12_deficiency",
    "citationTitle": "Wikipedia: Vitamin B12 deficiency"
  },
  {
    "id": "35eda6df-6467-44ad-b8f6-fd66ac9783c4",
    "text": "What traditional Middle Eastern chickpea fritter is considered a staple of vegetarian cuisine?",
    "options": [
      "Hummus",
      "Baba ganoush",
      "Falafel",
      "Tabbouleh"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Falafel consists of deep-fried chickpea or fava bean fritters and is a popular vegetarian protein source.",
    "detailedExplanation": "Falafel is a traditional Middle Eastern dish consisting of deep-fried balls or patties made from ground chickpeas, fava beans, or both. Originating in Egypt and spreading throughout the Middle East, falafel has become a global vegetarian staple due to its high protein content and versatility. It's typically seasoned with herbs and spices like parsley, cilantro, cumin, and coriander, then formed into balls or patties and deep-fried until crispy outside and tender inside.",
    "citationUrl": "https://en.wikipedia.org/wiki/Falafel",
    "citationTitle": "Wikipedia: Falafel"
  },
  {
    "id": "065aea8e-81b9-469c-9568-e17298455d65",
    "text": "Which fermented Indonesian soybean product is known for its nutty flavor and firm texture?",
    "options": [
      "Miso",
      "Natto",
      "Tempeh",
      "Doenjang"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Tempeh is an Indonesian fermented soybean cake with a nutty flavor and firm, meat-like texture.",
    "detailedExplanation": "Tempeh is a traditional Indonesian food made by fermenting soybeans with a mold called Rhizopus oligosporus. The fermentation process binds the soybeans into a firm, white cake with a nutty, mushroom-like flavor. Unlike other soy products, tempeh retains the whole soybean, making it higher in protein, fiber, and nutrients. It originated in Java, Indonesia, and has been a dietary staple there for centuries. The fermentation process also makes the soybeans more digestible and creates beneficial probiotics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tempeh",
    "citationTitle": "Wikipedia: Tempeh"
  },
  {
    "id": "002e652e-013e-4610-acab-761b77c9c32f",
    "text": "What cooking liquid from canned chickpeas has become popular as a vegan egg substitute, especially in baking?",
    "options": [
      "Chickpea water",
      "Bean broth",
      "Aquafaba",
      "Legume liquid"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Aquafaba, the liquid from canned chickpeas, can be whipped and used as an egg substitute in vegan baking.",
    "detailedExplanation": "Aquafaba, literally meaning 'bean water' in Latin, refers to the viscous liquid that results from cooking legumes, most commonly the liquid from canned chickpeas. Discovered as an egg substitute in 2014, aquafaba has revolutionary properties for vegan cooking - it can be whipped into peaks like egg whites, used as a binding agent, and even made into mayonnaise. Three tablespoons of aquafaba typically replace one whole egg in recipes, making it invaluable for vegan versions of meringues, mousses, and baked goods.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aquafaba",
    "citationTitle": "Wikipedia: Aquafaba"
  },
  {
    "id": "9a0cbc73-874c-4ef3-bff7-224ee66c68f5",
    "text": "Which plant-based milk alternative has the highest protein content, most similar to cow's milk?",
    "options": [
      "Almond milk",
      "Oat milk",
      "Rice milk",
      "Soy milk"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Soy milk contains about 7-8 grams of protein per cup, comparable to cow's milk's protein content.",
    "detailedExplanation": "Among plant-based milk alternatives, soy milk has the highest protein content and most closely matches cow's milk nutritionally. A cup of soy milk contains approximately 7-8 grams of complete protein, containing all essential amino acids. This compares to cow's milk's 8 grams per cup, while almond milk typically contains only 1 gram, oat milk about 2-3 grams, and rice milk around 1 gram per cup. Soy milk was also one of the first widely available plant-based milk alternatives and remains popular among vegans and those with lactose intolerance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Soy_milk",
    "citationTitle": "Wikipedia: Soy milk"
  },
  {
    "id": "7124bdc4-65f9-49ad-8edb-f48ed89feef0",
    "text": "What ancient grain, considered sacred by the Incas, is technically a seed and contains all nine essential amino acids?",
    "options": [
      "Amaranth",
      "Quinoa",
      "Bulgur",
      "Freekeh"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Quinoa is a complete protein containing all essential amino acids and was called 'chisaya mama' (mother of all grains) by the Incas.",
    "detailedExplanation": "Quinoa is a flowering plant native to South America that produces edible seeds. Despite being commonly referred to as a grain, quinoa is technically a pseudocereal - its seeds are used similarly to grains but it's not a member of the grass family. The Incas called it 'chisaya mama' meaning 'mother of all grains' and considered it sacred. Quinoa is particularly valuable in vegetarian and vegan diets because it's one of the few plant foods that contains all nine essential amino acids, making it a complete protein source.",
    "citationUrl": "https://en.wikipedia.org/wiki/Quinoa",
    "citationTitle": "Wikipedia: Quinoa"
  },
  {
    "id": "32613b1a-6fb4-400d-af47-ff38df129f66",
    "text": "Which popular vegan cheese substitute is traditionally made from cashews and nutritional yeast?",
    "options": [
      "Almond ricotta",
      "Coconut mozzarella",
      "Cashew cream cheese",
      "Soy cheddar"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Cashew cream cheese is a popular vegan alternative made by blending soaked cashews with nutritional yeast and seasonings.",
    "detailedExplanation": "Cashew-based cheese alternatives have become extremely popular in vegan cuisine due to cashews' naturally creamy texture when blended. Cashew cream cheese is typically made by soaking raw cashews to soften them, then blending with nutritional yeast (which provides a cheese-like, nutty flavor), lemon juice, salt, and various seasonings. The high fat content and neutral flavor of cashews makes them ideal for creating dairy-free cheese alternatives. Nutritional yeast, a deactivated yeast, is particularly important as it provides the umami and cheese-like flavor that makes these alternatives convincing substitutes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vegan_cheese",
    "citationTitle": "Wikipedia: Vegan cheese"
  },
  {
    "id": "cf567f92-8322-4c05-be9c-bd265cd58afe",
    "text": "Which Italian pasta sauce, made from basil, garlic, pine nuts, and olive oil, is naturally vegan when made without parmesan cheese?",
    "options": [
      "Carbonara",
      "Pesto",
      "Alfredo",
      "Amatriciana"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Traditional pesto genovese is naturally vegan except for the parmesan cheese, which can be omitted or replaced with nutritional yeast.",
    "detailedExplanation": "Pesto originates from Genoa, Italy, and its base ingredients of fresh basil, garlic, pine nuts, and olive oil are all plant-based. The traditional recipe includes parmesan cheese and sometimes pecorino, but these can easily be omitted or substituted with vegan alternatives like nutritional yeast or vegan parmesan to create a completely plant-based version while maintaining the sauce's distinctive flavor profile.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pesto",
    "citationTitle": "Wikipedia: Pesto"
  },
  {
    "id": "6dc91715-e439-4d80-b163-75543a8506dc",
    "text": "What type of cuisine features jackfruit as a popular meat substitute, particularly mimicking pulled pork?",
    "options": [
      "Thai",
      "Mexican",
      "Indian",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Young green jackfruit has a fibrous texture similar to pulled meat and is used as a meat substitute across Thai, Mexican, Indian, and many other cuisines.",
    "detailedExplanation": "Jackfruit, particularly when young and green, has gained popularity worldwide as a versatile meat substitute due to its naturally fibrous, stringy texture that closely resembles pulled pork or shredded chicken. While native to South and Southeast Asia, it's now used globally in various cuisines including Thai curries, Mexican tacos, Indian preparations, and American-style BBQ dishes, making it one of the most internationally adopted plant-based meat alternatives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jackfruit",
    "citationTitle": "Wikipedia: Jackfruit"
  },
  {
    "id": "e1d8045f-8774-448e-acf4-8bc1bc45f2c5",
    "text": "Which Japanese fermented soybean paste is essential for making traditional miso soup and many vegan Japanese dishes?",
    "options": [
      "Tamari",
      "Miso",
      "Natto",
      "Shoyu"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Miso is a fermented soybean paste that forms the base of miso soup and is used extensively in Japanese vegan cooking for its umami flavor.",
    "detailedExplanation": "Miso is a traditional Japanese seasoning made by fermenting soybeans with salt and koji (a type of fungus). It comes in various types ranging from sweet white miso to robust red miso, each offering different depths of umami flavor. Miso is naturally vegan and serves as a cornerstone ingredient in Japanese plant-based cuisine, providing complex savory flavors to soups, marinades, dressings, and glazes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Miso",
    "citationTitle": "Wikipedia: Miso"
  },
  {
    "id": "4923ef77-7568-42d5-866f-1e839772ff50",
    "text": "What cooking technique involves marinating and cooking thin slices of vegetables or tofu to create 'bacon' substitutes?",
    "options": [
      "Smoking",
      "Curing",
      "Marinating and pan-frying",
      "Dehydrating"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Vegetables like eggplant, mushrooms, or tofu are marinated in smoky, salty seasonings then pan-fried to create crispy, bacon-like textures and flavors.",
    "detailedExplanation": "Creating plant-based bacon substitutes typically involves slicing vegetables such as eggplant, king oyster mushrooms, or extra-firm tofu into thin strips, then marinating them in a mixture of soy sauce, liquid smoke, maple syrup, and various spices to mimic bacon's smoky, salty, and slightly sweet flavor profile. The marinated slices are then pan-fried until crispy, creating a texture and taste remarkably similar to traditional bacon while remaining completely plant-based.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bacon_substitute",
    "citationTitle": "Wikipedia: Bacon substitute"
  },
  {
    "id": "e81f39bf-f183-4786-aeda-45ce5d237405",
    "text": "Which African plant-based stew, popular in Ethiopian cuisine, contains lentils and is traditionally eaten during fasting periods?",
    "options": [
      "Tagine",
      "Misir wot",
      "Jollof",
      "Bobotie"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Misir wot is an Ethiopian red lentil stew that's naturally vegan and commonly eaten during Orthodox fasting periods when animal products are avoided.",
    "detailedExplanation": "Misir wot is a cornerstone dish of Ethiopian cuisine, consisting of red lentils cooked in berbere spice blend, creating a rich, flavorful, and protein-dense stew. This dish is particularly important during Ethiopian Orthodox fasting periods, which can last up to 250 days per year, when adherents follow a vegan diet. The combination of lentils and berbere (a complex spice mix including chili peppers, garlic, ginger, and various other spices) creates a nutritionally complete and deeply satisfying meal that's naturally plant-based.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ethiopian_cuisine",
    "citationTitle": "Wikipedia: Ethiopian cuisine"
  },
  {
    "id": "f3b4f3bf-d82a-4037-bf2a-66628bde4046",
    "text": "What natural thickening agent derived from red seaweed is commonly used in vegan cooking as a gelatin substitute?",
    "options": [
      "Carrageenan",
      "Agar-agar",
      "Xanthan gum",
      "Arrowroot"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Agar-agar is extracted from red seaweed and works as a direct substitute for animal-derived gelatin in vegan recipes.",
    "detailedExplanation": "Agar-agar, also simply called agar, is a gelatinous substance derived from red algae that has been used in Asian cooking for centuries. It's completely plant-based and serves as an excellent substitute for animal gelatin in vegan cooking and baking. Agar sets at room temperature and creates a firm, clear gel that's perfect for making vegan jellies, puddings, panna cotta, and even as a thickening agent in soups and sauces. Unlike gelatin, agar is stable at higher temperatures and provides a clean, neutral taste.",
    "citationUrl": "https://en.wikipedia.org/wiki/Agar",
    "citationTitle": "Wikipedia: Agar"
  },
  {
    "id": "8ab65fa1-8dcf-481f-a079-fa0766966bf5",
    "text": "Which term describes the practice of eating a diet consisting entirely of raw, unprocessed plant foods?",
    "options": [
      "Fruitarianism",
      "Raw veganism",
      "Breatharianism",
      "Macrobiotic"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Raw veganism involves consuming only raw, unprocessed plant foods that haven't been heated above approximately 104-118°F (40-48°C).",
    "detailedExplanation": "Raw veganism is a dietary lifestyle that combines veganism with raw foodism, meaning adherents consume only plant-based foods that have not been heated above approximately 104-118°F (40-48°C). Practitioners believe this temperature threshold preserves the natural enzymes and nutrients that might be destroyed through cooking. The diet includes raw fruits, vegetables, nuts, seeds, sprouted grains, and legumes, often prepared through techniques like sprouting, fermenting, dehydrating, and juicing rather than traditional cooking methods.",
    "citationUrl": "https://en.wikipedia.org/wiki/Raw_veganism",
    "citationTitle": "Wikipedia: Raw veganism"
  },
  {
    "id": "58091b93-0dd6-4322-bcee-65aa956151c0",
    "text": "What Indian flatbread, typically made without dairy products, is naturally vegan and commonly served with curry dishes?",
    "options": [
      "Naan",
      "Chapati",
      "Kulcha",
      "Paratha"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Chapati is made with just flour, water, and salt, making it naturally vegan, unlike naan which typically contains yogurt or milk.",
    "detailedExplanation": "Chapati, also known as roti, is a traditional Indian unleavened flatbread made from a simple dough of whole wheat flour, water, and a pinch of salt. Unlike naan, which typically contains yogurt, milk, or ghee, chapati is naturally vegan and has been a staple food across the Indian subcontinent for thousands of years. It's cooked on a dry griddle (tawa) and often puffed over an open flame, creating a soft, flexible bread perfect for scooping up curries and other dishes in traditional Indian meals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chapati",
    "citationTitle": "Wikipedia: Chapati"
  },
  {
    "id": "9b0a4598-4a2c-4767-ad87-2e2e0885de00",
    "text": "Which traditional French cooking technique involves slowly cooking vegetables in their own juices with minimal fat, commonly used in vegetarian cuisine?",
    "options": [
      "Confit",
      "Sweating",
      "Étuvée",
      "Sautéing"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Étuvée is a French cooking method where vegetables are cooked slowly in a covered pot with minimal liquid or fat.",
    "detailedExplanation": "Étuvée is a classic French culinary technique that has become particularly popular in vegetarian cooking. The method involves cooking vegetables slowly in a tightly covered pot with very little added liquid or fat, allowing them to cook in their own natural juices. This technique preserves the vegetables' natural flavors and nutrients while creating tender, flavorful dishes. Unlike confit (which uses large amounts of fat), sweating (which is done uncovered), or sautéing (which uses higher heat), étuvée creates a gentle, moist cooking environment that brings out the best in plant-based ingredients.",
    "citationUrl": "https://en.wikipedia.org/wiki/Braising",
    "citationTitle": "Wikipedia: Braising"
  },
  {
    "id": "dec04188-7b9c-443c-8f5b-ef5bce706e3b",
    "text": "What is the main ingredient in the popular vegan dessert called 'nice cream'?",
    "options": [
      "Coconut milk",
      "Cashews",
      "Frozen bananas",
      "Silken tofu"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Nice cream is primarily made from frozen bananas blended until creamy, creating a dairy-free ice cream alternative.",
    "detailedExplanation": "Nice cream has become a beloved staple in vegan dessert cuisine, offering a simple and healthy alternative to traditional ice cream. The base ingredient is frozen bananas, which when blended create a remarkably creamy, ice cream-like texture without any dairy products. The natural sugars in bananas provide sweetness, while their creamy consistency when frozen and processed mimics the mouthfeel of conventional ice cream. Additional ingredients like cocoa powder, berries, or nut butters can be added for flavor variations, but the frozen banana base remains the essential component that gives nice cream its characteristic texture and appeal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Banana",
    "citationTitle": "Wikipedia: Banana"
  },
  {
    "id": "3521d61e-aae6-43c4-ab25-552913a07d09",
    "text": "Which Mediterranean grain dish, traditionally made with bulgur wheat, is naturally vegan and features parsley as a main ingredient?",
    "options": [
      "Couscous",
      "Tabbouleh",
      "Pilaf",
      "Freekeh"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Tabbouleh is a Middle Eastern salad made primarily with bulgur wheat, fresh parsley, tomatoes, and lemon juice.",
    "detailedExplanation": "Tabbouleh is a traditional Levantine salad that has become a cornerstone of Mediterranean vegetarian cuisine. Originating from the mountainous regions of Lebanon and Syria, this refreshing dish is built around bulgur wheat and an abundance of fresh flat-leaf parsley, which actually makes up the majority of the dish rather than being just a garnish. Combined with diced tomatoes, mint, onions, lemon juice, and olive oil, tabbouleh offers a light, nutritious meal that's naturally vegan and packed with vitamins and minerals. The high proportion of fresh herbs makes it unique among grain salads and contributes to its distinctive bright, fresh flavor profile.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tabbouleh",
    "citationTitle": "Wikipedia: Tabbouleh"
  },
  {
    "id": "0b4bf3a6-31fc-4bbe-a24e-d5aa2d7b6ff4",
    "text": "What type of mushroom is most commonly used to create vegan 'pulled pork' due to its naturally stringy texture?",
    "options": [
      "Portobello",
      "King Oyster",
      "Shiitake",
      "Lion's Mane"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "King Oyster mushrooms have thick, meaty stems that can be shredded to mimic the texture of pulled pork.",
    "detailedExplanation": "King Oyster mushrooms (Pleurotus eryngii) have gained popularity in vegan cuisine specifically for their ability to replicate meat textures, particularly pulled pork. Unlike other mushrooms that have thin stems, King Oyster mushrooms feature thick, substantial stems that can be shredded using a fork after cooking, creating long, stringy fibers that closely resemble the texture of pulled pork. When seasoned with barbecue sauce and spices, the mushroom's naturally meaty flavor and convincing texture make it an excellent plant-based substitute. The mushroom's ability to absorb flavors while maintaining its structural integrity during cooking has made it a favorite among vegan chefs and home cooks seeking authentic meat-like textures in their dishes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pleurotus_eryngii",
    "citationTitle": "Wikipedia: Pleurotus eryngii"
  }
]