[
  {
    "id": "8e4a99c5-e89a-4638-952a-d5b78d755551",
    "text": "What was the name of the radical political club led by Maximilien Robespierre during the Reign of Terror?",
    "options": [
      "The Girondins",
      "The Jacobins",
      "The Feuillants",
      "The Cordeliers"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Jacobins were the radical political club dominated by Robespierre during the Terror.",
    "detailedExplanation": "The Jacobin Club, officially known as the Society of the Friends of the Constitution, became the most influential political club during the French Revolution. Under Maximilien Robespierre's leadership, they advocated for radical republican policies and were instrumental in implementing the Reign of Terror from 1793-1794. The Jacobins eventually purged their moderate rivals, the Girondins, and dominated revolutionary politics until Robespierre's own execution in July 1794.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jacobin_Club",
    "citationTitle": "Wikipedia: Jacobin Club"
  },
  {
    "id": "df781431-f675-426a-9594-1a23973cd57b",
    "text": "Which revolutionary calendar month was Thermidor, during which Robespierre fell from power?",
    "options": [
      "The 9th month",
      "The 11th month",
      "The 12th month",
      "The 10th month"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Thermidor was the 11th month of the French Revolutionary Calendar, roughly corresponding to July-August.",
    "detailedExplanation": "The French Revolutionary Calendar, implemented in 1793, renamed the months to remove Christian and royalist influences. Thermidor (meaning 'heat' in Greek) was the 11th month, running from mid-July to mid-August. The Thermidorian Reaction on 9 Thermidor Year II (July 27, 1794) marked the end of the Reign of Terror when Robespierre and his allies were arrested and executed, leading to a more moderate phase of the Revolution.",
    "citationUrl": "https://en.wikipedia.org/wiki/French_Republican_calendar",
    "citationTitle": "Wikipedia: French Republican Calendar"
  },
  {
    "id": "2cf18277-78c5-4637-a99f-ddbbce6fc7e3",
    "text": "Who was known as 'L'Ami du peuple' (The Friend of the People) and was assassinated in his bath in 1793?",
    "options": [
      "Jacques Pierre Brissot",
      "Jean-Paul Marat",
      "Georges Danton",
      "Camille Desmoulins"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Jean-Paul Marat published the radical newspaper 'L'Ami du peuple' and was murdered by Charlotte Corday.",
    "detailedExplanation": "Jean-Paul Marat was a radical journalist and politician who published the inflammatory newspaper 'L'Ami du peuple' (The Friend of the People), which called for violent measures against enemies of the revolution. His extreme rhetoric made him a target, and on July 13, 1793, he was assassinated by Charlotte Corday, a Girondin sympathizer from Caen, while he was taking a medicinal bath for his severe skin condition. His death made him a martyr for the radical cause.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Paul_Marat",
    "citationTitle": "Wikipedia: Jean-Paul Marat"
  },
  {
    "id": "f0eb136e-3381-4ff6-a9b2-f7d63be27e75",
    "text": "What was the name of the failed royalist uprising in the Vendée region that began in 1793?",
    "options": [
      "The Chouannerie",
      "The War in the Vendée",
      "The Federalist Revolts",
      "The Thermidorian Reaction"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The War in the Vendée was a major counter-revolutionary uprising in western France from 1793-1796.",
    "detailedExplanation": "The War in the Vendée was a massive counter-revolutionary uprising that began in March 1793 in the western French region of Vendée. Triggered by conscription laws and anti-clerical policies, Catholic and royalist peasants formed the 'Catholic and Royal Army' and fought against republican forces. The conflict was brutally suppressed by the revolutionary government, with an estimated 200,000-400,000 deaths. The rebellion continued sporadically until 1796 and represented one of the most serious internal threats to the revolutionary regime.",
    "citationUrl": "https://en.wikipedia.org/wiki/War_in_the_Vend%C3%A9e",
    "citationTitle": "Wikipedia: War in the Vendée"
  },
  {
    "id": "6d842243-8f57-4e3e-a30f-9784bdef9936",
    "text": "Which financial minister's dismissal by Louis XVI in July 1789 helped trigger the storming of the Bastille?",
    "options": [
      "Jacques Necker",
      "Charles Alexandre de Calonne",
      "Étienne Charles de Loménie de Brienne",
      "Anne Robert Jacques Turgot"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Jacques Necker's dismissal on July 11, 1789, sparked popular outrage that culminated in the storming of the Bastille.",
    "detailedExplanation": "Jacques Necker, a Swiss banker who served as Finance Minister, was popular with the Third Estate for his financial reforms and his publication of the first public account of royal finances. When Louis XVI dismissed him on July 11, 1789, amid the political crisis of the Estates-General, Parisians saw this as a reactionary move by the court. His dismissal, combined with fears of military action against the National Assembly, directly contributed to the popular uprising that led to the storming of the Bastille on July 14, 1789.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jacques_Necker",
    "citationTitle": "Wikipedia: Jacques Necker"
  },
  {
    "id": "8c99dbce-805e-4031-94db-a87b93d49c7d",
    "text": "What was the name of the oath taken by members of the Third Estate when they were locked out of their meeting hall in 1789?",
    "options": [
      "The Oath of the Federation",
      "The Civil Constitution Oath",
      "The Tennis Court Oath",
      "The Oath of Liberty"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Tennis Court Oath was sworn on June 20, 1789, when Third Estate delegates pledged to create a new constitution.",
    "detailedExplanation": "On June 20, 1789, members of the Third Estate found themselves locked out of their usual meeting hall at Versailles. They moved to a nearby tennis court (jeu de paume) where 576 delegates took a solemn oath not to separate until France had a written constitution. This Tennis Court Oath marked a crucial moment when the Third Estate transformed itself into the National Assembly, effectively challenging royal authority and beginning the constitutional phase of the French Revolution. Only one delegate, Joseph Martin-Dauch, refused to sign.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tennis_Court_Oath",
    "citationTitle": "Wikipedia: Tennis Court Oath"
  },
  {
    "id": "d56811ae-8973-490f-a0f9-2d19d0d6d926",
    "text": "What was the name of the artificial religion promoted by Robespierre as an alternative to Christianity?",
    "options": [
      "The Cult of Reason",
      "The Cult of the Supreme Being",
      "The Festival of Liberty",
      "The Temple of Nature"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Cult of the Supreme Being was Robespierre's deistic alternative to both Christianity and the atheistic Cult of Reason.",
    "detailedExplanation": "The Cult of the Supreme Being was established by Robespierre in May 1794 as a state religion based on deistic principles. Unlike the atheistic Cult of Reason promoted by radical de-Christianizers, Robespierre's cult acknowledged a supreme deity while rejecting organized Christianity. The culmination was the Festival of the Supreme Being on June 8, 1794, where Robespierre, as president of the Convention, led elaborate ceremonies on the Champ-de-Mars. The artificial nature of this civic religion and Robespierre's prominent role in it contributed to growing opposition against him.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cult_of_the_Supreme_Being",
    "citationTitle": "Wikipedia: Cult of the Supreme Being"
  },
  {
    "id": "197ba9ea-2de5-47dc-9b68-af9dbbe7abd3",
    "text": "What was the name of the calendar system introduced during the French Revolution that replaced the Gregorian calendar?",
    "options": [
      "Revolutionary Calendar",
      "Republican Calendar",
      "Jacobin Calendar",
      "National Calendar"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Republican Calendar was adopted in 1793 and used until 1806.",
    "detailedExplanation": "The French Republican Calendar, also known as the Revolutionary Calendar, was created by the National Convention in 1793 to remove religious and royalist influences from the calendar. It featured 12 months of 30 days each with five or six complementary days, renamed months after natural phenomena, and started Year I from the establishment of the Republic on September 22, 1792. The calendar was officially abandoned by Napoleon in 1806.",
    "citationUrl": "https://en.wikipedia.org/wiki/French_Republican_calendar",
    "citationTitle": "Wikipedia: French Republican Calendar"
  },
  {
    "id": "7807de82-91ac-4247-a638-bd7d389cb62e",
    "text": "Which economic policy implemented by Jacques Necker involved publishing the government's budget publicly for the first time?",
    "options": [
      "Compte Rendu au Roi",
      "Tableau Économique",
      "Déclaration Royale",
      "Budget National"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Compte Rendu au Roi (Account Rendered to the King) was published in 1781, revealing France's financial situation.",
    "detailedExplanation": "Jacques Necker, the Swiss banker who served as Director-General of Finance under Louis XVI, published the 'Compte Rendu au Roi' in 1781. This unprecedented public disclosure of the royal finances revealed the extent of France's debt crisis and court spending, becoming a bestseller and contributing to public outrage. The document showed that ordinary revenues exceeded ordinary expenses, but massive debt service payments created the deficit, helping fuel revolutionary sentiment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jacques_Necker",
    "citationTitle": "Wikipedia: Jacques Necker"
  },
  {
    "id": "d2145891-ca7b-476f-af89-682196de1c1c",
    "text": "What was the name of the militant women's political club led by Olympe de Gouges that was eventually banned by the Jacobins?",
    "options": [
      "Society of Revolutionary Women",
      "Club of Patriotic Women",
      "Society of Revolutionary Republican Women",
      "Women's Jacobin Society"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Society of Revolutionary Republican Women was founded in 1793 but banned later that year.",
    "detailedExplanation": "The Society of Revolutionary Republican Women (Société des républicaines révolutionnaires) was founded in May 1793 by Claire Lacombe and Pauline Léon, not Olympe de Gouges. This radical women's political club advocated for women's rights, supported sans-culotte policies, and demanded the right to bear arms. The club became increasingly militant and was eventually banned by the National Convention in October 1793, along with all women's political clubs, as the Jacobins viewed them as a threat to public order.",
    "citationUrl": "https://en.wikipedia.org/wiki/Society_of_Revolutionary_Republican_Women",
    "citationTitle": "Wikipedia: Society of Revolutionary Republican Women"
  },
  {
    "id": "88cd24a3-9ada-45bc-b0ac-d3dc5d364588",
    "text": "Which battle fought in June 1794 was considered the turning point that secured French revolutionary forces' control over the Austrian Netherlands?",
    "options": [
      "Battle of Valmy",
      "Battle of Jemappes",
      "Battle of Fleurus",
      "Battle of Wattignies"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Battle of Fleurus on June 26, 1794, led to French reconquest of Belgium.",
    "detailedExplanation": "The Battle of Fleurus, fought on June 26, 1794, was a decisive victory for the French revolutionary army under General Jean-Baptiste Jourdan against the Austrian forces commanded by Prince Josias of Saxe-Coburg-Saalfeld. This victory opened the way for French reconquest of Belgium and marked the beginning of French dominance in the Low Countries. Notably, this battle also featured the first military use of an observation balloon for aerial reconnaissance, operated by the French Aerostatic Corps.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_Fleurus_(1794)",
    "citationTitle": "Wikipedia: Battle of Fleurus (1794)"
  },
  {
    "id": "7ca4892d-e32d-4e11-9cba-bbb6ac39e0b4",
    "text": "What was the specific name of the law passed in September 1793 that legalized the Reign of Terror's mass arrests and executions?",
    "options": [
      "Law of Suspects",
      "Decree of Terror",
      "Law of Maximum",
      "Revolutionary Tribunal Act"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Law of Suspects authorized the arrest of anyone deemed suspicious of counter-revolutionary activities.",
    "detailedExplanation": "The Law of Suspects (Loi des suspects) was decreed on September 17, 1793, during the height of the Reign of Terror. This law dramatically expanded the definition of who could be considered an enemy of the revolution, including former nobles, relatives of émigrés, dismissed public officials, and anyone who couldn't prove their civic virtue. It essentially legalized arbitrary arrests and created the legal framework for the mass imprisonments and executions that characterized the Terror period, leading to approximately 17,000 official death sentences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Law_of_Suspects",
    "citationTitle": "Wikipedia: Law of Suspects"
  },
  {
    "id": "d30eb508-7626-4b69-81ac-1f25ad47271e",
    "text": "Which deputy's assassination in his bath on July 13, 1793, led to increased radicalization during the Revolution?",
    "options": [
      "Georges Danton",
      "Jean-Paul Marat",
      "Jacques Pierre Brissot",
      "Maximilien Robespierre"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Jean-Paul Marat was assassinated by Charlotte Corday while taking a medicinal bath.",
    "detailedExplanation": "Jean-Paul Marat, the radical journalist and politician known for his inflammatory newspaper 'L'Ami du peuple' (Friend of the People), was assassinated on July 13, 1793, by Charlotte Corday, a Girondin sympathizer from Caen. Marat was taking a medicinal bath to treat a painful skin condition when Corday gained access to his home under the pretense of providing information about Girondin conspirators. His death transformed him into a martyr for the radical cause and contributed to the intensification of the Terror, as the Jacobins used his assassination to justify further purges of their political enemies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Paul_Marat",
    "citationTitle": "Wikipedia: Jean-Paul Marat"
  },
  {
    "id": "4fb06d28-2c06-4824-96d4-45ffce2e46e2",
    "text": "What was the name of the artificial religion created by Robespierre to replace Christianity during the Revolution?",
    "options": [
      "Cult of Reason",
      "Cult of the Supreme Being",
      "Religion of Nature",
      "Civic Religion"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Cult of the Supreme Being was Robespierre's deistic alternative to both atheism and Christianity.",
    "detailedExplanation": "The Cult of the Supreme Being (Culte de l'Être suprême) was established by Maximilien Robespierre in May 1794 as an official state religion. Unlike the more atheistic Cult of Reason promoted by the Hébertists, Robespierre's cult was based on deistic principles acknowledging a supreme deity and the immortality of the soul. The inaugural Festival of the Supreme Being was held on June 8, 1794, with Robespierre presiding as the event's main organizer. The cult was intended to provide moral foundation for the Republic while avoiding both the extremes of atheism and traditional Catholicism, but it largely died out after Robespierre's execution.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cult_of_the_Supreme_Being",
    "citationTitle": "Wikipedia: Cult of the Supreme Being"
  },
  {
    "id": "fc518888-1575-4b90-8c7d-ba7a61be383a",
    "text": "Which financial scheme involving the sale of confiscated Church and emigrant lands ultimately led to massive inflation during the Revolution?",
    "options": [
      "Livres system",
      "Assignats currency",
      "Revolutionary bonds",
      "National debt certificates"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Assignats were paper currency backed by confiscated lands that became severely devalued through overprinting.",
    "detailedExplanation": "Assignats were paper currency introduced in December 1789, initially as interest-bearing bonds backed by nationalized Church lands (biens nationaux) and later by confiscated emigrant properties. Originally intended to solve France's fiscal crisis, the government continuously printed more assignats to finance the Revolution and wars, leading to massive inflation. By 1796, assignats had lost over 99% of their original value, with prices rising astronomically. The system finally collapsed, and assignats were replaced by territorial mandates in 1796, which also quickly failed, contributing to the economic instability that helped bring Napoleon to power.",
    "citationUrl": "https://en.wikipedia.org/wiki/Assignat",
    "citationTitle": "Wikipedia: Assignat"
  },
  {
    "id": "61b1b3dc-bfc1-4b83-811b-f1ada118cfe5",
    "text": "What was the name of the radical newspaper edited by Jean-Paul Marat during the French Revolution?",
    "options": [
      "L'Ami du peuple",
      "Le Père Duchesne",
      "L'Orateur du peuple",
      "Le Publiciste parisien"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "L'Ami du peuple (The Friend of the People) was Marat's influential radical newspaper.",
    "detailedExplanation": "Jean-Paul Marat published L'Ami du peuple from 1789 until his assassination in 1793. The newspaper was known for its radical positions and inflammatory rhetoric against the enemies of the revolution. Marat used it to call for violent measures against those he considered traitors to the revolutionary cause, making it one of the most influential and feared publications of the period. The paper played a crucial role in stirring popular sentiment during the most turbulent years of the Revolution.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Paul_Marat",
    "citationTitle": "Wikipedia: Jean-Paul Marat"
  },
  {
    "id": "8f452a7c-d6ea-4366-ad05-7233f1c5df21",
    "text": "Which battle in August 1792 effectively ended the French monarchy and led to the September Massacres?",
    "options": [
      "Battle of Valmy",
      "Storming of the Tuileries Palace",
      "Battle of Fleurus",
      "Siege of Verdun"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Storming of the Tuileries Palace on August 10, 1792, led to the king's arrest and the fall of the monarchy.",
    "detailedExplanation": "The Storming of the Tuileries Palace on August 10, 1792, was a pivotal moment when revolutionary forces, including the Paris Commune and volunteer fighters, attacked the royal residence where Louis XVI and his family had taken refuge. The Swiss Guard defending the palace was massacred, and the royal family was forced to seek protection from the Legislative Assembly. This event effectively ended the constitutional monarchy, led to the king's imprisonment, and created the political chaos that contributed to the September Massacres later that month, where over 1,000 prisoners were killed by mobs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Insurrection_of_10_August_1792",
    "citationTitle": "Wikipedia: Insurrection of 10 August 1792"
  },
  {
    "id": "c3aa56a8-1c7d-4dea-83de-5899f3fecc87",
    "text": "What was the official name of the new calendar system implemented during the French Revolution in 1793?",
    "options": [
      "Revolutionary Calendar",
      "Republican Calendar",
      "Decimal Calendar",
      "Civic Calendar"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Republican Calendar was adopted to remove religious and royalist influences from French society.",
    "detailedExplanation": "The Republican Calendar (Calendrier républicain) was introduced on October 24, 1793, during the radical phase of the Revolution. It was designed to remove Christian and monarchical influences from the measurement of time. The calendar featured 12 months of 30 days each, with poetic names like Thermidor (heat) and Brumaire (mist), plus five or six additional days called 'complementary days.' Each month was divided into three 10-day weeks called décades. The system was used until Napoleon abolished it in 1806, though it was briefly revived during the Paris Commune in 1871.",
    "citationUrl": "https://en.wikipedia.org/wiki/French_Republican_calendar",
    "citationTitle": "Wikipedia: French Republican Calendar"
  },
  {
    "id": "3dda9d7e-3d73-477f-98a7-e2d12001c51a",
    "text": "Who was the chief prosecutor during the Reign of Terror, known as 'The Incorruptible'?",
    "options": [
      "Georges Danton",
      "Maximilien Robespierre",
      "Antoine Fouquier-Tinville",
      "Jacques Hébert"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Antoine Fouquier-Tinville was the chief public prosecutor of the Revolutionary Tribunal during the Terror.",
    "detailedExplanation": "Antoine Fouquier-Tinville served as the chief public prosecutor (accusateur public) of the Revolutionary Tribunal from 1793 to 1794, making him the principal legal architect of the Reign of Terror. While Robespierre was known as 'The Incorruptible' and was the political leader behind the Terror, Fouquier-Tinville was the one who actually prosecuted thousands of cases, sending over 2,600 people to the guillotine. He was known for his ruthless efficiency and mechanical approach to death sentences. After Robespierre's fall, Fouquier-Tinville was himself tried and executed in May 1795.",
    "citationUrl": "https://en.wikipedia.org/wiki/Antoine_Fouquier-Tinville",
    "citationTitle": "Wikipedia: Antoine Fouquier-Tinville"
  },
  {
    "id": "c8f37738-2d02-4019-a570-69e75bf84fb0",
    "text": "Which specific document, issued by the National Assembly in August 1789, served as the philosophical foundation for revolutionary France and directly influenced the American Bill of Rights?",
    "options": [
      "The Civil Constitution of the Clergy",
      "The Declaration of the Rights of Man and of the Citizen",
      "The Law of Suspects",
      "The Constitution of Year III"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Declaration of the Rights of Man and of the Citizen was adopted on August 26, 1789, establishing fundamental human rights principles.",
    "detailedExplanation": "The Declaration of the Rights of Man and of the Citizen (Déclaration des droits de l'homme et du citoyen) was adopted by France's National Assembly on August 26, 1789. This foundational document articulated individual and collective rights, including liberty, property, security, and resistance to oppression. It was heavily influenced by Enlightenment philosophy and the American Declaration of Independence, while simultaneously influencing democratic movements worldwide, including directly impacting the development of the American Bill of Rights.",
    "citationUrl": "https://en.wikipedia.org/wiki/Declaration_of_the_Rights_of_Man_and_of_the_Citizen",
    "citationTitle": "Wikipedia: Declaration of the Rights of Man and of the Citizen"
  }
]