[
  {
    "id": "b76c14e2-3655-456b-a52e-54467f440fe3",
    "text": "Which band's album cover features a prism dispersing light into a rainbow spectrum?",
    "options": [
      "Pink Floyd",
      "Led Zeppelin",
      "The Beatles",
      "Queen"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Pink Floyd's 'The Dark Side of the Moon' features the iconic prism design.",
    "detailedExplanation": "Pink Floyd's 'The Dark Side of the Moon' (1973) features one of the most recognizable album covers in rock history, designed by Storm Thorgerson and Aubrey Powell of Hipgnosis. The simple yet striking design shows a white light beam entering a triangular prism and dispersing into a rainbow spectrum against a black background. The design reflects the band's interest in light shows and represents the pressures that can fracture human nature, themes explored throughout the album.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Dark_Side_of_the_Moon",
    "citationTitle": "Wikipedia: The Dark Side of the Moon"
  },
  {
    "id": "2623a1a0-5597-4022-9949-d1be66a7d0cf",
    "text": "The famous 'Abbey Road' album cover shows The Beatles crossing which type of street feature?",
    "options": [
      "A bridge",
      "A zebra crossing",
      "A roundabout",
      "A railway crossing"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Beatles are photographed walking across the zebra crossing outside Abbey Road Studios.",
    "detailedExplanation": "The Abbey Road album cover, photographed by Iain Macmillan on August 8, 1969, shows all four Beatles walking across the zebra crossing outside Abbey Road Studios in London. The image was taken in just ten minutes with only six shots captured. The crossing has since become a tourist attraction and was granted protected status as a cultural landmark. The cover's simplicity and the band's casual stride created an iconic image that symbolized the end of an era for the world's most famous band.",
    "citationUrl": "https://en.wikipedia.org/wiki/Abbey_Road",
    "citationTitle": "Wikipedia: Abbey Road"
  },
  {
    "id": "2c1aa884-c5fc-4a8c-b9ae-bb64e34d5aaf",
    "text": "Which pop star's album cover shows her emerging from or sinking into water?",
    "options": [
      "Madonna",
      "Beyoncé",
      "Adele",
      "Taylor Swift"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Beyoncé's 'Lemonade' visual album features water imagery throughout, including the iconic cover.",
    "detailedExplanation": "Beyoncé's 'Lemonade' (2016) features striking visual imagery throughout, with the album cover and promotional materials heavily featuring water symbolism. The cover art shows Beyoncé in flowing water, which relates to themes of cleansing, rebirth, and emotional transformation explored throughout the visual album. The water imagery appears in multiple tracks and represents the journey from betrayal and anger to healing and empowerment that forms the album's narrative arc.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lemonade_(Beyoncé_album)",
    "citationTitle": "Wikipedia: Lemonade (Beyoncé album)"
  },
  {
    "id": "d584594b-1408-4377-9f2f-a6b6b36afe42",
    "text": "What type of fruit appears on the cover of The Velvet Underground & Nico's debut album?",
    "options": [
      "Apple",
      "Orange",
      "Banana",
      "Peach"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Andy Warhol designed the famous peelable banana cover for The Velvet Underground & Nico.",
    "detailedExplanation": "The Velvet Underground & Nico's 1967 debut album features one of the most famous album covers in rock history, designed by pop artist Andy Warhol. The cover shows a yellow banana with text that originally read 'Peel slowly and see.' Early pressings featured a peelable banana sticker that revealed a pink banana underneath. Warhol, who was the band's manager and producer, created this playful and provocative design that perfectly captured the avant-garde spirit of the band and the era.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Velvet_Underground_%26_Nico",
    "citationTitle": "Wikipedia: The Velvet Underground & Nico"
  },
  {
    "id": "90183b52-c02b-498c-9c8f-3156759eb671",
    "text": "Which album cover features a baby swimming underwater toward a dollar bill?",
    "options": [
      "Pearl Jam - Ten",
      "Nirvana - Nevermind",
      "Soundgarden - Badmotorfinger",
      "Alice in Chains - Facelift"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Nirvana's 'Nevermind' shows baby Spencer Elden swimming toward a dollar bill on a fishhook.",
    "detailedExplanation": "Nirvana's breakthrough album 'Nevermind' (1991) features a photograph by Kirk Weddle showing four-month-old Spencer Elden swimming naked underwater in a pool, reaching toward a dollar bill attached to a fishhook. The image was shot at the Rose Bowl Aquatics Center in Pasadena, California. The cover art perfectly encapsulates the album's themes about innocence, commerce, and the corruption of the American dream, while becoming one of the most recognizable album covers of the 1990s grunge era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nevermind",
    "citationTitle": "Wikipedia: Nevermind"
  },
  {
    "id": "e8fa3510-f872-4b22-a617-429d51417cc1",
    "text": "Which legendary guitarist's album cover shows him setting his guitar on fire?",
    "options": [
      "Eric Clapton",
      "Jimi Hendrix",
      "Jimmy Page",
      "Keith Richards"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jimi Hendrix's live performances often featured him setting his guitar ablaze, captured on several album covers.",
    "detailedExplanation": "Jimi Hendrix was famous for his theatrical performances that often culminated in him setting his Fender Stratocaster on fire, most notably at the Monterey Pop Festival in 1967. This dramatic moment has been featured on several album covers and compilations, including 'Live at Monterey' and various greatest hits collections. The act of burning his guitar became symbolic of Hendrix's revolutionary approach to rock music and his willingness to push boundaries both musically and visually, making it one of rock's most iconic images.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jimi_Hendrix",
    "citationTitle": "Wikipedia: Jimi Hendrix"
  },
  {
    "id": "e8bf99ae-d863-490c-9b03-ee295ee51188",
    "text": "What color is the submarine featured on The Beatles' album of the same name?",
    "options": [
      "Blue",
      "Yellow",
      "Red",
      "Green"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Beatles' 'Yellow Submarine' album features the iconic yellow submarine from the animated film.",
    "detailedExplanation": "The Beatles' 'Yellow Submarine' (1969) soundtrack album features colorful psychedelic artwork based on the animated film of the same name. The cover shows the famous yellow submarine along with the cartoon versions of the band members in the whimsical, psychedelic art style created by Heinz Edelmann for the movie. The yellow submarine became an enduring symbol of the 1960s counterculture and The Beatles' experimental period, representing peace, love, and the band's journey into more abstract and conceptual territories.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yellow_Submarine_(album)",
    "citationTitle": "Wikipedia: Yellow Submarine (album)"
  },
  {
    "id": "a0194cf1-9905-41fd-884b-e33077688233",
    "text": "Which heavy metal band's album cover depicts a skeletal figure known as 'Eddie'?",
    "options": [
      "Black Sabbath",
      "Iron Maiden",
      "Judas Priest",
      "Metallica"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Iron Maiden's mascot 'Eddie' has appeared on virtually every album cover since their debut.",
    "detailedExplanation": "Iron Maiden's mascot 'Eddie the Head' (often shortened to just 'Eddie') is a skeletal figure that has appeared on nearly every Iron Maiden album cover since their 1980 self-titled debut. Created by artist Derek Riggs, Eddie has taken many forms over the years - from zombie to cyborg to pharaoh - but always maintains his distinctive skeletal appearance. Eddie has become one of the most recognizable mascots in heavy metal, appearing not only on album covers but also as a stage prop during live performances, making Iron Maiden's visual identity instantly recognizable to metal fans worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eddie_the_Head",
    "citationTitle": "Wikipedia: Eddie the Head"
  },
  {
    "id": "4701f8b0-6353-4acc-995e-c1c12ff16b2e",
    "text": "Which animal appears on Pink Floyd's 'Animals' album cover?",
    "options": [
      "A pig",
      "A sheep",
      "A dog",
      "A cow"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "A large inflatable pig floats between the chimneys of Battersea Power Station on the cover.",
    "detailedExplanation": "Pink Floyd's 1977 album 'Animals' features the iconic Battersea Power Station in London with a large inflatable pig floating between its chimneys. The pig, nicknamed 'Algie,' was photographed floating above the power station during the album cover shoot. The image has become one of the most recognizable album covers in rock history, perfectly complementing the album's themes inspired by George Orwell's 'Animal Farm.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Animals_(Pink_Floyd_album)",
    "citationTitle": "Wikipedia: Animals (Pink Floyd album)"
  },
  {
    "id": "b7a907b2-3c6e-4996-a721-9b94832a8e4f",
    "text": "What is the main color scheme of Michael Jackson's 'Thriller' album cover?",
    "options": [
      "Red and black",
      "Blue and white",
      "Purple and gold",
      "Green and silver"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The 'Thriller' cover features Michael Jackson in a white suit against a blue background.",
    "detailedExplanation": "Michael Jackson's 1982 album 'Thriller' features a distinctive cover with Jackson wearing a white suit and lying against a blue-tinted background. The photograph was taken by Dick Zimmerman and shows Jackson in a casual pose with his signature white suit. This simple but effective design became iconic as 'Thriller' went on to become one of the best-selling albums of all time, spending 37 weeks at number one on the Billboard 200.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thriller_(album)",
    "citationTitle": "Wikipedia: Thriller (album)"
  },
  {
    "id": "45f943c2-aeaf-4a68-a027-f5d723e31a8c",
    "text": "Which famous artist painted The Rolling Stones' 'She's a Rainbow' single cover?",
    "options": [
      "Andy Warhol",
      "Salvador Dalí",
      "Pablo Picasso",
      "David Hockney"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Andy Warhol created the psychedelic artwork for this 1967 Rolling Stones single.",
    "detailedExplanation": "Andy Warhol designed the cover art for The Rolling Stones' 1967 single 'She's a Rainbow.' The artwork features Warhol's distinctive pop art style with vibrant, psychedelic colors that perfectly captured the spirit of the late 1960s. Warhol had previously worked with The Rolling Stones on their 'Sticky Fingers' album cover, which featured his famous zipper design. His collaboration with rock bands helped bridge the gap between fine art and popular music during this era.",
    "citationUrl": "https://en.wikipedia.org/wiki/She%27s_a_Rainbow",
    "citationTitle": "Wikipedia: She's a Rainbow"
  },
  {
    "id": "231717df-8c55-4f80-b950-4831806ea84a",
    "text": "What type of building appears on Led Zeppelin's 'Physical Graffiti' album cover?",
    "options": [
      "A castle",
      "Apartment buildings",
      "A church",
      "A factory"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The cover shows tenement buildings in New York City with cut-out windows.",
    "detailedExplanation": "Led Zeppelin's 1975 double album 'Physical Graffiti' features a photograph of tenement buildings at 96 and 98 St. Mark's Place in New York City's East Village. The album cover was designed with die-cut windows that revealed different images when the inner sleeves were pulled out, creating an interactive element. The buildings themselves have become a pilgrimage site for Led Zeppelin fans, and the cover art perfectly captures the urban grittiness that matches the album's diverse musical content.",
    "citationUrl": "https://en.wikipedia.org/wiki/Physical_Graffiti",
    "citationTitle": "Wikipedia: Physical Graffiti"
  },
  {
    "id": "939d3eb8-7d52-4593-862c-eb76d9ffe8be",
    "text": "Which band's debut album cover features a close-up photograph of a zipper?",
    "options": [
      "The Velvet Underground",
      "The Rolling Stones",
      "The Doors",
      "The Who"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Rolling Stones' 'Sticky Fingers' album featured an actual working zipper on the cover.",
    "detailedExplanation": "The Rolling Stones' 1971 album 'Sticky Fingers' featured one of the most innovative album covers ever created, designed by Andy Warhol. The cover showed a close-up of a man's crotch in tight jeans with an actual working zipper that could be unzipped to reveal underwear underneath. This provocative and interactive design caused controversy and practical issues for record stores, as the zipper would often damage other records when stacked. The cover has since become a classic example of Warhol's boundary-pushing art.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sticky_Fingers",
    "citationTitle": "Wikipedia: Sticky Fingers"
  },
  {
    "id": "909c43ae-dcc1-4cc6-a332-3ae6ad19736d",
    "text": "What natural disaster is depicted on Supertramp's 'Crisis? What Crisis?' album cover?",
    "options": [
      "An earthquake",
      "A flood",
      "A blizzard",
      "A hurricane"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The cover shows a man relaxing in a deck chair during a heavy snowstorm.",
    "detailedExplanation": "Supertramp's 1975 album 'Crisis? What Crisis?' features a surreal cover image of a man in a business suit sitting calmly in a deck chair, reading a newspaper while surrounded by heavy snow and blizzard conditions. The image was photographed in Los Angeles and perfectly captures the album's theme of remaining oblivious to surrounding chaos. The ironic juxtaposition of the relaxed figure against the harsh winter storm became one of the most memorable album covers of the 1970s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Crisis%3F_What_Crisis%3F",
    "citationTitle": "Wikipedia: Crisis? What Crisis?"
  },
  {
    "id": "5bff8033-149c-44ac-a769-5f32af9c3663",
    "text": "Which iconic venue appears on the cover of Johnny Cash's 'At Folsom Prison'?",
    "options": [
      "San Quentin Prison",
      "Alcatraz",
      "Folsom Prison",
      "Sing Sing"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The album was recorded live at Folsom Prison, and the cover shows the prison itself.",
    "detailedExplanation": "Johnny Cash's 1968 live album 'At Folsom Prison' features a stark black and white photograph of Folsom State Prison in California on its cover. The album was recorded during two live performances Cash gave for the inmates at Folsom Prison in January 1968. The simple, documentary-style cover perfectly reflects the raw, authentic nature of the recording inside. This album helped revitalize Cash's career and became one of his most acclaimed releases, showcasing his connection with society's outcasts.",
    "citationUrl": "https://en.wikipedia.org/wiki/At_Folsom_Prison",
    "citationTitle": "Wikipedia: At Folsom Prison"
  },
  {
    "id": "05ccd046-ba4a-4152-8063-0d68fd28a698",
    "text": "What food item appears on The Allman Brothers Band's 'Eat a Peach' album cover?",
    "options": [
      "An apple",
      "A peach",
      "An orange",
      "A pear"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "A large peach appears on the cover, matching the album's title.",
    "detailedExplanation": "The Allman Brothers Band's 1972 album 'Eat a Peach' features a simple but effective cover design with a large, realistic illustration of a peach against a plain background. The album title and cover art reference a quote from Duane Allman, who had said in an interview that you can't help the revolution by talking about it, but 'you can help it by doing things, like peach.' Tragically, Duane Allman died in a motorcycle accident during the album's production, making this one of the most poignant album covers in rock history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eat_a_Peach",
    "citationTitle": "Wikipedia: Eat a Peach"
  },
  {
    "id": "44b60ba1-84e9-4ff0-becc-3adefa2f5bc5",
    "text": "Which album cover famously features four men walking in single file across a zebra crossing?",
    "options": [
      "Sgt. Pepper's Lonely Hearts Club Band",
      "Abbey Road",
      "Revolver",
      "Rubber Soul"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Abbey Road features The Beatles walking across the zebra crossing outside Abbey Road Studios.",
    "detailedExplanation": "The Abbey Road album cover, photographed by Iain Macmillan on August 8, 1969, shows all four Beatles walking in single file across the zebra crossing outside Abbey Road Studios in London. The image was taken in the middle of the day with the street briefly stopped for traffic. This iconic photograph has become one of the most recognizable and parodied album covers in music history, with the zebra crossing itself becoming a tourist attraction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Abbey_Road",
    "citationTitle": "Wikipedia: Abbey Road"
  },
  {
    "id": "c2090a52-01a9-473b-a2e4-5ec532928467",
    "text": "Which artist's album cover shows them wearing a distinctive lightning bolt makeup across their face?",
    "options": [
      "David Bowie",
      "Prince",
      "Elton John",
      "Freddie Mercury"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "David Bowie's 'Aladdin Sane' album features his iconic lightning bolt face makeup.",
    "detailedExplanation": "David Bowie's 1973 album 'Aladdin Sane' features one of the most iconic album covers in rock history, showing Bowie with a distinctive red and blue lightning bolt painted across his face and bare chest. The photograph was taken by Brian Duffy and has become synonymous with Bowie's glam rock era and his Ziggy Stardust persona. The striking makeup design has been recreated countless times and remains one of the most recognizable images in popular music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aladdin_Sane",
    "citationTitle": "Wikipedia: Aladdin Sane"
  },
  {
    "id": "466c89d8-3158-4b34-886f-66d75f7a2e27",
    "text": "What type of transportation vehicle appears prominently on the cover of Led Zeppelin IV?",
    "options": [
      "Airplane",
      "Train",
      "Ship",
      "None - it shows a painting on a wall"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Led Zeppelin IV shows 'The Hermit' tarot card painting hanging on a demolished wall, with no vehicles present.",
    "detailedExplanation": "Led Zeppelin IV (also known as the untitled fourth album) features a photograph of a framed painting called 'The Hermit' hanging on the wall of a partially demolished house in Worcestershire, England. The painting depicts an old man carrying a lantern and a staff, representing the Hermit card from the tarot deck. The contrast between the rustic painting and the crumbling urban wall was intended to represent the contrast between the old and new ways of life, fitting the album's blend of traditional and modern musical elements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Led_Zeppelin_IV",
    "citationTitle": "Wikipedia: Led Zeppelin IV"
  },
  {
    "id": "6746f859-2606-4ebc-ac83-a850341ffdea",
    "text": "Which album cover features a close-up photograph of a woman's red lips?",
    "options": [
      "Madonna - Like a Virgin",
      "Rocky Horror Picture Show Soundtrack",
      "Roxy Music - Country Life",
      "The Rolling Stones - Sticky Fingers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Rocky Horror Picture Show soundtrack features the iconic red lips from the movie's opening credits.",
    "detailedExplanation": "The Rocky Horror Picture Show soundtrack album cover features the iconic image of bright red lips against a black background, which became synonymous with the cult classic film and stage musical. These lips, belonging to actress Patricia Quinn (though they lip-sync to Richard O'Brien's voice), appear in the opening sequence of the movie singing 'Science Fiction/Double Feature.' The striking image has become one of the most recognizable symbols in pop culture and perfectly captures the campy, theatrical nature of the Rocky Horror phenomenon.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rocky_Horror_Picture_Show_(soundtrack)",
    "citationTitle": "Wikipedia: The Rocky Horror Picture Show (soundtrack)"
  }
]