[
  {
    "id": "5186aa75-2a17-4b4c-8e30-14de53c43751",
    "text": "What was the name of the coffee shop where the characters from 'Friends' frequently hung out?",
    "options": [
      "Central Perk",
      "Coffee Bean",
      "The Grind",
      "Brew Haven"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Central Perk was the iconic coffee shop in Friends where the main characters spent much of their time.",
    "detailedExplanation": "Central Perk served as one of the primary settings for Friends throughout its 10-season run from 1994-2004. The coffee shop was located in Greenwich Village, Manhattan, and featured a distinctive orange couch where the six main characters would gather. The establishment was managed by various characters throughout the series, including Gunther, who had an unrequited crush on Rachel. The coffee shop became so iconic that replicas have been created in various locations around the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "6535bfc1-50de-4a1f-b35f-fea0f93373b0",
    "text": "In 'Seinfeld', what is the name of Kramer's first name?",
    "options": [
      "Cosmo",
      "Kenny",
      "Murray",
      "Stanley"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kramer's first name is Cosmo, though it wasn't revealed until the sixth season of the show.",
    "detailedExplanation": "Cosmo Kramer, played by Michael Richards, was Jerry Seinfeld's eccentric neighbor in the hit sitcom that ran from 1989 to 1998. His first name wasn't revealed until the episode 'The Switch' in season 6, where Kramer's mother calls him by his full name. Throughout the earlier seasons, he was simply known as 'Kramer' to viewers and most characters. The character was based on series co-creator Larry David's real-life former neighbor, Kenny Kramer, who lived across the hall from David's apartment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cosmo_Kramer",
    "citationTitle": "Wikipedia: Cosmo Kramer"
  },
  {
    "id": "9d5d27c4-3822-4ddb-a591-5ef4039b8328",
    "text": "Which actor played the character Tim 'The Tool Man' Taylor in 'Home Improvement'?",
    "options": [
      "Tim Allen",
      "Richard Karn",
      "Earl Hindman",
      "Jonathan Taylor Thomas"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tim Allen starred as Tim Taylor, the accident-prone host of the fictional show 'Tool Time' within the series.",
    "detailedExplanation": "Tim Allen played the lead role of Tim Taylor in Home Improvement, which aired from 1991 to 1998. The character was known for his love of power tools, cars, and 'more power' in general, often leading to comedic mishaps around the house. Allen's portrayal of the bumbling but well-meaning suburban father made him a household name. The show was loosely based on Allen's own stand-up comedy routines about men, tools, and domestic life. His signature grunt became a cultural phenomenon during the show's eight-season run.",
    "citationUrl": "https://en.wikipedia.org/wiki/Home_Improvement_(TV_series)",
    "citationTitle": "Wikipedia: Home Improvement (TV series)"
  },
  {
    "id": "82bd3ef0-fa97-4e4e-a12c-691c3f89b48c",
    "text": "What was the name of the bar in 'Cheers' that continued into the 90s?",
    "options": [
      "Cheers",
      "Sam's Place",
      "The Bull & Finch",
      "Boston Tavern"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The bar was simply called 'Cheers,' and the show continued into the early 90s until 1993.",
    "detailedExplanation": "Cheers ran from 1982 to 1993, making it a significant part of early 1990s television. The show was set in a Boston bar called Cheers, 'where everybody knows your name' according to the famous theme song. The series followed the lives of the bar's staff and regular customers, with Sam Malone (Ted Danson) as the former baseball player turned bartender and owner. The show's success led to the spin-off series Frasier in 1993, which followed the character Dr. Frasier Crane after he left Boston for Seattle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cheers",
    "citationTitle": "Wikipedia: Cheers"
  },
  {
    "id": "e853205a-6afa-4866-a6ee-f7fbfdfccc41",
    "text": "In 'The Fresh Prince of Bel-Air', what city was Will Smith's character originally from?",
    "options": [
      "Philadelphia",
      "New York",
      "Chicago",
      "Detroit"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Will was from Philadelphia and moved to the wealthy Bel-Air neighborhood of Los Angeles to live with his relatives.",
    "detailedExplanation": "The Fresh Prince of Bel-Air, which aired from 1990 to 1996, followed Will Smith as a street-smart teenager from Philadelphia who moves in with his wealthy relatives in the upscale Bel-Air neighborhood of Los Angeles. The show's famous opening theme song explicitly mentions Philadelphia as Will's hometown, describing how he got into trouble there and was sent to live with his aunt and uncle. This fish-out-of-water premise created much of the show's comedy, as Will's urban Philadelphia background clashed with the affluent lifestyle of his Bel-Air relatives.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "afba4e71-f72f-46b4-8132-312162a0c38a",
    "text": "Which sitcom featured the character Steve Urkel as a breakout star?",
    "options": [
      "Family Matters",
      "Full House",
      "Step by Step",
      "Perfect Strangers"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Steve Urkel appeared on Family Matters and became so popular that he transformed from a guest character into the show's main focus.",
    "detailedExplanation": "Family Matters aired from 1989 to 1998 and was originally centered around the Winslow family. However, Steve Urkel, played by Jaleel White, was introduced as a guest character in season 1 and became so popular with audiences that he gradually became the show's central character. Urkel was known for his thick glasses, suspenders, nasal voice, and catchphrases like 'Did I do that?' and 'Got any cheese?' The character's popularity completely changed the direction of the show, shifting focus from the family dynamics to Urkel's various schemes and inventions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Family_Matters",
    "citationTitle": "Wikipedia: Family Matters"
  },
  {
    "id": "6a6dda5f-b977-481b-bc97-029eb43d9041",
    "text": "What was the occupation of the main character Frasier Crane in the spin-off series 'Frasier'?",
    "options": [
      "Psychiatrist",
      "Lawyer",
      "Teacher",
      "Chef"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Frasier Crane was a psychiatrist who hosted a radio call-in show in Seattle.",
    "detailedExplanation": "Frasier, which ran from 1993 to 2004, followed Dr. Frasier Crane after he moved from Boston (where he appeared on Cheers) to Seattle. As a psychiatrist, Frasier hosted a radio show called 'The Dr. Frasier Crane Show' where he gave advice to callers. The series explored both his professional life at the radio station and his personal relationships, particularly with his father Martin (a retired police officer) and his brother Niles (also a psychiatrist). The show was known for its sophisticated humor, cultural references, and won numerous Emmy Awards during its 11-season run.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frasier",
    "citationTitle": "Wikipedia: Frasier"
  },
  {
    "id": "aaf7feaa-079d-49fa-ad70-85b6b9e4421c",
    "text": "In 'Full House', what was the name of the Tanner family dog?",
    "options": [
      "Comet",
      "Buddy",
      "Max",
      "Charlie"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Comet was the golden retriever owned by the Tanner family throughout most of the series.",
    "detailedExplanation": "Full House ran from 1987 to 1995, and Comet the golden retriever was introduced in season 3 as a puppy. The dog became an integral part of the Tanner household in San Francisco, appearing in numerous episodes and storylines. Comet was particularly associated with the character of DJ Tanner, the eldest daughter. The dog remained with the family through the remainder of the series and was beloved by fans. Comet even had puppies in later seasons, adding to the family dynamic of the show.",
    "citationUrl": "https://en.wikipedia.org/wiki/Full_House",
    "citationTitle": "Wikipedia: Full House"
  },
  {
    "id": "53fe57aa-87dd-4e8c-b415-672e8a8f75fb",
    "text": "What was the name of the coffee shop where the characters from 'Friends' regularly hung out?",
    "options": [
      "Central Perk",
      "The Grind",
      "Coffee Joe's",
      "Bean There"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Central Perk was the iconic coffee shop in Friends where the main characters spent much of their time.",
    "detailedExplanation": "Central Perk served as one of the primary settings for Friends throughout its 10-season run from 1994-2004. The coffee shop was located in Greenwich Village, New York, and featured a large orange couch where the six main characters would gather. The establishment was managed by various characters throughout the series, including Gunther, who had an unrequited crush on Rachel Green.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "af9ba40d-8eca-4b25-8f3c-81cf8187e90d",
    "text": "What was the name of Jerry Seinfeld's neighbor who often burst through his apartment door in 'Seinfeld'?",
    "options": [
      "Kramer",
      "Newman",
      "George",
      "Frank"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Cosmo Kramer was Jerry's eccentric neighbor who was known for his dramatic entrances into Jerry's apartment.",
    "detailedExplanation": "Cosmo Kramer, played by Michael Richards, was Jerry's across-the-hall neighbor who became famous for his wild hair, vintage clothes, and his habit of sliding into Jerry's apartment without knocking. Kramer's character was based on comedian Kenny Kramer, who was the real-life neighbor of series co-creator Larry David. The character's full first name 'Cosmo' wasn't revealed until the sixth season of the show.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cosmo_Kramer",
    "citationTitle": "Wikipedia: Cosmo Kramer"
  },
  {
    "id": "d2a38819-9dc9-4c52-b4f3-26057e0b0a5d",
    "text": "In 'Full House', what was the name of the Tanner family's pet dog?",
    "options": [
      "Comet",
      "Buddy",
      "Max",
      "Charlie"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Comet was the Golden Retriever owned by the Tanner family throughout most of the series.",
    "detailedExplanation": "Comet was a Golden Retriever who joined the Tanner family in the third season of Full House. The dog was originally found as a puppy and became an integral part of the family. Comet appeared in numerous episodes and was particularly close to the youngest Tanner daughter, Michelle, played by Mary-Kate and Ashley Olsen. The dog remained with the family through the end of the series in 1995.",
    "citationUrl": "https://en.wikipedia.org/wiki/Full_House",
    "citationTitle": "Wikipedia: Full House"
  },
  {
    "id": "8273e95c-f61d-401d-817c-4b1cc47c4ebe",
    "text": "Which character in 'Family Matters' was known for saying 'Did I do that?' after causing mishaps?",
    "options": [
      "Steve Urkel",
      "Carl Winslow",
      "Eddie Winslow",
      "Laura Winslow"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Steve Urkel's catchphrase 'Did I do that?' became iconic after he would accidentally cause chaos.",
    "detailedExplanation": "Steve Urkel, played by Jaleel White, was originally intended to be a guest character but became so popular that he became the show's main character. His nasally voice, thick glasses, suspenders, and clumsy nature made him instantly recognizable. The phrase 'Did I do that?' became one of the most memorable catchphrases of 1990s television, typically delivered after Urkel would accidentally break something or cause some form of chaos in the Winslow household.",
    "citationUrl": "https://en.wikipedia.org/wiki/Steve_Urkel",
    "citationTitle": "Wikipedia: Steve Urkel"
  },
  {
    "id": "c354e3dd-2ffa-4df0-aeea-dde778973bdc",
    "text": "What was the profession of Tim Taylor, the main character in 'Home Improvement'?",
    "options": [
      "Tool Time TV show host",
      "Construction worker",
      "Hardware store owner",
      "Professional contractor"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tim 'The Tool Man' Taylor hosted a fictional TV show called 'Tool Time' about home improvement and tools.",
    "detailedExplanation": "Tim Taylor, played by Tim Allen, was the host of a fictional television show called 'Tool Time' within the series Home Improvement. The show-within-a-show format allowed for comedy as Tim would demonstrate tools and home improvement techniques, often with disastrous results. His assistant on Tool Time was Al Borland, who was actually more knowledgeable about tools and construction than Tim, creating a running gag throughout the series about Tim's inflated ego versus his actual competence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Home_Improvement_(TV_series)",
    "citationTitle": "Wikipedia: Home Improvement"
  },
  {
    "id": "f0966ea5-94b3-44fd-b8d9-2b95ae69113d",
    "text": "In 'Cheers', what was the name of the uptight psychiatrist who became a regular character in later seasons?",
    "options": [
      "Dr. Frasier Crane",
      "Dr. Sam Malone",
      "Dr. Cliff Clavin",
      "Dr. Norm Peterson"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Dr. Frasier Crane was the psychiatrist character who later got his own successful spin-off series.",
    "detailedExplanation": "Dr. Frasier Crane, played by Kelsey Grammer, was introduced in the third season of Cheers as a love interest for Diane Chambers. The character was originally intended for a short run, but proved so popular that he became a regular cast member. Frasier was portrayed as an intellectual, pompous psychiatrist who often clashed with the blue-collar patrons of the bar. The character was so successful that he was spun off into his own series, 'Frasier,' which ran from 1993 to 2004.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frasier_Crane",
    "citationTitle": "Wikipedia: Frasier Crane"
  },
  {
    "id": "7a8d8068-1259-4fac-9d01-810dfe42ffe1",
    "text": "What was the occupation of the main character Dorothy Zbornak in 'The Golden Girls'?",
    "options": [
      "Substitute teacher",
      "Nurse",
      "Secretary",
      "Social worker"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Dorothy worked as a substitute teacher, often dealing with challenging students and school situations.",
    "detailedExplanation": "Dorothy Zbornak, played by Bea Arthur, worked as a substitute teacher throughout most of The Golden Girls series. Her teaching career provided material for many episodes, as she would often come home with stories about difficult students or frustrating situations at various schools. Dorothy was portrayed as intelligent, sarcastic, and well-educated, making her teaching profession a natural fit for her character. Her career in education also reflected her practical, no-nonsense approach to life.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dorothy_Zbornak",
    "citationTitle": "Wikipedia: Dorothy Zbornak"
  },
  {
    "id": "a8646200-97e0-40ac-9168-cf72f2697dd2",
    "text": "What was the name of the coffee shop where the characters in 'Friends' frequently hung out?",
    "options": [
      "Central Perk",
      "Coffee Bean",
      "The Grind",
      "Java Joe's"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Central Perk was the iconic coffee shop in Friends where the main characters spent much of their time.",
    "detailedExplanation": "Central Perk served as one of the primary settings for Friends throughout its 10-season run from 1994-2004. The coffee shop was located on the ground floor of the apartment building where Monica and Rachel lived, and featured a distinctive orange couch where the six main characters would gather. The coffee shop was managed by various characters throughout the series, most notably Gunther, who had an unrequited crush on Rachel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "ca8d7dc9-5b88-4e97-8753-05409ed0c551",
    "text": "In 'Seinfeld', what was the first name of Kramer, Jerry's eccentric neighbor?",
    "options": [
      "Cosmo",
      "Chester",
      "Carlton",
      "Clarence"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kramer's first name was Cosmo, though this wasn't revealed until the sixth season of the show.",
    "detailedExplanation": "Cosmo Kramer was Jerry Seinfeld's neighbor across the hall in the iconic sitcom that ran from 1989 to 1998. Played by Michael Richards, Kramer was known for his wild hair, vintage clothing, and eccentric behavior including his dramatic entrances into Jerry's apartment. His first name wasn't revealed until the episode 'The Switch' in season 6, where his mother calls him Cosmo. Before this revelation, he was simply known as Kramer to viewers and most other characters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cosmo_Kramer",
    "citationTitle": "Wikipedia: Cosmo Kramer"
  },
  {
    "id": "7cb8894a-8f7f-4b1d-88c1-a0fa637cb703",
    "text": "Which actor played the character of Steve Urkel in 'Family Matters'?",
    "options": [
      "Jaleel White",
      "Malcolm-Jamal Warner",
      "Alfonso Ribeiro",
      "Kenan Thompson"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jaleel White portrayed the iconic character Steve Urkel, originally intended as a guest character who became the show's breakout star.",
    "detailedExplanation": "Jaleel White played Steve Urkel on Family Matters from 1989 to 1998. The character was originally supposed to appear in just one episode but became so popular that he was made a regular cast member and eventually became the show's central character. Urkel was known for his distinctive nasal voice, suspenders, large glasses, and his catchphrase 'Did I do that?' The character's popularity essentially transformed Family Matters from a show about the Winslow family into the Steve Urkel show.",
    "citationUrl": "https://en.wikipedia.org/wiki/Steve_Urkel",
    "citationTitle": "Wikipedia: Steve Urkel"
  },
  {
    "id": "f9df4b29-f9fd-47f1-aa0d-0ccd2e134a42",
    "text": "In 'The Fresh Prince of Bel-Air', what was the name of Will's wealthy uncle?",
    "options": [
      "Philip Banks",
      "George Banks",
      "Richard Banks",
      "William Banks"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Uncle Phil's full name was Philip Banks, Will's wealthy uncle who took him in from Philadelphia.",
    "detailedExplanation": "Philip Banks, known as Uncle Phil, was Will Smith's character's uncle in The Fresh Prince of Bel-Air, which aired from 1990 to 1996. Played by James Avery, Uncle Phil was a successful lawyer and later a judge who lived in the affluent Bel-Air neighborhood of Los Angeles. Despite their different backgrounds and frequent clashes, Uncle Phil became a father figure to Will throughout the series. The character was known for his stern but loving nature and his efforts to guide Will while dealing with the culture clash between Will's street-smart Philadelphia background and the privileged Bel-Air lifestyle.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "b4651efd-094c-400b-a5b1-91fa9f8e639f",
    "text": "What was the occupation of the main character Tim Taylor in 'Home Improvement'?",
    "options": [
      "TV show host",
      "Construction worker",
      "Hardware store owner",
      "Carpenter"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tim 'The Tool Man' Taylor hosted a fictional TV show called 'Tool Time' about home improvement and tools.",
    "detailedExplanation": "In Home Improvement, which ran from 1991 to 1998, Tim Allen played Tim Taylor, who hosted a local cable access television show called 'Tool Time' with his assistant Al Borland. The show-within-a-show format was central to the series, with Tim's on-air mishaps and his rivalry with his more competent assistant providing much of the comedy. Despite being a TV host about home improvement, Tim was ironically incompetent at actual home repair, often causing disasters with power tools and construction projects at his own house, much to the chagrin of his wife Jill and his neighbor Wilson.",
    "citationUrl": "https://en.wikipedia.org/wiki/Home_Improvement_(TV_series)",
    "citationTitle": "Wikipedia: Home Improvement"
  }
]