[
  {
    "id": "6938c284-1c32-46cf-91ec-176eafe9c442",
    "text": "In 'Frasier', what is the name of the upscale restaurant where Niles frequently dines and eventually becomes part-owner?",
    "options": [
      "Le Cigare Volant",
      "The Pinnacle",
      "Chez Henri",
      "Le Bernardin"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Le Cigare Volant is the upscale French restaurant where Niles dines and later becomes part-owner.",
    "detailedExplanation": "Le Cigare Volant was a recurring location in Frasier, representing the pretentious fine dining culture that both Frasier and Niles embraced. The restaurant served as a symbol of their sophisticated tastes and was the setting for numerous episodes involving the brothers' attempts to maintain their high-society status in Seattle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frasier",
    "citationTitle": "Wikipedia: Frasier"
  },
  {
    "id": "bb5ccc02-6fa9-49e4-a209-57e0b9172cfb",
    "text": "Which 'Seinfeld' episode was banned from television for several years due to its controversial subject matter involving a flag?",
    "options": [
      "The Caddy",
      "The Burning",
      "The Puerto Rican Day",
      "The Finale"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'The Puerto Rican Day' episode was pulled from syndication after complaints about stereotypical portrayals and a flag-burning scene.",
    "detailedExplanation": "Originally aired as the series' penultimate episode in 1998, 'The Puerto Rican Day' was pulled from syndication rotation after criticism from Puerto Rican groups who felt the episode promoted negative stereotypes. The controversy centered around a scene where Kramer accidentally burns a Puerto Rican flag. NBC kept the episode out of reruns for several years before eventually allowing it back into rotation with an apology.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Puerto_Rican_Day",
    "citationTitle": "Wikipedia: The Puerto Rican Day"
  },
  {
    "id": "a1881c0a-613a-453d-9dd7-97d4488db70b",
    "text": "In 'NewsRadio', what is the call sign of the AM radio station where the characters work?",
    "options": [
      "WNYX",
      "WXRK",
      "WFAN",
      "WCBS"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "WNYX is the fictional AM radio station that serves as the primary setting for NewsRadio.",
    "detailedExplanation": "WNYX was the fictional New York AM radio station featured in NewsRadio, which ran from 1995 to 1999. The show was set in the station's newsroom and focused on the workplace dynamics of the news staff. The series was known for its sharp writing and ensemble cast, including Dave Foley, Phil Hartman, and Andy Dick, and was critically acclaimed despite modest ratings during its five-season run.",
    "citationUrl": "https://en.wikipedia.org/wiki/NewsRadio",
    "citationTitle": "Wikipedia: NewsRadio"
  },
  {
    "id": "3ac3130a-4a6b-460d-b5f6-64cff025df93",
    "text": "What was the original working title for 'Friends' before it was changed?",
    "options": [
      "Six of One",
      "Friends Like Us",
      "Insomnia Cafe",
      "Across the Hall"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Insomnia Cafe' was the original title, later changed to 'Friends Like Us' and then 'Six of One' before settling on 'Friends'.",
    "detailedExplanation": "The show that became 'Friends' went through several title changes during development. Created by David Crane and Marta Kauffman, it was originally pitched as 'Insomnia Cafe,' referencing the coffee house setting that would become Central Perk. The title evolved through 'Friends Like Us' and briefly 'Six of One' before NBC executives settled on the simple 'Friends' just before the show's premiere in September 1994.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "194d7554-90cb-49b0-8e97-c1e2ccbbc3a1",
    "text": "In 'The Fresh Prince of Bel-Air', what is the name of Will's cousin who lives with the Banks family and is known for his preppy attitude?",
    "options": [
      "Ashley Banks",
      "Carlton Banks",
      "Hilary Banks",
      "Geoffrey Butler"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Carlton Banks is Will's preppy cousin, known for his conservative values and famous dance moves.",
    "detailedExplanation": "Carlton Banks, played by Alfonso Ribeiro, was Will's younger cousin and the son of Philip and Vivian Banks. Carlton served as a perfect foil to Will's street-smart Philadelphia background, embodying the privileged, preppy lifestyle of Bel-Air. His character was known for his love of Tom Jones music, conservative Republican politics, and his iconic dance to 'It's Not Unusual,' which became one of the show's most memorable recurring gags.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "c1c7f404-cb72-49f4-926c-7b906cdb3c84",
    "text": "Which 'Cheers' spinoff character made regular appearances on 'Wings', creating a shared universe between the two shows?",
    "options": [
      "Rebecca Howe",
      "Woody Boyd",
      "Frasier Crane",
      "Norm Peterson"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Frasier Crane appeared in several episodes of Wings, connecting the Cheers universe with the Nantucket-based sitcom.",
    "detailedExplanation": "'Wings,' which aired from 1990-1997, was set on Nantucket and followed the Hackett brothers who ran a small airline. The show was created by some of the same writers as 'Cheers' and existed in the same fictional universe. Frasier Crane, who had his own spinoff running concurrently, made several guest appearances on 'Wings,' typically when his character needed to travel to or from Nantucket. This cross-pollination helped establish a shared NBC sitcom universe during the network's Thursday night dominance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wings_(1990_TV_series)",
    "citationTitle": "Wikipedia: Wings (1990 TV series)"
  },
  {
    "id": "f32dc196-7a3d-4529-80ca-31e0f275fad2",
    "text": "In 'Home Improvement', what is the actual name of Tim Taylor's mysterious neighbor Wilson, whose full face is never shown?",
    "options": [
      "Wilson W. Wilson Jr.",
      "Wilson Walter Wilson",
      "Wilson Warren Wilson",
      "Wilson William Wilson"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Wilson's full name is Wilson W. Wilson Jr., revealed through various episodes of the series.",
    "detailedExplanation": "Wilson W. Wilson Jr., played by Earl Hindman, was Tim Taylor's enigmatic neighbor whose face was always partially obscured by the fence between their yards or other objects. The character served as Tim's wise advisor, often dispensing philosophical advice and obscure historical references. The running gag of never showing Wilson's full face became one of the show's most iconic elements, and the few times his face was nearly revealed became major moments for fans of the series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Home_Improvement_(TV_series)",
    "citationTitle": "Wikipedia: Home Improvement (TV series)"
  },
  {
    "id": "c4b96a13-79b2-496d-bc76-3e1bbb504f7d",
    "text": "What was the name of the fictional company where the characters worked in 'Just Shoot Me!'?",
    "options": [
      "Mode Magazine",
      "Blush Magazine",
      "Chic Magazine",
      "Style Weekly"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Blush Magazine was the fictional fashion magazine that served as the workplace setting for Just Shoot Me!",
    "detailedExplanation": "'Just Shoot Me!' ran from 1997 to 2003 and was set at Blush Magazine, a fictional fashion publication in New York City. The show starred Laura San Giacomo as Maya Gallo, a serious journalist who reluctantly goes to work at the superficial fashion magazine owned by her father, Jack Gallo (George Segal). The magazine setting allowed for storylines involving the fashion industry, celebrity culture, and the contrast between Maya's journalistic integrity and the magazine's frivolous content.",
    "citationUrl": "https://en.wikipedia.org/wiki/Just_Shoot_Me!",
    "citationTitle": "Wikipedia: Just Shoot Me!"
  }
]