[
  {
    "id": "6938c284-1c32-46cf-91ec-176eafe9c442",
    "text": "In 'Frasier', what is the name of the upscale restaurant where Niles frequently dines and eventually becomes part-owner?",
    "options": [
      "Le Cigare Volant",
      "The Pinnacle",
      "Chez Henri",
      "Le Bernardin"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Le Cigare Volant is the upscale French restaurant where Niles dines and later becomes part-owner.",
    "detailedExplanation": "Le Cigare Volant was a recurring location in Frasier, representing the pretentious fine dining culture that both Frasier and Niles embraced. The restaurant served as a symbol of their sophisticated tastes and was the setting for numerous episodes involving the brothers' attempts to maintain their high-society status in Seattle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frasier",
    "citationTitle": "Wikipedia: Frasier"
  },
  {
    "id": "bb5ccc02-6fa9-49e4-a209-57e0b9172cfb",
    "text": "Which 'Seinfeld' episode was banned from television for several years due to its controversial subject matter involving a flag?",
    "options": [
      "The Caddy",
      "The Burning",
      "The Puerto Rican Day",
      "The Finale"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'The Puerto Rican Day' episode was pulled from syndication after complaints about stereotypical portrayals and a flag-burning scene.",
    "detailedExplanation": "Originally aired as the series' penultimate episode in 1998, 'The Puerto Rican Day' was pulled from syndication rotation after criticism from Puerto Rican groups who felt the episode promoted negative stereotypes. The controversy centered around a scene where Kramer accidentally burns a Puerto Rican flag. NBC kept the episode out of reruns for several years before eventually allowing it back into rotation with an apology.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Puerto_Rican_Day",
    "citationTitle": "Wikipedia: The Puerto Rican Day"
  },
  {
    "id": "a1881c0a-613a-453d-9dd7-97d4488db70b",
    "text": "In 'NewsRadio', what is the call sign of the AM radio station where the characters work?",
    "options": [
      "WNYX",
      "WXRK",
      "WFAN",
      "WCBS"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "WNYX is the fictional AM radio station that serves as the primary setting for NewsRadio.",
    "detailedExplanation": "WNYX was the fictional New York AM radio station featured in NewsRadio, which ran from 1995 to 1999. The show was set in the station's newsroom and focused on the workplace dynamics of the news staff. The series was known for its sharp writing and ensemble cast, including Dave Foley, Phil Hartman, and Andy Dick, and was critically acclaimed despite modest ratings during its five-season run.",
    "citationUrl": "https://en.wikipedia.org/wiki/NewsRadio",
    "citationTitle": "Wikipedia: NewsRadio"
  },
  {
    "id": "3ac3130a-4a6b-460d-b5f6-64cff025df93",
    "text": "What was the original working title for 'Friends' before it was changed?",
    "options": [
      "Six of One",
      "Friends Like Us",
      "Insomnia Cafe",
      "Across the Hall"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Insomnia Cafe' was the original title, later changed to 'Friends Like Us' and then 'Six of One' before settling on 'Friends'.",
    "detailedExplanation": "The show that became 'Friends' went through several title changes during development. Created by David Crane and Marta Kauffman, it was originally pitched as 'Insomnia Cafe,' referencing the coffee house setting that would become Central Perk. The title evolved through 'Friends Like Us' and briefly 'Six of One' before NBC executives settled on the simple 'Friends' just before the show's premiere in September 1994.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "194d7554-90cb-49b0-8e97-c1e2ccbbc3a1",
    "text": "In 'The Fresh Prince of Bel-Air', what is the name of Will's cousin who lives with the Banks family and is known for his preppy attitude?",
    "options": [
      "Ashley Banks",
      "Carlton Banks",
      "Hilary Banks",
      "Geoffrey Butler"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Carlton Banks is Will's preppy cousin, known for his conservative values and famous dance moves.",
    "detailedExplanation": "Carlton Banks, played by Alfonso Ribeiro, was Will's younger cousin and the son of Philip and Vivian Banks. Carlton served as a perfect foil to Will's street-smart Philadelphia background, embodying the privileged, preppy lifestyle of Bel-Air. His character was known for his love of Tom Jones music, conservative Republican politics, and his iconic dance to 'It's Not Unusual,' which became one of the show's most memorable recurring gags.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "c1c7f404-cb72-49f4-926c-7b906cdb3c84",
    "text": "Which 'Cheers' spinoff character made regular appearances on 'Wings', creating a shared universe between the two shows?",
    "options": [
      "Rebecca Howe",
      "Woody Boyd",
      "Frasier Crane",
      "Norm Peterson"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Frasier Crane appeared in several episodes of Wings, connecting the Cheers universe with the Nantucket-based sitcom.",
    "detailedExplanation": "'Wings,' which aired from 1990-1997, was set on Nantucket and followed the Hackett brothers who ran a small airline. The show was created by some of the same writers as 'Cheers' and existed in the same fictional universe. Frasier Crane, who had his own spinoff running concurrently, made several guest appearances on 'Wings,' typically when his character needed to travel to or from Nantucket. This cross-pollination helped establish a shared NBC sitcom universe during the network's Thursday night dominance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wings_(1990_TV_series)",
    "citationTitle": "Wikipedia: Wings (1990 TV series)"
  },
  {
    "id": "f32dc196-7a3d-4529-80ca-31e0f275fad2",
    "text": "In 'Home Improvement', what is the actual name of Tim Taylor's mysterious neighbor Wilson, whose full face is never shown?",
    "options": [
      "Wilson W. Wilson Jr.",
      "Wilson Walter Wilson",
      "Wilson Warren Wilson",
      "Wilson William Wilson"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Wilson's full name is Wilson W. Wilson Jr., revealed through various episodes of the series.",
    "detailedExplanation": "Wilson W. Wilson Jr., played by Earl Hindman, was Tim Taylor's enigmatic neighbor whose face was always partially obscured by the fence between their yards or other objects. The character served as Tim's wise advisor, often dispensing philosophical advice and obscure historical references. The running gag of never showing Wilson's full face became one of the show's most iconic elements, and the few times his face was nearly revealed became major moments for fans of the series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Home_Improvement_(TV_series)",
    "citationTitle": "Wikipedia: Home Improvement (TV series)"
  },
  {
    "id": "c4b96a13-79b2-496d-bc76-3e1bbb504f7d",
    "text": "What was the name of the fictional company where the characters worked in 'Just Shoot Me!'?",
    "options": [
      "Mode Magazine",
      "Blush Magazine",
      "Chic Magazine",
      "Style Weekly"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Blush Magazine was the fictional fashion magazine that served as the workplace setting for Just Shoot Me!",
    "detailedExplanation": "'Just Shoot Me!' ran from 1997 to 2003 and was set at Blush Magazine, a fictional fashion publication in New York City. The show starred Laura San Giacomo as Maya Gallo, a serious journalist who reluctantly goes to work at the superficial fashion magazine owned by her father, Jack Gallo (George Segal). The magazine setting allowed for storylines involving the fashion industry, celebrity culture, and the contrast between Maya's journalistic integrity and the magazine's frivolous content.",
    "citationUrl": "https://en.wikipedia.org/wiki/Just_Shoot_Me!",
    "citationTitle": "Wikipedia: Just Shoot Me!"
  },
  {
    "id": "3b26b986-0341-410c-b065-18fb918920c1",
    "text": "In 'Seinfeld', what is the name of the fictional restaurant chain that Kramer and his friend Bob Sacamano supposedly ate at, which later makes Jerry violently ill?",
    "options": [
      "Kenny Kramer's Cuban Restaurant",
      "Reggie's",
      "Mackinaw Peaches",
      "Kenny Rogers' Roasters"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Kenny Rogers' Roasters was the chicken restaurant that opened across from Kramer's apartment.",
    "detailedExplanation": "Kenny Rogers' Roasters appeared in the episode 'The Chicken Roaster' from Season 8. The bright red neon sign kept Kramer awake, so he and Jerry switched apartments. The restaurant's rotisserie chicken became an obsession for Kramer, and Jerry eventually got food poisoning from eating there. This was based on the real Kenny Rogers' Roasters chain that was popular in the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Chicken_Roaster",
    "citationTitle": "Wikipedia: The Chicken Roaster"
  },
  {
    "id": "a8ce480b-8176-43a9-a842-9cd3741f0f1c",
    "text": "Which actor from 'Friends' was originally supposed to play the character of Chandler Bing before the role went to Matthew Perry?",
    "options": [
      "Jon Cryer",
      "Craig Bierko",
      "Hank Azaria",
      "Jon Favreau"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Craig Bierko was offered the role of Chandler but turned it down to star in a Broadway play.",
    "detailedExplanation": "Craig Bierko was the creators' first choice for Chandler Bing and was actually offered the role before Matthew Perry. However, Bierko declined the opportunity to pursue other projects, including Broadway work. This decision ultimately led to Matthew Perry's iconic portrayal of the sarcastic Chandler. Bierko later appeared on the show as a guest star playing Phoebe's boyfriend in Season 4.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends_(1994_TV_series)",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "0d554764-b2de-4c9f-82c0-d78f86f4f3b5",
    "text": "In 'The Fresh Prince of Bel-Air', what is the real reason why Janet Hubert, the original Aunt Vivian, was replaced by Daphne Maxwell Reid after Season 3?",
    "options": [
      "She demanded a higher salary than Will Smith",
      "She had creative differences and conflicts with Will Smith and producers",
      "She wanted to pursue a movie career",
      "She was pregnant and chose to leave"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Janet Hubert had well-documented conflicts with Will Smith and the show's producers over her role and treatment.",
    "detailedExplanation": "Janet Hubert's departure was the result of serious behind-the-scenes conflicts with Will Smith and the show's producers. She felt her character was being marginalized and that she was being treated poorly on set. The situation became so contentious that she was essentially fired rather than quitting voluntarily. This led to years of public feuding between Hubert and Smith, which wasn't resolved until a 2020 reunion special where they finally addressed their issues.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "1af41136-51a7-461a-a6ee-a9d89ad3457d",
    "text": "What was the original working title for the sitcom 'Home Improvement' during its development phase?",
    "options": [
      "Tool Time",
      "Hammer Time",
      "Men Behaving Badly",
      "Tim 'The Tool Man' Taylor"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The show was originally titled 'Hammer Time' before being changed to 'Home Improvement.'",
    "detailedExplanation": "'Home Improvement' went through several title changes during development. The original working title was 'Hammer Time,' playing on both the tool theme and the popular MC Hammer song. However, due to potential trademark issues and the desire for a more descriptive title, it was changed to 'Home Improvement.' The show was developed around Tim Allen's stand-up comedy routine about masculinity and home renovation, which he had been performing since the mid-1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Home_Improvement_(TV_series)",
    "citationTitle": "Wikipedia: Home Improvement"
  },
  {
    "id": "2ae5cac0-3232-44bc-bdfa-e54d6bfe59b4",
    "text": "In 'Cheers', what is the name of the uptight psychiatrist who becomes a regular patron of the bar in the later seasons and is known for his sophisticated vocabulary?",
    "options": [
      "Dr. Pascal",
      "Dr. Crane",
      "Dr. Lilith Sternin",
      "Dr. Bennett"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Dr. Frasier Crane, played by Kelsey Grammer, joined Cheers in Season 3 and later got his own spinoff show.",
    "detailedExplanation": "Dr. Frasier Crane was introduced in Season 3 of 'Cheers' as a love interest for Diane Chambers. Originally intended to be a temporary character for just a few episodes, Kelsey Grammer's performance was so well-received that Frasier became a series regular. The character was known for his pretentious intellectualism, love of opera and fine wine, and his complicated relationship with Diane and later with other characters. His popularity eventually led to the successful spinoff 'Frasier' which ran throughout the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frasier_Crane",
    "citationTitle": "Wikipedia: Frasier Crane"
  },
  {
    "id": "6d5613e1-f548-454e-9acc-7d3f6c746886",
    "text": "Which 'Roseanne' episode was banned from reruns for several years due to its controversial content about domestic violence?",
    "options": [
      "'War and Peace'",
      "'Don't Ask, Don't Tell'",
      "'Aliens'",
      "'A Stash from the Past'"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'War and Peace' dealt with domestic violence in the Connor family and was pulled from syndication for years.",
    "detailedExplanation": "The episode 'War and Peace' from Season 5 was considered too intense for regular syndication due to its realistic portrayal of domestic violence between Dan and Roseanne Connor. The episode showed the couple having a serious physical altercation that was much more dramatic than the show's usual fare. Networks were hesitant to air it in reruns because of concerns about its dark content and potential triggers for viewers. The episode was significant for addressing serious marital issues in a working-class family, but its heavy subject matter made it unsuitable for casual daytime reruns.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roseanne_(season_5)",
    "citationTitle": "Wikipedia: Roseanne Season 5"
  },
  {
    "id": "cc659788-e097-4a77-ba4d-5af313444ae0",
    "text": "In 'Full House', what is the name of Jesse Katsopolis's band that performs throughout the series?",
    "options": [
      "Jesse and the Rippers",
      "The Rip Tides",
      "Hot Daddy",
      "The Smash Club"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Jesse and the Rippers was Uncle Jesse's band, known for playing covers of Beach Boys songs and other hits.",
    "detailedExplanation": "Jesse and the Rippers was Uncle Jesse's rock band throughout 'Full House.' The band was known for performing covers of classic rock songs, particularly Beach Boys tunes, which reflected John Stamos's character's obsession with Elvis Presley and 1950s-60s rock and roll. The band performed at various venues throughout the series, including the Smash Club, and was often featured in episodes dealing with Jesse's musical aspirations versus his family responsibilities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Full_House",
    "citationTitle": "Wikipedia: Full House"
  },
  {
    "id": "6dc5e86d-fd3b-4613-bf68-0b80ab2d97c6",
    "text": "What was the name of the fictional African nation that was frequently referenced in 'A Different World' as the homeland of various international students?",
    "options": [
      "Zambezi",
      "Kamalawi",
      "Freeland",
      "Kinshasa"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Freeland was the fictional African nation referenced in the show as home to several international characters.",
    "detailedExplanation": "'A Different World' often featured storylines about African heritage and international students at the fictional Hillman College. Freeland was created as a fictional African nation to represent the experiences of African international students without stereotyping any real country. The show used this fictional setting to explore themes of African diaspora, cultural identity, and the connections between African Americans and continental Africans. This was part of the show's broader mission to educate viewers about historically black colleges and universities (HBCUs) and diverse cultural experiences.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Different_World",
    "citationTitle": "Wikipedia: A Different World"
  },
  {
    "id": "d20ed6b9-52aa-4f06-87a6-4f5621fcadf3",
    "text": "In 'Seinfeld', what is the name of Kramer's coffee table book about coffee tables that actually becomes a coffee table?",
    "options": [
      "The Coffee Table Coffee Table Book",
      "Tables: A Coffee Table Experience",
      "The Big Book of Coffee Tables",
      "Coffee Tables and the People Who Love Them"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Kramer's coffee table book is literally called 'The Coffee Table Coffee Table Book' and has legs that fold out.",
    "detailedExplanation": "In Season 6 of Seinfeld, Kramer publishes a coffee table book about coffee tables that comes with little legs so it can itself be used as a coffee table. This absurd concept was typical of the show's surreal humor and Kramer's bizarre entrepreneurial schemes. The book becomes a running gag throughout the episode 'The Caddy' and exemplifies the show's ability to turn mundane objects into comedic gold.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Caddy_(Seinfeld)",
    "citationTitle": "Wikipedia: The Caddy (Seinfeld)"
  },
  {
    "id": "22436c06-e897-4f77-a58b-5fa4e63bd4fd",
    "text": "Which 90s sitcom featured a character who was a disc jockey at the fictional radio station KACL in Seattle?",
    "options": [
      "NewsRadio",
      "Frasier",
      "Wings",
      "Cheers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Frasier Crane worked as a psychiatrist and radio host at KACL 780 AM in Seattle throughout the series.",
    "detailedExplanation": "After leaving Boston and the bar 'Cheers', Frasier Crane moved to Seattle where he hosted a call-in psychiatry show at the fictional radio station KACL 780 AM. The radio station setting provided the framework for much of the show's comedy, with Frasier dispensing advice to callers while dealing with his own complicated personal life. The show ran from 1993 to 2004 and won multiple Emmy Awards, becoming one of the most successful spin-offs in television history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frasier",
    "citationTitle": "Wikipedia: Frasier"
  },
  {
    "id": "ff7e474f-f3e9-48a9-91e2-c9b96fd88896",
    "text": "In 'The Fresh Prince of Bel-Air', what is the name of the private school that Carlton and later Will attend?",
    "options": [
      "Bel-Air Academy",
      "Beverly Hills Prep",
      "Bel-Air Preparatory School",
      "University of Los Angeles High School"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Both Carlton and Will attended Bel-Air Preparatory School, often referred to as 'Bel-Air Prep' in the show.",
    "detailedExplanation": "Bel-Air Preparatory School was the exclusive private school attended by Carlton Banks and later Will Smith after he moved in with the Banks family. The school setting was used to highlight the class differences between Will's street-smart background and the privileged world he entered. Episodes often featured storylines about Will adapting to the academic and social expectations of this elite institution, while maintaining his own identity and values from Philadelphia.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "e4fc49c2-4ba0-44d2-976c-1be8e7dd4b6e",
    "text": "Which actress played the role of Rebecca Howe's younger sister on 'Cheers' and later starred in her own 90s sitcom about magazine publishing?",
    "options": [
      "Helen Hunt",
      "Candice Bergen",
      "Tea Leoni",
      "Laura Leighton"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Candice Bergen played Rebecca's sister and starred in 'Murphy Brown' as an investigative journalist and news anchor.",
    "detailedExplanation": "Candice Bergen made guest appearances on Cheers as Susan Howe, Rebecca's successful and intimidating older sister. Bergen simultaneously starred in her own hit sitcom 'Murphy Brown' (1988-1998) where she played the titular character, an investigative journalist and anchor for the fictional news magazine show 'FYI'. Murphy Brown was groundbreaking for its portrayal of a strong, independent female protagonist and won Bergen five Emmy Awards. The show was known for tackling controversial political and social issues, including a famous fictional feud with Vice President Dan Quayle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Murphy_Brown",
    "citationTitle": "Wikipedia: Murphy Brown"
  }
]