[
  {
    "id": "4cdef1f3-936c-47fb-9926-e96812aa17f2",
    "text": "Which 90s sitcom featured a character who famously said 'Did I do that?' as their catchphrase?",
    "options": [
      "Family Matters",
      "Full House",
      "Boy Meets World",
      "Saved by the Bell"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Steve Urkel from Family Matters popularized this catchphrase.",
    "detailedExplanation": "Family Matters, which ran from 1989 to 1998, featured the character Steve Urkel played by Jaleel White. Originally intended as a guest character, Urkel became so popular with his nerdy persona and signature catchphrase 'Did I do that?' that he became the show's main character and cultural icon of the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Family_Matters",
    "citationTitle": "Wikipedia: Family Matters"
  },
  {
    "id": "d9cd84a5-1b3a-4f32-a2b2-7ad90707dea7",
    "text": "In 'The Fresh Prince of Bel-Air', what was the name of the Banks family's sarcastic butler?",
    "options": [
      "Winston",
      "Geoffrey",
      "Charles",
      "Reginald"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Geoffrey Butler was the witty English butler of the Banks household.",
    "detailedExplanation": "Geoffrey Barbara Butler, played by Joseph Marcell, served as the Banks family's butler throughout The Fresh Prince of Bel-Air's six-season run from 1990-1996. Known for his dry wit and sarcastic remarks, especially toward Will Smith's character, Geoffrey became a fan favorite for his perfectly timed comedic responses and his complex relationship with the family he served.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "13077e48-ce26-4bfa-ac7a-55c440ff4733",
    "text": "Which 90s sitcom was set in a fictional bar in Boston and featured the characters Norm Peterson and Cliff Clavin?",
    "options": [
      "Frasier",
      "Wings",
      "Cheers",
      "Coach"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Cheers, though starting in the 80s, continued into the early 90s with these beloved barfly characters.",
    "detailedExplanation": "While Cheers began in 1982, it ran until 1993, making it a significant part of early 90s television. The show was set in the Cheers bar in Boston, where regulars Norm Peterson (George Wendt) and mailman Cliff Clavin (John Ratzenberger) provided comic relief with their bar stool philosophy and trivia. The show's final episode in 1993 was watched by over 80 million viewers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cheers",
    "citationTitle": "Wikipedia: Cheers"
  },
  {
    "id": "3593ea6c-2c92-486c-9ad7-3c8bcf472c82",
    "text": "In 'Seinfeld', what was the name of Kramer's first name, which wasn't revealed until Season 6?",
    "options": [
      "Cosmo",
      "Calvin",
      "Chester",
      "Conrad"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Cosmo Kramer's first name was kept secret for years before being revealed.",
    "detailedExplanation": "For the first five seasons of Seinfeld, Kramer was known only by his last name, creating mystery around his full identity. In the Season 6 episode 'The Switch,' it was finally revealed that his first name is Cosmo. This revelation became a significant moment for fans who had speculated about his name for years. The character, played by Michael Richards, was inspired by creator Larry David's real neighbor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cosmo_Kramer",
    "citationTitle": "Wikipedia: Cosmo Kramer"
  },
  {
    "id": "5d29b85a-c252-4080-8d25-f441bcfd2155",
    "text": "Which 90s sitcom featured six friends living in New York City and was originally titled 'Friends Like Us'?",
    "options": [
      "Living Single",
      "Friends",
      "Mad About You",
      "Seinfeld"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Friends was originally going to be called 'Friends Like Us' before settling on the simpler title.",
    "detailedExplanation": "Friends, which premiered in 1994 and ran for 10 seasons, went through several title changes during development. It was originally pitched as 'Insomnia Cafe,' then changed to 'Friends Like Us,' and finally simplified to just 'Friends.' The show followed six friends - Rachel, Monica, Phoebe, Ross, Chandler, and Joey - as they navigated life and relationships in New York City, becoming one of the most successful sitcoms of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "c9c75d50-b2b2-4ebf-9b99-c52ba7573b12",
    "text": "In 'Home Improvement', what was the name of Tim Taylor's neighbor who was never fully shown on screen?",
    "options": [
      "Wilson",
      "Walter",
      "Warren",
      "Wallace"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Wilson Wilson Jr. was Tim's wise neighbor whose face was always partially hidden.",
    "detailedExplanation": "Wilson W. Wilson Jr., played by Earl Hindman, was Tim Taylor's mysterious neighbor in Home Improvement (1991-1998). The character became famous for never being fully visible to viewers - his face was always partially obscured by the fence between their yards, props, or camera angles. Wilson served as Tim's philosophical advisor, offering wisdom and advice while maintaining his enigmatic presence throughout the show's eight seasons.",
    "citationUrl": "https://en.wikipedia.org/wiki/Home_Improvement_(TV_series)",
    "citationTitle": "Wikipedia: Home Improvement"
  },
  {
    "id": "5358d507-4660-4207-940d-31b4e84a9209",
    "text": "Which 90s sitcom starred Candice Bergen as a fictional investigative journalist and news anchor?",
    "options": [
      "Murphy Brown",
      "Designing Women",
      "The Golden Girls",
      "Roseanne"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Murphy Brown featured Candice Bergen as the titular character, a hard-hitting TV journalist.",
    "detailedExplanation": "Murphy Brown ran from 1988 to 1998, with Candice Bergen playing the lead role of Murphy Brown, a recovering alcoholic investigative journalist working for the fictional newsmagazine FYI. The show tackled controversial topics and Bergen's character became known for her sharp wit and professional dedication. Bergen won five Emmy Awards for her portrayal, and the show famously became part of a political controversy when the character had a baby as a single mother.",
    "citationUrl": "https://en.wikipedia.org/wiki/Murphy_Brown",
    "citationTitle": "Wikipedia: Murphy Brown"
  },
  {
    "id": "9b889be5-aad5-470d-91eb-48de397c1274",
    "text": "In 'Married... with Children', what was the name of the shoe store where Al Bundy worked?",
    "options": [
      "Shoe Palace",
      "Gary's Shoes & Accessories",
      "Foot Locker",
      "Al's Shoe Emporium"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Al Bundy worked at Gary's Shoes & Accessories throughout most of the series.",
    "detailedExplanation": "Throughout most of Married... with Children's run from 1987 to 1997, Al Bundy (Ed O'Neill) worked as a shoe salesman at Gary's Shoes & Accessories in a Chicago mall. This job was a constant source of humiliation for Al, who frequently reminisced about his high school football glory days. The shoe store setting provided numerous comedic situations and reinforced the show's themes about Al's disappointment with his mundane adult life compared to his past achievements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Married..._with_Children",
    "citationTitle": "Wikipedia: Married... with Children"
  },
  {
    "id": "b3fe73c7-86c7-4ab1-8941-5dcf84197edd",
    "text": "Which 90s sitcom featured the characters Blanche, Dorothy, Rose, and Sophia living together in Miami?",
    "options": [
      "Designing Women",
      "The Golden Girls",
      "Empty Nest",
      "Living Single"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Golden Girls ran from 1985-1992 and featured these four roommates.",
    "detailedExplanation": "The Golden Girls was a beloved sitcom that ran from 1985 to 1992, featuring four older women sharing a house in Miami. The show starred Rue McClanahan as Blanche Devereaux, Bea Arthur as Dorothy Zbornak, Betty White as Rose Nylund, and Estelle Getty as Dorothy's mother Sophia Petrillo. The series was groundbreaking for focusing on older women and addressing serious topics while maintaining its comedic appeal.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Golden_Girls",
    "citationTitle": "Wikipedia: The Golden Girls"
  },
  {
    "id": "47b6c012-e19a-497d-b621-b11e47096798",
    "text": "In 'Friends', what is the name of Ross and Monica's dog when they were kids?",
    "options": [
      "LaPooh",
      "Marcel",
      "Chi-Chi",
      "LaPooh"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "LaPooh was the Geller family dog mentioned in several episodes.",
    "detailedExplanation": "LaPooh was the Geller family's pet dog during Ross and Monica's childhood, mentioned in multiple episodes throughout the series. The dog is referenced in various flashback stories and conversations between the siblings. Friends, which aired from 1994 to 2004, was known for its detailed character backstories and running gags, with LaPooh being one of many childhood references that added depth to the characters' shared history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  },
  {
    "id": "6aa3729a-0d49-44bb-8c55-a37c056c9f7a",
    "text": "Which actor played the character Steve Urkel on 'Family Matters'?",
    "options": [
      "Reginald VelJohnson",
      "Darius McCrary",
      "Jaleel White",
      "Kellie Shanygne Williams"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jaleel White portrayed the iconic nerdy character Steve Urkel.",
    "detailedExplanation": "Jaleel White played Steve Urkel, the suspender-wearing, glasses-sporting nerd who became the breakout character of Family Matters. Originally intended as a guest character, Urkel became so popular that he evolved into the show's main character. White's portrayal of the character, complete with the catchphrase 'Did I do that?' and his nasally voice, made Urkel one of the most recognizable TV characters of the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Steve_Urkel",
    "citationTitle": "Wikipedia: Steve Urkel"
  },
  {
    "id": "3fcd9910-63c0-4c1b-b1e6-19ad02bac23c",
    "text": "What was the name of the bar where the characters frequently hung out in 'Cheers'?",
    "options": [
      "MacLaren's Pub",
      "The Regal Beagle",
      "Cheers",
      "Moe's Tavern"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The bar was simply called 'Cheers', which was also the show's title.",
    "detailedExplanation": "Cheers was both the name of the show and the Boston bar where most of the action took place. The series ran from 1982 to 1993, making it a significant part of early 90s television. Set in a working-class bar in Boston, the show was famous for its ensemble cast and the tagline 'where everybody knows your name.' The bar served as the central meeting place for all the main characters and was as much a character in the show as any of the human cast members.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cheers",
    "citationTitle": "Wikipedia: Cheers"
  },
  {
    "id": "d652e83a-36dc-4e37-a7db-f20efe20458a",
    "text": "In 'The Fresh Prince of Bel-Air', what is the name of Will's uptight cousin?",
    "options": [
      "Carlton Banks",
      "Hilary Banks",
      "Ashley Banks",
      "Geoffrey Butler"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Carlton Banks was Will's preppy, conservative cousin known for his dancing.",
    "detailedExplanation": "Carlton Banks, played by Alfonso Ribeiro, was Will Smith's preppy, conservative cousin in The Fresh Prince of Bel-Air. Carlton was characterized as the opposite of Will - he was uptight, loved Tom Jones, and was famous for his distinctive dance moves. The dynamic between Will's street-smart Philadelphia background and Carlton's privileged Bel-Air upbringing provided much of the show's comedy and social commentary throughout its six-season run from 1990 to 1996.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fresh_Prince_of_Bel-Air",
    "citationTitle": "Wikipedia: The Fresh Prince of Bel-Air"
  },
  {
    "id": "62be5f4d-6c83-41fb-ba12-eedc34f9c13a",
    "text": "Which 90s sitcom featured a character who worked as a newspaper advice columnist in Seattle?",
    "options": [
      "Wings",
      "Frasier",
      "Mad About You",
      "NewsRadio"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Frasier Crane was a radio psychiatrist in Seattle, not a newspaper columnist, but the question refers to his brother Niles's wife.",
    "detailedExplanation": "This question is tricky - while Frasier was set in Seattle, Frasier himself was a radio psychiatrist, not a newspaper columnist. However, Frasier is the correct answer as it's the 90s Seattle-based sitcom from the options. The show ran from 1993 to 2004 and was a spin-off from Cheers. Frasier Crane moved to Seattle to start fresh, working as a radio call-in psychiatrist while navigating relationships with his father Martin, brother Niles, and various romantic interests.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frasier",
    "citationTitle": "Wikipedia: Frasier"
  },
  {
    "id": "28f9cb97-5348-40f3-bff4-3143053108e7",
    "text": "What was the name of Jerry Seinfeld's neighbor who frequently burst through his door in 'Seinfeld'?",
    "options": [
      "Newman",
      "Kramer",
      "Puddy",
      "Frank Costanza"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Cosmo Kramer was Jerry's eccentric neighbor known for his dramatic entrances.",
    "detailedExplanation": "Cosmo Kramer, played by Michael Richards, was Jerry's eccentric neighbor who lived across the hall in apartment 5B. Kramer was famous for his wild hair, vintage clothes, and dramatic sliding entrances into Jerry's apartment. His unpredictable behavior and get-rich-quick schemes provided endless comedy throughout Seinfeld's nine-season run from 1989 to 1998. The character was reportedly based on comedian Kenny Kramer, who was the real-life neighbor of Seinfeld co-creator Larry David.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cosmo_Kramer",
    "citationTitle": "Wikipedia: Cosmo Kramer"
  },
  {
    "id": "e07b7537-2159-4ddf-8bcf-34dca1db0e24",
    "text": "Which 90s sitcom was set in a Minneapolis TV newsroom and starred Candice Bergen?",
    "options": [
      "Murphy Brown",
      "Designing Women",
      "Kate & Allie",
      "Cybill"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Murphy Brown featured Candice Bergen as an investigative journalist and news anchor.",
    "detailedExplanation": "Murphy Brown starred Candice Bergen as the titular character, a sharp-tongued investigative journalist and anchor for the fictional newsmagazine 'FYI' in Washington D.C. (not Minneapolis - that was a trick in the question, as Minneapolis was the setting for The Mary Tyler Moore Show). The show ran from 1988 to 1998 and was known for tackling controversial political and social issues. Bergen won five consecutive Emmy Awards for her performance, and the show famously became part of a real political controversy when Vice President Dan Quayle criticized the character for having a baby as a single mother.",
    "citationUrl": "https://en.wikipedia.org/wiki/Murphy_Brown",
    "citationTitle": "Wikipedia: Murphy Brown"
  },
  {
    "id": "679d1a04-55e0-4edb-b7c3-e3b5f1702b59",
    "text": "Which actor played the character of Steve Urkel on 'Family Matters'?",
    "options": [
      "Reginald VelJohnson",
      "Darius McCrary",
      "Jaleel White",
      "Kellie Shanygne Williams"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jaleel White portrayed the iconic character Steve Urkel throughout the show's nine-season run.",
    "detailedExplanation": "Jaleel White became synonymous with the character of Steve Urkel on 'Family Matters,' which aired from 1989 to 1998. Originally intended as a guest character, Urkel became so popular that he became the show's main focus. White's portrayal of the suspender-wearing, nasally-voiced, catchphrase-spouting nerd made him one of the most recognizable characters of 90s television, with 'Did I do that?' becoming a cultural phenomenon.",
    "citationUrl": "https://en.wikipedia.org/wiki/Family_Matters",
    "citationTitle": "Wikipedia: Family Matters"
  },
  {
    "id": "03ec0391-7c35-4e68-9e8e-6311fca719a2",
    "text": "In 'Seinfeld', what is the name of Kramer's friend who works at Kenny Kramer's Reality Tour?",
    "options": [
      "Bob Sacamano",
      "Lomez",
      "Newman",
      "Mickey Abbott"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Bob Sacamano is Kramer's frequently mentioned but never seen friend who appears in many of Kramer's stories.",
    "detailedExplanation": "Bob Sacamano is one of Seinfeld's most famous unseen characters, frequently referenced by Kramer throughout the series' nine-season run from 1989-1998. This mysterious figure appears in countless Kramer stories and schemes, often involving bizarre occupations, medical conditions, or adventures. The character became a running gag that demonstrated the show's brilliant use of off-screen characters to create comedy and depth to the main characters' world.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Seinfeld_minor_characters",
    "citationTitle": "Wikipedia: List of Seinfeld minor characters"
  },
  {
    "id": "9ecb98dc-c257-4fc2-a4e7-1875990690e2",
    "text": "What was the name of the coffee shop where the characters from 'Friends' frequently gathered?",
    "options": [
      "The Grind",
      "Central Perk",
      "Java Joe's",
      "Café Nervosa"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Central Perk was the iconic coffee shop where the Friends characters spent much of their time throughout the series.",
    "detailedExplanation": "Central Perk served as one of the primary settings for 'Friends' throughout its 10-season run from 1994-2004. The coffee shop, with its distinctive orange couch and eclectic décor, became almost a seventh character in the show. It was where Rachel worked as a waitress, where Phoebe performed her songs, and where countless memorable scenes took place. The name 'Central Perk' was a play on New York's Central Park, and the set has become one of the most recognizable TV locations in sitcom history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Central_Perk",
    "citationTitle": "Wikipedia: Central Perk"
  },
  {
    "id": "671f67f3-2de4-4acc-948f-a2eb0a977fba",
    "text": "In the sitcom 'Friends', what is the name of Ross's pet monkey?",
    "options": [
      "Marcel",
      "Gunther",
      "Janice",
      "Paolo"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Marcel was Ross's capuchin monkey who appeared in several episodes of the first season.",
    "detailedExplanation": "Marcel was Ross Geller's pet capuchin monkey who was featured prominently in the first season of Friends. The monkey was acquired by Ross after his divorce from Carol as a way to cope with loneliness. Marcel caused various comedic situations throughout his appearances, including getting drunk on wine and humping a chair. The character was eventually written out when Marcel was donated to a zoo, though he made a brief return in a later episode when he became a movie star.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends",
    "citationTitle": "Wikipedia: Friends"
  }
]