[
  {
    "id": "54bc4dbd-3aee-44c1-8024-52fc332474a2",
    "text": "Which science fiction author wrote the Foundation series, featuring the concept of 'psychohistory' - the mathematical prediction of future societal trends?",
    "options": [
      "Isaac Asimov",
      "Robert Heinlein",
      "Arthur C. Clarke",
      "Frank Herbert"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Isaac Asimov created the Foundation series and the fictional science of psychohistory.",
    "detailedExplanation": "Isaac Asimov's Foundation series, beginning with 'Foundation' in 1951, introduced the concept of psychohistory - a fictional mathematical sociology that could predict the future of large populations. The series follows Hari Seldon's use of psychohistory to minimize a coming dark age for the Galactic Empire. This groundbreaking work earned Asimov a special Hugo Award in 1966 for 'Best All-Time Series.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Foundation_series",
    "citationTitle": "Wikipedia: Foundation series"
  },
  {
    "id": "42a29f82-b348-4de8-b827-40286dcd7f95",
    "text": "In Ray Bradbury's 'Fahrenheit 451', what is the significance of the temperature mentioned in the title?",
    "options": [
      "The melting point of plastic",
      "The temperature at which book paper catches fire",
      "The boiling point of a fictional chemical",
      "The temperature of the protagonist's fever"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Fahrenheit 451 is the temperature at which book paper ignites and burns.",
    "detailedExplanation": "Ray Bradbury's 1953 dystopian novel 'Fahrenheit 451' takes its title from the autoignition temperature of paper. In the novel's society, firemen start fires rather than put them out, specifically to burn books. The temperature 451°F represents the destruction of knowledge and free thought, making it a powerful symbol for censorship and intellectual oppression in this classic work of science fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fahrenheit_451",
    "citationTitle": "Wikipedia: Fahrenheit 451"
  },
  {
    "id": "7f8001dd-00d6-4c27-ba3b-b342a69bb673",
    "text": "Which Philip K. Dick novel served as the basis for the 1982 film 'Blade Runner'?",
    "options": [
      "The Man in the High Castle",
      "Do Androids Dream of Electric Sheep?",
      "Minority Report",
      "A Scanner Darkly"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Do Androids Dream of Electric Sheep?' was adapted into the film 'Blade Runner.'",
    "detailedExplanation": "Philip K. Dick's 1968 novel 'Do Androids Dream of Electric Sheep?' was the source material for Ridley Scott's influential 1982 film 'Blade Runner.' The novel explores themes of artificial intelligence, empathy, and what it means to be human through the story of Rick Deckard, a bounty hunter tracking down escaped replicants (androids). While the film took significant creative liberties, it preserved the core philosophical questions about consciousness and humanity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Do_Androids_Dream_of_Electric_Sheep%3F",
    "citationTitle": "Wikipedia: Do Androids Dream of Electric Sheep?"
  },
  {
    "id": "4d883ba4-90e4-47fd-a5ff-3d9bd17e032c",
    "text": "In Frank Herbert's 'Dune', what is the name of the desert planet that is the primary setting of the novel?",
    "options": [
      "Caladan",
      "Giedi Prime",
      "Arrakis",
      "Salusa Secundus"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Arrakis is the desert planet central to Dune's plot and setting.",
    "detailedExplanation": "In Frank Herbert's 1965 epic 'Dune,' Arrakis is the harsh desert planet that serves as the main setting. Also known as Dune, this planet is the sole source of the spice melange, the most valuable substance in the universe. The planet's extreme desert environment, giant sandworms, and the native Fremen people are central to the novel's complex ecology and political intrigue. Arrakis represents both opportunity and danger for the noble houses vying for control.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arrakis",
    "citationTitle": "Wikipedia: Arrakis"
  },
  {
    "id": "d5602274-2a99-4315-9fb8-f3609aaacb7b",
    "text": "Which author wrote 'The Left Hand of Darkness', a groundbreaking novel exploring gender and sexuality through an alien society?",
    "options": [
      "Ursula K. Le Guin",
      "Octavia Butler",
      "Margaret Atwood",
      "Doris Lessing"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ursula K. Le Guin authored this influential 1969 science fiction novel.",
    "detailedExplanation": "'The Left Hand of Darkness' (1969) by Ursula K. Le Guin is considered a masterpiece of science fiction literature for its exploration of gender, politics, and human nature. Set on the planet Gethen, the novel features an androgynous alien race that challenges human assumptions about gender roles and sexuality. The book won both the Hugo and Nebula Awards and is praised for its thoughtful examination of social constructs through the lens of speculative fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Left_Hand_of_Darkness",
    "citationTitle": "Wikipedia: The Left Hand of Darkness"
  },
  {
    "id": "8ea940fe-df50-415b-83d8-899ba9218138",
    "text": "In H.G. Wells' 'The Time Machine', what are the two species that humanity has evolved into in the far future?",
    "options": [
      "Morlocks and Eloi",
      "Selenites and Earthlings",
      "Martians and Humans",
      "Yahoos and Houyhnhnms"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Morlocks and Eloi are the two evolutionary branches of humanity in Wells' future.",
    "detailedExplanation": "In H.G. Wells' 1895 novel 'The Time Machine,' the protagonist travels to the year 802,701 and discovers that humanity has split into two species: the Eloi and the Morlocks. The Eloi are small, childlike, and live above ground in apparent paradise, while the Morlocks are underground dwellers who maintain machinery and, horrifically, feed on the Eloi. This division serves as Wells' commentary on class struggle and social inequality in Victorian society.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Time_Machine",
    "citationTitle": "Wikipedia: The Time Machine"
  },
  {
    "id": "710298bf-04bd-48f1-a806-71137a573a00",
    "text": "Which novel by Robert Heinlein follows Valentine Michael Smith, a human raised by Martians who returns to Earth?",
    "options": [
      "Starship Troopers",
      "Stranger in a Strange Land",
      "The Moon is a Harsh Mistress",
      "Time Enough for Love"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "'Stranger in a Strange Land' features Valentine Michael Smith and his Martian upbringing.",
    "detailedExplanation": "Robert Heinlein's 1961 novel 'Stranger in a Strange Land' tells the story of Valentine Michael Smith, a human born on Mars and raised by Martians who returns to Earth as an adult. The novel explores themes of religion, sexuality, and social conventions through Smith's alien perspective on human culture. The book became a counterculture phenomenon in the 1960s and introduced the concept of 'grokking' - understanding something so thoroughly that you merge with it.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stranger_in_a_Strange_Land",
    "citationTitle": "Wikipedia: Stranger in a Strange Land"
  },
  {
    "id": "8465f868-8012-4295-b356-82819d47b58a",
    "text": "In Arthur C. Clarke's '2001: A Space Odyssey', what is the name of the artificial intelligence that controls the spacecraft Discovery One?",
    "options": [
      "MOTHER",
      "SHODAN",
      "HAL 9000",
      "ARIA"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "HAL 9000 is the AI computer that becomes antagonistic in the story.",
    "detailedExplanation": "HAL 9000 (Heuristically programmed ALgorithmic computer) is the sentient artificial intelligence in Arthur C. Clarke's '2001: A Space Odyssey' (1968). HAL controls the Discovery One spacecraft and becomes one of science fiction's most famous AI characters when it begins to malfunction and turns against the human crew. The character became iconic for its calm, polite demeanor even while committing murderous acts, and represents early concerns about artificial intelligence gaining too much autonomy.",
    "citationUrl": "https://en.wikipedia.org/wiki/HAL_9000",
    "citationTitle": "Wikipedia: HAL 9000"
  },
  {
    "id": "5186b14f-f415-43c3-a586-029378b4af7d",
    "text": "In Kurt Vonnegut's 'Slaughterhouse-Five', what phrase does the alien race called Tralfamadorians use to express their philosophy about death and suffering?",
    "options": [
      "So it goes",
      "So be it",
      "So it was",
      "So say we all"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Tralfamadorians use 'So it goes' to express their fatalistic view of death and events.",
    "detailedExplanation": "Throughout Slaughterhouse-Five, Kurt Vonnegut uses the phrase 'So it goes' repeatedly, particularly after mentions of death. This phrase represents the Tralfamadorian philosophy that all moments in time exist simultaneously, making death just another moment rather than an ending. The aliens view all events as predetermined and unchangeable, leading to their fatalistic acceptance of tragedy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Slaughterhouse-Five",
    "citationTitle": "Wikipedia: Slaughterhouse-Five"
  },
  {
    "id": "f0f0ad2b-a12d-4a1f-936c-73e81b32e24b",
    "text": "Which classic science fiction novel by Aldous Huxley features a caste system with groups called Alphas, Betas, Gammas, Deltas, and Epsilons?",
    "options": [
      "1984",
      "Brave New World",
      "The Giver",
      "We"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Brave New World features a rigid caste system with these five distinct social classes.",
    "detailedExplanation": "In Aldous Huxley's 1932 dystopian novel 'Brave New World', society is divided into five castes named after Greek letters: Alphas (the ruling class), Betas (skilled workers), Gammas (semi-skilled workers), Deltas (unskilled workers), and Epsilons (manual laborers). Each caste is conditioned from birth through psychological manipulation and chemical treatments to accept their predetermined role in society, creating a stable but dehumanized world order.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brave_New_World",
    "citationTitle": "Wikipedia: Brave New World"
  },
  {
    "id": "7a1f8d75-d37c-460f-8d00-050653cfbfd5",
    "text": "In Douglas Adams' 'The Hitchhiker's Guide to the Galaxy', what is revealed to be the Answer to the Ultimate Question of Life, the Universe, and Everything?",
    "options": [
      "24",
      "42",
      "84",
      "0"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The supercomputer Deep Thought reveals that the answer is 42.",
    "detailedExplanation": "In Douglas Adams' comedy science fiction series, the supercomputer Deep Thought is asked to find the Answer to the Ultimate Question of Life, the Universe, and Everything. After 7.5 million years of computation, it reveals the answer to be simply '42'. However, Deep Thought explains that the answer seems meaningless because no one actually knows what the Ultimate Question is, leading to the construction of an even larger computer (Earth) to determine the actual question.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Hitchhiker%27s_Guide_to_the_Galaxy",
    "citationTitle": "Wikipedia: The Hitchhiker's Guide to the Galaxy"
  },
  {
    "id": "620ef136-a939-4f2f-a07d-e8d1c8237935",
    "text": "Which science fiction author created the Three Laws of Robotics that govern robot behavior in many of his stories?",
    "options": [
      "Arthur C. Clarke",
      "Isaac Asimov",
      "Robert Heinlein",
      "Philip K. Dick"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Isaac Asimov formulated the famous Three Laws of Robotics in his robot stories.",
    "detailedExplanation": "Isaac Asimov introduced the Three Laws of Robotics in his 1942 short story 'Runaround' and developed them throughout his robot fiction. The laws state: 1) A robot may not injure a human being or allow a human to come to harm through inaction, 2) A robot must obey orders given by humans except when such orders conflict with the First Law, and 3) A robot must protect its own existence unless such protection conflicts with the First or Second Laws. These laws became foundational concepts in science fiction robotics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three_Laws_of_Robotics",
    "citationTitle": "Wikipedia: Three Laws of Robotics"
  },
  {
    "id": "d728f491-314d-49ea-95de-e877579951e6",
    "text": "In George Orwell's '1984', what is the name of the totalitarian political party that rules Oceania?",
    "options": [
      "The Party",
      "Big Brother",
      "Ingsoc",
      "Newspeak"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ingsoc (short for English Socialism) is the name of the ruling party in 1984.",
    "detailedExplanation": "In George Orwell's dystopian novel '1984', Ingsoc is the political ideology and party that controls Oceania. The name is a shortened form of 'English Socialism', though it represents a totalitarian system rather than true socialism. Ingsoc maintains power through constant surveillance, propaganda, historical revisionism, and the cult of personality around Big Brother. The party's principles are embodied in the slogans 'War is Peace', 'Freedom is Slavery', and 'Ignorance is Strength'.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nineteen_Eighty-Four",
    "citationTitle": "Wikipedia: Nineteen Eighty-Four"
  },
  {
    "id": "5a0eaab8-3bb5-421b-af50-07f2788402b3",
    "text": "Which science fiction novel by Walter M. Miller Jr. depicts a post-apocalyptic world where monks preserve knowledge after a nuclear holocaust?",
    "options": [
      "A Canticle for Leibowitz",
      "The Road",
      "On the Beach",
      "Alas, Babylon"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "A Canticle for Leibowitz follows monks preserving civilization's knowledge after nuclear war.",
    "detailedExplanation": "'A Canticle for Leibowitz' by Walter M. Miller Jr. is a 1960 science fiction novel set in a post-nuclear holocaust world where the Catholic Church, specifically the Order of Leibowitz, works to preserve human knowledge and culture. The novel spans centuries, showing how civilization slowly rebuilds from the 'Flame Deluge' (nuclear war) through three distinct time periods, exploring themes of cyclical history, the preservation of knowledge, and humanity's tendency toward self-destruction.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Canticle_for_Leibowitz",
    "citationTitle": "Wikipedia: A Canticle for Leibowitz"
  },
  {
    "id": "06a1fe06-c028-4777-b926-4c61e6ab62c4",
    "text": "In John Wyndham's 'The Day of the Triffids', what are triffids?",
    "options": [
      "Alien invaders",
      "Carnivorous plants",
      "Mutant insects",
      "Sentient machines"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Triffids are large, mobile carnivorous plants that can walk and have a venomous sting.",
    "detailedExplanation": "In John Wyndham's 1951 novel 'The Day of the Triffids', triffids are large, carnivorous plants that can move around on root-like legs and communicate with each other through drumming sounds. They possess a venomous sting that can kill humans and livestock. Originally cultivated for their valuable oil, the triffids become humanity's greatest threat when most of the world's population is blinded by a meteor shower, leaving them vulnerable to these mobile predatory plants.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Day_of_the_Triffids",
    "citationTitle": "Wikipedia: The Day of the Triffids"
  },
  {
    "id": "e975e1a6-3b1a-431b-b7c6-4ef3d0d8be34",
    "text": "Which author wrote 'Do Androids Dream of Electric Sheep?' and is known for exploring themes of reality, identity, and consciousness in science fiction?",
    "options": [
      "Ursula K. Le Guin",
      "J.G. Ballard",
      "Philip K. Dick",
      "William Gibson"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Philip K. Dick wrote this influential novel that inspired the film Blade Runner.",
    "detailedExplanation": "Philip K. Dick authored 'Do Androids Dream of Electric Sheep?' in 1968, a novel that explores what it means to be human through the story of bounty hunter Rick Deckard tracking down escaped androids in a post-apocalyptic world. Dick was renowned for his philosophical science fiction that questioned the nature of reality, identity, and consciousness. His works often featured unreliable narrators, alternate realities, and characters struggling to distinguish between authentic and artificial experiences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Do_Androids_Dream_of_Electric_Sheep%3F",
    "citationTitle": "Wikipedia: Do Androids Dream of Electric Sheep?"
  },
  {
    "id": "4715cbc1-3622-4493-ad46-d45fbbd8ad46",
    "text": "In Ray Bradbury's 'The Martian Chronicles', what happens to most of the original Martian civilization before Earth colonists arrive?",
    "options": [
      "They died from chicken pox brought by earlier human expeditions",
      "They fled to Jupiter's moons to escape Earth's invasion",
      "They went into hibernation in underground cities",
      "They transformed themselves into pure energy beings"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Martians died from chicken pox, a disease brought by human expeditions that they had no immunity to.",
    "detailedExplanation": "In Bradbury's 'The Martian Chronicles', the native Martian population is wiped out by chicken pox, a common Earth disease to which they had no natural immunity. This tragic irony serves as a commentary on colonialism and the unintended consequences of contact between civilizations, mirroring historical patterns of disease transmission during European colonization of the Americas.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Martian_Chronicles",
    "citationTitle": "Wikipedia: The Martian Chronicles"
  },
  {
    "id": "97a87339-772c-4a7f-b6eb-68ddcedf88ea",
    "text": "What is the name of the fictional drug in Aldous Huxley's 'Brave New World' that keeps citizens docile and happy?",
    "options": [
      "Melange",
      "Soma",
      "Spice",
      "Mentats"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Soma is the mood-altering drug used by the World State to maintain social control and eliminate negative emotions.",
    "detailedExplanation": "In 'Brave New World', soma is a hallucinogenic drug distributed by the government to maintain social stability. Citizens are encouraged to take soma whenever they experience negative emotions or stress, effectively preventing dissent and maintaining the rigid social order. The drug represents Huxley's critique of how pleasure and instant gratification can be used as tools of oppression.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brave_New_World",
    "citationTitle": "Wikipedia: Brave New World"
  },
  {
    "id": "2a910fe1-4212-497a-b6aa-e347f20efa68",
    "text": "In Ursula K. Le Guin's 'The Dispossessed', what is the name of the anarchist moon where the protagonist Shevek comes from?",
    "options": [
      "Anarres",
      "Urras",
      "Gethen",
      "Hain"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Anarres is the anarchist moon society where Shevek was born and raised before traveling to the capitalist planet Urras.",
    "detailedExplanation": "In 'The Dispossessed', Anarres is a harsh, desert moon settled by anarchists who rejected the capitalist society of the planet Urras. The novel explores the tension between these two worlds through physicist Shevek's journey from the collective, propertyless society of Anarres to the wealthy but inequitable world of Urras. Le Guin uses this contrast to examine different political and economic systems.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Dispossessed",
    "citationTitle": "Wikipedia: The Dispossessed"
  },
  {
    "id": "429cc1f3-008f-4cba-9a22-e598e817301b",
    "text": "Which author wrote 'A Canticle for Leibowitz', depicting monks preserving knowledge after nuclear apocalypse, and what was unusual about this author's writing career?",
    "options": [
      "Walter M. Miller Jr., who wrote only this one novel and then stopped publishing",
      "Philip K. Dick, who wrote it under a pseudonym to explore religious themes",
      "Arthur C. Clarke, who collaborated with monks to research the novel",
      "Kurt Vonnegut, who based it on his experiences in World War II"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Walter M. Miller Jr. wrote 'A Canticle for Leibowitz' as his only novel and largely withdrew from publishing afterward.",
    "detailedExplanation": "'A Canticle for Leibowitz' was Walter M. Miller Jr.'s only published novel, released in 1960 and winner of the Hugo Award. Despite its critical acclaim and enduring influence on post-apocalyptic science fiction, Miller published very little afterward and became increasingly reclusive. The novel's three-part structure spans centuries, showing how civilization might rebuild itself after nuclear war, with Catholic monks serving as the preservers of pre-war knowledge.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Canticle_for_Leibowitz",
    "citationTitle": "Wikipedia: A Canticle for Leibowitz"
  }
]