[
  {
    "id": "6c9f298a-30cf-4d38-ab94-b6ae84be9410",
    "text": "Which island nation is the smallest country in Asia by both land area and population?",
    "options": [
      "Singapore",
      "Maldives",
      "Bahrain",
      "Brunei"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "The Maldives is the smallest Asian country with only 298 square kilometers and about 540,000 people.",
    "detailedExplanation": "The Maldives consists of 1,192 coral islands grouped into 26 atolls in the Indian Ocean. With a total land area of just 298 square kilometers (115 square miles) and a population of approximately 540,000, it holds the distinction of being Asia's smallest country by both measures. The nation is also notable for being the world's lowest-lying country, with an average ground level of just 1.5 meters above sea level.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maldives",
    "citationTitle": "Wikipedia: Maldives"
  },
  {
    "id": "d2b6da4d-935d-4131-b083-778de1516d40",
    "text": "Madagascar separated from which continent approximately 160 million years ago?",
    "options": [
      "South America",
      "Africa",
      "India",
      "Australia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Madagascar split from Africa around 160 million years ago, leading to its unique biodiversity.",
    "detailedExplanation": "Madagascar, the world's fourth-largest island, was once part of the supercontinent Gondwana. It separated from Africa approximately 160 million years ago during the Jurassic period, and later from India about 90 million years ago. This long isolation has resulted in Madagascar having one of the world's most unique ecosystems, with about 90% of its wildlife found nowhere else on Earth, including all lemur species.",
    "citationUrl": "https://en.wikipedia.org/wiki/Madagascar",
    "citationTitle": "Wikipedia: Madagascar"
  },
  {
    "id": "42c02d41-03ef-4fe6-b9ba-d8c3ee246bd9",
    "text": "Which Caribbean island nation is known as the 'Spice Isle' due to its nutmeg production?",
    "options": [
      "Jamaica",
      "Barbados",
      "Grenada",
      "Trinidad and Tobago"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Grenada is called the 'Spice Isle' because it's one of the world's largest nutmeg producers.",
    "detailedExplanation": "Grenada earned the nickname 'Spice Isle' due to its significant production of nutmeg, mace, cinnamon, ginger, and cloves. The island nation was once the world's second-largest producer of nutmeg after Indonesia. The nutmeg tree is so important to Grenada that it appears on their national flag. The spice industry has been central to Grenada's economy since the 18th century, though Hurricane Ivan in 2004 severely damaged many nutmeg trees.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grenada",
    "citationTitle": "Wikipedia: Grenada"
  },
  {
    "id": "ef82e8d7-c545-4068-ae86-5fa98e1ecb30",
    "text": "Which Pacific island nation consists of 83 islands and is home to the world's most remote diplomatic mission?",
    "options": [
      "Vanuatu",
      "Tonga",
      "Kiribati",
      "Marshall Islands"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Vanuatu comprises 83 islands and houses various remote diplomatic missions in the Pacific.",
    "detailedExplanation": "Vanuatu is an archipelago of 83 islands located about 1,750 kilometers east of northern Australia. The country is known for its active volcanoes, pristine beaches, and unique cultural diversity with over 100 indigenous languages. Due to its remote location in the Pacific, many diplomatic missions to Vanuatu are considered among the world's most isolated postings. The nation gained independence from joint British-French colonial rule in 1980 and has since become known for its 'happiness' ranking and citizenship-by-investment program.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vanuatu",
    "citationTitle": "Wikipedia: Vanuatu"
  },
  {
    "id": "25d8820f-1065-4ec1-a5e2-49c5b5ed77da",
    "text": "Which Mediterranean island nation has two official languages and was awarded the George Cross by Britain in 1942?",
    "options": [
      "Cyprus",
      "Malta",
      "Corsica",
      "Sardinia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Malta has Maltese and English as official languages and received the George Cross for WWII bravery.",
    "detailedExplanation": "Malta was collectively awarded the George Cross by King George VI in 1942 in recognition of the heroism and devotion of its people during World War II, particularly during the siege of Malta. The cross appears on the Maltese flag today. Malta has two official languages: Maltese, which evolved from Arabic with influences from Italian and other languages, and English, a legacy of British colonial rule from 1814 to 1964. The island nation joined the European Union in 2004 and adopted the euro in 2008.",
    "citationUrl": "https://en.wikipedia.org/wiki/Malta",
    "citationTitle": "Wikipedia: Malta"
  },
  {
    "id": "85639065-6460-48e8-9e31-fc02ae80cc29",
    "text": "What is the capital city of Palau, the Pacific island nation known for its jellyfish lake?",
    "options": [
      "Koror",
      "Ngerulmud",
      "Airai",
      "Melekeok"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Ngerulmud became Palau's capital in 2006, replacing the larger city of Koror.",
    "detailedExplanation": "Ngerulmud became the capital of Palau in 2006, taking over from Koror, which had served as the de facto capital since independence. Located in Melekeok State on Babeldaob island, Ngerulmud is one of the world's smallest national capitals by population, with fewer than 400 residents. Palau is famous for its Jellyfish Lake, where millions of harmless jellyfish migrate daily across the lake, and for its incredible marine biodiversity that makes it a world-renowned diving destination.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ngerulmud",
    "citationTitle": "Wikipedia: Ngerulmud"
  },
  {
    "id": "8c21f52a-4de5-40fe-98bc-cf1053007720",
    "text": "Which island nation in the Indian Ocean was uninhabited until the arrival of the Portuguese in the 16th century?",
    "options": [
      "Madagascar",
      "Sri Lanka",
      "Mauritius",
      "Seychelles"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Mauritius had no indigenous population and was first settled by the Portuguese, then Dutch, French, and British.",
    "detailedExplanation": "Mauritius was uninhabited when Portuguese sailors first visited it in the 16th century, naming it Ilha do Cisne (Island of the Swan). The Dutch later named it Mauritius after Prince Maurice of Nassau and were the first to establish a settlement in 1638, though they abandoned it in 1710. The French then took control, followed by the British in 1810. This unique colonial history, combined with later immigration from India, China, and Africa, has created Mauritius's distinctive multicultural society. The island is also famous as the former home of the dodo bird.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mauritius",
    "citationTitle": "Wikipedia: Mauritius"
  },
  {
    "id": "4359d4d9-cf31-4547-ba68-b2ad2e6e0251",
    "text": "Which Nordic island nation sits on both the North American and Eurasian tectonic plates?",
    "options": [
      "Faroe Islands",
      "Greenland",
      "Iceland",
      "Svalbard"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Iceland straddles the Mid-Atlantic Ridge where the North American and Eurasian plates meet.",
    "detailedExplanation": "Iceland sits directly on the Mid-Atlantic Ridge, the divergent boundary between the North American and Eurasian tectonic plates. This unique geological position makes Iceland one of the most volcanically active places on Earth, with the plates separating at a rate of about 2 centimeters per year. The country has over 30 active volcanic systems and is home to geysers, hot springs, and dramatic volcanic landscapes. This geological activity also provides Iceland with abundant geothermal energy, which powers much of the country's heating and electricity needs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iceland",
    "citationTitle": "Wikipedia: Iceland"
  },
  {
    "id": "d4cb4151-52fc-485c-9392-df025e3d7123",
    "text": "Which island nation is the world's smallest republic by both area and population?",
    "options": [
      "Nauru",
      "San Marino",
      "Vatican City",
      "Tuvalu"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Nauru is the world's smallest republic, covering just 21 square kilometers with about 10,800 people.",
    "detailedExplanation": "Nauru, located in the Pacific Ocean, holds the distinction of being the world's smallest republic by both land area (21 square kilometers) and population (approximately 10,800 people). While San Marino and Vatican City are smaller, San Marino is a microstate within Italy and Vatican City is an absolute monarchy, not a republic. Tuvalu is slightly larger than Nauru in area.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nauru",
    "citationTitle": "Wikipedia: Nauru"
  },
  {
    "id": "8a07d8d5-66cb-4b97-b67e-9fae4ce2b9cb",
    "text": "Which island nation consists of 188 coral atolls spread across approximately 90,000 square miles of ocean?",
    "options": [
      "Maldives",
      "Marshall Islands",
      "Kiribati",
      "Seychelles"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "The Marshall Islands consists of 188 coral atolls scattered across about 90,000 square miles of Pacific Ocean.",
    "detailedExplanation": "The Marshall Islands is a nation of 188 coral atolls and islands spread across approximately 90,000 square miles (233,000 square kilometers) of the Pacific Ocean. Despite this vast ocean territory, the total land area is only about 70 square miles. The Maldives has fewer atolls, Kiribati spans an even larger area but has fewer atolls, and the Seychelles consists of granite and coral islands rather than primarily atolls.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marshall_Islands",
    "citationTitle": "Wikipedia: Marshall Islands"
  },
  {
    "id": "66736908-db00-45fb-9e0e-b4897731e8d1",
    "text": "Which Pacific island nation's highest point is only 4 meters (13 feet) above sea level?",
    "options": [
      "Tuvalu",
      "Kiribati",
      "Marshall Islands",
      "Nauru"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Tuvalu's highest point reaches only 4 meters above sea level, making it extremely vulnerable to rising sea levels.",
    "detailedExplanation": "Tuvalu, a Polynesian island nation, has the distinction of having one of the lowest maximum elevations of any country in the world, with its highest point reaching only 4 meters (13 feet) above sea level. This makes Tuvalu particularly vulnerable to the effects of climate change and rising sea levels. The country consists of nine coral atolls and has been at the forefront of climate change discussions due to concerns that it could become uninhabitable within decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tuvalu",
    "citationTitle": "Wikipedia: Tuvalu"
  },
  {
    "id": "38930cb2-418b-43b3-b368-9a18ea3efbde",
    "text": "Which island nation in the Indian Ocean is famous for being home to the extinct dodo bird?",
    "options": [
      "Seychelles",
      "Comoros",
      "Mauritius",
      "Madagascar"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Mauritius was the only home of the dodo bird, which became extinct in the late 17th century.",
    "detailedExplanation": "Mauritius, an island nation in the Indian Ocean, was the sole habitat of the dodo bird (Raphus cucullatus), a flightless bird that became extinct in the late 17th century, likely around 1681. The dodo evolved in isolation on Mauritius with no natural predators, which made it vulnerable when humans arrived and introduced non-native species. The dodo has since become an icon of extinction and appears on Mauritius's coat of arms alongside the Mauritian flying fox.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mauritius",
    "citationTitle": "Wikipedia: Mauritius"
  },
  {
    "id": "29b8d37a-b6e5-41a4-968e-dc0b9e85a8f3",
    "text": "Which European island nation has no standing army and has been neutral since 1815?",
    "options": [
      "Malta",
      "Cyprus",
      "Iceland",
      "Ireland"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Iceland has no standing army and has maintained neutrality since 1815, relying on NATO membership for defense.",
    "detailedExplanation": "Iceland is unique among nations as it has no standing army, navy, or air force, making it one of the few countries in the world without a military. Iceland declared neutrality in 1815 and has maintained this position while adapting to modern realities through NATO membership since 1949. The country relies on the Icelandic Coast Guard for maritime security and NATO allies for defense. This peaceful approach has been possible due to Iceland's geographic isolation and stable political environment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iceland",
    "citationTitle": "Wikipedia: Iceland"
  },
  {
    "id": "7ca971e8-9607-4920-a96d-f12129419bfa",
    "text": "Which Southeast Asian island nation is composed of more than 17,000 islands?",
    "options": [
      "Philippines",
      "Indonesia",
      "Malaysia",
      "Brunei"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Indonesia is an archipelagic nation consisting of more than 17,000 islands, making it the world's largest archipelago.",
    "detailedExplanation": "Indonesia is the world's largest archipelagic state, consisting of more than 17,500 islands stretching across both the Indian and Pacific Oceans. Of these thousands of islands, only about 6,000 are inhabited. The archipelago spans over 3,200 miles from east to west, making it one of the most geographically diverse nations on Earth. While the Philippines also consists of many islands (over 7,000), Indonesia significantly exceeds this number and holds the record as the world's largest archipelago.",
    "citationUrl": "https://en.wikipedia.org/wiki/Indonesia",
    "citationTitle": "Wikipedia: Indonesia"
  },
  {
    "id": "7db0dac9-078c-443c-acb6-619752a6aa66",
    "text": "What is the smallest island nation in the world by land area?",
    "options": [
      "San Marino",
      "Monaco",
      "Nauru",
      "Vatican City"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Nauru is the world's smallest island nation at just 21 square kilometers.",
    "detailedExplanation": "Nauru, located in the central Pacific Ocean, is the world's smallest island nation with an area of just 21 square kilometers (8.1 square miles). While Vatican City and Monaco are smaller by area, they are not island nations - Vatican City is entirely enclosed by Rome, and Monaco is located on the French Riviera. San Marino is also landlocked, situated entirely within Italy. Nauru is a single coral island that was heavily mined for phosphate, which significantly altered its landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nauru",
    "citationTitle": "Wikipedia: Nauru"
  },
  {
    "id": "402c4354-aaad-432c-9d14-7a77aeafae28",
    "text": "Which two large islands make up the majority of New Zealand's landmass?",
    "options": [
      "North Island and South Island",
      "Stewart Island and Chatham Island",
      "Great Barrier Island and Waiheke Island",
      "Auckland Island and Campbell Island"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "New Zealand consists primarily of two main islands: North Island and South Island.",
    "detailedExplanation": "New Zealand is composed of two main landmasses known simply as the North Island and the South Island, separated by the Cook Strait. The South Island is the larger of the two at 150,437 square kilometers, while the North Island covers 113,729 square kilometers. Together, these two islands account for over 99% of New Zealand's total land area. Stewart Island, located south of the South Island, is the third-largest island but is much smaller than the main two islands.",
    "citationUrl": "https://en.wikipedia.org/wiki/New_Zealand",
    "citationTitle": "Wikipedia: New Zealand"
  },
  {
    "id": "b9ee1744-b731-4ed6-8f18-edc046d525b7",
    "text": "Madagascar is located off the coast of which continent?",
    "options": [
      "South America",
      "Asia",
      "Africa",
      "Australia"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Madagascar is located in the Indian Ocean off the eastern coast of Africa.",
    "detailedExplanation": "Madagascar is the world's fourth-largest island, located in the Indian Ocean approximately 400 kilometers (250 miles) off the eastern coast of Africa, separated from the mainland by the Mozambique Channel. Despite its proximity to Africa, Madagascar has been isolated for millions of years, resulting in unique flora and fauna found nowhere else on Earth. The island nation is home to about 5% of the world's plant and animal species, with 80% of them being endemic to Madagascar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Madagascar",
    "citationTitle": "Wikipedia: Madagascar"
  },
  {
    "id": "7b8af9cf-3baa-48a4-a0cc-e4a57b7957f0",
    "text": "Which Caribbean island nation is known for being the birthplace of reggae music?",
    "options": [
      "Barbados",
      "Trinidad and Tobago",
      "Jamaica",
      "Cuba"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Jamaica is widely recognized as the birthplace of reggae music, popularized by artists like Bob Marley.",
    "detailedExplanation": "Jamaica is internationally recognized as the birthplace of reggae music, which emerged in the late 1960s. The genre evolved from earlier Jamaican musical styles including ska and rocksteady, and was heavily influenced by traditional Caribbean music, rhythm and blues, and jazz. Bob Marley, perhaps the most famous reggae artist, helped popularize the genre worldwide in the 1970s. Reggae music is deeply connected to Rastafarian culture and often contains social and political commentary, making it an important cultural export of Jamaica.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reggae",
    "citationTitle": "Wikipedia: Reggae"
  },
  {
    "id": "3e0a8ffe-c86f-4970-befb-e284d10f191d",
    "text": "The Maldives consists of approximately how many coral islands?",
    "options": [
      "200",
      "600",
      "1,200",
      "2,000"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "The Maldives is made up of approximately 1,200 coral islands grouped into 26 atolls.",
    "detailedExplanation": "The Republic of Maldives is a tropical island nation in the Indian Ocean consisting of approximately 1,200 coral islands grouped into 26 natural atolls. Of these islands, only about 200 are inhabited, while around 100 are developed as tourist resorts. The islands are remarkably flat, with the highest point being just 2.4 meters above sea level, making the Maldives one of the lowest-lying countries in the world and particularly vulnerable to sea level rise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maldives",
    "citationTitle": "Wikipedia: Maldives"
  },
  {
    "id": "75ee8319-8cb1-49af-9671-5f20dfcb008b",
    "text": "Which island nation is home to the world's oldest parliament, the Althing, established in 930 AD?",
    "options": [
      "Iceland",
      "Malta",
      "Cyprus",
      "Madagascar"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "medium",
    "explanation": "Iceland's Althing was established in 930 AD and is considered the world's oldest surviving parliament.",
    "detailedExplanation": "The Althing (Alþingi) was established in Iceland in 930 AD at Þingvellir (Thingvellir) and is widely recognized as the world's oldest surviving parliament. This assembly was created by Viking settlers as a general assembly where laws were recited, disputes settled, and important decisions made. While it underwent various changes throughout history, including periods of reduced power under Danish rule, it has maintained its legislative function for over a millennium, making it a remarkable institution in the history of democratic governance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Althing",
    "citationTitle": "Wikipedia: Althing"
  }
]