[
  {
    "id": "8056fbed-8ca6-4dc4-bfb3-a08b9a23988e",
    "text": "Which 19th-century novel was originally published under the pseudonym 'Currer Bell' and features the famous line 'Reader, I married him'?",
    "options": [
      "Wuthering Heights",
      "Jane Eyre",
      "Agnes Grey",
      "The Tenant of Wildfell Hall"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Jane Eyre was published by Charlotte Brontë under the pseudonym 'Currer Bell' in 1847.",
    "detailedExplanation": "Charlotte Brontë published Jane Eyre in 1847 under the masculine pseudonym 'Currer Bell' to avoid the prejudices against female authors of the time. The novel's famous closing line 'Reader, I married him' reflects the direct narrative style that made the book revolutionary for its era, as it presented a strong-willed female protagonist who demanded equality in her relationships.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jane_Eyre",
    "citationTitle": "Wikipedia: Jane Eyre"
  },
  {
    "id": "328f4d8c-5b84-4657-9219-595e9cd07f8a",
    "text": "In Dostoyevsky's 'Crime and Punishment', what is the surname of the protagonist Rodion who commits murder?",
    "options": [
      "Raskolnikov",
      "Karamazov",
      "Oblonsky",
      "Bezukhov"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The protagonist's full name is Rodion Raskolnikov, a former law student who murders an elderly pawnbroker.",
    "detailedExplanation": "Rodion Raskolnikov is the central character of Dostoyevsky's 1866 masterpiece 'Crime and Punishment.' The surname 'Raskolnikov' derives from the Russian word 'raskol,' meaning 'schism' or 'split,' which symbolically represents the psychological division within the character as he struggles with guilt and his theory of extraordinary individuals being above moral law.",
    "citationUrl": "https://en.wikipedia.org/wiki/Crime_and_Punishment",
    "citationTitle": "Wikipedia: Crime and Punishment"
  },
  {
    "id": "d3a9555e-2476-4372-8b41-15ea85f8178c",
    "text": "Which novel by Thomas Hardy caused such controversy upon its publication in 1891 that it was banned by libraries and led Hardy to abandon novel writing?",
    "options": [
      "The Mayor of Casterbridge",
      "Far from the Madding Crowd",
      "Tess of the d'Urbervilles",
      "The Return of the Native"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Tess of the d'Urbervilles was considered scandalous for its frank treatment of sexuality and criticism of Victorian morality.",
    "detailedExplanation": "Thomas Hardy's 'Tess of the d'Urbervilles' (1891) shocked Victorian society with its sympathetic portrayal of a 'fallen woman' and its critique of social and religious hypocrisy. The novel's subtitle 'A Pure Woman' was particularly controversial as it challenged conventional morality by presenting the sexually experienced Tess as morally pure. The harsh critical reception and moral outrage eventually led Hardy to abandon novel writing and focus on poetry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tess_of_the_d%27Urbervilles",
    "citationTitle": "Wikipedia: Tess of the d'Urbervilles"
  },
  {
    "id": "d2c51a5a-5b06-4c26-8864-9c8124ce1765",
    "text": "In Herman Melville's 'Moby-Dick', what is the name of the Pequod's chief mate who opposes Captain Ahab's obsessive quest?",
    "options": [
      "Stubb",
      "Flask",
      "Starbuck",
      "Queequeg"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Starbuck is the rational chief mate who frequently challenges Ahab's dangerous obsession with the white whale.",
    "detailedExplanation": "Starbuck serves as the moral center and voice of reason in 'Moby-Dick' (1851), consistently opposing Captain Ahab's monomaniacal pursuit of the white whale. As the Pequod's first mate, he represents Quaker values and practical seamanship, often pleading with Ahab to abandon the destructive quest. His name was later adopted by the famous coffee chain, founded in Seattle in 1971.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moby-Dick",
    "citationTitle": "Wikipedia: Moby-Dick"
  },
  {
    "id": "7dff4b75-993f-41ef-bcbc-0e1ba00478ad",
    "text": "Which Charles Dickens novel features the character Sydney Carton, who famously declares 'It is a far, far better thing that I do, than I have ever done'?",
    "options": [
      "Great Expectations",
      "A Tale of Two Cities",
      "David Copperfield",
      "Our Mutual Friend"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Sydney Carton speaks these words before sacrificing his life in 'A Tale of Two Cities', set during the French Revolution.",
    "detailedExplanation": "Sydney Carton's sacrifice and final words in 'A Tale of Two Cities' (1859) represent one of literature's most famous acts of redemption. The dissolute barrister takes the place of Charles Darnay at the guillotine, finally finding purpose and meaning in his life through this ultimate act of love and selflessness. The novel, set against the backdrop of the French Revolution, explores themes of resurrection and renewal both personal and social.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Tale_of_Two_Cities",
    "citationTitle": "Wikipedia: A Tale of Two Cities"
  },
  {
    "id": "5228533e-258b-440c-ac26-064fa20e1040",
    "text": "What is the name of the opium den proprietor in Oscar Wilde's 'The Picture of Dorian Gray'?",
    "options": [
      "Mrs. Leaf",
      "Mrs. Vane",
      "Adrian Singleton",
      "There is no named opium den proprietor"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "While Dorian visits opium dens in the novel, Wilde does not name any specific proprietor in the text.",
    "detailedExplanation": "In 'The Picture of Dorian Gray' (1890), Oscar Wilde describes Dorian's visits to opium dens in London's East End as part of his moral degradation, but he deliberately keeps these scenes atmospheric rather than specific. The unnamed proprietors and the shadowy, anonymous nature of these establishments serve Wilde's purpose of showing Dorian's descent into a world of nameless vice and moral decay, reflecting the corruption that remains hidden from his beautiful exterior.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Picture_of_Dorian_Gray",
    "citationTitle": "Wikipedia: The Picture of Dorian Gray"
  },
  {
    "id": "ac1bc2c3-5d75-4a0a-96e4-0cd0ac9dd27a",
    "text": "Which novel by Gustave Flaubert was the subject of an obscenity trial in 1857, the same year as Baudelaire's 'Les Fleurs du mal'?",
    "options": [
      "Salammbô",
      "Sentimental Education",
      "Madame Bovary",
      "Bouvard et Pécuchet"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Madame Bovary was prosecuted for offending public morality and religious values, though Flaubert was ultimately acquitted.",
    "detailedExplanation": "Gustave Flaubert's 'Madame Bovary' (1857) faced an obscenity trial for its realistic portrayal of adultery and its perceived attack on bourgeois values and religious morality. The French government prosecuted both Flaubert and his publisher for 'outrage to public and religious morality.' Although Flaubert was acquitted, the trial brought enormous publicity to the novel and established it as a landmark of literary realism, influencing the development of the modern novel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Madame_Bovary",
    "citationTitle": "Wikipedia: Madame Bovary"
  },
  {
    "id": "12af140a-76bd-4574-a2da-3fc8ea373fcd",
    "text": "In George Eliot's 'Middlemarch', what is the profession of Tertius Lydgate, who marries the materialistic Rosamond Vincy?",
    "options": [
      "Lawyer",
      "Doctor",
      "Clergyman",
      "Banker"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Tertius Lydgate is a young, idealistic doctor who comes to Middlemarch with plans for medical reform.",
    "detailedExplanation": "Dr. Tertius Lydgate in 'Middlemarch' (1871-72) represents the new scientific approach to medicine in the 1830s setting of George Eliot's novel. His ambition to advance medical knowledge and establish a fever hospital conflicts with the conservative medical establishment and his wife Rosamond's expensive tastes. Lydgate's story illustrates one of the novel's central themes: how personal circumstances and social pressures can thwart idealistic ambitions and lead to moral compromise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Middlemarch",
    "citationTitle": "Wikipedia: Middlemarch"
  },
  {
    "id": "5a128730-780b-4b9f-8bb2-e179567879fd",
    "text": "In Leo Tolstoy's 'Anna Karenina', what is the opening line that has become one of the most famous first sentences in literature?",
    "options": [
      "Happy families are all alike; every unhappy family is unhappy in its own way",
      "It was the best of times, it was the worst of times",
      "All children, except one, grow up",
      "In a hole in the ground there lived a hobbit"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "This famous opening line from 'Anna Karenina' sets the philosophical tone for Tolstoy's exploration of family dynamics.",
    "detailedExplanation": "Leo Tolstoy's 'Anna Karenina' (1878) opens with this iconic line that immediately establishes the novel's central preoccupation with the nature of happiness and family relationships. The sentence serves as a philosophical framework for the parallel stories of Anna's tragic affair and Levin's search for meaning, suggesting that while contentment follows similar patterns, each form of suffering is unique and complex.",
    "citationUrl": "https://en.wikipedia.org/wiki/Anna_Karenina",
    "citationTitle": "Wikipedia: Anna Karenina"
  },
  {
    "id": "4fefb89f-dbf9-4d03-8624-2d0a2b402daf",
    "text": "Which Brontë sister wrote 'The Tenant of Wildfell Hall', a novel that shocked Victorian society with its depiction of alcoholism and domestic abuse?",
    "options": [
      "Charlotte Brontë",
      "Emily Brontë",
      "Anne Brontë",
      "Branwell Brontë"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Anne Brontë wrote this controversial novel, drawing from her experiences with her brother Branwell's alcoholism.",
    "detailedExplanation": "Anne Brontë's 'The Tenant of Wildfell Hall' (1848) was her second and final novel, considered even more radical than 'Agnes Grey'. The book's frank treatment of alcoholism, domestic violence, and a woman's right to leave an abusive marriage was so controversial that Charlotte Brontë later suppressed its republication after Anne's death. Anne drew heavily from her personal experience watching her brother Branwell's descent into alcoholism and drug addiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Tenant_of_Wildfell_Hall",
    "citationTitle": "Wikipedia: The Tenant of Wildfell Hall"
  },
  {
    "id": "ce2dbf25-c7e3-4314-a85a-f7e81b77f552",
    "text": "In Mary Shelley's 'Frankenstein', what is the name of Victor Frankenstein's best friend who is murdered by the creature?",
    "options": [
      "Henry Clerval",
      "Alphonse Frankenstein",
      "Robert Walton",
      "William Frankenstein"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Henry Clerval, Victor's childhood friend and companion at university, becomes one of the creature's victims.",
    "detailedExplanation": "Henry Clerval serves as Victor Frankenstein's loyal friend and moral compass throughout much of Mary Shelley's 'Frankenstein' (1818). A student of languages and poetry, Clerval represents the humanitarian ideals that Victor abandons in his obsessive pursuit of scientific knowledge. The creature murders Clerval as part of his systematic revenge against Victor, strangling him and leaving the body for Victor to discover, further emphasizing the tragic consequences of Victor's hubris.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frankenstein",
    "citationTitle": "Wikipedia: Frankenstein"
  },
  {
    "id": "4b587216-e6f8-4672-b8e1-2ff18571b7cf",
    "text": "Which American author wrote 'The Scarlet Letter', featuring Hester Prynne and her daughter Pearl in Puritan New England?",
    "options": [
      "Herman Melville",
      "Nathaniel Hawthorne",
      "Washington Irving",
      "Edgar Allan Poe"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Nathaniel Hawthorne wrote this classic exploration of sin, guilt, and redemption in Puritan society.",
    "detailedExplanation": "Nathaniel Hawthorne's 'The Scarlet Letter' (1850) is considered one of the masterpieces of American literature and a key work of the American Renaissance. Set in 17th-century Boston, the novel explores themes of sin, legalism, and guilt through the story of Hester Prynne, who bears a child out of wedlock and is forced to wear a scarlet 'A' as punishment. Hawthorne's psychological depth and symbolic complexity helped establish a distinctly American literary voice separate from European influences.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Scarlet_Letter",
    "citationTitle": "Wikipedia: The Scarlet Letter"
  },
  {
    "id": "6b14bb38-e5af-44ba-bfad-3a6526b8012f",
    "text": "In Jane Austen's 'Persuasion', what is the name of the naval captain who persuades Anne Elliot to break off her earlier engagement?",
    "options": [
      "Captain Harville",
      "Captain Benwick",
      "Captain Wentworth",
      "Admiral Croft"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Captain Wentworth is Anne's former fiancé who returns wealthy and successful, leading to their eventual reconciliation.",
    "detailedExplanation": "'Persuasion' (1817), Jane Austen's final completed novel, tells the story of Anne Elliot's second chance at love with Captain Frederick Wentworth. Eight years before the novel's events, Anne was persuaded by her godmother Lady Russell to break off her engagement to the then-poor naval officer. When Wentworth returns as a wealthy and successful captain, their renewed courtship explores themes of second chances, social mobility, and the nature of true persuasion versus manipulation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Persuasion_(novel)",
    "citationTitle": "Wikipedia: Persuasion (novel)"
  },
  {
    "id": "a5b62521-e822-44a1-8224-7b34d68066bf",
    "text": "Which Russian author wrote 'Dead Souls', a satirical novel about a man who travels around buying the names of deceased serfs?",
    "options": [
      "Ivan Turgenev",
      "Nikolai Gogol",
      "Anton Chekhov",
      "Alexander Pushkin"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Nikolai Gogol wrote this satirical masterpiece critiquing Russian serfdom and bureaucracy.",
    "detailedExplanation": "Nikolai Gogol's 'Dead Souls' (1842) follows Pavel Chichikov, a mysterious gentleman who travels through rural Russia purchasing the legal rights to deceased serfs (who remained on tax rolls until the next census). Gogol intended this darkly comic novel as the first part of a trilogy comparable to Dante's 'Divine Comedy,' with this volume representing the 'Inferno' of Russian society. The work provides a scathing satire of Russian serfdom, provincial life, and bureaucratic corruption in the pre-reform era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dead_Souls",
    "citationTitle": "Wikipedia: Dead Souls"
  },
  {
    "id": "47065a10-1550-4c6f-b4ea-f85580c77044",
    "text": "In George Eliot's 'Silas Marner', what causes the weaver to lose his faith and become a recluse before the main events of the novel?",
    "options": [
      "The death of his wife in childbirth",
      "Being falsely accused of theft by his best friend",
      "Losing his fortune in a failed business venture",
      "Being rejected by the woman he loved"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Silas was betrayed by his friend William Dane, who framed him for stealing church money and stole his fiancée.",
    "detailedExplanation": "In George Eliot's 'Silas Marner' (1861), the protagonist's tragic backstory reveals how he was framed for theft by his supposed best friend William Dane in their strict religious community. When lots are drawn to determine God's judgment of Silas's guilt, they declare him guilty, causing him to lose his faith entirely. Adding to his betrayal, William Dane also marries Silas's former fiancée Sarah. This devastating combination of religious disillusionment and personal betrayal drives Silas to his hermit-like existence as a weaver in Raveloe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Silas_Marner",
    "citationTitle": "Wikipedia: Silas Marner"
  },
  {
    "id": "262adb49-8701-4df5-b75d-f16073855bfa",
    "text": "Which novel by Alexandre Dumas features the character Edmond Dantès, who escapes from the Château d'If after fourteen years of imprisonment?",
    "options": [
      "The Three Musketeers",
      "Twenty Years After",
      "The Count of Monte Cristo",
      "The Man in the Iron Mask"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Edmond Dantès is the protagonist of 'The Count of Monte Cristo,' who seeks elaborate revenge after his wrongful imprisonment.",
    "detailedExplanation": "Alexandre Dumas's 'The Count of Monte Cristo' (1844-1846) follows Edmond Dantès, a young sailor who is falsely accused of treason and imprisoned in the fortress of Château d'If. After fourteen years, he escapes with the help of a fellow prisoner who has told him of a great treasure. Dantès uses this wealth to reinvent himself as the mysterious Count of Monte Cristo and systematically seeks revenge against those who betrayed him. The novel is considered one of the greatest adventure stories ever written and explores themes of justice, mercy, and the corrupting nature of revenge.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Count_of_Monte_Cristo",
    "citationTitle": "Wikipedia: The Count of Monte Cristo"
  },
  {
    "id": "a33f7120-2a75-4c85-8c4d-7ad9521798fd",
    "text": "In Emily Brontë's 'Wuthering Heights', what is the name of the narrator who tells most of the story to Mr. Lockwood?",
    "options": [
      "Ellen Dean",
      "Catherine Earnshaw",
      "Isabella Linton",
      "Frances Earnshaw"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Ellen Dean (Nelly) serves as the primary narrator who recounts the tumultuous history of Wuthering Heights to the tenant Mr. Lockwood.",
    "detailedExplanation": "Ellen Dean, known as Nelly, is the housekeeper who serves as the main storyteller in Emily Brontë's 'Wuthering Heights'. Through her narration to Mr. Lockwood, the reader learns the complex history of the Earnshaw and Linton families. Her role as both servant and confidante gives her unique insight into the passionate and destructive relationship between Heathcliff and Catherine, making her an essential narrative device in this Gothic novel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wuthering_Heights",
    "citationTitle": "Wikipedia: Wuthering Heights"
  },
  {
    "id": "51459a18-92ed-40ed-9b19-4e2c520e074b",
    "text": "Which 19th-century novel begins with the protagonist receiving a mysterious letter signed 'A Friend' while living in lodgings at Blackfriars?",
    "options": [
      "The Moonstone",
      "Bleak House",
      "The Strange Case of Dr. Jekyll and Mr. Hyde",
      "The Turn of the Screw"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Wilkie Collins' 'The Moonstone' opens with Franklin Blake receiving the anonymous letter that sets the mystery in motion.",
    "detailedExplanation": "Wilkie Collins' 'The Moonstone' (1868) is considered one of the first English detective novels. The story begins when Franklin Blake receives a mysterious letter signed 'A Friend' while staying in lodgings, which leads him to investigate the theft of the valuable Moonstone diamond. This opening sets up the complex mystery that unfolds through multiple narrators, establishing Collins as a master of the sensation novel genre that was popular in Victorian literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Moonstone",
    "citationTitle": "Wikipedia: The Moonstone"
  },
  {
    "id": "a6bb9ec1-6929-4543-a66c-3f3c76091fcf",
    "text": "In Honoré de Balzac's 'Père Goriot', what is the name of the ambitious young law student who becomes corrupted by Parisian society?",
    "options": [
      "Eugène de Rastignac",
      "Lucien de Rubempré",
      "Horace Bianchon",
      "Henri de Marsay"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Eugène de Rastignac is the central character whose moral decline parallels the tragic fate of Père Goriot in Balzac's novel.",
    "detailedExplanation": "Eugène de Rastignac is the protagonist of Balzac's 'Père Goriot' (1835), one of the key novels in his vast 'Human Comedy' series. Initially an idealistic law student from the provinces, Rastignac becomes increasingly ambitious and morally compromised as he navigates the corrupt world of Parisian high society. His character arc represents Balzac's critique of post-revolutionary French society, where money and social climbing have replaced traditional values. Rastignac appears in multiple novels throughout Balzac's work, serving as a recurring figure in the author's interconnected literary universe.",
    "citationUrl": "https://en.wikipedia.org/wiki/P%C3%A8re_Goriot",
    "citationTitle": "Wikipedia: Père Goriot"
  },
  {
    "id": "19df2dbe-83b5-40e8-9579-b3548c656155",
    "text": "Which American author's only completed novel features the character Bartleby, who repeatedly responds with 'I would prefer not to'?",
    "options": [
      "Herman Melville",
      "Edgar Allan Poe",
      "Washington Irving",
      "James Fenimore Cooper"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "'Bartleby, the Scrivener' is actually a short story by Herman Melville, but the question refers to his novel-writing career and his famous character's catchphrase.",
    "detailedExplanation": "While Herman Melville wrote several novels including 'Moby-Dick' and 'Pierre', the character Bartleby appears in his famous short story 'Bartleby, the Scrivener: A Story of Wall Street' (1853). Bartleby's passive resistance expressed through his repeated phrase 'I would prefer not to' has become one of the most famous examples of civil disobedience in American literature. The story, set in a Wall Street law office, explores themes of alienation, capitalism, and individual agency in modern society, and has been widely interpreted as a critique of dehumanizing work conditions in industrial America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bartleby,_the_Scrivener",
    "citationTitle": "Wikipedia: Bartleby, the Scrivener"
  }
]