[
  {
    "id": "3e3e8914-b41a-454d-8d92-7316c2d258f6",
    "text": "Which 19th century novel begins with the famous line 'It was the best of times, it was the worst of times'?",
    "options": [
      "Great Expectations",
      "A Tale of Two Cities",
      "Oliver Twist",
      "Hard Times"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "A Tale of Two Cities by Charles Dickens opens with this iconic contrasting statement.",
    "detailedExplanation": "Charles Dickens' 1859 novel 'A Tale of Two Cities' opens with one of the most recognizable opening lines in English literature: 'It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness...' The novel is set against the backdrop of the French Revolution and explores themes of resurrection, sacrifice, and social upheaval through the parallel cities of London and Paris.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Tale_of_Two_Cities",
    "citationTitle": "Wikipedia: A Tale of Two Cities"
  },
  {
    "id": "f92a6023-8403-4154-a858-d3a554b76b75",
    "text": "In Charlotte Brontë's 'Jane Eyre', what is the name of Mr. Rochester's estate where Jane works as a governess?",
    "options": [
      "Wuthering Heights",
      "Thornfield Hall",
      "Pemberley",
      "Manderley"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Thornfield Hall is the Gothic mansion where Jane Eyre serves as governess to Adèle Varens.",
    "detailedExplanation": "Thornfield Hall serves as the primary setting for much of Charlotte Brontë's 1847 novel 'Jane Eyre'. This imposing country estate, owned by the brooding Edward Rochester, becomes central to the story's Gothic atmosphere. It's here that Jane works as a governess to Rochester's ward Adèle, and where the mysterious laughter from the third floor and the dramatic fire that nearly kills Rochester add to the novel's suspenseful elements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jane_Eyre",
    "citationTitle": "Wikipedia: Jane Eyre"
  },
  {
    "id": "c0ad8aad-62d1-4910-a145-9a9a7de22071",
    "text": "Which Russian author wrote 'Crime and Punishment', published in 1866?",
    "options": [
      "Leo Tolstoy",
      "Fyodor Dostoevsky",
      "Ivan Turgenev",
      "Anton Chekhov"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Fyodor Dostoevsky wrote this psychological thriller about Raskolnikov's moral crisis after committing murder.",
    "detailedExplanation": "Fyodor Dostoevsky's 'Crime and Punishment' (1866) is considered one of the greatest psychological novels ever written. The story follows Rodion Raskolnikov, a former law student in St. Petersburg who murders an elderly pawnbroker, believing himself above conventional morality. The novel explores themes of guilt, redemption, and the psychological torment that follows Raskolnikov's crime, establishing Dostoevsky as a master of psychological realism.",
    "citationUrl": "https://en.wikipedia.org/wiki/Crime_and_Punishment",
    "citationTitle": "Wikipedia: Crime and Punishment"
  },
  {
    "id": "01c7613e-c154-4194-80fd-9d6c0f0be728",
    "text": "In Herman Melville's 'Moby Dick', what is the name of the narrator who begins the story with 'Call me...'?",
    "options": [
      "Ahab",
      "Queequeg",
      "Ishmael",
      "Starbuck"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ishmael is the narrator who famously begins the novel with 'Call me Ishmael.'",
    "detailedExplanation": "Herman Melville's 1851 masterpiece 'Moby-Dick' opens with one of literature's most famous introductions: 'Call me Ishmael.' Ishmael serves as both narrator and participant in the story, recounting his voyage aboard the Pequod under Captain Ahab's obsessive quest to hunt the white whale. As the sole survivor of the ship's destruction, Ishmael is able to tell the tale of Ahab's monomaniacal pursuit and its tragic consequences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moby-Dick",
    "citationTitle": "Wikipedia: Moby-Dick"
  },
  {
    "id": "5041f634-44bf-423d-83bf-4ae8d355abfa",
    "text": "Which Jane Austen novel features the proud Mr. Darcy and the prejudiced Elizabeth Bennet?",
    "options": [
      "Sense and Sensibility",
      "Emma",
      "Mansfield Park",
      "Pride and Prejudice"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Pride and Prejudice follows the romantic relationship between Elizabeth Bennet and Mr. Darcy.",
    "detailedExplanation": "Jane Austen's 1813 novel 'Pride and Prejudice' centers on the complex relationship between Elizabeth Bennet, a spirited young woman from a middle-class family, and Fitzwilliam Darcy, a wealthy and seemingly arrogant landowner. The novel's title reflects the main character flaws that both protagonists must overcome - Darcy's pride in his social position and Elizabeth's prejudice against him based on first impressions. Their eventual romance represents one of literature's most beloved love stories.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pride_and_Prejudice",
    "citationTitle": "Wikipedia: Pride and Prejudice"
  },
  {
    "id": "f1b6f836-f477-4ab1-947c-7e4464049928",
    "text": "In Victor Hugo's 'Les Misérables', what is the name of the protagonist who steals bread to feed his sister's children?",
    "options": [
      "Javert",
      "Marius",
      "Jean Valjean",
      "Enjolras"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jean Valjean is imprisoned for stealing bread and becomes the novel's central character seeking redemption.",
    "detailedExplanation": "Victor Hugo's 1862 epic 'Les Misérables' follows Jean Valjean, who serves 19 years in prison for stealing a loaf of bread to feed his sister's starving children. After his release, Valjean struggles to rebuild his life while being pursued by the relentless police inspector Javert. The novel explores themes of justice, mercy, and social inequality in post-revolutionary France, with Valjean's journey from criminal to saint serving as the moral center of Hugo's sprawling narrative.",
    "citationUrl": "https://en.wikipedia.org/wiki/Les_Mis%C3%A9rables",
    "citationTitle": "Wikipedia: Les Misérables"
  },
  {
    "id": "732d18c3-542e-46df-8ec9-311648e1d622",
    "text": "Which Thomas Hardy novel tells the story of Tess Durbeyfield and her tragic fate?",
    "options": [
      "The Mayor of Casterbridge",
      "Far from the Madding Crowd",
      "Tess of the d'Urbervilles",
      "Jude the Obscure"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Tess of the d'Urbervilles chronicles the tragic life of Tess Durbeyfield in Victorian England.",
    "detailedExplanation": "Thomas Hardy's 1891 novel 'Tess of the d'Urbervilles' follows the tragic story of Tess Durbeyfield, a young peasant woman whose family discovers they are descendants of the noble d'Urberville line. The novel traces Tess's downfall after she is seduced by Alec d'Urberville and later abandoned by her true love Angel Clare when he learns of her past. Hardy's portrayal of Tess as 'a pure woman' despite her circumstances was controversial for its time and criticized Victorian double standards regarding female sexuality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tess_of_the_d%27Urbervilles",
    "citationTitle": "Wikipedia: Tess of the d'Urbervilles"
  },
  {
    "id": "1d3bc0df-7b66-4dde-81d2-0ef14878294b",
    "text": "In Mary Shelley's 'Frankenstein', what is the first name of Dr. Frankenstein?",
    "options": [
      "Henry",
      "Victor",
      "Robert",
      "William"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Victor Frankenstein is the scientist who creates the monster in Mary Shelley's Gothic novel.",
    "detailedExplanation": "Mary Shelley's 1818 novel 'Frankenstein; or, The Modern Prometheus' features Victor Frankenstein as the ambitious young scientist who discovers the secret of creating life. Written when Shelley was just 18 years old, the novel explores the dangerous consequences of unchecked scientific ambition through Victor's creation of his monster. The story is often considered one of the first works of science fiction and remains a powerful allegory about the responsibility creators bear for their creations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frankenstein",
    "citationTitle": "Wikipedia: Frankenstein"
  },
  {
    "id": "390ce4f9-1883-47de-bc6a-8c403894401d",
    "text": "Which 19th century novel features the character Heathcliff and is set on the Yorkshire moors?",
    "options": [
      "Wuthering Heights",
      "Middlemarch",
      "The Mill on the Floss",
      "North and South"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Wuthering Heights by Emily Brontë features the dark, passionate character Heathcliff.",
    "detailedExplanation": "Published in 1847, Wuthering Heights is Emily Brontë's only novel and tells the story of the passionate and destructive love between Heathcliff and Catherine Earnshaw. Set in the isolated Yorkshire moors, the novel explores themes of revenge, love, and social class through its complex narrative structure and memorable characters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wuthering_Heights",
    "citationTitle": "Wikipedia: Wuthering Heights"
  },
  {
    "id": "cf8a1b84-c10d-4dae-80d3-a2331598682b",
    "text": "In which Charles Dickens novel does the character Miss Havisham appear, wearing her wedding dress decades after being jilted?",
    "options": [
      "Oliver Twist",
      "Great Expectations",
      "David Copperfield",
      "Bleak House"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Miss Havisham is a central character in Great Expectations, known for her decaying wedding dress.",
    "detailedExplanation": "Great Expectations, published in 1861, features the eccentric and bitter Miss Havisham who stopped all her clocks and continued wearing her wedding dress after being abandoned at the altar. She adopts Estella and uses her to break men's hearts as revenge. The novel follows Pip's journey from blacksmith's apprentice to gentleman.",
    "citationUrl": "https://en.wikipedia.org/wiki/Great_Expectations",
    "citationTitle": "Wikipedia: Great Expectations"
  },
  {
    "id": "b5f936e1-c290-4862-b321-c47b1fdc60bc",
    "text": "Which Leo Tolstoy novel opens with the famous line 'Happy families are all alike; every unhappy family is unhappy in its own way'?",
    "options": [
      "War and Peace",
      "Anna Karenina",
      "The Death of Ivan Ilyich",
      "Resurrection"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Anna Karenina begins with this famous observation about families.",
    "detailedExplanation": "Published between 1875-1877, Anna Karenina opens with one of literature's most quoted lines. The novel follows the parallel stories of Anna Karenina's tragic affair and Konstantin Levin's search for meaning in life. Tolstoy uses these contrasting narratives to explore themes of love, faith, society, and family in 19th century Russian aristocratic society.",
    "citationUrl": "https://en.wikipedia.org/wiki/Anna_Karenina",
    "citationTitle": "Wikipedia: Anna Karenina"
  },
  {
    "id": "5df84369-e426-41bd-ab1e-3737d56ca303",
    "text": "In which George Eliot novel does the character Silas Marner appear as a miserly weaver who finds redemption through caring for an abandoned child?",
    "options": [
      "Middlemarch",
      "Adam Bede",
      "Silas Marner",
      "The Mill on the Floss"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Silas Marner is both the title character and the novel's name.",
    "detailedExplanation": "Published in 1861, Silas Marner tells the story of a lonely weaver who becomes obsessed with hoarding gold after being falsely accused of theft and expelled from his religious community. When his gold is stolen and he finds the abandoned child Eppie, his care for her transforms him from a miserly recluse into a loving father figure, illustrating themes of redemption and community.",
    "citationUrl": "https://en.wikipedia.org/wiki/Silas_Marner",
    "citationTitle": "Wikipedia: Silas Marner"
  },
  {
    "id": "515b9941-be57-4d2d-91cd-a05e4cdf96b7",
    "text": "Which American author wrote 'The Scarlet Letter', a novel about Hester Prynne and her public shame in Puritan New England?",
    "options": [
      "Herman Melville",
      "Nathaniel Hawthorne",
      "Washington Irving",
      "Edgar Allan Poe"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Nathaniel Hawthorne wrote The Scarlet Letter in 1850.",
    "detailedExplanation": "Published in 1850, The Scarlet Letter is Nathaniel Hawthorne's masterpiece exploring themes of sin, guilt, and redemption in 17th century Puritan Boston. The novel follows Hester Prynne, who must wear a scarlet 'A' as punishment for adultery, while the identity of her lover and the father of her child remains hidden, creating a psychological drama about public shame and private guilt.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Scarlet_Letter",
    "citationTitle": "Wikipedia: The Scarlet Letter"
  },
  {
    "id": "441ccf18-2e5d-4c49-8733-0525b4ea5273",
    "text": "In Bram Stoker's 'Dracula', what is the name of the young solicitor who travels to Transylvania at the beginning of the novel?",
    "options": [
      "Arthur Holmwood",
      "Quincey Morris",
      "Jonathan Harker",
      "John Seward"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jonathan Harker is the solicitor who first encounters Count Dracula in his castle.",
    "detailedExplanation": "Published in 1897, Dracula begins with Jonathan Harker's journey to Castle Dracula to assist the Count with a real estate transaction in London. Harker becomes Dracula's prisoner and first victim, and his journal entries form part of the novel's epistolary structure. His wife Mina later becomes central to the vampire hunters' efforts to defeat Dracula.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dracula",
    "citationTitle": "Wikipedia: Dracula"
  },
  {
    "id": "fa7d839a-c6d6-4b8b-a883-20fdb1c25b52",
    "text": "Which novel by Alexandre Dumas features the motto 'All for one, and one for all'?",
    "options": [
      "The Count of Monte Cristo",
      "The Three Musketeers",
      "The Man in the Iron Mask",
      "Twenty Years After"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Three Musketeers features this famous motto of Athos, Porthos, Aramis, and D'Artagnan.",
    "detailedExplanation": "Published in 1844, The Three Musketeers follows young D'Artagnan as he joins the legendary musketeers Athos, Porthos, and Aramis in 17th century France. Their motto 'All for one, and one for all' represents their bond of friendship and loyalty. The novel combines historical fiction with adventure, romance, and political intrigue during the reign of Louis XIII.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Three_Musketeers",
    "citationTitle": "Wikipedia: The Three Musketeers"
  },
  {
    "id": "cdfff270-0261-4b11-af8b-60ee7ca92de6",
    "text": "In Charles Dickens' 'Oliver Twist', what is the name of the criminal gang leader who trains children to pick pockets?",
    "options": [
      "Bill Sikes",
      "Fagin",
      "Artful Dodger",
      "Bumble"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Fagin is the leader of the gang of child pickpockets who takes in Oliver Twist.",
    "detailedExplanation": "Fagin is one of Dickens' most memorable villains in 'Oliver Twist' (1838). He runs a gang of child thieves in London, including the Artful Dodger, and initially appears to be kind to Oliver before revealing his criminal nature. The character represents the exploitation of children in Victorian society and has become an iconic figure in English literature, though modern interpretations have noted problematic antisemitic stereotypes in Dickens' original portrayal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fagin",
    "citationTitle": "Wikipedia: Fagin"
  },
  {
    "id": "03b8272d-c7a1-42c0-9660-d096ca947d46",
    "text": "Which 19th century novel features a character who gradually transforms from a miser obsessed with gold into a loving father figure after finding a golden-haired child?",
    "options": [
      "Middlemarch",
      "Silas Marner",
      "The Mill on the Floss",
      "Adam Bede"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Silas Marner undergoes this transformation when he finds and raises the abandoned child Eppie.",
    "detailedExplanation": "In George Eliot's 'Silas Marner' (1861), the titular character is a lonely weaver who hoards gold coins until they are stolen. His life changes when he discovers a golden-haired toddler, Eppie, near his cottage and decides to raise her as his own daughter. Through caring for Eppie, Silas rediscovers his humanity and capacity for love, making it a story of redemption and the transformative power of human connection.",
    "citationUrl": "https://en.wikipedia.org/wiki/Silas_Marner",
    "citationTitle": "Wikipedia: Silas Marner"
  },
  {
    "id": "855389dc-ec19-4302-9f25-518f7414378e",
    "text": "In Emily Dickinson's contemporary Louisa May Alcott's 'Little Women', which March sister is known for her fiery temper and ambition to become a writer?",
    "options": [
      "Meg",
      "Jo",
      "Beth",
      "Amy"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Jo March is the tomboyish, ambitious writer of the four sisters with a notable temper.",
    "detailedExplanation": "Josephine 'Jo' March is the second eldest of the March sisters in Louisa May Alcott's 'Little Women' (1868). She is characterized by her boyish nature, quick temper, and strong desire to become a successful writer. Jo serves as a semi-autobiographical representation of Alcott herself, and her struggles to balance her artistic ambitions with societal expectations for women make her one of the most memorable characters in 19th-century American literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jo_March",
    "citationTitle": "Wikipedia: Jo March"
  },
  {
    "id": "fc9866fe-9eb8-437d-8c38-f3c2889f6990",
    "text": "Which author wrote 'The Turn of the Screw', a famous ghost story about a governess who may or may not be seeing supernatural apparitions?",
    "options": [
      "Henry James",
      "Oscar Wilde",
      "Robert Louis Stevenson",
      "Arthur Conan Doyle"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Henry James wrote this ambiguous ghost story that leaves readers uncertain about the reality of the supernatural events.",
    "detailedExplanation": "'The Turn of the Screw' (1898) is one of Henry James' most famous works, a psychological horror novella that has puzzled readers and critics for over a century. The story follows an unnamed governess who claims to see the ghosts of former employees at a remote estate while caring for two children. James deliberately crafted the narrative to be ambiguous, leaving it unclear whether the ghosts are real or products of the governess's troubled mind, making it a masterpiece of psychological ambiguity.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Turn_of_the_Screw",
    "citationTitle": "Wikipedia: The Turn of the Screw"
  },
  {
    "id": "f3bbc854-5ea8-4839-b980-f31aa6920e8a",
    "text": "In Gustave Flaubert's 'Madame Bovary', what is the first name of the title character who becomes disillusioned with her provincial life?",
    "options": [
      "Emma",
      "Anna",
      "Mathilde",
      "Berthe"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Emma Bovary is the protagonist whose romantic fantasies and materialism lead to her downfall.",
    "detailedExplanation": "Emma Bovary is the central character of Gustave Flaubert's groundbreaking novel 'Madame Bovary' (1857). Married to a country doctor, Emma becomes increasingly dissatisfied with her mundane provincial life and seeks escape through romantic affairs and extravagant spending. The novel was revolutionary for its realistic portrayal of bourgeois life and its psychological depth, though it initially caused scandal and led to Flaubert being prosecuted for obscenity. Emma's character has become synonymous with romantic idealism clashing with harsh reality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Emma_Bovary",
    "citationTitle": "Wikipedia: Emma Bovary"
  }
]