[
  {
    "id": "e29d2392-a711-45b9-b9fa-68c501f87f02",
    "text": "Which NHL player holds the record for most penalty minutes in a single season with 472 minutes?",
    "options": [
      "Dave Schultz",
      "Marty McSorley",
      "Tiger Williams",
      "Bob Probert"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Dave Schultz set the NHL record with 472 penalty minutes during the 1974-75 season.",
    "detailedExplanation": "Dave 'The Hammer' Schultz of the Philadelphia Flyers established the NHL single-season penalty minutes record with 472 minutes during the 1974-75 season. This record was set during the era of the 'Broad Street Bullies' when the Flyers were known for their physical, intimidating style of play. Schultz was the enforcer on those Stanley Cup-winning teams and his penalty minute record still stands today, making it one of the most unbreakable records in professional sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dave_Schultz_(ice_hockey)",
    "citationTitle": "Wikipedia: Dave Schultz (ice hockey)"
  },
  {
    "id": "5c9493ec-deef-42c7-9c8b-3f8c790a8f22",
    "text": "What is the name of the trophy awarded to the NHL's best defensive forward?",
    "options": [
      "Lady Byng Memorial Trophy",
      "Frank J. Selke Trophy",
      "James Norris Memorial Trophy",
      "William M. Jennings Trophy"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Frank J. Selke Trophy is awarded annually to the NHL forward who best excels in the defensive aspects of the game.",
    "detailedExplanation": "The Frank J. Selke Trophy has been awarded annually since the 1977-78 season to the forward who demonstrates the most skill in the defensive component of the game. Named after Frank J. Selke, a longtime general manager and front office executive, the trophy recognizes forwards who excel at penalty killing, checking, and other defensive responsibilities while still contributing offensively. Notable winners include Bob Gainey, who won the first four awards, and Patrice Bergeron, who has won it a record five times.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frank_J._Selke_Trophy",
    "citationTitle": "Wikipedia: Frank J. Selke Trophy"
  },
  {
    "id": "bef33d11-156e-4371-b0cc-153f72612ae8",
    "text": "Which team was the last to join the NHL's 'Original Six' era before expansion in 1967?",
    "options": [
      "New York Rangers",
      "Chicago Blackhawks",
      "Detroit Red Wings",
      "Boston Bruins"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The New York Rangers joined in 1926, making them the last team to complete the Original Six lineup.",
    "detailedExplanation": "The New York Rangers were the final team to join what would become known as the 'Original Six,' entering the NHL in the 1926-27 season. The Original Six consisted of the Boston Bruins (1924), Montreal Canadiens (1917), Toronto Maple Leafs (1917, originally as Toronto Arenas), Detroit Red Wings (1926), Chicago Blackhawks (1926), and the Rangers. These six teams comprised the entire NHL from 1942 until the league's first major expansion in 1967, when six new teams were added, doubling the league's size.",
    "citationUrl": "https://en.wikipedia.org/wiki/Original_Six",
    "citationTitle": "Wikipedia: Original Six"
  },
  {
    "id": "5965947c-ac38-460f-bcd8-42533bd1d537",
    "text": "Who was the first European-born player to be selected first overall in the NHL Entry Draft?",
    "options": [
      "Mats Sundin",
      "Alexander Ovechkin",
      "Ilya Kovalchuk",
      "Alexei Yashin"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Mats Sundin from Sweden was selected first overall by the Quebec Nordiques in 1989.",
    "detailedExplanation": "Mats Sundin became the first European-born player to be selected first overall in the NHL Entry Draft when the Quebec Nordiques chose him in 1989. The Swedish center had an outstanding junior career and was considered a can't-miss prospect. This selection marked a significant shift in NHL thinking, as European players were previously viewed with skepticism by many North American teams. Sundin went on to have a Hall of Fame career, playing 18 NHL seasons and becoming the Toronto Maple Leafs' all-time leading scorer.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mats_Sundin",
    "citationTitle": "Wikipedia: Mats Sundin"
  },
  {
    "id": "af98bb27-5a9b-40a5-9eb8-9570445e02b3",
    "text": "Which NHL team holds the record for the longest winning streak in league history?",
    "options": [
      "Pittsburgh Penguins",
      "Montreal Canadiens",
      "New York Islanders",
      "Philadelphia Flyers"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Pittsburgh Penguins won 17 consecutive games during the 1992-93 season.",
    "detailedExplanation": "The Pittsburgh Penguins set the NHL record for consecutive wins with 17 straight victories during the 1992-93 season, from March 9 to April 10, 1993. This streak occurred during Mario Lemieux's remarkable comeback season after missing two months due to Hodgkin's lymphoma treatment. The team was loaded with talent including Lemieux, Jaromir Jagr, Ron Francis, and Kevin Stevens. The streak helped propel them to first place in their division, though they would ultimately fall short of repeating as Stanley Cup champions.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_NHL_records_(team)",
    "citationTitle": "Wikipedia: List of NHL records (team)"
  },
  {
    "id": "01e9d3d9-aeb7-45db-922d-d0a572dba9fb",
    "text": "What is the maximum length of a major penalty in hockey?",
    "options": [
      "2 minutes",
      "5 minutes",
      "10 minutes",
      "Game misconduct"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "A major penalty is 5 minutes in length and the player serves the full time regardless of goals scored.",
    "detailedExplanation": "Major penalties in the NHL are always 5 minutes in length, unlike minor penalties which can end early if the opposing team scores a power-play goal. Major penalties are assessed for more serious infractions such as fighting, checking from behind, boarding, or spearing. The penalized player must serve the entire 5 minutes in the penalty box, and their team plays short-handed for the full duration. Major penalties can also be accompanied by additional penalties such as game misconducts or match penalties for the most severe infractions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Penalty_(ice_hockey)",
    "citationTitle": "Wikipedia: Penalty (ice hockey)"
  },
  {
    "id": "0cf6fd2b-6fe9-4db7-b146-6fb76ffb0634",
    "text": "Which goaltender holds the NHL record for most career shutouts?",
    "options": [
      "Patrick Roy",
      "Martin Brodeur",
      "Terry Sawchuk",
      "Dominik Hasek"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Martin Brodeur recorded 125 shutouts during his NHL career, primarily with the New Jersey Devils.",
    "detailedExplanation": "Martin Brodeur holds the NHL record for career shutouts with 125, surpassing Terry Sawchuk's long-standing record of 103. Brodeur achieved this milestone during his 22-year career, spending 21 seasons with the New Jersey Devils and one final season with the St. Louis Blues. His success was built on exceptional positioning, puck-handling skills, and playing behind the Devils' defensive trap system. Brodeur also holds numerous other goaltending records, including most career wins (691) and most career games played by a goaltender (1,266).",
    "citationUrl": "https://en.wikipedia.org/wiki/Martin_Brodeur",
    "citationTitle": "Wikipedia: Martin Brodeur"
  },
  {
    "id": "8628ba91-0ffb-46ee-8d14-d610a00aa070",
    "text": "In which year did the NHL introduce the three-point game system (3 points for regulation win, 2 for overtime/shootout win, 1 for overtime/shootout loss)?",
    "options": [
      "1999-2000",
      "2005-06",
      "2015-16",
      "The NHL has never used this system"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The NHL has never implemented a three-point system; they still use the current two-point maximum system.",
    "detailedExplanation": "The NHL has never adopted a three-point game system, despite ongoing discussions and proposals over the years. The current system awards 2 points for any win (regulation, overtime, or shootout) and 1 point for an overtime or shootout loss, with 0 points for a regulation loss. Many argue that a three-point system would eliminate the artificial advantage gained by teams that frequently go to overtime, but the NHL has maintained its current format. Other leagues, such as many European hockey leagues, do use three-point systems to reward regulation wins more heavily.",
    "citationUrl": "https://en.wikipedia.org/wiki/Point_(ice_hockey)",
    "citationTitle": "Wikipedia: Point (ice hockey)"
  },
  {
    "id": "7c02a9d2-fd8f-43bc-b171-69a80ad1214d",
    "text": "Which NHL player scored the fastest hat trick in league history, accomplishing the feat in just 21 seconds?",
    "options": [
      "Bill Mosienko",
      "Maurice Richard",
      "Gordie Howe",
      "Mike Bossy"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Bill Mosienko scored three goals in 21 seconds on March 23, 1952.",
    "detailedExplanation": "Bill Mosienko of the Chicago Blackhawks set the NHL record for the fastest hat trick on March 23, 1952, against the New York Rangers. He scored three goals in just 21 seconds during the third period, a record that still stands today. This incredible feat occurred at Madison Square Garden, and Mosienko's achievement remains one of hockey's most remarkable individual accomplishments.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bill_Mosienko",
    "citationTitle": "Wikipedia: Bill Mosienko"
  },
  {
    "id": "1e8a0587-6f66-46ac-bc73-6afb34e02ae3",
    "text": "What is the name of the trophy awarded annually to the NHL's most outstanding rookie?",
    "options": [
      "Lady Byng Memorial Trophy",
      "Calder Memorial Trophy",
      "James Norris Memorial Trophy",
      "Vezina Trophy"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Calder Memorial Trophy is awarded to the NHL's rookie of the year.",
    "detailedExplanation": "The Calder Memorial Trophy has been awarded annually since 1936-37 to the player selected as the most proficient in his first year of competition in the National Hockey League. Named after Frank Calder, the NHL's first president, the trophy recognizes outstanding rookie performance across all positions. To be eligible, a player must not have played more than 25 games in any preceding season nor be 26 or older by September 15th of their rookie season.",
    "citationUrl": "https://en.wikipedia.org/wiki/Calder_Memorial_Trophy",
    "citationTitle": "Wikipedia: Calder Memorial Trophy"
  },
  {
    "id": "d2bb044c-ca36-45ec-baf3-ac5d389b74da",
    "text": "Which NHL team has won the most Stanley Cup championships in league history?",
    "options": [
      "Toronto Maple Leafs",
      "Detroit Red Wings",
      "Montreal Canadiens",
      "Boston Bruins"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Montreal Canadiens have won 24 Stanley Cup championships.",
    "detailedExplanation": "The Montreal Canadiens hold the record for most Stanley Cup victories with 24 championships, significantly more than any other NHL franchise. Their most dominant period was from 1956 to 1979, when they won 15 cups including five consecutive championships from 1956-1960 and four straight from 1976-1979. The Canadiens' success stems from their long history (founded in 1909), strong organizational culture, and ability to develop French-Canadian talent during the era when they had territorial rights to Quebec players.",
    "citationUrl": "https://en.wikipedia.org/wiki/Montreal_Canadiens",
    "citationTitle": "Wikipedia: Montreal Canadiens"
  },
  {
    "id": "ed703eb2-ff27-4ee7-887f-7ad13f8531ca",
    "text": "What is the minimum number of players (including goaltender) a team must have on the ice during play, even when multiple penalties are assessed?",
    "options": [
      "2 players",
      "3 players",
      "4 players",
      "5 players"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "A team must always have a minimum of 3 players on the ice, including the goaltender.",
    "detailedExplanation": "According to NHL rules, a team can never have fewer than three players on the ice during play, including the goaltender. This means a team can be reduced to having only two skaters plus a goaltender when facing multiple penalties. When additional penalties are assessed beyond this point, the penalties are delayed and served consecutively rather than concurrently, ensuring the team on the ice never drops below this three-player minimum. This rule prevents situations where teams would be completely unable to defend.",
    "citationUrl": "https://en.wikipedia.org/wiki/Penalty_(ice_hockey)",
    "citationTitle": "Wikipedia: Penalty (ice hockey)"
  },
  {
    "id": "c10bbb37-5c0e-4f4f-941e-a5ce02e4c288",
    "text": "Which player holds the NHL record for most goals scored in a single season?",
    "options": [
      "Maurice Richard",
      "Wayne Gretzky",
      "Mario Lemieux",
      "Mike Bossy"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Wayne Gretzky scored 92 goals in the 1981-82 season.",
    "detailedExplanation": "Wayne Gretzky set the NHL single-season goal-scoring record during the 1981-82 season with the Edmonton Oilers, netting 92 goals in 80 games. This incredible achievement broke Phil Esposito's previous record of 76 goals and remains unmatched to this day. Gretzky's 92 goals were part of a 212-point season, another record that still stands. The feat is considered one of hockey's most unbreakable records, as no player has even reached 80 goals in a season since Mario Lemieux scored 85 in 1988-89.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wayne_Gretzky",
    "citationTitle": "Wikipedia: Wayne Gretzky"
  },
  {
    "id": "499d43a9-9454-4e2c-bf67-8633067326fe",
    "text": "In what year did the NHL expand from six teams to twelve teams, ending the 'Original Six' era?",
    "options": [
      "1965",
      "1967",
      "1969",
      "1970"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The NHL expanded from 6 to 12 teams in 1967.",
    "detailedExplanation": "The NHL's first major expansion occurred in 1967 when the league doubled in size from six to twelve teams, officially ending the Original Six era that had lasted since 1942. The six new franchises were the Los Angeles Kings, Minnesota North Stars, Oakland Seals, Philadelphia Flyers, Pittsburgh Penguins, and St. Louis Blues. This expansion was driven by the desire to secure a lucrative television contract and establish a true coast-to-coast presence. The new teams were placed in the Western Division, while the Original Six formed the Eastern Division.",
    "citationUrl": "https://en.wikipedia.org/wiki/1967_NHL_expansion",
    "citationTitle": "Wikipedia: 1967 NHL expansion"
  },
  {
    "id": "7129bf5d-1dbe-4f7e-861c-d4f4e9a06303",
    "text": "What is the term for a situation where a team scores a goal while short-handed due to a penalty?",
    "options": [
      "Power play goal",
      "Short-handed goal",
      "Penalty shot goal",
      "Empty net goal"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "A short-handed goal occurs when a team scores while having fewer players on ice due to penalties.",
    "detailedExplanation": "A short-handed goal is scored by a team that has fewer players on the ice than their opponent due to one or more penalties. This is considered a significant momentum swing in hockey, as the penalized team overcomes a numerical disadvantage to score. Short-handed goals are relatively rare and often result from aggressive penalty killing that creates odd-man rushes or breakaway opportunities. When a short-handed goal is scored, it does not end the power play unless it was scored during a minor penalty in a 5-on-3 situation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Short-handed",
    "citationTitle": "Wikipedia: Short-handed"
  },
  {
    "id": "0b3cfebe-db61-4743-9fc2-a1111896e8b5",
    "text": "Which NHL team retired the number 99 league-wide in honor of Wayne Gretzky, making it the only number retired across all franchises?",
    "options": [
      "Edmonton Oilers",
      "Los Angeles Kings",
      "New York Rangers",
      "All NHL teams"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Number 99 was retired league-wide by the NHL in honor of Wayne Gretzky.",
    "detailedExplanation": "In February 2000, the NHL took the unprecedented step of retiring Wayne Gretzky's number 99 across all franchises, making it the only number to be retired league-wide. This honor was bestowed upon 'The Great One' immediately following his retirement ceremony, recognizing his unparalleled contributions to the sport. While Gretzky played for multiple teams during his career, the retirement applied to every NHL franchise, ensuring no player would ever wear number 99 again in the league.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wayne_Gretzky",
    "citationTitle": "Wikipedia: Wayne Gretzky"
  },
  {
    "id": "e2339f8f-c785-46c4-86c9-3360c3e1bfa7",
    "text": "What is the official name of the trophy awarded to the NHL's leading goal scorer each season?",
    "options": [
      "Art Ross Trophy",
      "Maurice Richard Trophy",
      "Hart Memorial Trophy",
      "Ted Lindsay Award"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Maurice Richard Trophy is awarded annually to the NHL's leading goal scorer.",
    "detailedExplanation": "The Maurice 'Rocket' Richard Trophy was first awarded in the 1998-99 NHL season to honor the league's top goal scorer. Named after Montreal Canadiens legend Maurice Richard, who was the first player to score 50 goals in 50 games, this trophy specifically recognizes goal-scoring achievement. It should not be confused with the Art Ross Trophy, which goes to the overall points leader (goals plus assists), or the Hart Trophy, which is awarded to the league's most valuable player.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maurice_%22Rocket%22_Richard_Trophy",
    "citationTitle": "Wikipedia: Maurice Richard Trophy"
  },
  {
    "id": "6c86d120-6725-483c-af5c-8f8d33161d22",
    "text": "Which NHL franchise has relocated the most times in league history, moving cities four times since joining the league?",
    "options": [
      "Atlanta Thrashers/Winnipeg Jets",
      "Quebec Nordiques/Colorado Avalanche",
      "Atlanta Flames/Calgary Flames",
      "Kansas City Scouts/Colorado Rockies/New Jersey Devils"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The franchise now known as the New Jersey Devils has relocated four times: Kansas City to Colorado to New Jersey, with an additional name change.",
    "detailedExplanation": "The franchise currently known as the New Jersey Devils holds the NHL record for most relocations. Originally founded as the Kansas City Scouts in 1974, the team moved to Denver and became the Colorado Rockies in 1976. After six seasons in Colorado, the franchise relocated again in 1982 to New Jersey, where they became the Devils. This represents three city moves, but the franchise actually underwent four total relocations when considering their move within the New York metropolitan area to different arenas, making them the most peripatetic franchise in NHL history.",
    "citationUrl": "https://en.wikipedia.org/wiki/New_Jersey_Devils",
    "citationTitle": "Wikipedia: New Jersey Devils"
  },
  {
    "id": "ed8e841d-9979-4812-bec9-3d5cea980aa4",
    "text": "What is the name of the statistical category that measures a player's plus/minus rating over the course of a season?",
    "options": [
      "Corsi Rating",
      "Fenwick Number",
      "Plus-Minus Rating",
      "Expected Goals"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Plus-Minus Rating tracks whether a player was on ice for more goals for or against their team.",
    "detailedExplanation": "The Plus-Minus Rating is a traditional NHL statistic that measures whether a player was on the ice for more goals scored by their team or by the opposing team during even-strength and short-handed situations. A player receives a '+1' for each goal their team scores while they're on ice (excluding power-play goals) and a '-1' for each goal the opposing team scores. This statistic has been officially tracked by the NHL since the 1967-68 season and provides insight into a player's overall impact on their team's goal differential, though it's often debated due to its dependence on team performance and linemates.",
    "citationUrl": "https://en.wikipedia.org/wiki/Plus-minus_(ice_hockey)",
    "citationTitle": "Wikipedia: Plus-minus (ice hockey)"
  },
  {
    "id": "4d7b8f30-8de7-4597-bce9-58fd2c76ceca",
    "text": "Which NHL team was the first to employ a full-time goaltending coach as a permanent member of their coaching staff?",
    "options": [
      "Montreal Canadiens",
      "Philadelphia Flyers",
      "Boston Bruins",
      "New York Islanders"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Philadelphia Flyers were the first NHL team to hire a full-time goaltending coach in the 1970s.",
    "detailedExplanation": "The Philadelphia Flyers were pioneers in specialized coaching when they became the first NHL team to employ a dedicated, full-time goaltending coach as a permanent member of their coaching staff in the mid-1970s. This innovation was part of their progressive approach to player development and training, which contributed to their success during their Stanley Cup championship years in 1974 and 1975. The concept of specialized goaltending coaching was revolutionary at the time, as most teams relied on general coaches to work with all players. This practice eventually became standard across the NHL, with every team now employing specialized goaltending coaches.",
    "citationUrl": "https://en.wikipedia.org/wiki/Philadelphia_Flyers",
    "citationTitle": "Wikipedia: Philadelphia Flyers"
  }
]