[
  {
    "id": "c7373786-c490-46c4-94b4-92226697af33",
    "text": "What is the term for a government system where power is divided between a central government and regional governments?",
    "options": [
      "Federalism",
      "Unitarism",
      "Confederalism",
      "Anarchism"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Federalism divides power between central and regional governments.",
    "detailedExplanation": "Federalism is a system of government where sovereignty is constitutionally divided between a central governing authority and constituent political units like states or provinces. Examples include the United States, Canada, Germany, and Australia, where both federal and state/provincial governments have their own areas of jurisdiction and authority.",
    "citationUrl": "https://en.wikipedia.org/wiki/Federalism",
    "citationTitle": "Wikipedia: Federalism"
  },
  {
    "id": "0fa044ff-3258-4d37-b896-224355cbcd61",
    "text": "In the United Kingdom, what is the upper house of Parliament called?",
    "options": [
      "House of Commons",
      "House of Lords",
      "House of Representatives",
      "Senate"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The House of Lords is the upper chamber of the UK Parliament.",
    "detailedExplanation": "The House of Lords is the upper house of the Parliament of the United Kingdom, with the House of Commons being the lower house. The House of Lords consists of appointed life peers, hereditary peers, and bishops. It acts as a revising chamber, examining and potentially amending legislation passed by the House of Commons.",
    "citationUrl": "https://en.wikipedia.org/wiki/House_of_Lords",
    "citationTitle": "Wikipedia: House of Lords"
  },
  {
    "id": "32f9b3a8-10a3-4a5b-a9c3-e8763a47a6bc",
    "text": "What type of government system does China officially operate under?",
    "options": [
      "Democratic Republic",
      "Constitutional Monarchy",
      "One-Party Socialist Republic",
      "Federal Democracy"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "China is officially a one-party socialist republic under Communist Party rule.",
    "detailedExplanation": "The People's Republic of China operates as a one-party socialist republic, where the Chinese Communist Party (CCP) holds absolute power and is the sole governing party. The government structure includes the National People's Congress as the legislature, but all major decisions are made by the Communist Party leadership, making it effectively a one-party state.",
    "citationUrl": "https://en.wikipedia.org/wiki/Government_of_China",
    "citationTitle": "Wikipedia: Government of China"
  },
  {
    "id": "146b9537-e307-48f2-b8d0-6353f1a1767d",
    "text": "How many branches of government are there in the traditional separation of powers model?",
    "options": [
      "Two",
      "Three",
      "Four",
      "Five"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The traditional separation of powers model has three branches: executive, legislative, and judicial.",
    "detailedExplanation": "The separation of powers doctrine, popularized by Montesquieu and implemented in many democratic systems like the United States, divides government into three branches: the legislative branch (makes laws), the executive branch (enforces laws), and the judicial branch (interprets laws). This system is designed to prevent any single branch from gaining too much power through checks and balances.",
    "citationUrl": "https://en.wikipedia.org/wiki/Separation_of_powers",
    "citationTitle": "Wikipedia: Separation of Powers"
  },
  {
    "id": "f79f4783-2a6f-4cb6-b0a9-8258f66f941e",
    "text": "What is the head of government called in Germany?",
    "options": [
      "President",
      "Prime Minister",
      "Chancellor",
      "Premier"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The head of government in Germany is called the Chancellor (Bundeskanzler).",
    "detailedExplanation": "In Germany's parliamentary system, the Chancellor (Bundeskanzler) serves as the head of government and chief executive. The Chancellor is elected by the Bundestag (parliament) and leads the federal government. Germany also has a President who serves as the largely ceremonial head of state, but the Chancellor holds the real executive power and political leadership.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "citationTitle": "Wikipedia: Chancellor of Germany"
  },
  {
    "id": "c517a503-5ad4-4fcd-aa91-81be854d9e52",
    "text": "In a parliamentary system, who typically becomes the head of government?",
    "options": [
      "The candidate with the most votes nationwide",
      "The leader of the party with the most seats",
      "The oldest member of parliament",
      "The person appointed by the monarch"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "In parliamentary systems, the leader of the party with the most seats typically becomes head of government.",
    "detailedExplanation": "In parliamentary systems, the head of government (Prime Minister or equivalent) is typically the leader of the political party that wins the most seats in the legislature, or the leader who can command a majority through coalition-building. This person is then asked to form a government, rather than being directly elected by the people as in presidential systems.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parliamentary_system",
    "citationTitle": "Wikipedia: Parliamentary System"
  },
  {
    "id": "7fbfd1ce-b4fc-4aa0-b584-4879ffaceeed",
    "text": "What is the minimum age requirement to serve as President of the United States?",
    "options": [
      "30 years old",
      "35 years old",
      "40 years old",
      "25 years old"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The US Constitution requires the President to be at least 35 years old.",
    "detailedExplanation": "According to Article II of the United States Constitution, to be eligible for the presidency, a person must be at least 35 years old, be a natural-born citizen of the United States, and have been a resident of the United States for at least 14 years. These requirements were established by the Founding Fathers to ensure the President had sufficient maturity and connection to the country.",
    "citationUrl": "https://en.wikipedia.org/wiki/President_of_the_United_States",
    "citationTitle": "Wikipedia: President of the United States"
  },
  {
    "id": "a610556b-a334-4476-a4aa-6e64d8202c08",
    "text": "What is the term for a government ruled by a small group of people?",
    "options": [
      "Democracy",
      "Monarchy",
      "Oligarchy",
      "Theocracy"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "An oligarchy is a government ruled by a small group of people.",
    "detailedExplanation": "An oligarchy is a form of government where power is held by a small number of people, often distinguished by wealth, family ties, education, corporate control, military control, or religious authority. These ruling groups may be political, economic, or military elites. Historical examples include the rule of aristocratic families in ancient Greek city-states and modern examples of corporate or military oligarchies in various countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oligarchy",
    "citationTitle": "Wikipedia: Oligarchy"
  },
  {
    "id": "e8efecdf-088c-4a55-8575-28993d49f637",
    "text": "What is the name of the legislative body in the United States Congress that has 435 members?",
    "options": [
      "House of Representatives",
      "Senate",
      "Supreme Court",
      "Cabinet"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The House of Representatives is the lower chamber of the US Congress with 435 voting members.",
    "detailedExplanation": "The United States House of Representatives is one of two chambers of the U.S. Congress, alongside the Senate. It consists of 435 voting members, with representation based on each state's population as determined by the U.S. Census. Members serve two-year terms and are elected directly by voters in their respective districts. The House has exclusive powers including the ability to initiate revenue bills and impeach federal officials.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_States_House_of_Representatives",
    "citationTitle": "Wikipedia: United States House of Representatives"
  },
  {
    "id": "bf242d03-b773-4fd0-a945-5546761dbb2b",
    "text": "In Canada, what is the official residence of the Prime Minister called?",
    "options": [
      "Rideau Hall",
      "24 Sussex Drive",
      "Parliament Hill",
      "Laurier House"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "24 Sussex Drive has served as the official residence of Canadian Prime Ministers since 1951.",
    "detailedExplanation": "24 Sussex Drive is the official residence of the Prime Minister of Canada, located in Ottawa, Ontario. The Georgian Revival-style mansion was built in 1868 and has served as the PM's residence since Louis St. Laurent moved in during 1951. The residence sits on the Ottawa River and provides both living quarters and space for official functions, though it has faced ongoing maintenance and security concerns in recent years.",
    "citationUrl": "https://en.wikipedia.org/wiki/24_Sussex_Drive",
    "citationTitle": "Wikipedia: 24 Sussex Drive"
  },
  {
    "id": "c0cd0dff-0634-42fb-a914-7c3344146880",
    "text": "What term describes a government system where religious leaders hold political power?",
    "options": [
      "Democracy",
      "Theocracy",
      "Republic",
      "Monarchy"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "A theocracy is a form of government where religious authorities rule in the name of a god or divine power.",
    "detailedExplanation": "Theocracy is a form of government in which religious leaders or institutions exercise political power, claiming to rule on behalf of a deity or according to religious law. In a theocratic system, religious doctrine often forms the basis of civil law, and political authority derives from religious authority. Historical and contemporary examples include ancient Egypt under the pharaohs, Tibet under the Dalai Lama, and modern Iran where supreme religious authority guides government policy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Theocracy",
    "citationTitle": "Wikipedia: Theocracy"
  },
  {
    "id": "edb45b45-e6d8-49b6-a133-11749941436b",
    "text": "How many justices typically serve on the United States Supreme Court?",
    "options": [
      "7",
      "9",
      "11",
      "12"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The US Supreme Court has nine justices: one Chief Justice and eight Associate Justices.",
    "detailedExplanation": "The United States Supreme Court consists of nine justices who serve for life or until retirement. This number was established by the Judiciary Act of 1869, though it has varied throughout history from as few as five to as many as ten justices. The Court includes one Chief Justice and eight Associate Justices, all appointed by the President and confirmed by the Senate. The nine-justice composition has remained stable for over 150 years and requires a simple majority of five votes to decide cases.",
    "citationUrl": "https://en.wikipedia.org/wiki/Supreme_Court_of_the_United_States",
    "citationTitle": "Wikipedia: Supreme Court of the United States"
  },
  {
    "id": "2a704869-5061-4685-8387-b2381df2a0d6",
    "text": "What is the lower house of the French Parliament called?",
    "options": [
      "Senate",
      "National Assembly",
      "Chamber of Deputies",
      "Bundestag"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The National Assembly is the lower house of the French Parliament, with 577 members elected for five-year terms.",
    "detailedExplanation": "The National Assembly (Assemblée nationale) is the lower house of the French Parliament, which together with the Senate forms the bicameral legislature of France. It consists of 577 members called deputies (députés) who are elected by direct universal suffrage for five-year terms. The National Assembly has greater power than the Senate, including the ability to override Senate decisions and vote on motions of no confidence against the government. It meets in the Palais Bourbon in Paris.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Assembly_(France)",
    "citationTitle": "Wikipedia: National Assembly (France)"
  },
  {
    "id": "d65231d6-ab1d-4490-9b26-ec9d104580e1",
    "text": "In which building does the Canadian Parliament meet?",
    "options": [
      "Peace Tower",
      "Centre Block",
      "Rideau Hall",
      "Supreme Court Building"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Centre Block on Parliament Hill houses both chambers of the Canadian Parliament.",
    "detailedExplanation": "Centre Block is the main building of the Canadian Parliament Buildings located on Parliament Hill in Ottawa, Ontario. This Gothic Revival structure houses both the House of Commons and the Senate chambers, along with the offices of parliamentary leaders and the parliamentary library. The building features the iconic Peace Tower and has served as the seat of Canadian federal government since 1876, though it was rebuilt after a devastating fire in 1916. The building underwent major renovations from 2019-2030, with Parliament temporarily relocated.",
    "citationUrl": "https://en.wikipedia.org/wiki/Centre_Block",
    "citationTitle": "Wikipedia: Centre Block"
  },
  {
    "id": "54aefebd-e52a-408c-b284-5406915bcb6c",
    "text": "What is the term for a government system where power is held by the wealthy elite?",
    "options": [
      "Plutocracy",
      "Meritocracy",
      "Autocracy",
      "Bureaucracy"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Plutocracy is a form of government where the wealthy class rules or has controlling influence over policy.",
    "detailedExplanation": "Plutocracy is a form of government or political system where power is held by the wealthy or those whose power derives from their wealth. The term comes from the Greek words 'ploutos' (wealth) and 'kratos' (power or rule). In a plutocratic system, economic elite may directly hold political office or exercise significant influence over government policy through campaign contributions, lobbying, and other forms of political participation that require substantial financial resources. Critics argue that some modern democracies exhibit plutocratic characteristics when wealthy interests have disproportionate political influence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Plutocracy",
    "citationTitle": "Wikipedia: Plutocracy"
  },
  {
    "id": "42aec73b-0c0f-4343-92b4-410087398628",
    "text": "What is the maximum number of terms a US President can serve?",
    "options": [
      "One",
      "Two",
      "Three",
      "Unlimited"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 22nd Amendment limits US Presidents to two terms, or a maximum of 10 years in office.",
    "detailedExplanation": "The Twenty-Second Amendment to the United States Constitution, ratified in 1951, limits the President to two elected terms in office. This means a president can serve a maximum of eight years through election, though they could theoretically serve up to 10 years total if they assumed the presidency through succession (as Vice President) and served less than two years of their predecessor's term before being elected twice on their own. The amendment was passed largely in response to Franklin D. Roosevelt's four-term presidency, establishing the two-term tradition started by George Washington as constitutional law.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-second_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-second Amendment to the United States Constitution"
  },
  {
    "id": "d6383c48-4371-47d1-8922-dc255e8159ec",
    "text": "What is the term for a government system where power is held by the people through elected representatives?",
    "options": [
      "Democracy",
      "Autocracy",
      "Monarchy",
      "Anarchy"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Democracy is a system of government where power is vested in the people and exercised through elected representatives.",
    "detailedExplanation": "Democracy comes from the Greek words 'demos' (people) and 'kratos' (power), literally meaning 'rule by the people.' In a democratic system, citizens have the right to participate in government through voting for representatives who make decisions on their behalf. This contrasts with autocracy (rule by one person), monarchy (rule by a hereditary leader), and anarchy (absence of government).",
    "citationUrl": "https://en.wikipedia.org/wiki/Democracy",
    "citationTitle": "Wikipedia: Democracy"
  },
  {
    "id": "852caf7c-d9ec-49c6-aaf2-78e0c3b96aca",
    "text": "What is the official title of the head of state in Russia?",
    "options": [
      "Prime Minister",
      "President",
      "Chancellor",
      "Premier"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Russia has a President as its head of state, currently serving six-year terms.",
    "detailedExplanation": "The President of Russia is both the head of state and the most powerful political figure in the Russian Federation. The position was established in 1991 following the dissolution of the Soviet Union. The President serves as the supreme commander-in-chief of the armed forces and has significant executive powers, including the ability to appoint the Prime Minister who serves as head of government.",
    "citationUrl": "https://en.wikipedia.org/wiki/President_of_Russia",
    "citationTitle": "Wikipedia: President of Russia"
  },
  {
    "id": "7f16e45f-82c3-4c7f-961c-f6a0109099e9",
    "text": "In Australia, what are the two main houses of Parliament collectively called?",
    "options": [
      "The Commonwealth Parliament",
      "The Federal Assembly",
      "The National Congress",
      "The General Assembly"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Australia's national legislature is officially called the Commonwealth Parliament, consisting of the House of Representatives and the Senate.",
    "detailedExplanation": "The Commonwealth Parliament of Australia is the federal legislature established by the Australian Constitution in 1901. It consists of two houses: the House of Representatives (lower house) with 151 members representing electoral divisions, and the Senate (upper house) with 76 senators representing the states and territories. The Parliament meets in Parliament House in Canberra, the national capital.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parliament_of_Australia",
    "citationTitle": "Wikipedia: Parliament of Australia"
  },
  {
    "id": "b4401bfd-d0e7-41c1-8a8d-d5df231e6de9",
    "text": "What is the term for a government system where a single ruler has absolute power?",
    "options": [
      "Republic",
      "Federation",
      "Dictatorship",
      "Coalition"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "A dictatorship is a form of government where a single leader or small group holds absolute power without democratic accountability.",
    "detailedExplanation": "In a dictatorship, power is concentrated in the hands of one person (dictator) or a small group who rule with absolute authority. Unlike democratic systems, dictatorships typically lack free elections, independent judiciary, or constitutional limitations on power. Citizens have little to no political rights or freedoms, and opposition is often suppressed. Historical examples include Nazi Germany under Hitler and the Soviet Union under Stalin.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dictatorship",
    "citationTitle": "Wikipedia: Dictatorship"
  }
]