[
  {
    "id": "93463a46-a6f6-4de4-9213-c99287c487de",
    "text": "Which rugby union tournament was the first to feature a bonus point system for tries scored and narrow defeats?",
    "options": [
      "Six Nations Championship",
      "Rugby Championship",
      "Celtic League",
      "Super Rugby"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Super Rugby was the first major tournament to introduce the bonus point system in 1996.",
    "detailedExplanation": "Super Rugby, originally known as Super 12 when it launched in 1996, was the pioneering tournament to introduce the bonus point system that rewarded teams with extra points for scoring four or more tries in a match or losing by seven points or fewer. This innovation was later adopted by other major tournaments including the Six Nations Championship in 2017 and the Rugby Championship in 2016, but Super Rugby was the trailblazer in this scoring methodology.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Rugby",
    "citationTitle": "Wikipedia: Super Rugby"
  },
  {
    "id": "7c1d27e1-b22a-4c48-8b3c-3dd5e66d1287",
    "text": "The Currie Cup, South Africa's premier domestic rugby union competition, is named after which historical figure?",
    "options": [
      "Sir Donald Currie",
      "Captain James Currie",
      "Lord Matthew Currie",
      "Admiral William Currie"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Currie Cup is named after Sir Donald Currie, a shipping magnate who donated the original trophy in 1889.",
    "detailedExplanation": "Sir Donald Currie was a Scottish-born shipping magnate and politician who founded the Castle Line shipping company. In 1889, he donated a gold cup to be awarded to the South African rugby team, which later became the trophy for South Africa's premier provincial rugby competition. The first Currie Cup tournament was held in 1889, making it one of the oldest rugby competitions in the world, predating even the modern Rugby World Cup by nearly a century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Currie_Cup",
    "citationTitle": "Wikipedia: Currie Cup"
  },
  {
    "id": "bce47bed-d5c1-4dc0-a585-e9b02be4f055",
    "text": "Which rugby league tournament holds the record for the most consecutive victories by a single team, with the Brisbane Broncos winning how many straight matches between 1992-1993?",
    "options": [
      "19 matches",
      "23 matches",
      "27 matches",
      "31 matches"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Brisbane Broncos set the NRL/NSWRL record with 19 consecutive victories spanning the 1992 and 1993 seasons.",
    "detailedExplanation": "The Brisbane Broncos' remarkable winning streak of 19 consecutive matches began in Round 15 of the 1992 NSWRL season and continued through to Round 8 of the 1993 season. This incredible run included their 1992 Grand Final victory over St. George Dragons and helped establish the Broncos as one of rugby league's most dominant teams during the 1990s. The streak remains the longest in Australian rugby league's premier competition and showcased the team's exceptional talent under coach Wayne Bennett.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brisbane_Broncos",
    "citationTitle": "Wikipedia: Brisbane Broncos"
  },
  {
    "id": "867d97f1-1ad5-4319-8891-5e519480831a",
    "text": "The Challenge Cup in rugby league features which unique tradition dating back to 1929?",
    "options": [
      "Winners plant a tree at Wembley",
      "The 'Lance Todd Trophy' for man of the match",
      "Losing team keeps their medals",
      "Final is played on Christmas Day"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Lance Todd Trophy has been awarded to the Challenge Cup Final's man of the match since 1946, but the tradition stems from Lance Todd's involvement from 1929.",
    "detailedExplanation": "The Lance Todd Trophy is awarded annually to the man of the match in rugby league's Challenge Cup Final at Wembley Stadium. Named after Lance Todd, a New Zealand-born player and manager who was instrumental in rugby league's development in Britain, the award has been presented since 1946. Todd himself was tragically killed in a car accident in 1942, but his contribution to the sport, particularly his role in organizing the Challenge Cup from 1929 onwards, is commemorated through this prestigious individual honor that accompanies the team trophy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lance_Todd_Trophy",
    "citationTitle": "Wikipedia: Lance Todd Trophy"
  },
  {
    "id": "b0b9e15c-8612-44f7-9f78-6fae4ca27a34",
    "text": "Which rugby union tournament was discontinued in 2014 after 133 years, making it one of the oldest competitions in the sport?",
    "options": [
      "Hospitals Cup",
      "County Championship",
      "Inter-Services Championship",
      "Barbarian FC Annual Tour"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The County Championship, which began in 1889, was discontinued by the RFU in 2014 due to declining participation and interest.",
    "detailedExplanation": "The County Championship was one of English rugby union's most historic competitions, running from 1889 to 2014. At its peak, it was considered almost as prestigious as international rugby, with county matches drawing large crowds and featuring the best players outside of international selection. However, the rise of professional club rugby, the establishment of the Premiership, and changing player priorities led to declining participation and spectator interest. The Rugby Football Union made the difficult decision to discontinue the tournament after 125 years, marking the end of an era in English rugby tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/County_Championship_(rugby_union)",
    "citationTitle": "Wikipedia: County Championship (rugby union)"
  },
  {
    "id": "b08f7ade-9da6-4927-bc01-a51d61c11b47",
    "text": "In rugby sevens, the Hong Kong Sevens tournament is famous for introducing which innovation that became standard across the format?",
    "options": [
      "Video referee system",
      "Sin bin for yellow cards",
      "Sudden death extra time",
      "Plate and Bowl competitions"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Hong Kong Sevens pioneered the Plate and Bowl competitions in 1976 to ensure all teams played meaningful matches throughout the tournament.",
    "detailedExplanation": "The Hong Kong Sevens, first held in 1976, revolutionized tournament structure by introducing the Plate and Bowl competitions alongside the main Cup competition. This innovation ensured that teams eliminated in the early rounds of the Cup competition could continue playing meaningful matches rather than being eliminated entirely. The Plate competition was for teams knocked out in the Cup quarter-finals, while the Bowl was for teams eliminated even earlier. This format became the template for sevens tournaments worldwide and significantly enhanced the spectator experience and commercial viability of the sport.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hong_Kong_Sevens",
    "citationTitle": "Wikipedia: Hong Kong Sevens"
  },
  {
    "id": "63c83b3a-22a8-414e-8c41-a6b4cac4070d",
    "text": "Which rugby league team holds the record for the most State of Origin series victories in the tournament's history?",
    "options": [
      "New South Wales Blues",
      "Queensland Maroons",
      "They are tied",
      "Northern Territory Thunder"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Queensland has won more State of Origin series than New South Wales since the tournament began in 1980.",
    "detailedExplanation": "The Queensland Maroons have dominated the State of Origin series, particularly during their golden era from 2006 to 2017 when they won an unprecedented eight consecutive series. As of recent years, Queensland holds the edge in total series victories since the modern State of Origin format began in 1980. This dominance was built around legendary players like Johnathan Thurston, Cameron Smith, Billy Slater, and coached by Wayne Bennett and Mal Meninga. The success transformed Queensland from underdogs to the most successful state in Origin history, completely reversing the early years when New South Wales had the upper hand.",
    "citationUrl": "https://en.wikipedia.org/wiki/State_of_Origin_series",
    "citationTitle": "Wikipedia: State of Origin series"
  },
  {
    "id": "d33ea1bf-850e-4f46-a70a-8ac0895423a3",
    "text": "The European Rugby Challenge Cup replaced which predecessor tournament in 2014?",
    "options": [
      "European Shield",
      "Amlin Cup",
      "Parker Pen Cup",
      "European Rugby Cup"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Challenge Cup replaced the Parker Pen Cup (later known as the European Challenge Cup) as European rugby's second-tier tournament.",
    "detailedExplanation": "The European Rugby Challenge Cup was established in 2014 as part of a major restructuring of European rugby competitions. It replaced the previous second-tier tournament that had operated under various names and sponsors, most notably as the Parker Pen Cup (2001-2006) and later iterations. The new Challenge Cup was created alongside the restructured European Rugby Champions Cup (which replaced the Heineken Cup) to provide a comprehensive European tournament structure. The change was designed to increase participation from more countries and provide greater commercial opportunities while maintaining competitive integrity in European club rugby.",
    "citationUrl": "https://en.wikipedia.org/wiki/European_Rugby_Challenge_Cup",
    "citationTitle": "Wikipedia: European Rugby Challenge Cup"
  },
  {
    "id": "bc60104c-7283-4b83-8093-6db2dfe58531",
    "text": "Which rugby union tournament features the famous 'Calcutta Cup' as its trophy, contested annually since 1879?",
    "options": [
      "England vs Scotland in the Six Nations",
      "England vs Wales in the Six Nations",
      "Scotland vs Ireland in the Six Nations",
      "England vs France in the Six Nations"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Calcutta Cup is contested between England and Scotland as part of the Six Nations Championship.",
    "detailedExplanation": "The Calcutta Cup is one of rugby union's oldest trophies, first contested in 1879 between England and Scotland. The cup was made from melted-down silver rupees from the Calcutta Football Club when it disbanded. It remains one of the most prestigious fixtures in the Six Nations Championship, with both teams having roughly equal success over its 140+ year history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Calcutta_Cup",
    "citationTitle": "Wikipedia: Calcutta Cup"
  },
  {
    "id": "d5defd97-4a72-4b0a-adc7-a2c4993abdc1",
    "text": "The Rugby World Cup Sevens tournament is held every how many years, and which country has won the men's tournament the most times?",
    "options": [
      "Every 3 years, New Zealand",
      "Every 4 years, Fiji",
      "Every 4 years, New Zealand",
      "Every 2 years, South Africa"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Rugby World Cup Sevens is held every four years, with New Zealand having won the men's tournament three times.",
    "detailedExplanation": "The Rugby World Cup Sevens, first held in 1993, takes place every four years and is separate from the regular Rugby World Cup. New Zealand has dominated the men's tournament, winning in 2001, 2013, and 2022. The tournament features both men's and women's competitions and is considered the pinnacle of rugby sevens competition, separate from the World Rugby Sevens Series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rugby_World_Cup_Sevens",
    "citationTitle": "Wikipedia: Rugby World Cup Sevens"
  },
  {
    "id": "32c0cae5-57e4-46ee-9df1-af81925eb7aa",
    "text": "Which rugby union tournament was the first professional inter-provincial competition in the northern hemisphere when it launched in 2001?",
    "options": [
      "Celtic League (now URC)",
      "English Premiership",
      "Top 14",
      "European Cup"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Celtic League, now known as the United Rugby Championship, was the first professional inter-provincial competition in the northern hemisphere.",
    "detailedExplanation": "The Celtic League began in 2001 as a professional competition initially featuring teams from Ireland, Scotland, and Wales. It was groundbreaking as the first cross-border professional league in the northern hemisphere, predating similar formats. The competition has evolved significantly, adding Italian teams in 2010 and South African franchises in 2021, when it was rebranded as the United Rugby Championship.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Rugby_Championship",
    "citationTitle": "Wikipedia: United Rugby Championship"
  },
  {
    "id": "73f9d34c-e320-4a80-ad31-a4cb4f777e8f",
    "text": "In rugby league's Super League, which team won the inaugural Grand Final in 1998 and what was unique about the league's formation?",
    "options": [
      "Wigan Warriors, it was the first summer rugby league competition in Europe",
      "Leeds Rhinos, it introduced salary caps to rugby league",
      "St. Helens, it was the first fully professional rugby league competition",
      "Bradford Bulls, it merged with Australian teams"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Wigan Warriors won the first Super League Grand Final in 1998, and Super League was notable for being the first summer rugby league competition in Europe.",
    "detailedExplanation": "Super League revolutionized European rugby league when it launched in 1996 by switching from the traditional winter season to summer, following the Australian NRL model. The Grand Final format was introduced in 1998, with Wigan Warriors defeating Leeds Rhinos 10-4 at Old Trafford. This change to summer rugby was designed to avoid competition with football and provide better playing conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_League",
    "citationTitle": "Wikipedia: Super League"
  },
  {
    "id": "cf18a6a6-0632-4da1-a138-178852542805",
    "text": "The Rugby Championship (formerly Tri Nations) expanded to include which country in 2012, and what record does New Zealand hold in this tournament?",
    "options": [
      "Japan, most consecutive titles (7)",
      "Argentina, most consecutive titles (7)",
      "Georgia, most points scored in a match",
      "Argentina, most tries in a single tournament"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Argentina joined in 2012, and New Zealand holds the record for most consecutive Rugby Championship/Tri Nations titles with 7 wins from 2010-2016.",
    "detailedExplanation": "The Tri Nations, featuring New Zealand, Australia, and South Africa since 1996, expanded to become The Rugby Championship in 2012 with Argentina's inclusion. New Zealand's dominance during the 2010s was unprecedented, winning seven consecutive titles from 2010-2016 under the coaching of Steve Hansen and Graham Henry. This streak coincided with their Rugby World Cup victories in 2011 and 2015.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rugby_Championship",
    "citationTitle": "Wikipedia: The Rugby Championship"
  },
  {
    "id": "57cad4a1-68bf-40a6-8eb4-1a513cb400bb",
    "text": "Which rugby union tournament holds the record for the highest attendance at a club match, and what was the attendance figure?",
    "options": [
      "Heineken Cup Final 2010 - 81,744 at Stade de France",
      "English Premiership Final 2024 - 82,000 at Twickenham",
      "Top 14 Final 2016 - 99,124 at Camp Nou",
      "Challenge Cup Final 2007 - 84,068 at Twickenham"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Top 14 Final in 2016 between Racing 92 and Toulon at Camp Nou drew 99,124 spectators, the highest attendance for a club rugby match.",
    "detailedExplanation": "The 2016 Top 14 Final was moved from the traditional Stade de France to FC Barcelona's Camp Nou stadium in an unprecedented move to increase attendance and global exposure. Racing 92 defeated Toulon 29-21 in front of 99,124 spectators, smashing all previous attendance records for club rugby. This remains the highest attendance for any club rugby union match and demonstrated the sport's potential for attracting massive crowds in the right circumstances.",
    "citationUrl": "https://en.wikipedia.org/wiki/Top_14",
    "citationTitle": "Wikipedia: Top 14"
  },
  {
    "id": "16395084-0519-4039-908c-92fa332058b9",
    "text": "The Pacific Nations Cup rugby union tournament was restructured in 2019 to include which tier-one nation, creating what new format?",
    "options": [
      "Australia, creating a home-and-away league system",
      "New Zealand, creating promotion/relegation with tier-two nations",
      "Japan, creating a single round-robin tournament",
      "South Africa, creating a knockout tournament format"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Japan joined the Pacific Nations Cup in 2019, creating a single round-robin format with Fiji, Samoa, Tonga, USA, and Canada.",
    "detailedExplanation": "The Pacific Nations Cup underwent significant restructuring in 2019 when Japan, fresh from hosting the Rugby World Cup, was included as a permanent member alongside traditional Pacific Island teams Fiji, Samoa, and Tonga, plus USA and Canada. This created a more competitive and commercially viable tournament, with Japan's inclusion bringing higher television audiences and sponsorship opportunities while providing crucial regular competition for the Pacific Island nations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pacific_Nations_Cup",
    "citationTitle": "Wikipedia: Pacific Nations Cup"
  },
  {
    "id": "4bffde3d-1094-4b29-8ae7-da99ddf07f54",
    "text": "In the Rugby League World Cup, which achievement is unique to the 2021 tournament (played in 2022) that had never occurred before in the competition's history?",
    "options": [
      "First time three tournaments were held simultaneously",
      "First time held in the southern hemisphere",
      "First time with a 32-team format",
      "First time with golden point extra time"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 2021 Rugby League World Cup featured men's, women's, and wheelchair tournaments simultaneously for the first time.",
    "detailedExplanation": "The 2021 Rugby League World Cup, delayed until 2022 due to COVID-19, was groundbreaking as the first time in the tournament's history that men's, women's, and wheelchair World Cups were held simultaneously in the same country (England). This inclusive format was designed to maximize exposure for all forms of the game and create a festival atmosphere. Australia won both the men's and women's tournaments, while England claimed the wheelchair title.",
    "citationUrl": "https://en.wikipedia.org/wiki/2021_Rugby_League_World_Cup",
    "citationTitle": "Wikipedia: 2021 Rugby League World Cup"
  },
  {
    "id": "a43b180a-abf4-4e79-9504-ebf689302017",
    "text": "Which rugby union tournament holds the record for the highest individual points tally in a single match, when Jannie de Beer kicked 34 points (5 drop goals, 4 penalties, 2 conversions) for South Africa against England in 1999?",
    "options": [
      "Six Nations Championship",
      "Rugby World Cup",
      "Tri Nations Championship",
      "European Rugby Champions Cup"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jannie de Beer's 34-point performance came in the 1999 Rugby World Cup quarter-final.",
    "detailedExplanation": "During the 1999 Rugby World Cup quarter-final in Paris, South African fly-half Jannie de Beer delivered one of the most remarkable individual performances in tournament history. His 34 points against England included a record-equaling five drop goals in a single match, along with four penalties and two conversions, leading the Springboks to a 44-21 victory. This performance remains the highest individual points tally in Rugby World Cup history and helped establish de Beer as a tournament legend.",
    "citationUrl": "https://en.wikipedia.org/wiki/1999_Rugby_World_Cup",
    "citationTitle": "Wikipedia: 1999 Rugby World Cup"
  },
  {
    "id": "62d80bd4-4aaa-45bc-ad7c-a93f9aaf0387",
    "text": "The Heineken Cup (now European Rugby Champions Cup) featured which unusual qualifying scenario in 2007 that led to a team playing in the tournament despite being relegated from their domestic league?",
    "options": [
      "Border Reivers qualified through Scottish representation",
      "Leeds Tykes received a wild card entry",
      "Northampton Saints maintained European qualification",
      "Gloucester received an injury exemption"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Northampton Saints qualified for the 2007-08 Heineken Cup despite being relegated from the Premiership.",
    "detailedExplanation": "In one of European rugby's most unusual qualifying scenarios, Northampton Saints earned their place in the 2007-08 Heineken Cup through their previous season's Premiership performance, but were subsequently relegated to the Championship after the qualification period had closed. This created the bizarre situation where Saints competed in Europe's premier tournament while playing in England's second tier domestically. The club had to balance Championship matches with games against Europe's elite teams, creating significant scheduling and preparation challenges that highlighted flaws in the qualification system.",
    "citationUrl": "https://en.wikipedia.org/wiki/European_Rugby_Champions_Cup",
    "citationTitle": "Wikipedia: European Rugby Champions Cup"
  },
  {
    "id": "cdd4094c-f042-49c2-b6f9-a61def1709dc",
    "text": "Which rugby league tournament was the first to implement the 'Golden Point' extra time rule, where the first team to score any points in extra time wins the match?",
    "options": [
      "State of Origin",
      "NRL Premiership",
      "Four Nations Tournament",
      "World Club Challenge"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The NRL introduced Golden Point in 2003, becoming the first major rugby league tournament to use this sudden-death format.",
    "detailedExplanation": "The National Rugby League revolutionized rugby league with the introduction of Golden Point extra time in 2003, making it the first major rugby league competition to adopt this sudden-death format. Under this system, if scores are tied after 80 minutes, teams play two five-minute periods of extra time where the first score of any kind (try, goal, drop goal, or penalty) immediately ends the match. This innovation was designed to reduce drawn matches and create more exciting finishes, and has since been adopted by various other rugby league tournaments worldwide, fundamentally changing how close matches are decided.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Rugby_League",
    "citationTitle": "Wikipedia: National Rugby League"
  },
  {
    "id": "8ee2f89a-c934-4f1c-9992-4a25429b07f0",
    "text": "The Rugby League Challenge Cup final traditionally takes place at which venue, and what unique record does Lance Todd Medal winner Shaun Edwards hold in this tournament?",
    "options": [
      "Wembley Stadium; youngest ever winner at 18",
      "Old Trafford; most medals with 4 wins",
      "Wembley Stadium; only player to win on both winning and losing sides",
      "Millennium Stadium; first to win as player and coach"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Challenge Cup final is held at Wembley, and Shaun Edwards uniquely won the Lance Todd Medal despite being on the losing side.",
    "detailedExplanation": "The Challenge Cup final has been held at the iconic Wembley Stadium for most of its modern history, with brief periods at other venues during Wembley's reconstruction. Shaun Edwards holds a unique distinction in Challenge Cup history by winning the Lance Todd Medal (awarded to the man of the match in the final) in 1990 while playing for the losing Wigan team against Warrington. This makes him one of only a handful of players to receive this individual honor despite their team losing the final, demonstrating the rarity of such an outstanding individual performance in a losing cause at rugby league's showpiece event.",
    "citationUrl": "https://en.wikipedia.org/wiki/Challenge_Cup",
    "citationTitle": "Wikipedia: Challenge Cup"
  }
]