[
  {
    "id": "e2d9f1b0-2340-4a59-993f-01c2674941e8",
    "text": "Which 1997 film won 11 Academy Awards, tying the record for most Oscars won by a single film?",
    "options": [
      "Forrest Gump",
      "Titanic",
      "The English Patient",
      "Good Will Hunting"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Titanic won 11 Oscars in 1998, tying the record held by Ben-Hur.",
    "detailedExplanation": "James Cameron's Titanic swept the 70th Academy Awards, winning 11 Oscars out of 14 nominations. The film won Best Picture, Best Director, and nine other categories including Visual Effects, Art Direction, and Cinematography. This tied the record previously set by Ben-Hur in 1959, and the record was later matched again by The Lord of the Rings: The Return of the King in 2003.",
    "citationUrl": "https://en.wikipedia.org/wiki/Titanic_(1997_film)",
    "citationTitle": "Wikipedia: Titanic (1997 film)"
  },
  {
    "id": "81474d94-3288-4af1-9ce8-228097bc8d4a",
    "text": "Which animated film was the first to be nominated for Best Picture at the Academy Awards?",
    "options": [
      "The Lion King",
      "Beauty and the Beast",
      "Toy Story",
      "Shrek"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Beauty and the Beast became the first animated film nominated for Best Picture in 1991.",
    "detailedExplanation": "Disney's Beauty and the Beast made history at the 64th Academy Awards in 1992 by becoming the first animated feature film ever nominated for Best Picture. The film received six nominations total, including Best Original Song for three of its songs. This groundbreaking nomination paved the way for future animated films to be recognized in the top category, though it would be 17 years before another animated film (Up) received a Best Picture nomination.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beauty_and_the_Beast_(1991_film)",
    "citationTitle": "Wikipedia: Beauty and the Beast (1991 film)"
  },
  {
    "id": "0728493d-581c-436f-9414-41c96c09c9b5",
    "text": "Who was the first actor to win an Oscar for playing the Joker?",
    "options": [
      "Jack Nicholson",
      "Heath Ledger",
      "Joaquin Phoenix",
      "Jared Leto"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Heath Ledger won Best Supporting Actor posthumously for his role as the Joker in The Dark Knight (2008).",
    "detailedExplanation": "Heath Ledger's haunting portrayal of the Joker in Christopher Nolan's The Dark Knight earned him the Academy Award for Best Supporting Actor at the 81st Academy Awards in 2009. Tragically, Ledger died in January 2008, months before the film's release, making him only the second actor to win an Oscar posthumously. His dark, chaotic interpretation of the iconic villain was widely praised and is considered one of the greatest film performances of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Heath_Ledger",
    "citationTitle": "Wikipedia: Heath Ledger"
  },
  {
    "id": "6e66b73e-b84b-41fe-916b-8c9e46c65b81",
    "text": "Which film won the first ever Academy Award for Best Picture in 1929?",
    "options": [
      "Wings",
      "Sunrise",
      "The Jazz Singer",
      "Metropolis"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Wings, a World War I aviation epic, won the first Best Picture Oscar at the inaugural Academy Awards ceremony.",
    "detailedExplanation": "Wings, directed by William A. Wellman, won the Academy Award for Outstanding Picture (now called Best Picture) at the first Academy Awards ceremony held on May 16, 1929. The silent war film featured spectacular aerial sequences and starred Clara Bow, Charles 'Buddy' Rogers, and Richard Arlen. Interestingly, the ceremony honored films released between 1927 and 1928, and the entire event lasted only 15 minutes, a far cry from today's lengthy Oscar broadcasts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wings_(1927_film)",
    "citationTitle": "Wikipedia: Wings (1927 film)"
  },
  {
    "id": "0d0076d3-7836-44e3-be1f-571ba330154b",
    "text": "Which Best Picture winner features the famous line 'Here's looking at you, kid'?",
    "options": [
      "Gone with the Wind",
      "Casablanca",
      "The Maltese Falcon",
      "Citizen Kane"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Casablanca won Best Picture in 1944 and features this iconic line spoken by Humphrey Bogart to Ingrid Bergman.",
    "detailedExplanation": "Casablanca, starring Humphrey Bogart and Ingrid Bergman, won the Academy Award for Best Picture at the 16th Academy Awards in 1944. The film is renowned for its memorable dialogue, including the famous line 'Here's looking at you, kid,' delivered by Bogart's character Rick Blaine to Bergman's Ilsa Lund. Set during World War II in the Moroccan city of Casablanca, the romantic drama has become one of the most beloved and quoted films in cinema history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casablanca_(film)",
    "citationTitle": "Wikipedia: Casablanca (film)"
  },
  {
    "id": "45985d7c-8445-4102-a13c-fff56e190a79",
    "text": "Which actress holds the record for most Oscar wins with four Best Actress awards?",
    "options": [
      "Meryl Streep",
      "Bette Davis",
      "Katharine Hepburn",
      "Ingrid Bergman"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Katharine Hepburn won four Best Actress Oscars, a record that still stands today.",
    "detailedExplanation": "Katharine Hepburn holds the record for most Academy Awards won by any actor, with four Best Actress wins spanning four decades. She won for Morning Glory (1933), Guess Who's Coming to Dinner (1967), The Lion in Winter (1968), and On Golden Pond (1981). Hepburn was known for her fierce independence, strong-willed screen persona, and her long professional and personal relationship with Spencer Tracy. Her record of four competitive acting Oscars remains unmatched by any performer.",
    "citationUrl": "https://en.wikipedia.org/wiki/Katharine_Hepburn",
    "citationTitle": "Wikipedia: Katharine Hepburn"
  },
  {
    "id": "52ad086e-6bb8-498b-80d8-199a2befe7bc",
    "text": "Which 2019 Best Picture winner made history as the first non-English language film to win the award?",
    "options": [
      "Roma",
      "Parasite",
      "The Favourite",
      "Green Book"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Parasite became the first non-English language film to win Best Picture at the 2020 Academy Awards.",
    "detailedExplanation": "Bong Joon-ho's Parasite made Oscar history at the 92nd Academy Awards in 2020 by becoming the first non-English language film to win Best Picture. The South Korean dark comedy thriller also won Best Director, Best Original Screenplay, and Best International Feature Film, making it the first film to win both Best Picture and Best International Feature Film in the same year. The film's victory was seen as a significant moment for international cinema and diversity in Hollywood recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parasite_(2019_film)",
    "citationTitle": "Wikipedia: Parasite (2019 film)"
  },
  {
    "id": "29e9fb82-5216-4cf6-9b51-928cfbfb4a6d",
    "text": "Which actor won his first Oscar for the 2016 survival drama 'The Revenant'?",
    "options": [
      "Matt Damon",
      "Leonardo DiCaprio",
      "Michael Fassbender",
      "Eddie Redmayne"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Leonardo DiCaprio won his first and only Oscar for Best Actor for his role in The Revenant.",
    "detailedExplanation": "Leonardo DiCaprio finally won his first Academy Award for Best Actor at the 88th Academy Awards in 2016 for his grueling performance in Alejandro González Iñárritu's The Revenant. DiCaprio's win came after five previous nominations, making it one of the most anticipated and celebrated Oscar victories in recent memory. His portrayal of frontier explorer Hugh Glass required him to endure harsh filming conditions, including eating raw bison liver and sleeping in animal carcasses, demonstrating his commitment to the physically demanding role.",
    "citationUrl": "https://en.wikipedia.org/wiki/Leonardo_DiCaprio",
    "citationTitle": "Wikipedia: Leonardo DiCaprio"
  },
  {
    "id": "fb014122-0a86-413d-8d42-bc9404ea90e0",
    "text": "Which 1997 film won the Academy Award for Best Picture and features the famous line 'I'm the king of the world!'?",
    "options": [
      "The English Patient",
      "Titanic",
      "Good Will Hunting",
      "As Good as It Gets"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Titanic won Best Picture in 1998 for the 1997 film year.",
    "detailedExplanation": "James Cameron's epic romance disaster film Titanic won 11 Academy Awards in 1998, tying the record for most Oscars won by a single film. The movie starred Leonardo DiCaprio and Kate Winslet and became the highest-grossing film of all time until Cameron's own Avatar surpassed it in 2009. The famous line 'I'm the king of the world!' is shouted by DiCaprio's character Jack Dawson while standing at the bow of the ship.",
    "citationUrl": "https://en.wikipedia.org/wiki/Titanic_(1997_film)",
    "citationTitle": "Wikipedia: Titanic (1997 film)"
  },
  {
    "id": "adbec03e-afed-4707-8576-ddcd65effea2",
    "text": "Which actor won the Academy Award for Best Actor for his role as Forrest Gump?",
    "options": [
      "Robin Williams",
      "Tom Hanks",
      "Morgan Freeman",
      "John Travolta"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tom Hanks won Best Actor in 1995 for playing the title character in Forrest Gump.",
    "detailedExplanation": "Tom Hanks won his second consecutive Academy Award for Best Actor in 1995 for his portrayal of the simple but kind-hearted Forrest Gump. This followed his 1994 win for Philadelphia, making him only the second actor in history to win back-to-back Best Actor Oscars. The film itself also won Best Picture, Best Director for Robert Zemeckis, and several other Academy Awards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Forrest_Gump",
    "citationTitle": "Wikipedia: Forrest Gump"
  },
  {
    "id": "4b647554-58c4-42f7-b414-769ef99dc2d7",
    "text": "Which Disney animated film was the first animated feature to win the Academy Award for Best Picture?",
    "options": [
      "The Lion King",
      "Beauty and the Beast",
      "None - no animated film has won",
      "Shrek"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "No animated film has ever won the Academy Award for Best Picture, though several have been nominated.",
    "detailedExplanation": "While several animated films have been nominated for Best Picture, including Beauty and the Beast (1991), Up (2009), and Toy Story 3 (2010), no animated feature has ever won the Academy's top prize. Beauty and the Beast was the first animated film to be nominated in the category. The Academy created a separate Best Animated Feature category in 2001, which has been won by films like Shrek, Finding Nemo, and Frozen.",
    "citationUrl": "https://en.wikipedia.org/wiki/Academy_Award_for_Best_Picture",
    "citationTitle": "Wikipedia: Academy Award for Best Picture"
  },
  {
    "id": "33cdcb47-63a7-44a7-aecf-36ba183279e4",
    "text": "Which 1972 film won Best Picture and is famous for the line 'I'm gonna make him an offer he can't refuse'?",
    "options": [
      "The Godfather",
      "Cabaret",
      "Deliverance",
      "The French Connection"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Godfather won Best Picture in 1973 and features this iconic line spoken by Marlon Brando's character.",
    "detailedExplanation": "Francis Ford Coppola's The Godfather won the Academy Award for Best Picture in 1973, along with Best Adapted Screenplay and Best Actor for Marlon Brando (though Brando famously refused the award). The film, based on Mario Puzo's novel, is widely considered one of the greatest films ever made and spawned two sequels, with The Godfather Part II also winning Best Picture in 1975.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Godfather",
    "citationTitle": "Wikipedia: The Godfather"
  },
  {
    "id": "d5d8b169-f23a-4bcf-97ea-f9c9202d2721",
    "text": "Which actress won the Academy Award for Best Actress for her role in the 2016 musical film La La Land?",
    "options": [
      "Amy Adams",
      "Emma Stone",
      "Natalie Portman",
      "Meryl Streep"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Emma Stone won Best Actress in 2017 for her role as Mia in La La Land.",
    "detailedExplanation": "Emma Stone won the Academy Award for Best Actress in 2017 for her performance as aspiring actress Mia Dolan in Damien Chazelle's musical romance La La Land. The film was nominated for a record-tying 14 Academy Awards and won six, including Best Director for Chazelle, who at age 32 became the youngest winner in that category. Stone's co-star Ryan Gosling was also nominated for Best Actor.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_La_Land_(film)",
    "citationTitle": "Wikipedia: La La Land (film)"
  },
  {
    "id": "ea55e267-554e-4ad1-8e32-26b3faae33e4",
    "text": "Which 1994 film won Best Picture and is set primarily in a prison?",
    "options": [
      "Pulp Fiction",
      "Forrest Gump",
      "The Lion King",
      "Quiz Show"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Forrest Gump won Best Picture in 1995, though The Shawshank Redemption (the prison film) was also nominated but didn't win.",
    "detailedExplanation": "This is a bit of a trick question - while The Shawshank Redemption is the famous 1994 prison film that many consider a masterpiece, it actually lost the Best Picture Oscar to Forrest Gump. The Shawshank Redemption, starring Tim Robbins and Morgan Freeman, was nominated for seven Academy Awards but won none. Despite this, it has since been recognized as one of the greatest films ever made and topped IMDb's Top 250 films list for many years.",
    "citationUrl": "https://en.wikipedia.org/wiki/67th_Academy_Awards",
    "citationTitle": "Wikipedia: 67th Academy Awards"
  },
  {
    "id": "5ec3f1c1-1abd-4c5c-b534-0107e062341f",
    "text": "Which film won the Academy Award for Best Picture in 2020, making history as the first non-English language film to win?",
    "options": [
      "1917",
      "Joker",
      "Parasite",
      "Once Upon a Time in Hollywood"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Parasite, a South Korean film, won Best Picture at the 2020 Academy Awards ceremony.",
    "detailedExplanation": "Bong Joon-ho's South Korean dark comedy thriller Parasite made history at the 92nd Academy Awards in 2020 by becoming the first non-English language film to win Best Picture. The film won four Oscars in total: Best Picture, Best Director, Best Original Screenplay, and Best International Feature Film. This groundbreaking win was seen as a significant moment for international cinema and diversity in Hollywood recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parasite_(2019_film)",
    "citationTitle": "Wikipedia: Parasite (2019 film)"
  },
  {
    "id": "e859fb81-04de-479a-aa82-99c78d821af1",
    "text": "Which 1939 film starring Judy Garland features the song 'Over the Rainbow' and won the Academy Award for Best Original Song?",
    "options": [
      "Gone with the Wind",
      "The Wizard of Oz",
      "Mr. Smith Goes to Washington",
      "Stagecoach"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Over the Rainbow' from The Wizard of Oz won Best Original Song at the 1940 Academy Awards.",
    "detailedExplanation": "The Wizard of Oz, starring Judy Garland as Dorothy, won the Academy Award for Best Original Song in 1940 for 'Over the Rainbow,' composed by Harold Arlen with lyrics by Yip Harburg. While the film is now considered a classic, it actually lost Best Picture to Gone with the Wind that same year. Judy Garland also received a special Juvenile Academy Award for her performance as 'the best juvenile performer of the year.'",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wizard_of_Oz_(1939_film)",
    "citationTitle": "Wikipedia: The Wizard of Oz (1939 film)"
  },
  {
    "id": "8fa24196-e509-462c-a631-669324055284",
    "text": "Which 1997 film starring Leonardo DiCaprio and Kate Winslet won the Academy Award for Best Picture?",
    "options": [
      "Romeo + Juliet",
      "Titanic",
      "The Departed",
      "Inception"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Titanic won Best Picture at the 1998 Academy Awards.",
    "detailedExplanation": "Titanic, directed by James Cameron, won a record-tying 11 Academy Awards at the 1998 ceremony, including Best Picture and Best Director. The epic romance disaster film became the highest-grossing film of all time upon its release and remained so for over a decade. Its sweeping love story set against the backdrop of the infamous ship's sinking captivated audiences worldwide and dominated the awards season.",
    "citationUrl": "https://en.wikipedia.org/wiki/Titanic_(1997_film)",
    "citationTitle": "Wikipedia: Titanic (1997 film)"
  },
  {
    "id": "514b1514-660f-4bf4-95b6-c4ad402fa70b",
    "text": "Which animated film was the first to win the Academy Award for Best Animated Feature when the category was introduced in 2001?",
    "options": [
      "Monsters, Inc.",
      "Shrek",
      "Jimmy Neutron: Boy Genius",
      "Ice Age"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Shrek won the first-ever Best Animated Feature Oscar in 2002.",
    "detailedExplanation": "The Academy Award for Best Animated Feature was introduced at the 74th Academy Awards in 2002 to honor the year's best animated films. Shrek, DreamWorks' irreverent fairy tale parody featuring the voices of Mike Myers, Eddie Murphy, and Cameron Diaz, took home the inaugural award. The category was created in response to the growing prominence and quality of animated films in cinema, and Shrek's win marked a significant moment for non-Disney animated features in Hollywood.",
    "citationUrl": "https://en.wikipedia.org/wiki/Academy_Award_for_Best_Animated_Feature",
    "citationTitle": "Wikipedia: Academy Award for Best Animated Feature"
  },
  {
    "id": "41b041b1-bb5f-4023-88a3-4d7f6ef1ac01",
    "text": "Which actor won the Academy Award for Best Actor for his role as Vito Corleone in 'The Godfather' (1972)?",
    "options": [
      "Al Pacino",
      "James Caan",
      "Robert Duvall",
      "Marlon Brando"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Marlon Brando won Best Actor for playing Vito Corleone, though he famously refused to accept the award.",
    "detailedExplanation": "Marlon Brando won the Academy Award for Best Actor for his iconic portrayal of Don Vito Corleone in Francis Ford Coppola's The Godfather. However, Brando famously refused to accept the award and sent Native American activist Sacheen Littlefeather to the ceremony in his place to decline the Oscar as a protest against Hollywood's treatment of Native Americans in film. This remains one of the most memorable and controversial moments in Oscar history.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Godfather",
    "citationTitle": "Wikipedia: The Godfather"
  },
  {
    "id": "bb71b3e4-b853-4045-98be-b60a097412d6",
    "text": "How many Academy Awards did the 2003 film 'The Lord of the Rings: The Return of the King' win?",
    "options": [
      "9",
      "11",
      "13",
      "8"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Return of the King won all 11 categories it was nominated for, tying the record for most Oscar wins.",
    "detailedExplanation": "The Lord of the Rings: The Return of the King achieved a remarkable clean sweep at the 76th Academy Awards, winning all 11 categories for which it was nominated. This tied the record for most Oscar wins by a single film, matching the achievements of Ben-Hur (1959) and Titanic (1997). The film's wins included Best Picture, Best Director for Peter Jackson, and Best Adapted Screenplay, serving as recognition for the entire Lord of the Rings trilogy's cinematic achievement.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Lord_of_the_Rings:_The_Return_of_the_King",
    "citationTitle": "Wikipedia: The Lord of the Rings: The Return of the King"
  }
]