[
  {
    "id": "3e4c0ae9-43a6-4c21-9e89-5dbc7e17f2fe",
    "text": "Who led the American colonies to independence from Britain and became the first President of the United States?",
    "options": [
      "George Washington",
      "Thomas Jefferson",
      "Benjamin Franklin",
      "John Adams"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "George Washington led the Continental Army during the American Revolution and became the first U.S. President.",
    "detailedExplanation": "George Washington commanded the Continental Army throughout the American Revolutionary War from 1775 to 1783, leading the thirteen colonies to victory against British rule. After the war, he presided over the Constitutional Convention and was unanimously elected as the first President of the United States, serving from 1789 to 1797. His leadership during both the revolution and early republic earned him the title 'Father of His Country.'",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Washington",
    "citationTitle": "Wikipedia: George Washington"
  },
  {
    "id": "f5234298-b848-42e0-a4fa-94738c6f46a4",
    "text": "Which French revolutionary leader was known as 'The Incorruptible' and led the Reign of Terror?",
    "options": [
      "Napoleon Bonaparte",
      "Maximilien Robespierre",
      "Georges Danton",
      "Jean-Paul Marat"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Maximilien Robespierre earned the nickname 'The Incorruptible' and was a key figure during the Reign of Terror.",
    "detailedExplanation": "Maximilien Robespierre was a French lawyer and politician who became one of the most influential figures of the French Revolution. Known for his moral rigidity and incorruptible nature, he was a leading member of the Committee of Public Safety from 1793 to 1794. During this period, known as the Reign of Terror, thousands of perceived enemies of the revolution were executed by guillotine. Ironically, Robespierre himself was executed in July 1794 when the revolution turned against him.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maximilien_Robespierre",
    "citationTitle": "Wikipedia: Maximilien Robespierre"
  },
  {
    "id": "a302e769-c672-4206-8ef7-fff08b8cdedb",
    "text": "Who was the Russian revolutionary leader that led the Bolsheviks to power in the October Revolution of 1917?",
    "options": [
      "Joseph Stalin",
      "Leon Trotsky",
      "Vladimir Lenin",
      "Nikita Khrushchev"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Vladimir Lenin led the Bolshevik Party to victory in the October Revolution and became the first leader of Soviet Russia.",
    "detailedExplanation": "Vladimir Lenin was the architect and leader of the Bolshevik Revolution in October 1917, which overthrew the Russian Provisional Government. As the head of the Bolshevik Party, Lenin had spent years in exile developing revolutionary theory based on Marxism. After returning to Russia in April 1917, he organized the successful coup that brought the Bolsheviks to power, leading to the establishment of the Soviet Union and making him the first head of the Soviet state until his death in 1924.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vladimir_Lenin",
    "citationTitle": "Wikipedia: Vladimir Lenin"
  },
  {
    "id": "fb3b2476-775f-4689-9c05-11140662b4ae",
    "text": "Which South American revolutionary leader is known as 'El Libertador' for liberating several countries from Spanish rule?",
    "options": [
      "Che Guevara",
      "Simón Bolívar",
      "José de San Martín",
      "Francisco Miranda"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Simón Bolívar earned the title 'El Libertador' (The Liberator) for his role in freeing much of South America from Spanish colonialism.",
    "detailedExplanation": "Simón Bolívar was a Venezuelan military and political leader who played a crucial role in the independence of six South American countries: Venezuela, Colombia, Panama, Ecuador, Peru, and Bolivia (which was named after him). Between 1813 and 1830, Bolívar led numerous military campaigns against Spanish colonial forces, earning him the honorary title 'El Libertador.' His vision extended beyond military victory to creating a unified South American federation, though this dream was never fully realized during his lifetime.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sim%C3%B3n_Bol%C3%ADvar",
    "citationTitle": "Wikipedia: Simón Bolívar"
  },
  {
    "id": "e49e0c93-62ce-414f-9002-372e20fd3c72",
    "text": "Who led the Chinese Communist Revolution and founded the People's Republic of China in 1949?",
    "options": [
      "Sun Yat-sen",
      "Chiang Kai-shek",
      "Mao Zedong",
      "Deng Xiaoping"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Mao Zedong led the Chinese Communist Party to victory and proclaimed the People's Republic of China in 1949.",
    "detailedExplanation": "Mao Zedong was the founding father of the People's Republic of China, leading the Chinese Communist Party through decades of struggle against both Japanese invaders and the Nationalist government. After years of civil war, the Communists achieved final victory in 1949, with Mao proclaiming the establishment of the People's Republic of China from Tiananmen Square on October 1, 1949. He remained the paramount leader of China until his death in 1976, fundamentally transforming Chinese society through various revolutionary campaigns and policies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mao_Zedong",
    "citationTitle": "Wikipedia: Mao Zedong"
  },
  {
    "id": "57cc0df7-d98c-4130-b450-4a55a5f5b636",
    "text": "Which Cuban revolutionary leader overthrew the Batista regime and ruled Cuba for nearly five decades?",
    "options": [
      "Che Guevara",
      "Camilo Cienfuegos",
      "Fidel Castro",
      "Raúl Castro"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Fidel Castro led the Cuban Revolution that overthrew Fulgencio Batista and ruled Cuba from 1959 to 2008.",
    "detailedExplanation": "Fidel Castro was a Cuban revolutionary who led a guerrilla campaign against the dictatorial government of Fulgencio Batista. Starting with the failed attack on the Moncada Barracks in 1953, Castro eventually succeeded in overthrowing Batista's regime on January 1, 1959. He then served as Cuba's prime minister from 1959 to 1976 and president from 1976 to 2008, establishing a communist state just 90 miles from the United States. His rule lasted 49 years, making him one of the longest-serving leaders in modern history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fidel_Castro",
    "citationTitle": "Wikipedia: Fidel Castro"
  },
  {
    "id": "4e08fc98-3371-40db-a80f-08755416171a",
    "text": "Who led India's independence movement against British rule through non-violent civil disobedience?",
    "options": [
      "Jawaharlal Nehru",
      "Mahatma Gandhi",
      "Subhas Chandra Bose",
      "Bhagat Singh"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Mahatma Gandhi pioneered non-violent resistance and led India's struggle for independence from British colonial rule.",
    "detailedExplanation": "Mahatma Gandhi, born Mohandas Karamchand Gandhi, became the leader of the Indian independence movement through his philosophy of non-violent resistance called 'satyagraha.' His methods included civil disobedience, boycotts of British goods, and peaceful protests like the famous Salt March in 1930. Gandhi's approach of non-violent revolution inspired civil rights movements worldwide and ultimately contributed to India gaining independence in 1947. He was assassinated in 1948, shortly after achieving his life's goal of Indian independence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mahatma_Gandhi",
    "citationTitle": "Wikipedia: Mahatma Gandhi"
  },
  {
    "id": "7b5a66a9-7718-438e-8535-ffc816ac2542",
    "text": "Which revolutionary leader became the first President of South Africa after the end of apartheid?",
    "options": [
      "Steve Biko",
      "Oliver Tambo",
      "Nelson Mandela",
      "Desmond Tutu"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Nelson Mandela led the anti-apartheid movement and became South Africa's first Black president in 1994.",
    "detailedExplanation": "Nelson Mandela was a South African anti-apartheid revolutionary who spent 27 years in prison for his activism against the racist apartheid system. After his release in 1990, he led negotiations with the white minority government to transition South Africa to a multiracial democracy. In 1994, he was elected as South Africa's first Black president in the country's first fully democratic elections. Mandela served one term as president from 1994 to 1999, focusing on reconciliation and nation-building, and won the Nobel Peace Prize in 1993 for his efforts to dismantle apartheid.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nelson_Mandela",
    "citationTitle": "Wikipedia: Nelson Mandela"
  },
  {
    "id": "2cb193de-3b83-4847-b6eb-ef3c03aff33d",
    "text": "Which revolutionary leader wrote the influential pamphlet 'Common Sense' in 1776?",
    "options": [
      "Thomas Paine",
      "Benjamin Franklin",
      "John Adams",
      "Patrick Henry"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Thomas Paine wrote 'Common Sense,' which convinced many colonists to support independence from Britain.",
    "detailedExplanation": "Thomas Paine's pamphlet 'Common Sense,' published in January 1776, was instrumental in persuading American colonists to support independence from Britain. Written in plain language that ordinary people could understand, it sold over 500,000 copies and helped shift public opinion toward revolution. Paine argued that monarchy was an unnatural form of government and that America had the right and ability to govern itself.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thomas_Paine",
    "citationTitle": "Wikipedia: Thomas Paine"
  },
  {
    "id": "b3bb2a82-e172-4995-a713-10611df43008",
    "text": "What was the name of the ship that brought Vladimir Lenin back to Russia in 1917?",
    "options": [
      "The sealed train",
      "The Aurora",
      "The Potemkin",
      "The Baltic Express"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Lenin returned to Russia from exile in a sealed train provided by the German government.",
    "detailedExplanation": "Vladimir Lenin returned to Russia from Swiss exile in April 1917 aboard what became known as the 'sealed train.' The German government, hoping that Lenin would help destabilize Russia and take it out of World War I, provided safe passage through German territory. The train car was diplomatically sealed, meaning Lenin and his fellow revolutionaries could not disembark on German soil. This journey was crucial to Lenin's ability to lead the Bolshevik Revolution later that year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lenin%27s_return_to_Russia",
    "citationTitle": "Wikipedia: Lenin's return to Russia"
  },
  {
    "id": "9976cd0d-1232-403f-a451-5f003fffbf80",
    "text": "Which revolutionary leader was executed by guillotine during the French Revolution along with Robespierre?",
    "options": [
      "Louis Antoine de Saint-Just",
      "Jacques Danton",
      "Jean-Paul Marat",
      "Olympe de Gouges"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Saint-Just, known as the 'Angel of Death,' was executed alongside Robespierre in 1794.",
    "detailedExplanation": "Louis Antoine de Saint-Just was a close ally of Maximilien Robespierre and one of the youngest leaders of the French Revolution. Known as the 'Angel of Death' for his role in the Reign of Terror, Saint-Just was a radical Jacobin who helped orchestrate many executions. When Robespierre fell from power in July 1794 during the Thermidorian Reaction, Saint-Just was arrested and executed by guillotine alongside his mentor on July 28, 1794, at age 26.",
    "citationUrl": "https://en.wikipedia.org/wiki/Louis_Antoine_de_Saint-Just",
    "citationTitle": "Wikipedia: Louis Antoine de Saint-Just"
  },
  {
    "id": "76331f78-ce21-4a0e-a276-5f81bab669d1",
    "text": "What nationality was revolutionary leader Che Guevara?",
    "options": [
      "Argentine",
      "Cuban",
      "Mexican",
      "Colombian"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Che Guevara was born in Argentina before joining Castro's Cuban Revolution.",
    "detailedExplanation": "Ernesto 'Che' Guevara was born in Rosario, Argentina, in 1928. Though he became famous for his role in the Cuban Revolution alongside Fidel Castro, Guevara was Argentine by birth. His nickname 'Che' actually comes from an Argentine expression meaning 'hey' or 'buddy.' Before joining the Cuban revolutionary movement, Guevara traveled extensively through Latin America as a young man, experiences that shaped his revolutionary ideology and commitment to fighting imperialism across the continent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Che_Guevara",
    "citationTitle": "Wikipedia: Che Guevara"
  },
  {
    "id": "6302e6d5-8f36-4b4c-a322-2edde767b7b3",
    "text": "Which revolution did Oliver Cromwell lead in 17th century England?",
    "options": [
      "English Civil War",
      "Glorious Revolution",
      "Peasants' Revolt",
      "War of the Roses"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Cromwell was a key military leader in the English Civil War that resulted in the execution of King Charles I.",
    "detailedExplanation": "Oliver Cromwell was a leading figure in the English Civil War (1642-1651), which pitted Parliamentary forces against the Royalists supporting King Charles I. As a military commander and politician, Cromwell played a crucial role in the Parliamentary victory that led to the execution of Charles I in 1649 and the establishment of the Commonwealth of England. Cromwell eventually became Lord Protector, effectively ruling England as a military dictator from 1653 until his death in 1658.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oliver_Cromwell",
    "citationTitle": "Wikipedia: Oliver Cromwell"
  },
  {
    "id": "7ac023f4-162a-44d6-9d7f-c9d64e08de35",
    "text": "In which year did Toussaint Louverture lead the Haitian Revolution?",
    "options": [
      "1791",
      "1776",
      "1804",
      "1789"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Haitian Revolution began in 1791, with Louverture emerging as its key leader.",
    "detailedExplanation": "Toussaint Louverture became the leader of the Haitian Revolution, which began in 1791 as a slave uprising in the French colony of Saint-Domingue (now Haiti). This was the first and only successful slave revolt in history that led to the founding of a free state governed by non-whites and former slaves. Louverture, born into slavery himself, proved to be a brilliant military strategist and political leader, eventually becoming governor of the entire island before being captured by Napoleon's forces in 1802.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toussaint_Louverture",
    "citationTitle": "Wikipedia: Toussaint Louverture"
  },
  {
    "id": "b582e32b-bd48-4c65-8556-9dfb9caa01e2",
    "text": "Which Italian revolutionary leader was known as the 'Hero of Two Worlds'?",
    "options": [
      "Giuseppe Garibaldi",
      "Giuseppe Mazzini",
      "Camillo di Cavour",
      "Victor Emmanuel II"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Garibaldi earned this nickname for his revolutionary activities in both South America and Italy.",
    "detailedExplanation": "Giuseppe Garibaldi earned the title 'Hero of Two Worlds' for his revolutionary activities on both sides of the Atlantic. In South America, he fought for independence movements in Brazil and Uruguay during his exile in the 1830s and 1840s. Returning to Italy, he became a central figure in the Risorgimento, the movement for Italian unification, leading his famous 'Redshirts' in campaigns that helped create the unified Kingdom of Italy. His military prowess and dedication to republican ideals made him a legendary figure in both continents.",
    "citationUrl": "https://en.wikipedia.org/wiki/Giuseppe_Garibaldi",
    "citationTitle": "Wikipedia: Giuseppe Garibaldi"
  },
  {
    "id": "56013a64-2eb5-4b21-b493-c525a22f8ab9",
    "text": "What was the profession of Samuel Adams before he became a revolutionary leader?",
    "options": [
      "Tax collector",
      "Lawyer",
      "Merchant",
      "Printer"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Adams worked as a tax collector in Boston before dedicating himself to the revolutionary cause.",
    "detailedExplanation": "Before becoming one of the most prominent organizers of the American Revolution, Samuel Adams worked as a tax collector in Boston. Ironically, he was notably unsuccessful at this job and was often in debt himself. Adams was more interested in politics than tax collection, and he used his position to build networks and organize resistance to British policies. He was a key organizer of the Boston Tea Party and helped establish the committees of correspondence that coordinated colonial resistance efforts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Samuel_Adams",
    "citationTitle": "Wikipedia: Samuel Adams"
  },
  {
    "id": "a53d67ae-75d9-47f2-8052-b405e15425cd",
    "text": "Which Mexican revolutionary leader was known for his famous saying 'It is better to die on your feet than to live on your knees'?",
    "options": [
      "Pancho Villa",
      "Emiliano Zapata",
      "Porfirio Díaz",
      "Venustiano Carranza"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Emiliano Zapata, the Mexican revolutionary, is credited with this famous quote about dignity and resistance.",
    "detailedExplanation": "Emiliano Zapata was a leading figure in the Mexican Revolution who fought for agrarian rights and land reform. He led the Liberation Army of the South and became an iconic symbol of resistance against oppression. His quote 'It is better to die on your feet than to live on your knees' has become one of the most famous revolutionary slogans in history, embodying his philosophy of fighting for dignity and justice rather than accepting subjugation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Emiliano_Zapata",
    "citationTitle": "Wikipedia: Emiliano Zapata"
  },
  {
    "id": "e3b85006-5e37-4605-975e-a5f677017c23",
    "text": "What was the nickname of Irish revolutionary leader Michael Collins?",
    "options": [
      "The Big Fellow",
      "The Iron Wolf",
      "The Liberator",
      "The Chief"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Michael Collins was commonly known as 'The Big Fellow' due to his imposing physical presence and leadership role.",
    "detailedExplanation": "Michael Collins was a key figure in the Irish War of Independence and the Irish Civil War. Standing over six feet tall with a commanding presence, he earned the nickname 'The Big Fellow' from his comrades. Collins was instrumental in developing guerrilla warfare tactics against British forces and later became Chairman of the Provisional Government of the Irish Free State before his assassination in 1922 at the age of 31.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Collins_(Irish_leader)",
    "citationTitle": "Wikipedia: Michael Collins (Irish leader)"
  },
  {
    "id": "279ef48f-6188-4737-8dbb-e70a72106abe",
    "text": "Which Vietnamese revolutionary leader founded the Viet Minh independence movement?",
    "options": [
      "Vo Nguyen Giap",
      "Ho Chi Minh",
      "Ngo Dinh Diem",
      "Le Duan"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Ho Chi Minh founded the Viet Minh in 1941 to fight for Vietnamese independence from French colonial rule.",
    "detailedExplanation": "Ho Chi Minh, born Nguyen Sinh Cung, was the revolutionary leader who founded the Viet Minh (League for the Independence of Vietnam) in 1941. The organization was created to resist Japanese occupation during World War II and later fought against French colonial rule. Ho Chi Minh served as President of North Vietnam from 1945 until his death in 1969, leading the country through the First Indochina War against France and much of the Vietnam War against the United States.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ho_Chi_Minh",
    "citationTitle": "Wikipedia: Ho Chi Minh"
  },
  {
    "id": "b14a872a-e2b3-4432-88fd-3277beecd381",
    "text": "In which prison was Nelson Mandela held for the majority of his 27-year imprisonment?",
    "options": [
      "Pollsmoor Prison",
      "Victor Verster Prison",
      "Robben Island",
      "Pretoria Central Prison"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Nelson Mandela spent 18 of his 27 years in prison on Robben Island, making it the site of the majority of his imprisonment.",
    "detailedExplanation": "Robben Island, located off the coast of Cape Town, South Africa, was where Nelson Mandela spent 18 years of his 27-year imprisonment (from 1964 to 1982). The island served as a maximum-security prison for political prisoners during apartheid. Mandela was later moved to Pollsmoor Prison and then Victor Verster Prison before his release in 1990. Today, Robben Island is a UNESCO World Heritage Site and museum, symbolizing the triumph of democracy and freedom over oppression.",
    "citationUrl": "https://en.wikipedia.org/wiki/Robben_Island",
    "citationTitle": "Wikipedia: Robben Island"
  }
]