[
  {
    "id": "76f06f89-9873-4f0e-8491-207943575c48",
    "text": "Which revolutionary leader wrote 'The Green Book' (Al-Kitab al-Akhdar), outlining his political philosophy known as the 'Third Universal Theory'?",
    "options": [
      "Gamal Abdel Nasser",
      "Muammar Gaddafi",
      "Saddam Hussein",
      "Hafez al-Assad"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Muammar Gaddafi wrote 'The Green Book' outlining his Third Universal Theory.",
    "detailedExplanation": "Muammar Gaddafi published 'The Green Book' in three volumes between 1975-1979, presenting his political philosophy called the 'Third Universal Theory' as an alternative to both capitalism and communism. The book outlined his concept of direct democracy through 'people's committees' and became mandatory reading in Libyan schools during his rule.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Green_Book_(Muammar_Gaddafi)",
    "citationTitle": "Wikipedia: The Green Book (Muammar Gaddafi)"
  },
  {
    "id": "3c5cc7c6-9900-49b8-a7dd-8c7101597501",
    "text": "Before leading the Cuban Revolution, Fidel Castro was trained as what profession?",
    "options": [
      "Doctor",
      "Teacher",
      "Lawyer",
      "Engineer"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Fidel Castro was a trained lawyer before becoming a revolutionary leader.",
    "detailedExplanation": "Fidel Castro graduated from the University of Havana Law School in 1950 and practiced law briefly before turning to revolutionary activities. His legal background proved useful in his political career, as he often defended himself in court and used legal arguments to justify his revolutionary actions, most famously in his 'History Will Absolve Me' speech during his 1953 trial.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fidel_Castro",
    "citationTitle": "Wikipedia: Fidel Castro"
  },
  {
    "id": "6e520a82-8aeb-4b03-82c4-34b0225e110a",
    "text": "Which Vietnamese revolutionary leader used over 50 different aliases during his lifetime, including Nguyen Ai Quoc?",
    "options": [
      "Vo Nguyen Giap",
      "Le Duan",
      "Ho Chi Minh",
      "Pham Van Dong"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Ho Chi Minh used over 50 aliases, including Nguyen Ai Quoc ('Nguyen the Patriot').",
    "detailedExplanation": "Ho Chi Minh, born Nguyen Sinh Cung, adopted numerous pseudonyms throughout his revolutionary career to evade colonial authorities and international surveillance. 'Nguyen Ai Quoc' meaning 'Nguyen the Patriot' was one of his most famous early aliases, used during his time in France and China. He finally settled on 'Ho Chi Minh' (meaning 'Bringer of Light') in the 1940s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ho_Chi_Minh",
    "citationTitle": "Wikipedia: Ho Chi Minh"
  },
  {
    "id": "ce6ccaa1-2855-47fd-acc3-55a880b513e3",
    "text": "Toussaint Louverture, leader of the Haitian Revolution, was born into slavery on which Caribbean island?",
    "options": [
      "Jamaica",
      "Saint-Domingue (Haiti)",
      "Barbados",
      "Martinique"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Toussaint Louverture was born into slavery on Saint-Domingue, the French colony that became Haiti.",
    "detailedExplanation": "Toussaint Louverture was born around 1743 on the Bréda plantation in Saint-Domingue (modern-day Haiti), then France's most profitable sugar colony. Despite being born into slavery, he was relatively privileged, learning to read and write, which was rare for enslaved people. He later led the successful slave revolt that began in 1791 and eventually resulted in Haiti becoming the first independent black republic in 1804.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toussaint_Louverture",
    "citationTitle": "Wikipedia: Toussaint Louverture"
  },
  {
    "id": "f28988a8-e755-4127-815e-97777d02d63a",
    "text": "Which Irish revolutionary leader was executed in 1916 and had previously been a schoolteacher and founded St. Enda's School?",
    "options": [
      "Michael Collins",
      "Patrick Pearse",
      "James Connolly",
      "Éamon de Valera"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Patrick Pearse founded St. Enda's School and was executed after the 1916 Easter Rising.",
    "detailedExplanation": "Patrick Pearse was an educator, poet, and revolutionary who founded St. Enda's School (Scoil Éanna) in 1908 to promote Irish language and culture. He was one of the leaders of the 1916 Easter Rising in Dublin and read the Proclamation of the Irish Republic from the steps of the General Post Office. He was executed by firing squad on May 3, 1916, along with his brother Willie.",
    "citationUrl": "https://en.wikipedia.org/wiki/Patrick_Pearse",
    "citationTitle": "Wikipedia: Patrick Pearse"
  },
  {
    "id": "5c1f392d-ed4b-4c76-88c4-cde7f7205e32",
    "text": "Which Mexican revolutionary leader was known by the nickname 'El Centauro del Norte' (The Centaur of the North)?",
    "options": [
      "Emiliano Zapata",
      "Pancho Villa",
      "Venustiano Carranza",
      "Álvaro Obregón"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Pancho Villa was nicknamed 'El Centauro del Norte' for his legendary horseback riding skills in northern Mexico.",
    "detailedExplanation": "Francisco 'Pancho' Villa earned the nickname 'El Centauro del Norte' due to his exceptional horsemanship and his dominance in northern Mexico during the Mexican Revolution (1910-1920). Like the mythical centaur, Villa seemed inseparable from his horse, leading lightning-fast cavalry raids across the desert landscapes of Chihuahua and other northern states. His mobility and tactical brilliance made him one of the most feared and respected military commanders of the revolution.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pancho_Villa",
    "citationTitle": "Wikipedia: Pancho Villa"
  },
  {
    "id": "01362980-9ec2-4b91-a2b3-44e29cc74979",
    "text": "Sun Yat-sen, father of the Republic of China, spent significant time in exile and died in which city in 1925?",
    "options": [
      "Hong Kong",
      "Beijing",
      "Shanghai",
      "Guangzhou"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Sun Yat-sen died in Beijing in 1925 while attempting to unify China.",
    "detailedExplanation": "Sun Yat-sen died of liver cancer in Beijing on March 12, 1925, while engaged in negotiations to reunify China, which had been fragmented among various warlords since the fall of the Qing Dynasty. Despite spending much of his revolutionary career in exile in places like Japan, Hawaii, and the United States, he had returned to China and was working toward national unity when his health failed. His death occurred in the Rockefeller Foundation-funded Peking Union Medical College Hospital.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sun_Yat-sen",
    "citationTitle": "Wikipedia: Sun Yat-sen"
  },
  {
    "id": "7dde62ed-ae39-4e26-b9d9-f8f80227f18e",
    "text": "Which South American revolutionary leader died at the young age of 31 in Bolivia and became known as 'El Che'?",
    "options": [
      "Camilo Cienfuegos",
      "Che Guevara",
      "Régis Debray",
      "Inti Peredo"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Che Guevara died at age 39 (not 31) in Bolivia in 1967, but was indeed known as 'El Che'.",
    "detailedExplanation": "Ernesto 'Che' Guevara, the Argentine-born revolutionary, was actually 39 when he was captured and executed in Bolivia in October 1967, not 31 as the question states. However, he was indeed universally known as 'El Che' (a common Argentine expression meaning 'hey' or 'buddy'). After helping Fidel Castro win the Cuban Revolution, Che left Cuba to foment revolution elsewhere, ultimately leading a failed guerrilla campaign in Bolivia where he was captured and killed by Bolivian forces assisted by the CIA.",
    "citationUrl": "https://en.wikipedia.org/wiki/Che_Guevara",
    "citationTitle": "Wikipedia: Che Guevara"
  },
  {
    "id": "d6b08897-4120-46e3-b613-f95db54260ad",
    "text": "Which French revolutionary leader was known as 'The Incorruptible' due to his unwavering moral principles during the Reign of Terror?",
    "options": [
      "Georges Danton",
      "Maximilien Robespierre",
      "Jean-Paul Marat",
      "Jacques Hébert"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Maximilien Robespierre earned the nickname 'The Incorruptible' for his moral rigidity and principled stance.",
    "detailedExplanation": "Maximilien Robespierre (1758-1794) was a French lawyer and politician who became one of the most influential figures of the French Revolution. He earned the nickname 'L'Incorruptible' (The Incorruptible) due to his reputation for moral virtue, dedication to the revolutionary cause, and his refusal to be swayed by personal gain. As a leader of the Jacobins and the Committee of Public Safety, he played a crucial role during the Reign of Terror, advocating for the execution of King Louis XVI and implementing policies of revolutionary justice.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maximilien_Robespierre",
    "citationTitle": "Wikipedia: Maximilien Robespierre"
  },
  {
    "id": "3c8688a9-8043-416d-a9e8-d60db2e7bf21",
    "text": "Simón Bolívar, 'El Libertador', was instrumental in the independence of six South American countries. In which modern-day country was he born?",
    "options": [
      "Colombia",
      "Venezuela",
      "Ecuador",
      "Peru"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Simón Bolívar was born in Caracas, Venezuela, in 1783.",
    "detailedExplanation": "Simón José Antonio de la Santísima Trinidad Bolívar y Palacios was born on July 24, 1783, in Caracas, which was then part of the Captaincy General of Venezuela under Spanish colonial rule. Known as 'El Libertador' (The Liberator), Bolívar led the independence movements that freed Venezuela, Colombia, Panama, Ecuador, Peru, and Bolivia from Spanish rule. His birthplace in Caracas is now a museum, and he remains a revered figure throughout Latin America for his role in establishing republican governments across the continent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sim%C3%B3n_Bol%C3%ADvar",
    "citationTitle": "Wikipedia: Simón Bolívar"
  },
  {
    "id": "c8d818fd-950d-4229-8725-5441fc579844",
    "text": "Which Russian revolutionary leader was living in exile in Switzerland when the February Revolution began in 1917, requiring German assistance to return to Russia?",
    "options": [
      "Joseph Stalin",
      "Leon Trotsky",
      "Vladimir Lenin",
      "Georgy Plekhanov"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Vladimir Lenin was in Zurich, Switzerland, when the February Revolution started and famously returned via the sealed train provided by Germany.",
    "detailedExplanation": "Vladimir Lenin was living in exile in Zurich, Switzerland, when news of the February Revolution reached him in March 1917. Desperate to return to Russia to lead the Bolsheviks, Lenin accepted German assistance in the form of a sealed railway car that transported him through Germany to Russia. The Germans facilitated his journey hoping that Lenin's anti-war stance would help remove Russia from World War I. His return to Petrograd in April 1917 marked a turning point in the Russian Revolution, as he immediately began organizing the Bolsheviks for the October Revolution that would bring them to power.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vladimir_Lenin",
    "citationTitle": "Wikipedia: Vladimir Lenin"
  },
  {
    "id": "e5ceeb44-948c-48c9-9d3d-52a38912a22c",
    "text": "Which Chinese revolutionary leader led the Long March of 1934-1935, a strategic retreat that became legendary in Communist Party history?",
    "options": [
      "Zhou Enlai",
      "Deng Xiaoping",
      "Mao Zedong",
      "Zhu De"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Mao Zedong led the Long March, which established his leadership of the Chinese Communist Party.",
    "detailedExplanation": "Mao Zedong led the Long March (1934-1935), a military retreat undertaken by the Red Army of the Communist Party of China to evade the pursuit of the Kuomintang army. The march covered approximately 9,000 kilometers (5,600 miles) over 370 days, from Jiangxi province to Shaanxi province. Despite massive casualties and hardships, the Long March became a foundational myth of Chinese Communism and solidified Mao's position as the paramount leader of the Party. The march demonstrated the resilience and determination of the Communist forces and became a powerful propaganda tool for recruitment and morale.",
    "citationUrl": "https://en.wikipedia.org/wiki/Long_March",
    "citationTitle": "Wikipedia: Long March"
  },
  {
    "id": "2fc38dba-0769-460d-b881-fbcd01db447b",
    "text": "Which Italian revolutionary leader was known as the 'Hero of Two Worlds' for his military campaigns in both South America and Europe?",
    "options": [
      "Giuseppe Mazzini",
      "Giuseppe Garibaldi",
      "Camillo di Cavour",
      "Victor Emmanuel II"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Giuseppe Garibaldi earned this nickname for fighting for freedom in both South America and Italy.",
    "detailedExplanation": "Giuseppe Garibaldi (1807-1882) earned the title 'Hero of Two Worlds' for his revolutionary activities on two continents. In South America, he fought for the independence of Brazil and Uruguay during his exile from Italy. Upon returning to Europe, he became a central figure in the Italian unification movement (Risorgimento), leading his famous volunteer army known as the 'Red Shirts' or 'Thousand' in the conquest of the Kingdom of the Two Sicilies. His charismatic leadership and military prowess made him one of the most celebrated figures of 19th-century nationalism and republicanism.",
    "citationUrl": "https://en.wikipedia.org/wiki/Giuseppe_Garibaldi",
    "citationTitle": "Wikipedia: Giuseppe Garibaldi"
  },
  {
    "id": "b87af27e-2ee7-411e-8e7f-210bb11baa0a",
    "text": "Which American revolutionary leader served as the first Secretary of the Treasury and was killed in a duel by Aaron Burr in 1804?",
    "options": [
      "Thomas Jefferson",
      "Alexander Hamilton",
      "John Adams",
      "Benjamin Franklin"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Alexander Hamilton was killed in a duel with Aaron Burr on July 11, 1804, in Weehawken, New Jersey.",
    "detailedExplanation": "Alexander Hamilton (1755-1804) was one of the Founding Fathers of the United States and the first Secretary of the Treasury under President George Washington. As a key architect of the American financial system, he established the national bank and federal credit system. His political rivalry with Aaron Burr, stemming from years of personal and political conflicts, culminated in a fatal duel on July 11, 1804, in Weehawken, New Jersey. Hamilton was mortally wounded and died the following day, ending the life of one of America's most influential early statesmen.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alexander_Hamilton",
    "citationTitle": "Wikipedia: Alexander Hamilton"
  },
  {
    "id": "a7387fbf-c8d8-44bd-8fdc-e8e595b0e49d",
    "text": "Which Indian independence leader was known as the 'Iron Man of India' and successfully integrated over 560 princely states into the newly independent nation?",
    "options": [
      "Jawaharlal Nehru",
      "Mahatma Gandhi",
      "Vallabhbhai Patel",
      "Subhas Chandra Bose"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Vallabhbhai Patel earned the title 'Iron Man of India' for his firm handling of the integration of princely states.",
    "detailedExplanation": "Vallabhbhai Jhaverbhai Patel (1875-1950), known as Sardar Patel, earned the nickname 'Iron Man of India' for his strong will and determination in unifying the country after independence. As India's first Deputy Prime Minister and Minister of Home Affairs, he successfully negotiated the integration of over 560 princely states into the Indian Union through a combination of diplomacy and, when necessary, force. His most notable achievement was the integration of Hyderabad through 'Operation Polo' in 1948. Patel's efforts ensured that India emerged as a unified nation rather than a fragmented collection of independent states.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vallabhbhai_Patel",
    "citationTitle": "Wikipedia: Vallabhbhai Patel"
  },
  {
    "id": "8c001028-c3fb-4949-b847-03ec4cdd9363",
    "text": "Which Turkish revolutionary leader abolished the Ottoman Caliphate in 1924 and established the modern Republic of Turkey?",
    "options": [
      "Enver Pasha",
      "Mustafa Kemal Atatürk",
      "Ismet İnönü",
      "Kazım Karabekir"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Mustafa Kemal Atatürk abolished the Caliphate on March 3, 1924, as part of his secular reforms.",
    "detailedExplanation": "Mustafa Kemal Atatürk (1881-1938) was the founder and first President of the Republic of Turkey. After leading the Turkish War of Independence against occupying Allied forces, he initiated sweeping reforms to modernize and secularize Turkey. On March 3, 1924, he abolished the Ottoman Caliphate, ending over 400 years of Ottoman religious and political authority. This bold move was part of his broader program of westernization and secularization, which included adopting the Latin alphabet, granting women equal rights, and separating religion from state affairs. His reforms transformed Turkey from a theocratic empire into a modern, secular republic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mustafa_Kemal_Atat%C3%BCrk",
    "citationTitle": "Wikipedia: Mustafa Kemal Atatürk"
  },
  {
    "id": "ccf5f433-e71d-49e7-bd0a-c3ab3c8d8f8d",
    "text": "Which Polish revolutionary leader founded the Polish Legions during World War I and became the first Chief of State of independent Poland in 1918?",
    "options": [
      "Józef Piłsudski",
      "Roman Dmowski",
      "Ignacy Jan Paderewski",
      "Wladyslaw Sikorski"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Józef Piłsudski founded the Polish Legions and became Poland's first Chief of State.",
    "detailedExplanation": "Józef Piłsudski was a pivotal figure in Polish independence, founding the Polish Legions in 1914 to fight for Austrian-Hungary against Russia during World War I. His strategic vision was to exploit the conflict between the partitioning powers to restore Polish independence. When Poland regained independence in 1918, Piłsudski became the first Chief of State and later led a military coup in 1926, establishing an authoritarian regime that lasted until his death in 1935.",
    "citationUrl": "https://en.wikipedia.org/wiki/J%C3%B3zef_Pi%C5%82sudski",
    "citationTitle": "Wikipedia: Józef Piłsudski"
  },
  {
    "id": "cc3cbc7a-33d9-4e84-9e28-012490242545",
    "text": "Which Kenyan revolutionary leader was imprisoned for nearly seven years by the British colonial government and later became the country's first President?",
    "options": [
      "Tom Mboya",
      "Oginga Odinga",
      "Jomo Kenyatta",
      "Dedan Kimathi"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Jomo Kenyatta was imprisoned from 1952-1959 and became Kenya's first President in 1964.",
    "detailedExplanation": "Jomo Kenyatta was arrested in 1952 during the Mau Mau Uprising and sentenced to seven years of hard labor on charges of managing the banned Mau Mau movement, though he served until 1959 with additional restrictions. His imprisonment made him a symbol of Kenyan resistance to colonial rule. After his release and Kenya's independence in 1963, he became the country's first Prime Minister and then its first President in 1964, serving until his death in 1978.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jomo_Kenyatta",
    "citationTitle": "Wikipedia: Jomo Kenyatta"
  },
  {
    "id": "89f2e328-34e4-4cfc-85c3-a0715e468eb6",
    "text": "Which Romanian revolutionary leader was executed alongside his wife on Christmas Day 1989, ending his 24-year communist dictatorship?",
    "options": [
      "Gheorghe Gheorghiu-Dej",
      "Nicolae Ceaușescu",
      "Ion Antonescu",
      "Petru Groza"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Nicolae Ceaușescu and his wife Elena were executed on December 25, 1989, during the Romanian Revolution.",
    "detailedExplanation": "Nicolae Ceaușescu ruled Romania from 1965 to 1989, initially gaining popularity for his independent foreign policy but later becoming increasingly authoritarian and implementing harsh austerity measures. The Romanian Revolution began in December 1989, and after fleeing Bucharest, Ceaușescu and his wife Elena were captured, given a brief military trial, and executed by firing squad on Christmas Day 1989, marking the violent end of communist rule in Romania.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nicolae_Ceau%C8%99escu",
    "citationTitle": "Wikipedia: Nicolae Ceaușescu"
  },
  {
    "id": "9f391788-211a-4e8c-a3f2-7d2e7f8a7078",
    "text": "Which Ethiopian revolutionary leader overthrew Emperor Haile Selassie in 1974 and ruled the country under a brutal Marxist-Leninist regime known as the Derg?",
    "options": [
      "Mengistu Haile Mariam",
      "Haile Selassie II",
      "Abiy Ahmed",
      "Meles Zenawi"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Mengistu Haile Mariam led the Derg military junta that overthrew Haile Selassie and ruled Ethiopia from 1977-1991.",
    "detailedExplanation": "Mengistu Haile Mariam was a key figure in the 1974 military coup that overthrew Emperor Haile Selassie and later became the head of the Derg (military committee) that ruled Ethiopia. His regime, which lasted from 1977 to 1991, was marked by the 'Red Terror' campaign, forced relocations, and devastating famines. Supported by the Soviet Union during the Cold War, his brutal Marxist-Leninist government was responsible for hundreds of thousands of deaths before he was finally overthrown and fled to Zimbabwe in 1991.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mengistu_Haile_Mariam",
    "citationTitle": "Wikipedia: Mengistu Haile Mariam"
  }
]