[
  {
    "id": "52e99afc-5147-470f-a9f2-7879074a7d72",
    "text": "Which revolutionary leader famously said 'Give me liberty, or give me death!' during a speech to the Virginia Convention in 1775?",
    "options": [
      "Patrick Henry",
      "Samuel Adams",
      "Thomas Paine",
      "John Hancock"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Patrick Henry delivered this famous rallying cry on March 23, 1775, at St. John's Church in Richmond, Virginia.",
    "detailedExplanation": "Patrick Henry's passionate speech to the Second Virginia Convention is considered one of the most influential speeches in American history. His famous words 'Give me liberty, or give me death!' came at the conclusion of his argument for arming the Virginia militia against British forces. The speech was delivered at St. John's Church in Richmond on March 23, 1775, and helped convince the Virginia Assembly to pass a resolution delivering Virginian troops for the Revolutionary War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Patrick_Henry",
    "citationTitle": "Wikipedia: Patrick Henry"
  },
  {
    "id": "d7a0ceba-c55c-4dce-9a97-6b8ea93755ef",
    "text": "What was the name of the ship that brought Vladimir Lenin back to Russia in 1917, helping spark the October Revolution?",
    "options": [
      "The Aurora",
      "A sealed German train",
      "The Potemkin",
      "The Baltic Express"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Lenin traveled from Switzerland to Russia in a sealed train car provided by Germany, arriving at Finland Station in Petrograd in April 1917.",
    "detailedExplanation": "Vladimir Lenin's return to Russia in April 1917 was facilitated by the German government, who hoped his presence would destabilize Russia and lead to their withdrawal from World War I. Lenin traveled in a sealed train car from Switzerland through Germany and Sweden to Finland, then to Petrograd (now St. Petersburg). His arrival at Finland Station on April 16, 1917, was a pivotal moment that energized the Bolshevik movement and ultimately led to the October Revolution.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lenin%27s_sealed_train",
    "citationTitle": "Wikipedia: Lenin's sealed train"
  },
  {
    "id": "7b7030b6-af2f-4a7b-b692-38b3c3b37239",
    "text": "Which Chinese revolutionary leader is credited with founding the Republic of China and is known as the 'Father of Modern China'?",
    "options": [
      "Mao Zedong",
      "Sun Yat-sen",
      "Chiang Kai-shek",
      "Zhou Enlai"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Sun Yat-sen led the revolution that overthrew the Qing Dynasty in 1911 and became the first provisional president of the Republic of China.",
    "detailedExplanation": "Sun Yat-sen was a Chinese revolutionary and political leader who played a pivotal role in overthrowing the Qing Dynasty in 1911, ending over 2,000 years of imperial rule in China. He founded the Kuomintang (Nationalist Party) and served as the first provisional president of the Republic of China. His political philosophy, known as the 'Three Principles of the People' (nationalism, democracy, and people's livelihood), became the foundation of the new republic. He is revered by both mainland China and Taiwan as the father of modern China.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sun_Yat-sen",
    "citationTitle": "Wikipedia: Sun Yat-sen"
  },
  {
    "id": "b5c5f530-8b2e-4b67-8ed5-0e985980b3cc",
    "text": "What was the profession of Maximilien Robespierre before he became a leader of the French Revolution?",
    "options": [
      "Doctor",
      "Lawyer",
      "Teacher",
      "Journalist"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Robespierre was a lawyer from Arras who became known as 'The Incorruptible' for his moral stance and dedication to revolutionary ideals.",
    "detailedExplanation": "Maximilien Robespierre studied law and worked as a lawyer in his hometown of Arras before the French Revolution. He earned a reputation for defending the poor and advocating for social justice, which earned him the nickname 'The Incorruptible.' His legal background and reputation for moral integrity helped him rise to prominence during the Revolution, eventually becoming one of the most influential leaders of the radical Jacobins and a key figure during the Reign of Terror from 1793-1794.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maximilien_Robespierre",
    "citationTitle": "Wikipedia: Maximilien Robespierre"
  },
  {
    "id": "8b4d8c28-0382-411a-92de-d23c3eae3ce1",
    "text": "Which South American revolutionary leader earned the nickname 'El Libertador' for his role in liberating six countries from Spanish rule?",
    "options": [
      "José de San Martín",
      "Simón Bolívar",
      "Bernardo O'Higgins",
      "Antonio José de Sucre"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Simón Bolívar liberated Venezuela, Colombia, Ecuador, Peru, Bolivia, and Panama from Spanish colonial rule, earning him the title 'El Libertador.'",
    "detailedExplanation": "Simón Bolívar was a Venezuelan military and political leader who led the independence movement against Spanish colonial rule in South America. Between 1813 and 1830, he successfully liberated six countries: Venezuela, Colombia, Ecuador, Peru, Bolivia (named after him), and Panama. His vision extended beyond mere independence to creating a unified South American confederation called Gran Colombia. His military genius, political acumen, and unwavering dedication to the cause of independence earned him the revered title 'El Libertador' (The Liberator).",
    "citationUrl": "https://en.wikipedia.org/wiki/Sim%C3%B3n_Bol%C3%ADvar",
    "citationTitle": "Wikipedia: Simón Bolívar"
  },
  {
    "id": "72b2c79f-e124-409b-beaa-14d288d060a4",
    "text": "What was the name of the political party founded by Nelson Mandela that fought against apartheid in South Africa?",
    "options": [
      "Pan Africanist Congress",
      "African National Congress",
      "United Democratic Front",
      "Black Consciousness Movement"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Mandela joined the African National Congress (ANC) in 1944 and later became its leader in the struggle against apartheid.",
    "detailedExplanation": "Nelson Mandela joined the African National Congress (ANC) in 1944, though the party was founded in 1912, making it one of the oldest liberation movements in Africa. Mandela became increasingly prominent within the ANC, helping to form its Youth League and later becoming a key leader of the armed resistance wing, Umkhonto we Sizwe (Spear of the Nation). After spending 27 years in prison for his anti-apartheid activities, Mandela was released in 1990 and led the ANC in negotiations that ended apartheid, becoming South Africa's first Black president in 1994.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nelson_Mandela",
    "citationTitle": "Wikipedia: Nelson Mandela"
  },
  {
    "id": "41136385-be8d-4f85-ad02-8d5ac960388d",
    "text": "Which Irish revolutionary leader was executed in 1916 following the Easter Rising and wrote the famous poem 'The Mother' while imprisoned?",
    "options": [
      "Michael Collins",
      "Patrick Pearse",
      "James Connolly",
      "Éamon de Valera"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Patrick Pearse was one of the leaders of the 1916 Easter Rising and was executed by firing squad. He was also a poet and educator.",
    "detailedExplanation": "Patrick Pearse was an Irish teacher, barrister, poet, writer, nationalist, and revolutionary leader. He was one of the leaders of the Easter Rising in 1916 and served as President of the Provisional Irish Republic. Pearse was also the Director of the Irish Volunteers and gave the graveside oration at the funeral of Jeremiah O'Donovan Rossa that helped inspire the Rising. After the failed uprising, he was court-martialed and executed by firing squad on May 3, 1916, becoming a martyr for Irish independence. His writings and poetry, including works written in prison, became influential in Irish nationalist literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Patrick_Pearse",
    "citationTitle": "Wikipedia: Patrick Pearse"
  },
  {
    "id": "e544a3cc-2065-46a7-8dfd-8248df57c205",
    "text": "What was the original name of Ho Chi Minh, the Vietnamese revolutionary leader who fought against French colonial rule?",
    "options": [
      "Nguyen Sinh Cung",
      "Nguyen Ai Quoc",
      "Nguyen That Thanh",
      "All of these names were used by him"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Ho Chi Minh used many aliases throughout his life, including all of these names, with his birth name being Nguyen Sinh Cung.",
    "detailedExplanation": "Ho Chi Minh, the founder of modern Vietnam and leader of its independence movement, used over 50 different aliases throughout his revolutionary career. He was born as Nguyen Sinh Cung (later changed to Nguyen Sinh Cong), used Nguyen That Thanh during his youth, and adopted Nguyen Ai Quoc ('Nguyen the Patriot') during his time in France and as a communist agent. He finally settled on Ho Chi Minh ('He Who Enlightens') in the 1940s. This practice of using multiple identities was common among revolutionaries to evade colonial authorities and was essential to his survival as he organized resistance movements across Vietnam.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ho_Chi_Minh",
    "citationTitle": "Wikipedia: Ho Chi Minh"
  },
  {
    "id": "6c77a4fc-02bc-4713-b423-4e50c35c2c47",
    "text": "Which revolutionary leader was known as 'Pancho Villa' and fought in the Mexican Revolution alongside Emiliano Zapata?",
    "options": [
      "Doroteo Arango",
      "Venustiano Carranza",
      "Álvaro Obregón",
      "Porfirio Díaz"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Pancho Villa's real name was Doroteo Arango, and he was a key figure in the Mexican Revolution.",
    "detailedExplanation": "Doroteo Arango, better known by his nom de guerre Pancho Villa, was one of the most prominent leaders of the Mexican Revolution (1910-1920). Born into poverty, he became a bandit before joining the revolutionary cause against the dictatorship of Porfirio Díaz. Villa commanded the famous División del Norte and was known for his military prowess and Robin Hood-like reputation among the poor. He formed a crucial alliance with Emiliano Zapata during the revolution, though they later had conflicts with other revolutionary factions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pancho_Villa",
    "citationTitle": "Wikipedia: Pancho Villa"
  },
  {
    "id": "d7b4322d-cf1e-4283-9a9e-48e1e4487a32",
    "text": "What was the name of the secret revolutionary organization led by Giuseppe Mazzini that aimed to unify Italy in the 19th century?",
    "options": [
      "Young Italy",
      "Red Shirts",
      "Carbonari",
      "Black Hand"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Young Italy (Giovine Italia) was founded by Giuseppe Mazzini in 1831 to promote Italian unification and independence.",
    "detailedExplanation": "Young Italy (Giovine Italia) was a political movement founded by Giuseppe Mazzini in Marseille in 1831. The organization aimed to create a unified, independent, and republican Italy through revolutionary means. Mazzini believed that Italy should be a nation of free men rather than a collection of kingdoms and papal states. Young Italy inspired similar movements across Europe and played a crucial role in the Risorgimento, the movement for Italian unification. The organization's motto was 'God and the People' and it attracted thousands of members despite being banned and persecuted by various Italian states.",
    "citationUrl": "https://en.wikipedia.org/wiki/Young_Italy_(historical)",
    "citationTitle": "Wikipedia: Young Italy"
  },
  {
    "id": "2b60aab7-4919-41ee-b12a-7e9f52d53fb6",
    "text": "Which Cuban revolutionary leader served as the country's president from 1976 to 2008?",
    "options": [
      "Che Guevara",
      "Fidel Castro",
      "Camilo Cienfuegos",
      "Raúl Castro"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Fidel Castro led the Cuban Revolution and served as Cuba's president from 1976 to 2008.",
    "detailedExplanation": "Fidel Castro was the primary leader of the Cuban Revolution that overthrew the Batista government in 1959. After initially serving as Prime Minister, Castro became President of Cuba in 1976 and held the position until 2008, when he stepped down due to health issues and transferred power to his brother Raúl. Castro transformed Cuba into a one-party communist state and became one of the most influential figures in 20th-century Latin American politics. His government implemented major social reforms in education and healthcare while maintaining strict political control.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fidel_Castro",
    "citationTitle": "Wikipedia: Fidel Castro"
  },
  {
    "id": "c96d2b51-fba5-444c-910b-7cc475250cf0",
    "text": "What was the name of the famous pamphlet written by Thomas Paine that helped inspire the American Revolution?",
    "options": [
      "The Rights of Man",
      "Common Sense",
      "The Crisis",
      "The Age of Reason"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Thomas Paine's 'Common Sense' was published in 1776 and greatly influenced American colonial opinion in favor of independence.",
    "detailedExplanation": "Published in January 1776, 'Common Sense' was a 47-page pamphlet written by Thomas Paine that presented powerful arguments for American independence from British rule. The pamphlet was written in plain language that ordinary colonists could understand, making complex political ideas accessible to a broad audience. Paine argued against the concept of monarchy and hereditary rule, while advocating for republican government and American independence. The pamphlet sold over 120,000 copies within three months and eventually sold over 500,000 copies, making it one of the most widely read and influential political works in American history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Common_Sense",
    "citationTitle": "Wikipedia: Common Sense (pamphlet)"
  },
  {
    "id": "5f73fc19-580b-4014-84c3-a754e7bd216d",
    "text": "Which Indian revolutionary leader founded the Indian National Army (INA) to fight against British rule during World War II?",
    "options": [
      "Mahatma Gandhi",
      "Subhas Chandra Bose",
      "Bhagat Singh",
      "Chandrashekhar Azad"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Subhas Chandra Bose founded the Indian National Army in 1942 with Japanese support to fight British colonial rule.",
    "detailedExplanation": "Subhas Chandra Bose, known as 'Netaji,' was a prominent leader of the Indian independence movement who took a more militant approach than Gandhi's non-violent resistance. After disagreeing with the Indian National Congress's methods, Bose escaped British surveillance in 1941 and eventually reached Japan. With Japanese support, he reorganized the Indian National Army (Azad Hind Fauj) in 1942, composed primarily of Indian prisoners of war and expatriates in Southeast Asia. The INA fought alongside Japanese forces against the British in Burma and Northeast India, though ultimately unsuccessful in their military campaigns.",
    "citationUrl": "https://en.wikipedia.org/wiki/Subhas_Chandra_Bose",
    "citationTitle": "Wikipedia: Subhas Chandra Bose"
  },
  {
    "id": "356498ca-effe-4ba4-98f1-e5f400ad42cb",
    "text": "Which French revolutionary leader was known as 'The Friend of the People' and was assassinated in his bath by Charlotte Corday?",
    "options": [
      "Jean-Paul Marat",
      "Georges Danton",
      "Jacques Hébert",
      "Camille Desmoulins"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Jean-Paul Marat was a radical journalist during the French Revolution who was murdered by Charlotte Corday in 1793.",
    "detailedExplanation": "Jean-Paul Marat was a radical journalist and politician during the French Revolution, known for his newspaper 'L'Ami du peuple' (The Friend of the People). Marat was a fierce advocate for the rights of the poorest classes and called for violent measures against enemies of the revolution. His inflammatory writings made him both popular among the sans-culottes and hated by moderate revolutionaries. On July 13, 1793, Charlotte Corday, a Girondin sympathizer from Normandy, gained access to Marat's home and stabbed him to death while he was in his medicinal bath, which he used to treat a painful skin condition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jean-Paul_Marat",
    "citationTitle": "Wikipedia: Jean-Paul Marat"
  },
  {
    "id": "71ce7ee5-5c83-41a1-9143-3c1193267bad",
    "text": "What was the nickname of Ernesto Guevara, the Argentine-Cuban revolutionary who fought alongside Fidel Castro?",
    "options": [
      "El Comandante",
      "Che",
      "El Loco",
      "Camilo"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Ernesto Guevara was universally known as 'Che,' an Argentine expression meaning 'friend' or 'buddy.'",
    "detailedExplanation": "Ernesto 'Che' Guevara was an Argentine Marxist revolutionary who became a central figure in the Cuban Revolution alongside Fidel Castro. The nickname 'Che' came from his frequent use of the Argentine expression 'che,' which is similar to saying 'hey' or 'buddy' in English. After the success of the Cuban Revolution in 1959, Guevara held various important positions in the new government, including president of La Cabaña prison, minister of industries, and president of the national bank. He later left Cuba to foment revolution elsewhere and was killed in Bolivia in 1967 while attempting to start a guerrilla movement there.",
    "citationUrl": "https://en.wikipedia.org/wiki/Che_Guevara",
    "citationTitle": "Wikipedia: Che Guevara"
  },
  {
    "id": "20401a41-28a3-4ab9-be33-ea1955821180",
    "text": "Which Russian revolutionary leader was known as the 'Iron Lady of the Revolution' and was a close associate of Lenin?",
    "options": [
      "Alexandra Kollontai",
      "Nadezhda Krupskaya",
      "Inessa Armand",
      "Rosa Luxemburg"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Alexandra Kollontai was a prominent Bolshevik revolutionary and the world's first female government minister.",
    "detailedExplanation": "Alexandra Kollontai was a prominent Bolshevik revolutionary, feminist, and diplomat who played a significant role in the Russian Revolution. She was one of the few women in Lenin's inner circle and became the world's first female government minister when she was appointed People's Commissar for Social Welfare in 1917. Kollontai was known for her fierce advocacy for women's rights and workers' causes, earning her the nickname 'Iron Lady of the Revolution.' She later served as a Soviet diplomat and was instrumental in negotiating peace between the Soviet Union and Finland during World War II.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alexandra_Kollontai",
    "citationTitle": "Wikipedia: Alexandra Kollontai"
  },
  {
    "id": "0631f90c-fee9-48c5-be37-96e839dfa9d9",
    "text": "Which revolutionary leader wrote 'The Wretched of the Earth', a influential work on decolonization and the effects of colonialism?",
    "options": [
      "Frantz Fanon",
      "Patrice Lumumba",
      "Kwame Nkrumah",
      "Jomo Kenyatta"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Frantz Fanon wrote 'The Wretched of the Earth' in 1961, a seminal work on decolonization.",
    "detailedExplanation": "Frantz Fanon was a Martinican psychiatrist, philosopher, and revolutionary who became a leading voice in the decolonization movement. His book 'The Wretched of the Earth' (Les Damnés de la Terre), published in 1961, analyzed the psychological and cultural effects of colonization and became one of the most influential works on revolutionary theory and anti-colonial struggle. Fanon participated in the Algerian War of Independence and his writings profoundly influenced liberation movements across Africa, Asia, and Latin America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frantz_Fanon",
    "citationTitle": "Wikipedia: Frantz Fanon"
  },
  {
    "id": "606d7db6-7150-472f-87c8-4b6d42d0cc5a",
    "text": "What was the name of the women's battalion led by Emiliano Zapata's sister-in-law during the Mexican Revolution?",
    "options": [
      "Las Adelitas",
      "Las Soldaderas",
      "Las Coronelas",
      "Las Zapatistas"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Las Coronelas was the women's battalion, though the term 'Soldaderas' referred to women fighters generally in the Mexican Revolution.",
    "detailedExplanation": "During the Mexican Revolution (1910-1920), women played significant combat and support roles, collectively known as 'soldaderas.' While many women fought alongside revolutionary forces, some formed specific units. The term 'Las Coronelas' referred to high-ranking women officers who led troops. These women revolutionaries challenged traditional gender roles and became symbols of female empowerment in Mexican history. They served not only as fighters but also as spies, nurses, and suppliers for the revolutionary armies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Soldaderas",
    "citationTitle": "Wikipedia: Soldaderas"
  },
  {
    "id": "904b571a-fff1-4145-983d-d2229a89a7e3",
    "text": "Which revolutionary leader established the first successful slave revolt in the Western Hemisphere, leading to Haiti's independence?",
    "options": [
      "Denmark Vesey",
      "Nat Turner",
      "Toussaint Louverture",
      "Gabriel Prosser"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Toussaint Louverture led the Haitian Revolution, which resulted in the first successful slave revolt and Haiti's independence in 1804.",
    "detailedExplanation": "Toussaint Louverture was a former slave who became the leader of the Haitian Revolution (1791-1804), the most successful slave revolt in history. Born into slavery, he educated himself and rose to become a skilled military strategist and political leader. His leadership transformed a slave rebellion into a successful independence movement that defeated French, Spanish, and British forces. Though he died in French captivity in 1803, his revolution culminated in Haiti becoming the first nation founded by former slaves and the second independent nation in the Americas after the United States.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toussaint_Louverture",
    "citationTitle": "Wikipedia: Toussaint Louverture"
  },
  {
    "id": "16b4a2fa-5431-4b77-97bb-2134c62dfb6e",
    "text": "What was the code name used by Leon Trotsky during his revolutionary activities before the Russian Revolution?",
    "options": [
      "The Eagle",
      "Pero",
      "The Bear",
      "Molotov"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Leon Trotsky used the code name 'Pero' (meaning 'pen' in Russian) during his early revolutionary activities.",
    "detailedExplanation": "Leon Trotsky, born Lev Davidovich Bronstein, adopted various pseudonyms during his revolutionary career to avoid detection by the Tsarist police. One of his early code names was 'Pero,' meaning 'pen' in Russian, which was fitting given his prolific writing and journalism. The name 'Trotsky' itself was actually a pseudonym he adopted from one of his prison guards. As a key figure in the Bolshevik Revolution and later the founder of the Red Army, Trotsky was instrumental in the success of the 1917 Russian Revolution before eventually falling out with Stalin and being exiled.",
    "citationUrl": "https://en.wikipedia.org/wiki/Leon_Trotsky",
    "citationTitle": "Wikipedia: Leon Trotsky"
  }
]