[
  {
    "id": "f3a8aac9-917d-4ab3-8a2b-2e462371b67d",
    "text": "Which treaty officially ended World War I between Germany and the Allied powers?",
    "options": [
      "Treaty of Versailles",
      "Treaty of Vienna",
      "Treaty of Paris",
      "Treaty of Berlin"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Treaty of Versailles was signed on June 28, 1919, officially ending WWI between Germany and the Allies.",
    "detailedExplanation": "The Treaty of Versailles was signed on June 28, 1919, in the Palace of Versailles near Paris, France. It officially ended the state of war between Germany and the Allied Powers. The treaty imposed heavy penalties on Germany, including territorial losses, military restrictions, and substantial reparations payments. It was one of the most significant peace treaties in modern history and had lasting effects on European politics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Versailles",
    "citationTitle": "Wikipedia: Treaty of Versailles"
  },
  {
    "id": "b3a6db9f-6edb-4169-8cda-477103588110",
    "text": "The Camp David Accords of 1978 were a peace agreement between which two countries?",
    "options": [
      "Egypt and Israel",
      "India and Pakistan",
      "North and South Korea",
      "Greece and Turkey"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Camp David Accords were signed by Egyptian President Sadat and Israeli Prime Minister Begin in 1978.",
    "detailedExplanation": "The Camp David Accords were signed on September 17, 1978, following thirteen days of secret negotiations at Camp David, the country retreat of the President of the United States. The accords were signed by Egyptian President Anwar Sadat and Israeli Prime Minister Menachem Begin, with U.S. President Jimmy Carter serving as mediator. This historic agreement led to the Egypt-Israel Peace Treaty of 1979 and earned Sadat and Begin the Nobel Peace Prize.",
    "citationUrl": "https://en.wikipedia.org/wiki/Camp_David_Accords",
    "citationTitle": "Wikipedia: Camp David Accords"
  },
  {
    "id": "6dbf5630-479a-46d2-838b-c10f0f972b20",
    "text": "Which agreement established the United Nations in 1945?",
    "options": [
      "Charter of the United Nations",
      "Atlantic Charter",
      "Potsdam Agreement",
      "Yalta Agreement"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Charter of the United Nations was signed in San Francisco in 1945, establishing the UN as an international organization.",
    "detailedExplanation": "The Charter of the United Nations was signed on June 26, 1945, in San Francisco at the conclusion of the United Nations Conference on International Organization. It came into force on October 24, 1945, after being ratified by the five permanent members of the Security Council and a majority of other signatory nations. The Charter serves as the foundational treaty of the United Nations and establishes its purposes, principles, and structure for maintaining international peace and security.",
    "citationUrl": "https://en.wikipedia.org/wiki/Charter_of_the_United_Nations",
    "citationTitle": "Wikipedia: Charter of the United Nations"
  },
  {
    "id": "c8123191-14cd-4af9-b66c-1835a9b17216",
    "text": "The Good Friday Agreement of 1998 brought peace to which region?",
    "options": [
      "Northern Ireland",
      "Bosnia",
      "Kashmir",
      "Cyprus"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Good Friday Agreement was signed in 1998, largely ending the conflict in Northern Ireland known as 'The Troubles.'",
    "detailedExplanation": "The Good Friday Agreement, also known as the Belfast Agreement, was signed on April 10, 1998 (Good Friday). It was a major political development in the Northern Ireland peace process that largely ended the 30-year conflict known as 'The Troubles.' The agreement established a power-sharing government in Northern Ireland and was approved by voters in simultaneous referendums in both Northern Ireland and the Republic of Ireland. It involved multiple parties including the British and Irish governments and most Northern Ireland political parties.",
    "citationUrl": "https://en.wikipedia.org/wiki/Good_Friday_Agreement",
    "citationTitle": "Wikipedia: Good Friday Agreement"
  },
  {
    "id": "0b8171b8-541e-4066-90a8-92add76b7a8d",
    "text": "Which treaty created the North Atlantic Treaty Organization (NATO) in 1949?",
    "options": [
      "North Atlantic Treaty",
      "Warsaw Pact",
      "Marshall Plan",
      "Truman Doctrine"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The North Atlantic Treaty was signed on April 4, 1949, establishing NATO as a military alliance.",
    "detailedExplanation": "The North Atlantic Treaty was signed on April 4, 1949, in Washington, D.C., by twelve founding member countries. The treaty established the North Atlantic Treaty Organization (NATO) as a collective defense alliance based on the principle that an attack against one member is considered an attack against all members (Article 5). The original signatories included the United States, Canada, and ten Western European nations, forming a crucial Cold War alliance to counter Soviet influence in Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/North_Atlantic_Treaty",
    "citationTitle": "Wikipedia: North Atlantic Treaty"
  },
  {
    "id": "f021e5e7-6c24-4525-8a8a-e4f9a53cbd7b",
    "text": "The Oslo Accords of the 1990s were peace negotiations between Israel and which organization?",
    "options": [
      "Palestine Liberation Organization (PLO)",
      "Hamas",
      "Hezbollah",
      "Arab League"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Oslo Accords were signed between Israel and the PLO, represented by Yasser Arafat, in the 1990s.",
    "detailedExplanation": "The Oslo Accords were a series of agreements between Israel and the Palestine Liberation Organization (PLO) signed in the 1990s. Oslo I was signed in Washington D.C. on September 13, 1993, followed by Oslo II in 1995. These accords marked the first direct, face-to-face agreement between Israel and the PLO, with Israeli Prime Minister Yitzhak Rabin and PLO Chairman Yasser Arafat shaking hands at the White House. The agreements established the Palestinian Authority and outlined a framework for Palestinian self-governance in parts of the West Bank and Gaza Strip.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oslo_Accords",
    "citationTitle": "Wikipedia: Oslo Accords"
  },
  {
    "id": "42ca2971-38d2-4eab-a70a-00412352af5e",
    "text": "Which 1648 treaty ended the devastating Thirty Years' War in Europe?",
    "options": [
      "Peace of Westphalia",
      "Treaty of Utrecht",
      "Peace of Augsburg",
      "Treaty of Münster"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Peace of Westphalia in 1648 ended the Thirty Years' War and established the principle of national sovereignty.",
    "detailedExplanation": "The Peace of Westphalia was signed in 1648, consisting of two treaties signed in the cities of Münster and Osnabrück. It ended the Thirty Years' War (1618-1648), one of the most destructive conflicts in European history. The peace settlement established the principle of state sovereignty and non-interference in domestic affairs, fundamentally shaping the modern international system. It also recognized the independence of the Dutch Republic and Swiss Confederation, and allowed German princes greater autonomy within the Holy Roman Empire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_of_Westphalia",
    "citationTitle": "Wikipedia: Peace of Westphalia"
  },
  {
    "id": "d859d1b0-29f1-4a91-af40-e54ac79b4ada",
    "text": "The Antarctic Treaty of 1959 established Antarctica as what type of zone?",
    "options": [
      "Peaceful and scientific research zone",
      "Military testing zone",
      "Commercial fishing zone",
      "Nuclear waste storage zone"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Antarctic Treaty designated Antarctica as a continent devoted to peaceful purposes and scientific research.",
    "detailedExplanation": "The Antarctic Treaty was signed on December 1, 1959, and entered into force on June 23, 1961. It established Antarctica as a scientific preserve and banned military activity on the continent. The treaty designates Antarctica as a continent devoted to peaceful purposes and international scientific cooperation. It prohibits military activities, nuclear testing, and nuclear waste disposal, while promoting freedom of scientific investigation and environmental protection. The treaty was initially signed by 12 countries and has since been joined by many others.",
    "citationUrl": "https://en.wikipedia.org/wiki/Antarctic_Treaty_System",
    "citationTitle": "Wikipedia: Antarctic Treaty System"
  },
  {
    "id": "f3a59702-0c91-4223-a606-6e1bb6b17251",
    "text": "The Treaty of Versailles required Germany to pay massive war reparations. What was the approximate total amount demanded?",
    "options": [
      "132 billion gold marks",
      "50 billion gold marks",
      "200 billion gold marks",
      "75 billion gold marks"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Germany was required to pay 132 billion gold marks in reparations under the Treaty of Versailles.",
    "detailedExplanation": "The Treaty of Versailles imposed enormous financial reparations on Germany, totaling 132 billion gold marks (approximately $33 billion at the time). These crushing reparations contributed to Germany's economic instability in the 1920s and 1930s, creating resentment that would later be exploited by extremist political movements. The payments were so burdensome that they weren't fully completed until 2010, nearly a century after the treaty was signed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Versailles",
    "citationTitle": "Wikipedia: Treaty of Versailles"
  },
  {
    "id": "30acd218-8cd5-4420-a3b6-af75604be4a9",
    "text": "Which peace treaty ended the Vietnam War and led to the withdrawal of US forces in 1973?",
    "options": [
      "Paris Peace Accords",
      "Geneva Convention",
      "Saigon Agreement",
      "Hanoi Accords"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Paris Peace Accords of 1973 officially ended US involvement in the Vietnam War.",
    "detailedExplanation": "The Paris Peace Accords were signed on January 27, 1973, formally titled 'Agreement on Ending the War and Restoring Peace in Viet-Nam.' The agreement called for the withdrawal of all US troops and advisors from South Vietnam within 60 days, the release of prisoners of war, and allowed North Vietnamese forces to remain in positions they held in South Vietnam. Despite the ceasefire agreement, fighting continued between North and South Vietnamese forces until Saigon fell in 1975.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paris_Peace_Accords",
    "citationTitle": "Wikipedia: Paris Peace Accords"
  },
  {
    "id": "7293d3bd-6c67-4188-ba06-df3cf073e850",
    "text": "The Dayton Agreement of 1995 ended a brutal conflict in which European region?",
    "options": [
      "Bosnia and Herzegovina",
      "Kosovo",
      "Croatia",
      "Slovenia"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Dayton Agreement ended the Bosnian War and established the current political structure of Bosnia and Herzegovina.",
    "detailedExplanation": "The Dayton Agreement was negotiated at Wright-Patterson Air Force Base in Dayton, Ohio, and signed in Paris on December 14, 1995. It ended the three-and-a-half-year Bosnian War that had resulted in approximately 100,000 deaths and massive displacement of civilians. The agreement established Bosnia and Herzegovina as a single state composed of two main entities: the Federation of Bosnia and Herzegovina and the Republika Srpska, with the Brčko District as a special administrative unit.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dayton_Agreement",
    "citationTitle": "Wikipedia: Dayton Agreement"
  },
  {
    "id": "4e042493-7b83-4b03-a05f-c17c28cba2b2",
    "text": "What was the name of the 1978 peace treaty between Egypt and Israel, the first between Israel and an Arab state?",
    "options": [
      "Egypt-Israel Peace Treaty",
      "Sinai Accords",
      "Cairo Agreement",
      "Alexandria Treaty"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Egypt-Israel Peace Treaty was signed in 1979, following the Camp David Accords negotiations.",
    "detailedExplanation": "The Egypt-Israel Peace Treaty was signed on March 26, 1979, by Egyptian President Anwar Sadat and Israeli Prime Minister Menachem Begin, with US President Jimmy Carter as witness. This historic agreement was the result of the Camp David Accords negotiations and marked the first peace treaty between Israel and any Arab state. Under the treaty, Israel withdrew from the Sinai Peninsula, which it had occupied since 1967, and Egypt became the first Arab country to officially recognize Israel's right to exist.",
    "citationUrl": "https://en.wikipedia.org/wiki/Egypt%E2%80%93Israel_peace_treaty",
    "citationTitle": "Wikipedia: Egypt–Israel peace treaty"
  },
  {
    "id": "7b73a2a9-fe81-4eab-8b86-25aa9f7ff193",
    "text": "Which treaty established the European Union in 1992?",
    "options": [
      "Treaty of Maastricht",
      "Treaty of Rome",
      "Treaty of Lisbon",
      "Treaty of Amsterdam"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Treaty of Maastricht, signed in 1992, created the European Union and established European citizenship.",
    "detailedExplanation": "The Treaty of Maastricht, formally known as the Treaty on European Union, was signed on February 7, 1992, in Maastricht, Netherlands. It transformed the European Economic Community into the European Union and introduced European citizenship, giving citizens of member states additional rights and freedoms. The treaty also laid the groundwork for the creation of the euro currency and established the three-pillar structure of the EU, covering economic integration, foreign policy cooperation, and justice and home affairs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maastricht_Treaty",
    "citationTitle": "Wikipedia: Maastricht Treaty"
  },
  {
    "id": "62081ca8-30e9-436d-bb32-92dd3c1cb074",
    "text": "The Korean Armistice Agreement of 1953 ended active fighting in the Korean War. Where was it signed?",
    "options": [
      "Panmunjom",
      "Seoul",
      "Pyongyang",
      "Busan"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Korean Armistice Agreement was signed at Panmunjom, located in the Korean Demilitarized Zone.",
    "detailedExplanation": "The Korean Armistice Agreement was signed on July 27, 1953, at Panmunjom, a village located in the Korean Demilitarized Zone (DMZ). The agreement established a ceasefire and created the DMZ as a buffer zone between North and South Korea. Importantly, this was an armistice (ceasefire) rather than a peace treaty, meaning the two Koreas are technically still at war. Panmunjom remains significant today as the site of occasional diplomatic meetings between North and South Korea.",
    "citationUrl": "https://en.wikipedia.org/wiki/Korean_Armistice_Agreement",
    "citationTitle": "Wikipedia: Korean Armistice Agreement"
  },
  {
    "id": "4a3af770-4bcc-45d7-b919-c1788dd1ba3b",
    "text": "Which arms control treaty between the US and Soviet Union was signed by Reagan and Gorbachev in 1987?",
    "options": [
      "INF Treaty",
      "START Treaty",
      "SALT I",
      "ABM Treaty"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Intermediate-Range Nuclear Forces (INF) Treaty eliminated an entire class of nuclear weapons.",
    "detailedExplanation": "The Intermediate-Range Nuclear Forces (INF) Treaty was signed on December 8, 1987, by US President Ronald Reagan and Soviet General Secretary Mikhail Gorbachev. This groundbreaking arms control agreement eliminated all land-based ballistic and cruise missiles with ranges between 500 and 5,500 kilometers, along with their infrastructure and support equipment. It was the first treaty to actually reduce nuclear arsenals rather than just limit their growth, and included unprecedented verification measures allowing each side to inspect the other's facilities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Intermediate-Range_Nuclear_Forces_Treaty",
    "citationTitle": "Wikipedia: Intermediate-Range Nuclear Forces Treaty"
  },
  {
    "id": "74bfe02e-0f48-4273-b372-03ac7045a961",
    "text": "The Peace of Utrecht in 1713 ended which major European conflict?",
    "options": [
      "War of the Spanish Succession",
      "Seven Years' War",
      "War of Austrian Succession",
      "Napoleonic Wars"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Peace of Utrecht ended the War of the Spanish Succession and reshaped the European balance of power.",
    "detailedExplanation": "The Peace of Utrecht was a series of treaties signed in 1713-1714 that ended the War of the Spanish Succession (1701-1714). This conflict arose over who would inherit the Spanish throne after the death of the childless Charles II of Spain. The treaties established Philip V as King of Spain but prevented the union of the French and Spanish crowns. Britain gained significant territories including Gibraltar and Minorca, while the balance of power in Europe was restored, preventing any single nation from becoming too dominant.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_of_Utrecht",
    "citationTitle": "Wikipedia: Peace of Utrecht"
  },
  {
    "id": "259cb2a4-f591-4670-8c07-2f5e3f511740",
    "text": "The Peace of Westphalia in 1648 established which fundamental principle of international law that remains important today?",
    "options": [
      "National sovereignty and non-interference in domestic affairs",
      "The right to form military alliances",
      "Freedom of navigation on international waters",
      "The concept of diplomatic immunity"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Peace of Westphalia established the principle of national sovereignty and non-interference in domestic affairs.",
    "detailedExplanation": "The Peace of Westphalia, signed in 1648, not only ended the Thirty Years' War but also established the fundamental principle known as 'Westphalian sovereignty.' This concept holds that each state has sovereignty over its territory and domestic affairs, and that external powers should not interfere in the internal affairs of other states. This principle became a cornerstone of international law and the modern state system.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_of_Westphalia",
    "citationTitle": "Wikipedia: Peace of Westphalia"
  },
  {
    "id": "df0b8fb1-007b-4327-ae96-0cc0296f992b",
    "text": "Which Cold War nuclear treaty banned atmospheric, underwater, and space nuclear testing but still allowed underground tests?",
    "options": [
      "Partial Nuclear Test Ban Treaty (1963)",
      "Strategic Arms Limitation Treaty (SALT I)",
      "Nuclear Non-Proliferation Treaty",
      "Comprehensive Test Ban Treaty"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Partial Nuclear Test Ban Treaty of 1963 banned nuclear testing in the atmosphere, underwater, and in space.",
    "detailedExplanation": "The Partial Nuclear Test Ban Treaty, signed in 1963 by the United States, Soviet Union, and United Kingdom, was a significant step in nuclear arms control during the Cold War. It prohibited nuclear weapons testing in the atmosphere, underwater, and in outer space, but crucially still allowed underground nuclear testing. This treaty was motivated by growing concerns about radioactive fallout from atmospheric tests affecting global health and the environment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Partial_Nuclear_Test_Ban_Treaty",
    "citationTitle": "Wikipedia: Partial Nuclear Test Ban Treaty"
  },
  {
    "id": "b71b5843-caf7-4ce7-968d-6cb56b3b7dbd",
    "text": "The Treaty of Tordesillas in 1494 divided newly discovered lands between which two colonial powers?",
    "options": [
      "Spain and Portugal",
      "England and France",
      "Spain and France",
      "Portugal and the Netherlands"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Treaty of Tordesillas divided the New World between Spain and Portugal.",
    "detailedExplanation": "The Treaty of Tordesillas was signed in 1494 between Spain and Portugal to resolve disputes over newly discovered lands following Christopher Columbus's voyages. The treaty established an imaginary line 370 leagues west of the Cape Verde Islands, with Spain claiming lands to the west and Portugal claiming lands to the east. This division explains why Brazil became a Portuguese colony while most of the rest of South America was colonized by Spain.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Tordesillas",
    "citationTitle": "Wikipedia: Treaty of Tordesillas"
  },
  {
    "id": "05708035-0c78-4a42-a033-5d3c394bbec0",
    "text": "The Kyoto Protocol, signed in 1997, was an international agreement aimed at addressing which global issue?",
    "options": [
      "Climate change and greenhouse gas emissions",
      "Nuclear weapons proliferation",
      "International trade disputes",
      "Refugee and migration crises"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Kyoto Protocol was designed to combat climate change by reducing greenhouse gas emissions.",
    "detailedExplanation": "The Kyoto Protocol, adopted in 1997 and entered into force in 2005, was the first major international agreement to set binding targets for reducing greenhouse gas emissions to combat climate change. It required developed countries to reduce their emissions by an average of 5.2% below 1990 levels between 2008-2012. The protocol established mechanisms like carbon trading and clean development projects, though its effectiveness was limited by the non-participation of some major emitters like the United States.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kyoto_Protocol",
    "citationTitle": "Wikipedia: Kyoto Protocol"
  }
]