[
  {
    "id": "b86a487f-2db9-49d0-b209-bb8891050a87",
    "text": "The Treaty of Westphalia in 1648 ended which major European conflict?",
    "options": [
      "The Thirty Years' War",
      "The War of Spanish Succession",
      "The Seven Years' War",
      "The War of Austrian Succession"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Treaty of Westphalia ended the Thirty Years' War and established the principle of state sovereignty.",
    "detailedExplanation": "The Peace of Westphalia was a series of peace treaties signed in 1648 that ended the Thirty Years' War, one of the most destructive conflicts in European history. The treaties were negotiated in the cities of Münster and Osnabrück and established the principle of state sovereignty and non-interference in domestic affairs, fundamentally shaping the modern international system.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_of_Westphalia",
    "citationTitle": "Wikipedia: Peace of Westphalia"
  },
  {
    "id": "53d60e38-6ad8-4a49-9995-5ca2cadd5df4",
    "text": "The Good Friday Agreement of 1998 helped bring peace to which region?",
    "options": [
      "Northern Ireland",
      "Bosnia and Herzegovina",
      "East Timor",
      "Kosovo"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Good Friday Agreement was a peace accord that largely ended the conflict in Northern Ireland known as 'The Troubles.'",
    "detailedExplanation": "The Good Friday Agreement, also known as the Belfast Agreement, was signed on April 10, 1998, and approved by referendums in both Northern Ireland and the Republic of Ireland. It established a power-sharing government in Northern Ireland and largely ended three decades of sectarian conflict known as 'The Troubles.' The agreement was crucial in bringing together unionists who wanted Northern Ireland to remain part of the UK and nationalists who wanted it to join the Republic of Ireland.",
    "citationUrl": "https://en.wikipedia.org/wiki/Good_Friday_Agreement",
    "citationTitle": "Wikipedia: Good Friday Agreement"
  },
  {
    "id": "0964cba6-5d63-4ecd-8732-844eed0aa409",
    "text": "Which Cold War treaty signed in 1987 eliminated an entire class of nuclear weapons?",
    "options": [
      "SALT I Treaty",
      "ABM Treaty",
      "INF Treaty",
      "START I Treaty"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Intermediate-Range Nuclear Forces (INF) Treaty eliminated all intermediate-range missiles between the US and Soviet Union.",
    "detailedExplanation": "The INF Treaty was signed by President Ronald Reagan and Soviet leader Mikhail Gorbachev in December 1987. It was groundbreaking as it was the first treaty to eliminate an entire category of nuclear weapons rather than just limit their numbers. The treaty required the destruction of all ground-launched ballistic and cruise missiles with ranges between 500 and 5,500 kilometers, along with their launchers and support structures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Intermediate-Range_Nuclear_Forces_Treaty",
    "citationTitle": "Wikipedia: Intermediate-Range Nuclear Forces Treaty"
  },
  {
    "id": "e21525b9-6cb1-459c-888d-2424880ae55f",
    "text": "The Treaty of Guadalupe Hidalgo in 1848 ended a war between which two countries?",
    "options": [
      "United States and Mexico",
      "United States and Spain",
      "Mexico and France",
      "United States and Britain"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The treaty ended the Mexican-American War and resulted in Mexico ceding vast territories to the United States.",
    "detailedExplanation": "The Treaty of Guadalupe Hidalgo was signed on February 2, 1848, ending the Mexican-American War (1846-1848). Under the treaty, Mexico ceded approximately half of its territory to the United States, including present-day California, Nevada, Utah, Arizona, New Mexico, Colorado, and Wyoming. In return, the U.S. paid Mexico $15 million and assumed $3.25 million in debts owed by Mexico to American citizens.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Guadalupe_Hidalgo",
    "citationTitle": "Wikipedia: Treaty of Guadalupe Hidalgo"
  },
  {
    "id": "76c33529-fef5-4b8a-90ad-1edffd149e35",
    "text": "The Dayton Accords of 1995 ended the war in which former Yugoslav republic?",
    "options": [
      "Croatia",
      "Slovenia",
      "Bosnia and Herzegovina",
      "Macedonia"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Dayton Accords ended the Bosnian War and established the current structure of Bosnia and Herzegovina.",
    "detailedExplanation": "The Dayton Accords were negotiated at Wright-Patterson Air Force Base in Dayton, Ohio, and signed in Paris in December 1995. The agreement ended the three-and-a-half-year Bosnian War and established Bosnia and Herzegovina as a single state composed of two main entities: the Federation of Bosnia and Herzegovina and Republika Srpska. The accords also established a complex governmental structure designed to balance the interests of Bosniaks, Croats, and Serbs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dayton_Agreement",
    "citationTitle": "Wikipedia: Dayton Agreement"
  },
  {
    "id": "af4a949c-dff0-46c6-972f-174252c06275",
    "text": "Which 1993 agreement created the framework for Palestinian self-governance in parts of the West Bank and Gaza?",
    "options": [
      "Madrid Conference",
      "Oslo Accords",
      "Wye River Memorandum",
      "Road Map for Peace"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Oslo Accords were signed by Israeli Prime Minister Yitzhak Rabin and PLO Chairman Yasser Arafat.",
    "detailedExplanation": "The Oslo Accords, formally known as the Declaration of Principles on Interim Self-Government Arrangements, were signed on September 13, 1993, on the White House lawn with President Bill Clinton presiding. The agreement established the Palestinian Authority and provided for Palestinian self-rule in parts of the West Bank and Gaza Strip. Despite initial optimism, the peace process stalled due to continued violence and disagreements over final status issues.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oslo_Accords",
    "citationTitle": "Wikipedia: Oslo Accords"
  },
  {
    "id": "403f02eb-0170-4a8a-bdf9-4a81caee869d",
    "text": "The Camp David Accords of 1978 led to a historic peace treaty between which two Middle Eastern nations?",
    "options": [
      "Israel and Egypt",
      "Israel and Jordan",
      "Syria and Lebanon",
      "Iraq and Iran"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Camp David Accords resulted in the Egypt-Israel Peace Treaty of 1979.",
    "detailedExplanation": "The Camp David Accords were negotiated at the presidential retreat in Maryland through thirteen days of secret negotiations between Egyptian President Anwar Sadat and Israeli Prime Minister Menachem Begin, facilitated by U.S. President Jimmy Carter. The agreements led to the Egypt-Israel Peace Treaty signed in March 1979, making Egypt the first Arab country to officially recognize Israel. In return, Israel withdrew from the Sinai Peninsula, which it had occupied since the 1967 Six-Day War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Camp_David_Accords",
    "citationTitle": "Wikipedia: Camp David Accords"
  },
  {
    "id": "6c9afca7-7241-4ddf-be9a-0906d26f3c56",
    "text": "Which treaty signed in 1919 officially ended World War I between Germany and the Allied Powers?",
    "options": [
      "Treaty of Sevres",
      "Treaty of Versailles",
      "Treaty of Trianon",
      "Treaty of Saint-Germain"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Treaty of Versailles was signed on June 28, 1919, ending the war between Germany and the Allies.",
    "detailedExplanation": "The Treaty of Versailles was signed in the Hall of Mirrors at the Palace of Versailles, exactly five years after the assassination of Archduke Franz Ferdinand. The treaty imposed harsh terms on Germany, including significant territorial losses, military restrictions, and the famous 'war guilt clause' requiring Germany to accept responsibility for the war. The treaty also established the League of Nations and set the stage for many of the political tensions that would later contribute to World War II.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Versailles",
    "citationTitle": "Wikipedia: Treaty of Versailles"
  },
  {
    "id": "74e141aa-30cf-4dda-b701-80dda9c456a6",
    "text": "The Korean Armistice Agreement of 1953 created which heavily fortified border zone?",
    "options": [
      "38th Parallel Zone",
      "Korean Neutral Zone",
      "Demilitarized Zone (DMZ)",
      "Peace Corridor"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The armistice established the Korean Demilitarized Zone (DMZ) as a buffer between North and South Korea.",
    "detailedExplanation": "The Korean Armistice Agreement was signed on July 27, 1953, effectively ending active hostilities in the Korean War, though technically the two Koreas remain at war as no peace treaty was ever signed. The agreement established the Korean Demilitarized Zone, a 2.5-mile-wide buffer zone that runs roughly along the 38th parallel. Despite its name, the DMZ is one of the most heavily militarized borders in the world, with both sides maintaining significant military presence along its length.",
    "citationUrl": "https://en.wikipedia.org/wiki/Korean_Armistice_Agreement",
    "citationTitle": "Wikipedia: Korean Armistice Agreement"
  },
  {
    "id": "0897b91f-7ba6-4321-be42-0368fa3641aa",
    "text": "Which 1975 agreement divided Vietnam and led to the end of the Vietnam War?",
    "options": [
      "Geneva Accords",
      "Paris Peace Accords",
      "Saigon Agreement",
      "Hanoi Protocols"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Paris Peace Accords were signed in 1973, leading to the U.S. withdrawal and eventual reunification of Vietnam in 1975.",
    "detailedExplanation": "The Paris Peace Accords, officially titled 'Agreement on Ending the War and Restoring Peace in Viet-Nam,' were signed on January 27, 1973. The agreement called for a ceasefire, the withdrawal of U.S. forces, the release of prisoners of war, and the eventual reunification of Vietnam through peaceful means. However, fighting continued between North and South Vietnamese forces after the U.S. withdrawal, ultimately leading to the fall of Saigon in April 1975 and the reunification of Vietnam under communist rule.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paris_Peace_Accords",
    "citationTitle": "Wikipedia: Paris Peace Accords"
  },
  {
    "id": "3efae2cc-70b4-4def-af66-f666c5c78bbb",
    "text": "The Treaty of Portsmouth in 1905 ended which conflict and earned President Theodore Roosevelt a Nobel Peace Prize?",
    "options": [
      "Spanish-American War",
      "Russo-Japanese War",
      "Boxer Rebellion",
      "Philippine-American War"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Roosevelt mediated the Treaty of Portsmouth ending the Russo-Japanese War, becoming the first American to win the Nobel Peace Prize.",
    "detailedExplanation": "The Treaty of Portsmouth was signed on September 5, 1905, at the Portsmouth Naval Shipyard in Maine. President Theodore Roosevelt served as mediator between Russia and Japan, helping to end a war that had been fought primarily over influence in Manchuria and Korea. The treaty recognized Japan's predominant interest in Korea and allowed Japan to take over Russian leases in southern Manchuria. Roosevelt's successful mediation made him the first American to receive the Nobel Peace Prize in 1906.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Portsmouth",
    "citationTitle": "Wikipedia: Treaty of Portsmouth"
  },
  {
    "id": "5acb58e9-1c64-4fbe-999d-2b9518c86788",
    "text": "Which Cold War agreement signed in Helsinki in 1975 improved relations between Eastern and Western Europe?",
    "options": [
      "Warsaw Pact",
      "Helsinki Accords",
      "European Security Treaty",
      "Baltic Agreement"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Helsinki Accords established principles for European security and cooperation during the Cold War.",
    "detailedExplanation": "The Helsinki Accords, officially known as the Helsinki Final Act, were signed on August 1, 1975, by 35 nations including the United States, Canada, and most European countries. The agreement established three main areas of cooperation: security in Europe, cooperation in economics and technology, and human rights and humanitarian issues. While not legally binding, the accords helped reduce tensions during the Cold War and provided a framework for improved East-West relations. The human rights provisions particularly influenced the development of dissident movements in Eastern Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Helsinki_Accords",
    "citationTitle": "Wikipedia: Helsinki Accords"
  },
  {
    "id": "07423fe1-fb28-4bc1-94a2-7af1ff65959a",
    "text": "The Comprehensive Nuclear-Test-Ban Treaty (CTBT) of 1996 prohibits which type of weapons testing?",
    "options": [
      "Chemical weapons testing",
      "All nuclear explosive testing",
      "Biological weapons research",
      "Conventional weapons development"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The CTBT bans all nuclear weapons testing explosions worldwide.",
    "detailedExplanation": "The Comprehensive Nuclear-Test-Ban Treaty was opened for signature in 1996 and prohibits all nuclear weapons test explosions, whether conducted underground, underwater, in the atmosphere, or in outer space. The treaty established the Comprehensive Test Ban Treaty Organization (CTBTO) and a global monitoring system to detect nuclear explosions. While signed by 185 countries, the treaty has not yet entered into force because several key nuclear-capable states, including the United States, China, and North Korea, have not ratified it.",
    "citationUrl": "https://en.wikipedia.org/wiki/Comprehensive_Nuclear-Test-Ban_Treaty",
    "citationTitle": "Wikipedia: Comprehensive Nuclear-Test-Ban Treaty"
  },
  {
    "id": "0319be28-c8db-402c-b8d0-e25fea18ec7a",
    "text": "The Maastricht Treaty of 1992 established which major international organization?",
    "options": [
      "NATO",
      "European Union",
      "United Nations",
      "World Trade Organization"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Maastricht Treaty created the European Union and established the framework for European integration.",
    "detailedExplanation": "The Treaty on European Union, commonly known as the Maastricht Treaty, was signed on February 7, 1992, and came into force on November 1, 1993. It transformed the European Economic Community into the European Union and established the three-pillar structure of the EU. The treaty created European citizenship, established the framework for a common foreign and security policy, and laid the groundwork for Economic and Monetary Union, including the eventual adoption of the euro currency. It represented a major step toward European political and economic integration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maastricht_Treaty",
    "citationTitle": "Wikipedia: Maastricht Treaty"
  },
  {
    "id": "58763362-373c-4ccc-a2e5-33c6ad37b126",
    "text": "The SALT I treaty of 1972 was a landmark arms control agreement between which two superpowers?",
    "options": [
      "USA and China",
      "USSR and China",
      "USA and USSR",
      "USA and United Kingdom"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "SALT I (Strategic Arms Limitation Treaty) was signed between the United States and Soviet Union in 1972.",
    "detailedExplanation": "The Strategic Arms Limitation Treaty (SALT I) was signed in Moscow on May 26, 1972, by U.S. President Richard Nixon and Soviet General Secretary Leonid Brezhnev. This groundbreaking agreement marked the first major nuclear arms control treaty between the two superpowers during the Cold War, placing limits on anti-ballistic missile systems and establishing a framework for future arms control negotiations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Strategic_Arms_Limitation_Talks",
    "citationTitle": "Wikipedia: Strategic Arms Limitation Talks"
  },
  {
    "id": "c36c5975-56b0-4a24-86b3-71a6cdd41244",
    "text": "Which peace treaty signed in 1783 formally ended the American Revolutionary War?",
    "options": [
      "Treaty of Paris",
      "Treaty of London",
      "Treaty of Boston",
      "Treaty of Philadelphia"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Treaty of Paris was signed on September 3, 1783, officially ending the American Revolutionary War.",
    "detailedExplanation": "The Treaty of Paris of 1783 was negotiated in Paris, France, and signed by representatives of King George III of Great Britain and representatives of the United States of America. The treaty granted the thirteen colonies official recognition of their independence and established borders for the new nation, extending from the Atlantic coast to the Mississippi River, excluding British North America and Florida.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Paris_(1783)",
    "citationTitle": "Wikipedia: Treaty of Paris (1783)"
  },
  {
    "id": "2ac38f08-d913-4b9f-b497-344c764f936c",
    "text": "The Locarno Treaties of 1925 were designed to secure peace in post-WWI Europe and guaranteed the borders between Germany and which two countries?",
    "options": [
      "Austria and Poland",
      "France and Belgium",
      "Netherlands and Denmark",
      "Czechoslovakia and Switzerland"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Locarno Treaties guaranteed Germany's borders with France and Belgium as established by the Treaty of Versailles.",
    "detailedExplanation": "The Locarno Treaties were signed on October 16, 1925, in Locarno, Switzerland. The most important treaty guaranteed Germany's western frontiers with France and Belgium, which had been established under the Treaty of Versailles. Germany, France, and Belgium pledged to respect these borders, while Britain and Italy served as guarantors. The treaties were seen as a major step toward normalizing relations between Germany and Western Europe during the interwar period.",
    "citationUrl": "https://en.wikipedia.org/wiki/Locarno_Treaties",
    "citationTitle": "Wikipedia: Locarno Treaties"
  },
  {
    "id": "4709c4f9-ac23-4ae4-a107-2db548e87274",
    "text": "Which 1648 treaty is often credited with establishing the modern concept of national sovereignty in international law?",
    "options": [
      "Treaty of Münster",
      "Peace of Westphalia",
      "Treaty of Osnabrück",
      "Concordat of Worms"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Peace of Westphalia established the principle of state sovereignty and non-interference in domestic affairs.",
    "detailedExplanation": "The Peace of Westphalia, consisting of two treaties signed in 1648, fundamentally transformed the European political system by establishing the principle of state sovereignty. This concept, known as 'Westphalian sovereignty,' stipulated that rulers had exclusive authority within their territories and that external powers should not interfere in the domestic affairs of sovereign states. This principle became a cornerstone of international law and the modern state system.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_of_Westphalia",
    "citationTitle": "Wikipedia: Peace of Westphalia"
  },
  {
    "id": "9dd03c27-caa9-4a56-a6c3-4de78dbc783a",
    "text": "The Sykes-Picot Agreement of 1916 was a secret treaty that divided which region between British and French spheres of influence?",
    "options": [
      "North Africa",
      "The Ottoman Empire's Middle Eastern territories",
      "The Balkans",
      "Central Asia"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Sykes-Picot Agreement divided the Ottoman Empire's Arab provinces in the Middle East between Britain and France.",
    "detailedExplanation": "The Sykes-Picot Agreement was a secret treaty negotiated during World War I between British diplomat Mark Sykes and French diplomat François Georges-Picot. The agreement divided the Ottoman Empire's Arab provinces in the Middle East into British and French spheres of influence, with Britain controlling areas roughly corresponding to modern-day Jordan, Iraq, and Israel/Palestine, while France would control Syria and Lebanon. The agreement was later revealed by the Bolsheviks in 1917, causing controversy as it conflicted with promises made to Arab leaders about independence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sykes%E2%80%93Picot_Agreement",
    "citationTitle": "Wikipedia: Sykes–Picot Agreement"
  },
  {
    "id": "9ab2909f-810e-4a6b-b668-e6a1b42d4be8",
    "text": "Which 1955 agreement established a neutral, independent Austria after World War II?",
    "options": [
      "Treaty of St. Germain",
      "Austrian State Treaty",
      "Vienna Convention",
      "Salzburg Accord"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Austrian State Treaty of 1955 re-established Austria as a sovereign, neutral state and ended Allied occupation.",
    "detailedExplanation": "The Austrian State Treaty (Österreichischer Staatsvertrag) was signed on May 15, 1955, in Vienna by the four Allied powers (United States, United Kingdom, France, and Soviet Union) and Austria. The treaty restored Austria as a sovereign, independent, and democratic state and ended the four-power occupation that had existed since 1945. In return, Austria committed to permanent neutrality, meaning it would not join any military alliances or allow foreign military bases on its territory, a status that Austria maintains to this day.",
    "citationUrl": "https://en.wikipedia.org/wiki/Austrian_State_Treaty",
    "citationTitle": "Wikipedia: Austrian State Treaty"
  }
]