[
  {
    "id": "28db4699-4ad5-420e-9b13-47cd8ba25695",
    "text": "What 1960 Alfred Hitchcock film features the famous shower scene at the Bates Motel?",
    "options": [
      "Psycho",
      "Vertigo",
      "The Birds",
      "Rear Window"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Psycho is the 1960 Hitchcock thriller famous for its shocking shower murder scene.",
    "detailedExplanation": "Alfred Hitchcock's 'Psycho' (1960) revolutionized horror cinema with its unexpected plot twists and the iconic shower scene murder of Janet Leigh's character Marion Crane. The film broke conventional storytelling rules by killing off what appeared to be the main character early in the film. The shower scene, with its quick cuts and screeching violin score by Bernard Herrmann, became one of the most famous and influential sequences in cinema history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Psycho_(1960_film)",
    "citationTitle": "Wikipedia: Psycho (1960 film)"
  },
  {
    "id": "c45e6409-52ed-4645-a60d-76907f44b8a5",
    "text": "Which horror classic features a young girl named Regan who becomes possessed by a demon?",
    "options": [
      "Rosemary's Baby",
      "The Exorcist",
      "Carrie",
      "The Omen"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Exorcist follows 12-year-old Regan MacNeil's demonic possession and subsequent exorcism.",
    "detailedExplanation": "William Friedkin's 'The Exorcist' (1973) tells the terrifying story of Regan MacNeil, a 12-year-old girl who becomes possessed by a demonic entity. The film, based on William Peter Blatty's novel, follows her mother's desperate attempts to save her, ultimately turning to two Catholic priests to perform an exorcism. The film was groundbreaking for its realistic special effects and disturbing imagery, reportedly causing audience members to faint and vomit during screenings.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Exorcist",
    "citationTitle": "Wikipedia: The Exorcist"
  },
  {
    "id": "884ca58a-4b94-45cc-b391-316322224a17",
    "text": "In the 1978 film 'Halloween', what is the name of the masked killer who stalks teenage babysitters?",
    "options": [
      "Jason Voorhees",
      "Freddy Krueger",
      "Michael Myers",
      "Leatherface"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Michael Myers is the silent, masked killer from the Halloween franchise, first appearing in John Carpenter's 1978 film.",
    "detailedExplanation": "Michael Myers is the central antagonist of John Carpenter's 'Halloween' (1978), a film that helped establish many slasher movie conventions. Myers, known as 'The Shape' in the credits, is a seemingly supernatural killer who escapes from a psychiatric hospital and returns to his hometown of Haddonfield, Illinois, to stalk and murder teenage babysitters on Halloween night. His iconic white mask was actually a modified Captain Kirk mask from Star Trek, spray-painted white and altered to create a more unsettling appearance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Myers_(Halloween)",
    "citationTitle": "Wikipedia: Michael Myers (Halloween)"
  },
  {
    "id": "a31beb4d-c452-4575-8ab9-5ef889753ca6",
    "text": "What classic 1968 zombie film was directed by George A. Romero?",
    "options": [
      "Dawn of the Dead",
      "Night of the Living Dead",
      "Day of the Dead",
      "Land of the Dead"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Night of the Living Dead was Romero's groundbreaking 1968 debut that created the modern zombie genre.",
    "detailedExplanation": "George A. Romero's 'Night of the Living Dead' (1968) is widely credited with creating the modern zombie genre and establishing many of the conventions still used today. The low-budget black-and-white film depicts a group of people trapped in a farmhouse while being besieged by reanimated corpses. The film was groundbreaking not only for its horror elements but also for its social commentary and its casting of African American actor Duane Jones in the lead role during the height of the civil rights movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Night_of_the_Living_Dead",
    "citationTitle": "Wikipedia: Night of the Living Dead"
  },
  {
    "id": "336a026c-878b-4b6d-8363-59a7bba12075",
    "text": "Which 1975 Steven Spielberg film about a killer shark was one of the first summer blockbusters?",
    "options": [
      "Jaws",
      "The Abyss",
      "Deep Blue Sea",
      "Piranha"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jaws was Spielberg's 1975 thriller about a great white shark terrorizing a beach town, creating the summer blockbuster phenomenon.",
    "detailedExplanation": "Steven Spielberg's 'Jaws' (1975) tells the story of a great white shark that terrorizes the fictional beach town of Amity Island. The film, based on Peter Benchley's novel, was notable for keeping the shark largely hidden due to mechanical problems with the animatronic shark nicknamed 'Bruce.' This limitation actually enhanced the film's suspense. Jaws became a cultural phenomenon and is credited with creating the concept of the summer blockbuster, earning over $470 million worldwide and spawning multiple sequels.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jaws_(film)",
    "citationTitle": "Wikipedia: Jaws (film)"
  },
  {
    "id": "df60fbf8-4afa-4287-a721-0f1ecd965b4b",
    "text": "In the 1980 film 'The Shining', what hotel serves as the main setting where Jack Torrance goes insane?",
    "options": [
      "The Stanley Hotel",
      "The Overlook Hotel",
      "The Grand Hotel",
      "The Bates Motel"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Overlook Hotel is the isolated Colorado resort where Jack Torrance serves as winter caretaker in Stanley Kubrick's The Shining.",
    "detailedExplanation": "Stanley Kubrick's 'The Shining' (1980) is set primarily at the fictional Overlook Hotel, an isolated resort in the Colorado Rockies where Jack Torrance takes a job as winter caretaker with his wife and psychic son Danny. The hotel's dark history and supernatural influences gradually drive Jack to madness and violence. While the exterior shots were filmed at the Timberline Lodge in Oregon, the hotel's interior was a meticulously designed set that has become iconic in horror cinema, particularly the hedge maze and the famous 'Here's Johnny!' door scene.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Shining_(film)",
    "citationTitle": "Wikipedia: The Shining (film)"
  },
  {
    "id": "de7b02bd-ba0a-46c3-9837-7de9bf22e77f",
    "text": "What 1976 Stephen King adaptation features a teenage girl with telekinetic powers?",
    "options": [
      "Christine",
      "Carrie",
      "Firestarter",
      "The Fury"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Carrie was the first Stephen King novel adapted for film, featuring Sissy Spacek as the telekinetic teenager.",
    "detailedExplanation": "Brian De Palma's 'Carrie' (1976) was the first Stephen King novel to be adapted for the screen, starring Sissy Spacek as Carrie White, a shy, awkward teenager who discovers she has telekinetic powers. The film follows Carrie's torment by classmates and her oppressive, religiously fanatic mother, culminating in the infamous prom night massacre where Carrie uses her powers for revenge. The film was both a critical and commercial success, earning Academy Award nominations for both Spacek and Piper Laurie, and established King as a major force in horror entertainment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Carrie_(1976_film)",
    "citationTitle": "Wikipedia: Carrie (1976 film)"
  },
  {
    "id": "65feb396-7854-4c14-842f-3049991f48d7",
    "text": "Which classic 1931 monster movie starred Bela Lugosi in his most famous role?",
    "options": [
      "Frankenstein",
      "The Mummy",
      "Dracula",
      "The Wolf Man"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Bela Lugosi's portrayal of Count Dracula in the 1931 Universal film became the definitive version of the character.",
    "detailedExplanation": "Tod Browning's 'Dracula' (1931) starred Hungarian actor Bela Lugosi as the iconic vampire Count Dracula, a role that would define both the character and Lugosi's career. Lugosi had previously played Dracula on Broadway, and his theatrical, accented performance became the template for virtually all subsequent portrayals of the character. The film was part of Universal Pictures' classic monster movie cycle and was a major commercial success, establishing many of the visual and narrative conventions of vampire films that persist today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dracula_(1931_English-language_film)",
    "citationTitle": "Wikipedia: Dracula (1931 English-language film)"
  },
  {
    "id": "f30c7b7f-d800-48ac-b476-15411c3111c4",
    "text": "What classic 1932 horror film featured Boris Karloff as the monster created by a mad scientist?",
    "options": [
      "Frankenstein",
      "The Mummy",
      "The Wolf Man",
      "Dr. Jekyll and Mr. Hyde"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Frankenstein (1931) starred Boris Karloff as the iconic monster.",
    "detailedExplanation": "Boris Karloff's portrayal of Frankenstein's monster in the 1931 Universal Pictures film became one of the most iconic performances in horror cinema history. Directed by James Whale, the film was based on Mary Shelley's novel and established many of the visual elements we associate with the monster today, including Karloff's distinctive makeup and towering presence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frankenstein_(1931_film)",
    "citationTitle": "Wikipedia: Frankenstein (1931 film)"
  },
  {
    "id": "c1ed5310-f2b0-4235-8b8c-85a9a95d5494",
    "text": "Which horror classic features the character Laurie Strode as the 'final girl' who survives the killer's rampage?",
    "options": [
      "Friday the 13th",
      "Halloween",
      "A Nightmare on Elm Street",
      "Black Christmas"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jamie Lee Curtis played Laurie Strode, the final girl in Halloween (1978).",
    "detailedExplanation": "Laurie Strode, portrayed by Jamie Lee Curtis in her film debut, became the archetypal 'final girl' in John Carpenter's Halloween (1978). The character established many tropes for the horror genre, being resourceful, virginal, and ultimately the sole survivor who confronts and temporarily defeats the killer. Curtis reprised this role in multiple sequels throughout the franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Laurie_Strode",
    "citationTitle": "Wikipedia: Laurie Strode"
  },
  {
    "id": "57eb7d74-f004-427d-aa9a-4fc4d2e915ad",
    "text": "What 1979 Ridley Scott film popularized the tagline 'In space no one can hear you scream'?",
    "options": [
      "Alien",
      "The Thing",
      "Event Horizon",
      "Forbidden Planet"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Alien (1979) used this famous tagline to emphasize the isolation and terror of space.",
    "detailedExplanation": "Alien, directed by Ridley Scott, revolutionized science fiction horror with its claustrophobic atmosphere and biomechanical creature design by H.R. Giger. The tagline 'In space no one can hear you scream' perfectly captured the film's theme of isolation and helplessness. The movie spawned a successful franchise and established Sigourney Weaver's Ellen Ripley as one of cinema's greatest action heroines.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alien_(film)",
    "citationTitle": "Wikipedia: Alien (film)"
  },
  {
    "id": "a2c7a37b-3895-41ed-958b-1a048037df5d",
    "text": "Which 1973 horror film is considered the first major 'slasher' movie and features a killer terrorizing sorority sisters?",
    "options": [
      "Black Christmas",
      "Peeping Tom",
      "Bay of Blood",
      "The Texas Chain Saw Massacre"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Black Christmas (1974) is often credited as the first true slasher film.",
    "detailedExplanation": "Black Christmas, directed by Bob Clark, established many conventions that would become standard in the slasher genre, including the anonymous killer making threatening phone calls, the Final Girl trope, and the use of point-of-view shots from the killer's perspective. The film's influence can be seen in later classics like Halloween and Friday the 13th, making it a crucial piece of horror cinema history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Black_Christmas_(1974_film)",
    "citationTitle": "Wikipedia: Black Christmas (1974 film)"
  },
  {
    "id": "87bb6942-9a9b-4abc-8a7b-e3c88b988392",
    "text": "What 1986 horror-comedy musical features a man-eating plant named Audrey II?",
    "options": [
      "Little Shop of Horrors",
      "The Blob",
      "Attack of the Killer Tomatoes",
      "Invasion of the Body Snatchers"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Little Shop of Horrors features the carnivorous plant Audrey II as the main antagonist.",
    "detailedExplanation": "Little Shop of Horrors, directed by Frank Oz, was based on the off-Broadway musical, which itself was based on Roger Corman's 1960 B-movie. The film starred Rick Moranis as Seymour, who discovers and nurtures a plant that feeds on human blood and flesh. The plant, named Audrey II after Seymour's crush, was brought to life through elaborate puppetry and became one of cinema's most memorable monster characters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Little_Shop_of_Horrors_(film)",
    "citationTitle": "Wikipedia: Little Shop of Horrors (film)"
  },
  {
    "id": "b2189237-b3a3-466a-a09d-e01cbf2581cf",
    "text": "Which 1968 Roman Polanski film about a pregnant woman and her paranoid suspicions became a landmark psychological horror?",
    "options": [
      "Rosemary's Baby",
      "The Tenant",
      "Repulsion",
      "Don't Look Now"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Rosemary's Baby (1968) starred Mia Farrow as the paranoid pregnant protagonist.",
    "detailedExplanation": "Rosemary's Baby, based on Ira Levin's novel, follows Rosemary Woodhouse as she becomes convinced that her elderly neighbors are members of a Satanic cult who want her baby. The film masterfully builds psychological tension through ambiguity, leaving viewers uncertain whether Rosemary's fears are justified or the product of paranoid delusions. It won Ruth Gordon an Academy Award for Best Supporting Actress and established Polanski as a master of psychological horror.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rosemary%27s_Baby_(film)",
    "citationTitle": "Wikipedia: Rosemary's Baby (film)"
  },
  {
    "id": "04ebb06b-12cb-48ec-8150-5fd4a85e9260",
    "text": "What 1982 John Carpenter film features an alien entity that can perfectly imitate other life forms?",
    "options": [
      "The Thing",
      "They Live",
      "The Fog",
      "Christine"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Thing (1982) features a shape-shifting alien that can mimic any living being.",
    "detailedExplanation": "John Carpenter's The Thing is a remake of the 1951 film 'The Thing from Another World' and is based on John W. Campbell Jr.'s novella 'Who Goes There?' The film is set in an isolated Antarctic research station where the crew encounters an alien organism that can assimilate and perfectly imitate other life forms. Famous for its groundbreaking practical effects by Rob Bottin, the film explores themes of paranoia and mistrust as characters become suspicious of one another.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Thing_(1982_film)",
    "citationTitle": "Wikipedia: The Thing (1982 film)"
  },
  {
    "id": "fc505e9c-cbb7-4712-9b58-dbc148c0ba67",
    "text": "Which 1984 Wes Craven film introduced the dream-stalking killer Freddy Krueger?",
    "options": [
      "A Nightmare on Elm Street",
      "The Hills Have Eyes",
      "Red Eye",
      "Scream"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "A Nightmare on Elm Street (1984) introduced Freddy Krueger, played by Robert Englund.",
    "detailedExplanation": "A Nightmare on Elm Street revolutionized the horror genre by creating a killer who attacks victims in their dreams, making sleep itself dangerous. Freddy Krueger, a burned child murderer seeking revenge from beyond the grave, became one of horror's most recognizable villains with his razor-fingered glove, burned face, and sardonic personality. The film also launched Johnny Depp's career in his film debut and spawned a successful franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Nightmare_on_Elm_Street",
    "citationTitle": "Wikipedia: A Nightmare on Elm Street"
  },
  {
    "id": "de113fbc-5fb7-42ac-9976-d3be9c782346",
    "text": "Which classic 1973 horror film features two young women who encounter a family of cannibals after their car breaks down in rural Texas?",
    "options": [
      "The Texas Chain Saw Massacre",
      "The Hills Have Eyes",
      "Deliverance",
      "Last House on the Left"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Texas Chain Saw Massacre follows Sally and her friends as they encounter Leatherface and his cannibalistic family.",
    "detailedExplanation": "Directed by Tobe Hooper, The Texas Chain Saw Massacre became one of the most influential horror films of the 1970s. The film follows Sally Hardesty and her wheelchair-bound brother Franklin, along with their friends, who encounter a family of cannibals including the chainsaw-wielding Leatherface after visiting an old family property in rural Texas. Despite its title suggesting extreme gore, much of the violence occurs off-screen, relying instead on psychological terror and disturbing imagery.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Texas_Chain_Saw_Massacre",
    "citationTitle": "Wikipedia: The Texas Chain Saw Massacre"
  },
  {
    "id": "4e6efe6c-6d7c-4c64-baeb-53095da1744a",
    "text": "What 1922 German silent film, considered one of the greatest vampire movies ever made, was an unauthorized adaptation of Dracula?",
    "options": [
      "The Cabinet of Dr. Caligari",
      "Nosferatu",
      "Metropolis",
      "The Golem"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Nosferatu was directed by F.W. Murnau and featured Max Schreck as the vampire Count Orlok.",
    "detailedExplanation": "Nosferatu: A Symphony of Horror was directed by F.W. Murnau and is considered a masterpiece of German Expressionist cinema. The film was an unauthorized adaptation of Bram Stoker's Dracula novel, which led to a lawsuit from Stoker's estate. Max Schreck's portrayal of Count Orlok, with his rat-like appearance and long fingernails, created an iconic vampire image that influenced horror cinema for decades. The film's innovative use of shadows, lighting, and camera techniques helped establish many visual conventions of the horror genre.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nosferatu",
    "citationTitle": "Wikipedia: Nosferatu"
  },
  {
    "id": "0348aca9-96b7-40b6-854d-08850e524b38",
    "text": "In the 1968 horror classic 'Rosemary's Baby', what is the name of the apartment building where the sinister events take place?",
    "options": [
      "The Overlook",
      "The Bramford",
      "The Dakota",
      "The Belmont"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Bramford is the fictional apartment building in Rosemary's Baby where the satanic cult operates.",
    "detailedExplanation": "In Roman Polanski's Rosemary's Baby, the Bramford apartment building serves as the central location where Rosemary and Guy Woodhouse move in and become entangled with their elderly neighbors who are part of a satanic coven. The building is described as having a dark history of witchcraft and suicide. While the Bramford is fictional, the exterior shots were filmed at The Dakota apartment building in New York City, which later became infamous as the location where John Lennon was murdered in 1980.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rosemary%27s_Baby_(film)",
    "citationTitle": "Wikipedia: Rosemary's Baby (film)"
  },
  {
    "id": "90c7315a-8789-4866-96a4-12af9fd2f4aa",
    "text": "Which 1987 horror film features the character Pinhead, the leader of extra-dimensional beings called Cenobites?",
    "options": [
      "Hellbound",
      "Hellraiser",
      "From Hell",
      "Evil Dead"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hellraiser introduced Pinhead and the Cenobites, beings summoned by solving the Lament Configuration puzzle box.",
    "detailedExplanation": "Hellraiser was written and directed by Clive Barker, based on his own novella 'The Hellbound Heart.' The film introduced the iconic character Pinhead, played by Doug Bradley, who leads a group of extra-dimensional sadomasochistic beings called Cenobites. These creatures are summoned when someone solves the Lament Configuration, a puzzle box that serves as a gateway to their realm. Pinhead became one of horror cinema's most recognizable villains, spawning multiple sequels and establishing Barker as a major figure in horror filmmaking.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hellraiser",
    "citationTitle": "Wikipedia: Hellraiser"
  }
]