[
  {
    "id": "580108f5-d2ee-4a30-b9c9-6742dab4d013",
    "text": "What is the name of the hotel in Stanley Kubrick's 'The Shining' (1980)?",
    "options": [
      "The Stanley Hotel",
      "The Overlook Hotel",
      "The Grand Hotel",
      "The Timberline Lodge"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Overlook Hotel is the isolated mountain resort where Jack Torrance works as winter caretaker.",
    "detailedExplanation": "In Stanley Kubrick's adaptation of Stephen King's novel, the Overlook Hotel serves as the primary setting where Jack Torrance descends into madness. While the exterior shots were filmed at the Timberline Lodge in Oregon, and King's novel was inspired by the Stanley Hotel in Colorado, the fictional hotel in the film is called the Overlook Hotel. The hotel's isolation and dark history play crucial roles in the psychological horror that unfolds.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Shining_(film)",
    "citationTitle": "Wikipedia: The Shining (film)"
  },
  {
    "id": "bfdafafd-9601-4e8d-be06-1db0fc89166c",
    "text": "Which classic horror film features the famous line 'We all go a little mad sometimes'?",
    "options": [
      "Psycho",
      "The Birds",
      "Vertigo",
      "Rear Window"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Norman Bates delivers this iconic line in Alfred Hitchcock's 'Psycho' (1960).",
    "detailedExplanation": "This memorable quote is spoken by Norman Bates, played by Anthony Perkins, in Alfred Hitchcock's groundbreaking psychological thriller 'Psycho.' The line comes during a conversation between Norman and Marion Crane (Janet Leigh) in the motel office, where Norman's disturbed psychology begins to surface. The film revolutionized the horror genre with its shocking plot twists and psychological depth, and this particular line has become one of cinema's most quoted phrases about mental instability.",
    "citationUrl": "https://en.wikipedia.org/wiki/Psycho_(1960_film)",
    "citationTitle": "Wikipedia: Psycho (1960 film)"
  },
  {
    "id": "d6bd15a5-5686-4bed-a3e0-d288d8de1b2e",
    "text": "In 'Night of the Living Dead' (1968), what causes the dead to rise?",
    "options": [
      "A viral outbreak",
      "Radiation from a Venus space probe",
      "A chemical spill",
      "An ancient curse"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The film suggests that radiation from a returning Venus space probe may be responsible for reanimating the dead.",
    "detailedExplanation": "George A. Romero's 'Night of the Living Dead' briefly mentions through news reports that a Venus space probe returning to Earth may have brought back high levels of radiation that are causing the dead to return to life. However, the film deliberately keeps the cause ambiguous and focuses more on the survival horror aspect. This groundbreaking independent film essentially created the modern zombie genre and established many of the tropes that would define zombie movies for decades to come.",
    "citationUrl": "https://en.wikipedia.org/wiki/Night_of_the_Living_Dead",
    "citationTitle": "Wikipedia: Night of the Living Dead"
  },
  {
    "id": "00dd810b-82a9-4fbc-b9e5-a30f3aab59a3",
    "text": "What is the name of the demon that possesses Regan in 'The Exorcist' (1973)?",
    "options": [
      "Beelzebub",
      "Pazuzu",
      "Asmodeus",
      "Belial"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Pazuzu is the ancient Mesopotamian demon that possesses the young girl Regan MacNeil.",
    "detailedExplanation": "In William Friedkin's 'The Exorcist,' the demon Pazuzu possesses 12-year-old Regan MacNeil. Pazuzu was an actual deity from ancient Mesopotamian religion, known as the king of wind demons. The film's connection to this ancient demon adds to its authenticity and terror. The movie opens with the archaeological dig in Iraq where Father Merrin discovers artifacts related to Pazuzu, establishing the demon's ancient and malevolent presence that will later manifest in Georgetown.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Exorcist_(film)",
    "citationTitle": "Wikipedia: The Exorcist (film)"
  },
  {
    "id": "010fda20-b968-498b-90b8-9db8b48de348",
    "text": "Which actor played both the Wolfman and Frankenstein's monster in Universal's classic monster films?",
    "options": [
      "Boris Karloff",
      "Bela Lugosi",
      "Lon Chaney Jr.",
      "Vincent Price"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Lon Chaney Jr. portrayed both Larry Talbot/The Wolf Man and took over the role of Frankenstein's monster from Boris Karloff.",
    "detailedExplanation": "Lon Chaney Jr., son of silent film horror legend Lon Chaney Sr., became famous for playing Larry Talbot/The Wolf Man starting in 1941's 'The Wolf Man.' He later took on the role of Frankenstein's monster in several Universal films including 'The Ghost of Frankenstein' (1942). Chaney Jr. was the only actor to play four of Universal's major monsters: the Wolf Man, Frankenstein's monster, the Mummy, and Dracula, making him a versatile icon of classic horror cinema.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lon_Chaney_Jr.",
    "citationTitle": "Wikipedia: Lon Chaney Jr."
  },
  {
    "id": "1ceb3b05-ba51-43fe-98e0-9c48f31f8bb7",
    "text": "What everyday object becomes the murder weapon in John Carpenter's 'Halloween' (1978)?",
    "options": [
      "A chainsaw",
      "A kitchen knife",
      "A hammer",
      "An axe"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Michael Myers uses a large kitchen knife as his primary weapon throughout the film.",
    "detailedExplanation": "In John Carpenter's influential slasher film 'Halloween,' Michael Myers' weapon of choice is a large kitchen knife, which he first uses to kill his sister Judith when he's just six years old, and continues to use as an adult when he returns to Haddonfield. The choice of a common household item as the murder weapon adds to the film's sense of domestic terror and helped establish the slasher genre's preference for simple, everyday objects as instruments of horror rather than elaborate or supernatural weapons.",
    "citationUrl": "https://en.wikipedia.org/wiki/Halloween_(1978_film)",
    "citationTitle": "Wikipedia: Halloween (1978 film)"
  },
  {
    "id": "69c8faab-1a40-4a99-8503-bf82f66f6a3a",
    "text": "In 'Rosemary's Baby' (1968), what apartment building serves as the setting for most of the film?",
    "options": [
      "The Bramford",
      "The Dakota",
      "The Ansonia",
      "The Apthorp"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Bramford is the fictional apartment building where Rosemary and Guy Woodhouse live, though it was filmed at The Dakota.",
    "detailedExplanation": "In Roman Polanski's 'Rosemary's Baby,' the fictional Bramford apartment building is where the protagonist Rosemary Woodhouse becomes pregnant with what may be the devil's child. While the building in the film is called The Bramford, the actual filming location was The Dakota building in New York City. The choice of this Gothic Revival building with its imposing architecture perfectly complements the film's atmosphere of paranoid horror and urban menace, making the building itself almost a character in the story.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rosemary%27s_Baby_(film)",
    "citationTitle": "Wikipedia: Rosemary's Baby (film)"
  },
  {
    "id": "0f477ace-0a82-496d-aa43-cbdabddbbd68",
    "text": "What is the name of the spaceship in Ridley Scott's 'Alien' (1979)?",
    "options": [
      "Sulaco",
      "Sevastopol",
      "Nostromo",
      "Prometheus"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The USCSS Nostromo is the commercial towing vessel where the alien terror unfolds.",
    "detailedExplanation": "The USCSS Nostromo serves as the primary setting for Ridley Scott's 'Alien,' a commercial space tug returning to Earth when it receives a distress signal and encounters the deadly xenomorph. The ship's name is a reference to Joseph Conrad's novel 'Nostromo,' reflecting the film's themes of isolation and corporate exploitation. The claustrophobic corridors and industrial design of the Nostromo became iconic in science fiction horror, creating the perfect environment for the cat-and-mouse game between the alien creature and the surviving crew members.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alien_(film)",
    "citationTitle": "Wikipedia: Alien (film)"
  },
  {
    "id": "5742bae9-87a6-4b40-b99d-0de2d4926a19",
    "text": "Who directed the 1978 horror classic 'Dawn of the Dead'?",
    "options": [
      "George A. Romero",
      "Dario Argento",
      "John Carpenter",
      "Tobe Hooper"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "George A. Romero directed 'Dawn of the Dead' as the sequel to his groundbreaking 'Night of the Living Dead'.",
    "detailedExplanation": "George A. Romero directed 'Dawn of the Dead' in 1978, which became the second film in his influential zombie trilogy. The film was set primarily in a shopping mall and continued Romero's exploration of zombie horror while providing social commentary on consumerism. Italian horror director Dario Argento served as a producer and created a different cut for European audiences, but Romero remained the primary director.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dawn_of_the_Dead_(1978_film)",
    "citationTitle": "Wikipedia: Dawn of the Dead (1978 film)"
  },
  {
    "id": "ad3e4627-cf32-40e9-86e6-f5d88196c3a2",
    "text": "In the 1960 film 'Psycho', what is the name of Norman Bates' motel?",
    "options": [
      "Bates Motel",
      "Fairvale Inn",
      "Phoenix Lodge",
      "Desert Palms"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The motel in 'Psycho' is called the Bates Motel, which Norman runs with his domineering mother.",
    "detailedExplanation": "In Alfred Hitchcock's 'Psycho', Norman Bates operates the Bates Motel, a remote establishment that becomes the setting for the film's infamous shower scene and psychological terror. The motel's isolated location and declining business serve as perfect metaphors for Norman's deteriorating mental state. The Bates Motel has since become an iconic location in horror cinema and popular culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Psycho_(1960_film)",
    "citationTitle": "Wikipedia: Psycho (1960 film)"
  },
  {
    "id": "e0cf49e5-3ed0-40cc-8b1f-758d377b2a4f",
    "text": "What year was the original 'The Texas Chain Saw Massacre' released?",
    "options": [
      "1972",
      "1974",
      "1976",
      "1978"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'The Texas Chain Saw Massacre' was released in 1974 and became a landmark in horror cinema.",
    "detailedExplanation": "Tobe Hooper's 'The Texas Chain Saw Massacre' was released in 1974 and revolutionized the horror genre with its raw, unflinching portrayal of violence and terror. Despite its title and reputation, the film actually contains relatively little on-screen gore, relying instead on suggestion and atmosphere to create its horrifying impact. The film was made on a tiny budget but became highly influential in establishing many tropes of the slasher genre.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Texas_Chain_Saw_Massacre",
    "citationTitle": "Wikipedia: The Texas Chain Saw Massacre"
  },
  {
    "id": "e839a5d1-4090-4b3d-8a36-8d9a812c7784",
    "text": "In 'Poltergeist' (1982), which television channel do the supernatural entities communicate through?",
    "options": [
      "Channel 7",
      "Static/white noise",
      "Channel 13",
      "Cable access"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The poltergeists in the film communicate through television static and white noise when stations go off the air.",
    "detailedExplanation": "In Tobe Hooper's 'Poltergeist', the supernatural entities communicate through television static - the white noise that appears when broadcast stations sign off for the night. Young Carol Anne Freeling famously speaks to 'the TV people' through this static, leading to one of horror cinema's most memorable lines: 'They're here.' This use of television as a conduit for supernatural activity was innovative for its time and reflected contemporary anxieties about technology and media.",
    "citationUrl": "https://en.wikipedia.org/wiki/Poltergeist_(1982_film)",
    "citationTitle": "Wikipedia: Poltergeist (1982 film)"
  },
  {
    "id": "7cdf0c9f-216e-4d8f-8fe4-57a96dcd02f5",
    "text": "Which actor played the vampire Count Orlok in the 1922 silent film 'Nosferatu'?",
    "options": [
      "Conrad Veidt",
      "Max Schreck",
      "Emil Jannings",
      "Werner Krauss"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Max Schreck played Count Orlok in F.W. Murnau's 'Nosferatu', creating one of cinema's most iconic vampire portrayals.",
    "detailedExplanation": "Max Schreck portrayed Count Orlok in F.W. Murnau's 1922 masterpiece 'Nosferatu: A Symphony of Horror'. His gaunt, rat-like appearance and unsettling performance created a vampire image that differed dramatically from later, more romantic interpretations. Schreck's mysterious persona led to decades of speculation about the actor, even inspiring the 2000 film 'Shadow of the Vampire', which imagined Schreck as an actual vampire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nosferatu",
    "citationTitle": "Wikipedia: Nosferatu"
  },
  {
    "id": "762966f1-9ab8-4b36-9638-b9f033851a6f",
    "text": "In 'The Cabinet of Dr. Caligari' (1920), what is the name of the sleepwalker controlled by Dr. Caligari?",
    "options": [
      "Francis",
      "Alan",
      "Cesare",
      "Heinrich"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Cesare is the somnambulist (sleepwalker) who carries out murders at the command of Dr. Caligari.",
    "detailedExplanation": "In Robert Wiene's German Expressionist horror film 'The Cabinet of Dr. Caligari', Cesare is the pale, gaunt sleepwalker who is controlled by the sinister Dr. Caligari to commit murders. Played by Conrad Veidt, Cesare's haunting appearance and robotic movements became iconic images of early horror cinema. The film's twisted narrative and expressionistic visual style made it a landmark of both horror and art cinema.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Cabinet_of_Dr._Caligari",
    "citationTitle": "Wikipedia: The Cabinet of Dr. Caligari"
  },
  {
    "id": "a3962b36-5edc-4114-b4d9-587e030fbdae",
    "text": "Which classic horror film features the character Carrie White with telekinetic powers?",
    "options": [
      "The Fury",
      "Scanners",
      "Carrie",
      "The Dead Zone"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Carrie' (1976) tells the story of Carrie White, a high school student with telekinetic abilities.",
    "detailedExplanation": "Brian De Palma's 1976 film 'Carrie' was the first Stephen King novel to be adapted for the screen and launched both King's film career and Sissy Spacek's rise to stardom. The film follows Carrie White, a sheltered teenager who discovers she has telekinetic powers, which she eventually uses for devastating revenge against her tormentors. The film's prom night climax and shocking final scene have become classics of horror cinema.",
    "citationUrl": "https://en.wikipedia.org/wiki/Carrie_(1976_film)",
    "citationTitle": "Wikipedia: Carrie (1976 film)"
  },
  {
    "id": "2f62e299-5c37-4462-96a5-31bd86cdf509",
    "text": "In 'The Wicker Man' (1973), what is the name of the Scottish island where Sergeant Howie searches for a missing girl?",
    "options": [
      "Summerisle",
      "Blackwood Island",
      "Hebrides Isle",
      "Moorland"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Summerisle is the fictional Scottish island setting of 'The Wicker Man' where pagan rituals take place.",
    "detailedExplanation": "In Robin Hardy's 'The Wicker Man', Sergeant Howie travels to the remote Scottish island of Summerisle to investigate the disappearance of a young girl named Rowan Morrison. The island is portrayed as a community that has abandoned Christianity in favor of ancient pagan practices under the leadership of Lord Summerisle. The film builds to one of horror cinema's most memorable and disturbing conclusions, with the island's May Day celebrations playing a central role.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wicker_Man_(1973_film)",
    "citationTitle": "Wikipedia: The Wicker Man (1973 film)"
  },
  {
    "id": "ee6d6b2a-e4df-4c51-859e-1f425a006823",
    "text": "Which horror film director is known for creating the 'Three Mothers' trilogy, including 'Suspiria' (1977) and 'Inferno' (1980)?",
    "options": [
      "Mario Bava",
      "Dario Argento",
      "Lucio Fulci",
      "Lamberto Bava"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Dario Argento created the 'Three Mothers' trilogy featuring supernatural witches.",
    "detailedExplanation": "Dario Argento, the master of Italian giallo horror, created the acclaimed 'Three Mothers' trilogy (Le Tre madri) focusing on three powerful witches. The trilogy consists of 'Suspiria' (1977), 'Inferno' (1980), and 'The Mother of Tears' (2007). These films are renowned for their vivid colors, elaborate set pieces, and Goblin's haunting musical scores, establishing Argento as one of horror cinema's most distinctive auteurs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dario_Argento",
    "citationTitle": "Wikipedia: Dario Argento"
  },
  {
    "id": "8072278a-cec9-4436-b5d4-af2fb7460601",
    "text": "In George A. Romero's 'Night of the Living Dead' (1968), what is the name of the farmhouse where the survivors take shelter?",
    "options": [
      "The Cooper House",
      "The Evans Farmhouse",
      "No specific name is given",
      "Willard Farm"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The isolated farmhouse in the film is never given a specific name.",
    "detailedExplanation": "While the farmhouse serves as the central location for most of 'Night of the Living Dead,' George A. Romero never gave it a specific name in the script or dialogue. The house, located in rural Pennsylvania, becomes a fortress-like sanctuary where Ben, Barbra, and other survivors attempt to survive the zombie apocalypse. The anonymity of the location adds to the film's sense of isolation and universality, making it feel like it could be anywhere in rural America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Night_of_the_Living_Dead",
    "citationTitle": "Wikipedia: Night of the Living Dead"
  },
  {
    "id": "6e833fd9-dcfb-4c24-a1d7-d1407bc43d39",
    "text": "Which classic horror film features the character Dr. Van Helsing as a vampire hunter pursuing the undead Count?",
    "options": [
      "Nosferatu (1922)",
      "Dracula (1931)",
      "Horror of Dracula (1958)",
      "Both B and C"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Dr. Van Helsing appears in both the 1931 Universal Dracula and the 1958 Hammer Horror version.",
    "detailedExplanation": "Dr. Abraham Van Helsing, the vampire-hunting scholar from Bram Stoker's novel, appears as a key character in multiple classic Dracula adaptations. Edward Van Sloan played the role in Universal's 1931 'Dracula' opposite Bela Lugosi, while Peter Cushing portrayed him in Hammer Film Productions' 1958 'Horror of Dracula' (also known as 'Dracula') alongside Christopher Lee. Notably, the 1922 'Nosferatu' used different character names due to copyright issues, with Professor Bulwer serving as the Van Helsing equivalent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Abraham_Van_Helsing",
    "citationTitle": "Wikipedia: Abraham Van Helsing"
  },
  {
    "id": "889793bf-f1b7-4d54-a652-5dabf0a64185",
    "text": "What type of bird attacks the schoolchildren in the famous playground scene from Alfred Hitchcock's 'The Birds' (1963)?",
    "options": [
      "Seagulls",
      "Crows",
      "Ravens",
      "Sparrows"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Crows attack the children at the Bodega Bay School playground in the iconic scene.",
    "detailedExplanation": "In one of 'The Birds' most memorable sequences, a massive flock of crows gathers on the playground equipment behind the Bodega Bay School while Melanie Daniels (Tippi Hedren) waits outside. The tension builds as more and more crows silently perch on the jungle gym before suddenly attacking the fleeing schoolchildren. This scene showcases Hitchcock's mastery of suspense, using the seemingly innocent setting of a school playground to create terror through the methodical gathering of these intelligent black birds.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Birds_(film)",
    "citationTitle": "Wikipedia: The Birds (film)"
  }
]