[
  {
    "id": "4f43d2e5-ba3f-43bc-a9cf-7420c8bddcf9",
    "text": "Which European country provided crucial naval support to the American colonists during the Revolutionary War?",
    "options": [
      "Spain",
      "France",
      "Netherlands",
      "Prussia"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "France provided essential naval support, including ships and experienced officers.",
    "detailedExplanation": "France played a pivotal role in American victory by providing naval support that proved decisive in several key battles. The French fleet under Admiral de Grasse helped secure American victory at Yorktown by preventing British reinforcements from reaching Cornwallis by sea. French naval assistance was part of their broader military alliance with the Americans, formalized in 1778.",
    "citationUrl": "https://en.wikipedia.org/wiki/France_in_the_American_Revolutionary_War",
    "citationTitle": "Wikipedia: France in the American Revolutionary War"
  },
  {
    "id": "ad245dd9-3a99-4f95-b8d5-a4c6af4b40e1",
    "text": "What was the primary cause of the Boston Massacre in 1770?",
    "options": [
      "A riot over tea taxes",
      "Tensions between British soldiers and colonist workers",
      "A protest against the Stamp Act",
      "A dispute over housing British troops"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Economic competition and tensions between off-duty British soldiers and local workers led to the confrontation.",
    "detailedExplanation": "The Boston Massacre occurred when tensions boiled over between British soldiers stationed in Boston and local colonists, particularly workers who competed with soldiers for part-time jobs. On March 5, 1770, a crowd gathered around British sentries, throwing snowballs and shouting insults. The situation escalated when more soldiers arrived, and they eventually fired into the crowd, killing five colonists. The incident was used as propaganda by colonial leaders like Samuel Adams.",
    "citationUrl": "https://en.wikipedia.org/wiki/Boston_Massacre",
    "citationTitle": "Wikipedia: Boston Massacre"
  },
  {
    "id": "2af7b2a8-0156-48df-8e81-4b0aa7cfd328",
    "text": "Which battle is considered the turning point of the American Revolution?",
    "options": [
      "Battle of Bunker Hill",
      "Battle of Saratoga",
      "Battle of Lexington and Concord",
      "Battle of Yorktown"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Battle of Saratoga convinced France to formally enter the war as an American ally.",
    "detailedExplanation": "The Battle of Saratoga (September-October 1777) is widely considered the turning point of the American Revolution because it demonstrated that the Continental Army could defeat a major British force. General Burgoyne's surrender of over 5,000 British troops convinced France that the Americans had a real chance of winning the war, leading to the formal Franco-American alliance in 1778. This alliance brought crucial military and naval support that proved essential to ultimate American victory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battles_of_Saratoga",
    "citationTitle": "Wikipedia: Battles of Saratoga"
  },
  {
    "id": "7afd96a7-ff20-459c-9f0d-8a37079c3268",
    "text": "Which act passed by the British Parliament in 1765 required colonists to pay a tax on printed materials?",
    "options": [
      "Sugar Act",
      "Townshend Acts",
      "Stamp Act",
      "Tea Act"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Stamp Act required special stamps on newspapers, legal documents, and other printed materials.",
    "detailedExplanation": "The Stamp Act of 1765 was the first direct tax imposed by Britain on the American colonies, requiring special tax stamps on newspapers, legal documents, licenses, and other printed materials. Unlike previous acts that regulated trade, this directly taxed colonists for revenue. The act sparked widespread resistance and the famous slogan 'no taxation without representation,' leading to the Stamp Act Congress and eventually to the act's repeal in 1766 due to colonial boycotts and protests.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stamp_Act_1765",
    "citationTitle": "Wikipedia: Stamp Act 1765"
  },
  {
    "id": "f70d170f-d372-476e-be7c-618107cfddc4",
    "text": "Who was the British general who surrendered at Yorktown, effectively ending the Revolutionary War?",
    "options": [
      "General Howe",
      "General Burgoyne",
      "General Cornwallis",
      "General Clinton"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Lord Cornwallis surrendered his army to Washington and Rochambeau at Yorktown in 1781.",
    "detailedExplanation": "General Charles Cornwallis surrendered his army of about 8,000 troops to the combined American and French forces at Yorktown, Virginia, on October 19, 1781. Cornwallis had moved his army to Yorktown expecting naval support and reinforcements from New York, but the French fleet under Admiral de Grasse controlled the sea, while Washington and Rochambeau's combined forces surrounded the British on land. This surrender effectively ended major combat operations and led to peace negotiations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Siege_of_Yorktown",
    "citationTitle": "Wikipedia: Siege of Yorktown"
  },
  {
    "id": "e133a57d-6006-4a98-b7b6-5e4d3b4ec676",
    "text": "What was the first major battle of the American Revolution?",
    "options": [
      "Battle of Bunker Hill",
      "Battle of Concord",
      "Battle of Lexington",
      "Battles of Lexington and Concord"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The combined Battles of Lexington and Concord on April 19, 1775, marked the beginning of armed conflict.",
    "detailedExplanation": "The Battles of Lexington and Concord, fought on April 19, 1775, marked the beginning of the American Revolutionary War. British troops marched from Boston to seize colonial weapons stored in Concord, but were met by colonial militia at Lexington Green where the first shots were fired. After a brief skirmish at Lexington, the British continued to Concord but faced increasing resistance from colonial minutemen during their retreat to Boston. These battles demonstrated that the colonists were willing to fight and marked the transition from political protest to armed rebellion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battles_of_Lexington_and_Concord",
    "citationTitle": "Wikipedia: Battles of Lexington and Concord"
  },
  {
    "id": "30a08c02-4b8f-4700-9833-7e387aec2fe5",
    "text": "Which European nation provided the most significant military support to the American colonists during the Revolutionary War?",
    "options": [
      "Spain",
      "France",
      "Netherlands",
      "Prussia"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "France provided crucial military aid, naval support, and financing to the American colonists.",
    "detailedExplanation": "France became America's most important ally during the Revolutionary War, motivated by their desire to weaken Britain following their defeat in the Seven Years' War. French support included military advisors like Marquis de Lafayette, naval forces that proved decisive at Yorktown, substantial financial loans, and weapons. The French alliance, formalized in 1778, was arguably essential to American victory.",
    "citationUrl": "https://en.wikipedia.org/wiki/France_in_the_American_Revolutionary_War",
    "citationTitle": "Wikipedia: France in the American Revolutionary War"
  },
  {
    "id": "be976bd9-81ff-4da7-bbbc-3a8792719caf",
    "text": "What was the primary purpose of the Boston Tea Party in 1773?",
    "options": [
      "To celebrate a successful harvest",
      "To protest the Tea Act and taxation without representation",
      "To welcome British officials to Boston",
      "To demonstrate new brewing techniques"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Boston Tea Party was a political protest against the Tea Act and British taxation policies.",
    "detailedExplanation": "The Boston Tea Party occurred on December 16, 1773, when American colonists, many disguised as Native Americans, dumped 342 chests of British East India Company tea into Boston Harbor. This act of defiance was primarily a protest against the Tea Act of 1773, which granted the British East India Company a monopoly on tea sales in the American colonies while maintaining a tax on tea, symbolizing the broader issue of 'taxation without representation.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Boston_Tea_Party",
    "citationTitle": "Wikipedia: Boston Tea Party"
  },
  {
    "id": "9f4c23aa-bff3-4908-8c66-384d73260be9",
    "text": "Which document officially ended the American Revolutionary War?",
    "options": [
      "Treaty of Paris",
      "Treaty of Versailles",
      "Articles of Confederation",
      "Treaty of Alliance"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Treaty of Paris, signed in 1783, formally ended the Revolutionary War and recognized American independence.",
    "detailedExplanation": "The Treaty of Paris was signed on September 3, 1783, by representatives of the United States and Great Britain, officially ending the Revolutionary War. The treaty recognized American independence, established the United States' borders from the Atlantic Ocean to the Mississippi River, and from Canada to Florida. It also addressed issues such as fishing rights, debt collection, and the treatment of American Loyalists. The treaty was negotiated by American commissioners including Benjamin Franklin, John Adams, and John Jay.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Paris_(1783)",
    "citationTitle": "Wikipedia: Treaty of Paris (1783)"
  },
  {
    "id": "633f48f2-8ae4-4ed8-a0fd-4a912a3ec5f9",
    "text": "What was the first major military action of the American Revolution?",
    "options": [
      "Boston Massacre",
      "Battle of Bunker Hill",
      "Battles of Lexington and Concord",
      "Siege of Boston"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Battles of Lexington and Concord on April 19, 1775, marked the beginning of armed conflict in the Revolution.",
    "detailedExplanation": "The Battles of Lexington and Concord, fought on April 19, 1775, marked the outbreak of armed conflict between Britain and the American colonies. British troops marched from Boston to seize colonial military supplies stored in Concord, but were confronted first at Lexington and then at Concord by colonial militia. The famous 'shot heard 'round the world' was fired during these engagements. The British retreat to Boston under constant harassment by colonial forces demonstrated that the conflict had escalated beyond political protest to armed rebellion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battles_of_Lexington_and_Concord",
    "citationTitle": "Wikipedia: Battles of Lexington and Concord"
  },
  {
    "id": "a67428ac-6447-423c-8323-090d2461bbc5",
    "text": "Which Prussian military officer helped train the Continental Army and improve their discipline?",
    "options": [
      "Marquis de Lafayette",
      "Baron von Steuben",
      "Count Pulaski",
      "Baron de Kalb"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Baron von Steuben was the Prussian officer who transformed the Continental Army through military training and discipline.",
    "detailedExplanation": "Friedrich Wilhelm Baron von Steuben was a Prussian military officer who arrived at Valley Forge in February 1778 and became instrumental in training the Continental Army. Despite speaking little English, von Steuben created a standardized drill manual and training program that taught soldiers proper military formations, marching techniques, and battlefield tactics. His efforts transformed the ragtag Continental Army into a more professional fighting force capable of standing against British regulars. He later became Inspector General of the Continental Army.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friedrich_Wilhelm_von_Steuben",
    "citationTitle": "Wikipedia: Friedrich Wilhelm von Steuben"
  },
  {
    "id": "62aa2e7e-84d0-48ce-9619-14d13c6aea38",
    "text": "Which European country provided the most significant military and financial support to the American colonists during the Revolutionary War?",
    "options": [
      "Spain",
      "France",
      "Netherlands",
      "Prussia"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "France provided crucial military aid, naval support, and loans totaling millions of livres to help the Americans defeat Britain.",
    "detailedExplanation": "France became America's most important ally during the Revolutionary War, motivated largely by their desire for revenge against Britain following their defeat in the Seven Years' War. French support included significant financial loans, military supplies, naval assistance, and thousands of troops. The French fleet's victory at the Battle of the Chesapeake in 1781 was crucial in trapping British forces at Yorktown, leading to Cornwallis's surrender.",
    "citationUrl": "https://en.wikipedia.org/wiki/France_in_the_American_Revolutionary_War",
    "citationTitle": "Wikipedia: France in the American Revolutionary War"
  },
  {
    "id": "5393d146-963c-497b-87e4-b0d8dc197235",
    "text": "What was the name of the pamphlet written by Thomas Paine that greatly influenced American public opinion in favor of independence?",
    "options": [
      "The Crisis",
      "Common Sense",
      "Rights of Man",
      "The American Crisis"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Common Sense, published in January 1776, persuaded many colonists to support independence from Britain through plain language arguments.",
    "detailedExplanation": "Thomas Paine's 'Common Sense' was published anonymously in January 1776 and became an immediate bestseller, selling over 120,000 copies in the first three months. Written in plain language that ordinary colonists could understand, it argued against monarchy and hereditary rule while making the case for American independence. The pamphlet helped shift public opinion from seeking reconciliation with Britain to supporting complete separation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Common_Sense",
    "citationTitle": "Wikipedia: Common Sense"
  },
  {
    "id": "b63e145e-7644-4224-878e-cdd0f99180e9",
    "text": "At which battle did the Continental Army cross the Delaware River on Christmas night 1776?",
    "options": [
      "Battle of Princeton",
      "Battle of Brandywine",
      "Battle of Trenton",
      "Battle of Monmouth"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Washington led his troops across the icy Delaware River on Christmas night to launch a surprise attack on Hessian forces at Trenton.",
    "detailedExplanation": "The Battle of Trenton took place on December 26, 1776, after George Washington's famous crossing of the Delaware River on Christmas night. The Continental Army surprised and defeated Hessian mercenaries who were recovering from Christmas celebrations. This victory was crucial for American morale after a series of defeats and helped convince many soldiers to re-enlist when their terms were set to expire at year's end.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_Trenton",
    "citationTitle": "Wikipedia: Battle of Trenton"
  },
  {
    "id": "2973d328-c9f4-4085-bb55-c1a9f2a107e0",
    "text": "Who was the British general that surrendered at Yorktown, effectively ending major combat operations in the Revolutionary War?",
    "options": [
      "General Henry Clinton",
      "General John Burgoyne",
      "General Charles Cornwallis",
      "General William Howe"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "General Charles Cornwallis surrendered his army at Yorktown on October 19, 1781, after being trapped by American and French forces.",
    "detailedExplanation": "General Charles Cornwallis led British forces in the Southern campaign and became trapped at Yorktown, Virginia, in 1781. Surrounded by American and French land forces under Washington and Rochambeau, and cut off from naval reinforcement by the French fleet, Cornwallis was forced to surrender his entire army of about 7,000 men on October 19, 1781. This decisive defeat effectively ended major British military operations in the colonies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Siege_of_Yorktown",
    "citationTitle": "Wikipedia: Siege of Yorktown"
  },
  {
    "id": "7820eaa8-7acb-412e-8837-c1bd2441b60c",
    "text": "What was the primary purpose of the Committees of Correspondence established in the colonies before the war?",
    "options": [
      "To organize trade boycotts",
      "To coordinate communication between colonies",
      "To collect taxes for the war effort",
      "To recruit soldiers for the militia"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Committees of Correspondence were created to share information and coordinate resistance activities between the American colonies.",
    "detailedExplanation": "The Committees of Correspondence were shadow governments organized by American colonial leaders to maintain communication between the colonies and coordinate resistance to British policies. First established by Samuel Adams in Massachusetts in 1772, these committees spread throughout all thirteen colonies. They shared information about British actions, organized boycotts, and helped unite colonial opposition. These networks proved crucial in organizing resistance and eventually coordinating the move toward independence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Committees_of_correspondence",
    "citationTitle": "Wikipedia: Committees of correspondence"
  },
  {
    "id": "d87e20ab-6a50-4417-bee5-535ed9a17a2d",
    "text": "Which European country provided the most significant military aid to the American colonists during the Revolutionary War?",
    "options": [
      "Spain",
      "France",
      "Netherlands",
      "Prussia"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "France provided crucial military aid including troops, naval support, and supplies to help the Americans defeat Britain.",
    "detailedExplanation": "France became America's most important ally during the Revolutionary War, motivated by their desire for revenge against Britain after the Seven Years' War. French support included sending thousands of troops, providing naval assistance that proved decisive at Yorktown, supplying weapons and ammunition, and offering substantial financial aid. The French alliance, formalized in 1778, transformed the conflict from a colonial rebellion into a global war.",
    "citationUrl": "https://en.wikipedia.org/wiki/France_in_the_American_Revolutionary_War",
    "citationTitle": "Wikipedia: France in the American Revolutionary War"
  },
  {
    "id": "7db7dfc9-5ac6-4f41-86a8-8a17d75503ae",
    "text": "What was the primary reason for the Boston Tea Party in 1773?",
    "options": [
      "High taxes on all imported goods",
      "British soldiers stationed in Boston homes",
      "The Tea Act giving monopoly privileges to the East India Company",
      "Closure of Boston Harbor by the British"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Tea Act of 1773 granted the East India Company a monopoly on tea sales in America, threatening colonial merchants' businesses.",
    "detailedExplanation": "The Boston Tea Party was primarily a protest against the Tea Act of 1773, which gave the British East India Company exclusive rights to sell tea directly to retailers in the American colonies, bypassing colonial merchants. This threatened the livelihoods of American tea merchants and was seen as another example of taxation without representation. On December 16, 1773, colonists disguised as Native Americans dumped 342 chests of tea into Boston Harbor, leading to the punitive Intolerable Acts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Boston_Tea_Party",
    "citationTitle": "Wikipedia: Boston Tea Party"
  },
  {
    "id": "2dd48d4e-54fc-424a-8e84-9307124ff449",
    "text": "At which battle did British General Cornwallis surrender, effectively ending major combat in the Revolutionary War?",
    "options": [
      "Battle of Saratoga",
      "Siege of Yorktown",
      "Battle of Cowpens",
      "Battle of Guilford Courthouse"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Cornwallis surrendered at Yorktown in October 1781 after being trapped by American and French forces.",
    "detailedExplanation": "The Siege of Yorktown (September 28 - October 19, 1781) was the decisive victory that effectively ended the Revolutionary War. General Cornwallis found himself trapped on the Yorktown peninsula by Washington's Continental Army and French forces on land, while the French fleet under Admiral de Grasse controlled the sea. Unable to escape or receive reinforcements, Cornwallis surrendered his army of nearly 8,000 men, leading to negotiations that resulted in the Treaty of Paris in 1783.",
    "citationUrl": "https://en.wikipedia.org/wiki/Siege_of_Yorktown",
    "citationTitle": "Wikipedia: Siege of Yorktown"
  },
  {
    "id": "02186d21-3d72-4d68-84f8-86663874df1a",
    "text": "Which pamphlet, published in 1776, helped convince many colonists to support independence from Britain?",
    "options": [
      "The Federalist Papers",
      "Common Sense",
      "Letters from a Farmer in Pennsylvania",
      "The Crisis"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Thomas Paine's 'Common Sense' used plain language to argue for independence and was widely read throughout the colonies.",
    "detailedExplanation": "Thomas Paine's 'Common Sense,' published in January 1776, became one of the most influential pamphlets in American history. Written in accessible language that ordinary colonists could understand, it argued against monarchy and hereditary rule while making the case for American independence. The pamphlet sold over 50,000 copies within months and eventually reached nearly every literate colonist. It helped shift public opinion from seeking reconciliation with Britain to supporting complete independence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Common_Sense",
    "citationTitle": "Wikipedia: Common Sense (pamphlet)"
  }
]