[
  {
    "id": "c2d1742c-c74d-4723-a658-d2bd6a219c0e",
    "text": "How many permanent members are there on the UN Security Council?",
    "options": [
      "3",
      "5",
      "7",
      "10"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The UN Security Council has 5 permanent members with veto power.",
    "detailedExplanation": "The United Nations Security Council consists of 15 members total, but only 5 are permanent members with veto power: the United States, United Kingdom, France, Russia, and China. These five nations were the major Allied powers at the end of World War II and were granted permanent status when the UN was established in 1945. The remaining 10 members are non-permanent and serve two-year terms.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Security_Council",
    "citationTitle": "Wikipedia: United Nations Security Council"
  },
  {
    "id": "cc67aa81-c53c-41ef-b02b-0a99cf5c9f20",
    "text": "Which city serves as the headquarters of NATO?",
    "options": [
      "Paris",
      "Brussels",
      "London",
      "Washington D.C."
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "NATO headquarters is located in Brussels, Belgium.",
    "detailedExplanation": "The North Atlantic Treaty Organization (NATO) moved its headquarters to Brussels, Belgium in 1967. Prior to this, NATO headquarters were located in Paris, France, but were relocated after France withdrew from NATO's integrated command structure under President Charles de Gaulle. The Brussels headquarters houses the North Atlantic Council and serves as the primary decision-making body for the alliance's 31 member countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO_headquarters",
    "citationTitle": "Wikipedia: NATO headquarters"
  },
  {
    "id": "75c64819-a4cc-4f18-91eb-19d398e72c91",
    "text": "In what year was the United Nations officially established?",
    "options": [
      "1944",
      "1945",
      "1946",
      "1947"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The United Nations was officially established in 1945.",
    "detailedExplanation": "The United Nations officially came into existence on October 24, 1945, when the UN Charter was ratified by the five permanent Security Council members and a majority of the original 51 member states. The Charter had been signed earlier that year in San Francisco on June 26, 1945, following the United Nations Conference on International Organization. October 24th is now celebrated annually as UN Day.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations",
    "citationTitle": "Wikipedia: United Nations"
  },
  {
    "id": "6e5c9953-d72e-4ab6-8349-33b360df52ea",
    "text": "What does the acronym 'NATO' stand for?",
    "options": [
      "North American Treaty Organization",
      "North Atlantic Trade Organization",
      "North Atlantic Treaty Organization",
      "Northern Alliance Treaty Organization"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "NATO stands for North Atlantic Treaty Organization.",
    "detailedExplanation": "NATO stands for North Atlantic Treaty Organization, a military alliance formed in 1949 by 12 founding members including the United States, Canada, and several Western European nations. The organization was created as a collective defense alliance during the Cold War, with the principle that an attack on one member would be considered an attack on all members, as outlined in Article 5 of the North Atlantic Treaty.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO",
    "citationTitle": "Wikipedia: NATO"
  },
  {
    "id": "590582e6-2124-4ceb-b147-d4bb5c973aa3",
    "text": "Who is the current Secretary-General of the United Nations?",
    "options": [
      "Ban Ki-moon",
      "Kofi Annan",
      "António Guterres",
      "Boutros Boutros-Ghali"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "António Guterres of Portugal has been UN Secretary-General since 2017.",
    "detailedExplanation": "António Guterres, former Prime Minister of Portugal and UN High Commissioner for Refugees, became the ninth Secretary-General of the United Nations on January 1, 2017. He succeeded Ban Ki-moon of South Korea, who served from 2007 to 2016. Guterres was re-elected for a second term beginning January 1, 2022. The Secretary-General serves as the UN's chief administrative officer and is appointed by the General Assembly upon recommendation of the Security Council.",
    "citationUrl": "https://en.wikipedia.org/wiki/António_Guterres",
    "citationTitle": "Wikipedia: António Guterres"
  },
  {
    "id": "06163f30-932f-4ae6-8b0d-f63b71d428c9",
    "text": "How many countries were founding members of NATO in 1949?",
    "options": [
      "10",
      "12",
      "15",
      "16"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "NATO was founded by 12 countries in 1949.",
    "detailedExplanation": "NATO was established on April 4, 1949, with 12 founding members: the United States, Canada, United Kingdom, France, Italy, Portugal, Norway, Denmark, Iceland, Belgium, Netherlands, and Luxembourg. These nations signed the North Atlantic Treaty in Washington, D.C., creating the alliance as a response to the growing Soviet influence in Eastern Europe after World War II. The organization has since expanded significantly and now includes 31 member countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO",
    "citationTitle": "Wikipedia: NATO"
  },
  {
    "id": "23b37433-0df3-473d-8ec2-844abc71a379",
    "text": "Which UN body is responsible for maintaining international peace and security?",
    "options": [
      "General Assembly",
      "Economic and Social Council",
      "Security Council",
      "Trusteeship Council"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The UN Security Council is primarily responsible for maintaining international peace and security.",
    "detailedExplanation": "The United Nations Security Council is the UN organ with primary responsibility for maintaining international peace and security. Unlike the General Assembly where all member states have equal representation, the Security Council has only 15 members and can make binding decisions. It has the power to authorize military action, impose sanctions, and deploy peacekeeping forces. The five permanent members (US, UK, France, Russia, China) each have veto power over substantive resolutions.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Security_Council",
    "citationTitle": "Wikipedia: United Nations Security Council"
  },
  {
    "id": "ca9c7ec7-664f-4614-a19d-e68a6183d47a",
    "text": "Which article of the NATO treaty establishes the principle of collective defense?",
    "options": [
      "Article 3",
      "Article 5",
      "Article 7",
      "Article 9"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Article 5 establishes NATO's collective defense principle.",
    "detailedExplanation": "Article 5 of the North Atlantic Treaty establishes the principle of collective defense, stating that an armed attack against one or more NATO members shall be considered an attack against all members. This article has only been invoked once in NATO's history, following the September 11, 2001 terrorist attacks on the United States. The collective defense principle is the cornerstone of the NATO alliance and provides the legal framework for mutual military assistance among member nations.",
    "citationUrl": "https://en.wikipedia.org/wiki/North_Atlantic_Treaty#Article_5",
    "citationTitle": "Wikipedia: North Atlantic Treaty"
  },
  {
    "id": "be12e1c5-f097-44fe-8334-d1932a22d95b",
    "text": "Which continent has the most member countries in the United Nations?",
    "options": [
      "Asia",
      "Africa",
      "Europe",
      "South America"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Africa has 54 UN member countries, making it the continent with the most representation.",
    "detailedExplanation": "Africa is the continent with the highest number of UN member states, with 54 countries represented. This reflects the large number of sovereign nations on the African continent, many of which gained independence and UN membership during the decolonization period of the 1960s. Asia follows with 47 members, then Europe with 44 members.",
    "citationUrl": "https://en.wikipedia.org/wiki/Member_states_of_the_United_Nations",
    "citationTitle": "Wikipedia: Member states of the United Nations"
  },
  {
    "id": "2b36ceb4-532c-47a3-be7d-449ca83cea8b",
    "text": "What is the maximum number of consecutive terms a country can serve as a non-permanent member of the UN Security Council?",
    "options": [
      "One term only",
      "Two consecutive terms",
      "Three consecutive terms",
      "No limit"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Non-permanent members serve two-year terms and cannot be immediately re-elected for consecutive terms.",
    "detailedExplanation": "Non-permanent members of the UN Security Council serve for two-year terms and are not eligible for immediate re-election. This rule ensures rotation among UN member states and prevents any single non-permanent member from holding prolonged influence. Countries must wait at least one term before they can be elected again to serve on the Security Council.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Security_Council",
    "citationTitle": "Wikipedia: United Nations Security Council"
  },
  {
    "id": "c0ea5ec7-ae8d-4e07-9c56-e70363e861f0",
    "text": "Which country was the first to withdraw from NATO and then later rejoin?",
    "options": [
      "Turkey",
      "France",
      "Spain",
      "Greece"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "France withdrew from NATO's integrated command structure in 1966 under Charles de Gaulle and fully rejoined in 2009.",
    "detailedExplanation": "France withdrew from NATO's integrated command structure in 1966 under President Charles de Gaulle, who wanted to maintain French military independence during the Cold War. While France remained a political member of the alliance, it operated outside the unified command structure for over 40 years. In 2009, under President Nicolas Sarkozy, France fully rejoined NATO's integrated command structure.",
    "citationUrl": "https://en.wikipedia.org/wiki/France_and_NATO",
    "citationTitle": "Wikipedia: France and NATO"
  },
  {
    "id": "c3abde2d-2393-4368-85c0-13082d7cba0a",
    "text": "Which UN specialized agency is responsible for international postal services?",
    "options": [
      "International Telecommunication Union",
      "Universal Postal Union",
      "International Civil Aviation Organization",
      "World Intellectual Property Organization"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Universal Postal Union (UPU) coordinates postal policies and facilitates international mail exchange between member countries.",
    "detailedExplanation": "The Universal Postal Union (UPU) is a specialized agency of the United Nations that coordinates postal policies among member nations and ensures the smooth operation of international mail services. Established in 1874, it was one of the first international organizations and became a UN specialized agency in 1948. The UPU sets rules for international mail exchanges and helps ensure that mail can be sent and received anywhere in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Universal_Postal_Union",
    "citationTitle": "Wikipedia: Universal Postal Union"
  },
  {
    "id": "e38adef5-9cc9-456d-a83c-02ecdac35323",
    "text": "What percentage of member countries' votes is required for the UN General Assembly to make decisions on important matters?",
    "options": [
      "Simple majority (50%+)",
      "Two-thirds majority",
      "Three-quarters majority",
      "Unanimous consent"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Important matters in the UN General Assembly require a two-thirds majority of members present and voting.",
    "detailedExplanation": "The UN General Assembly requires a two-thirds majority vote for decisions on important matters, including recommendations on peace and security, election of Security Council members, admission of new UN members, and budgetary questions. Regular procedural matters only require a simple majority. This two-thirds requirement ensures that significant decisions have broad support among the international community.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_General_Assembly",
    "citationTitle": "Wikipedia: United Nations General Assembly"
  },
  {
    "id": "edf6237c-b139-4e03-b38d-e6949dea4283",
    "text": "Which NATO member country has the smallest population?",
    "options": [
      "Luxembourg",
      "Iceland",
      "Montenegro",
      "Estonia"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Iceland has a population of approximately 370,000 people, making it NATO's smallest member by population.",
    "detailedExplanation": "Iceland, with a population of approximately 370,000 people, is NATO's smallest member country by population. Despite its small size, Iceland has been strategically important to NATO due to its location in the North Atlantic, serving as a bridge between North America and Europe. Iceland was a founding member of NATO in 1949, though it notably has no standing army and relies on coast guard and crisis response units.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iceland_and_NATO",
    "citationTitle": "Wikipedia: Iceland and NATO"
  },
  {
    "id": "47bd27cc-6e3c-4270-87a1-e6183a3cd613",
    "text": "In which Swiss city do many UN agencies have offices, making it the European headquarters of the UN?",
    "options": [
      "Zurich",
      "Bern",
      "Geneva",
      "Basel"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Geneva hosts the UN Office at Geneva (UNOG) and serves as the European headquarters for many UN agencies.",
    "detailedExplanation": "Geneva, Switzerland, serves as the European headquarters of the United Nations and hosts the UN Office at Geneva (UNOG), which is the second-largest UN office after New York. Geneva houses numerous UN agencies including the World Health Organization (WHO), International Labour Organization (ILO), and the UN Human Rights Council. The city's long tradition of international diplomacy and neutrality makes it an ideal location for international organizations.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Office_at_Geneva",
    "citationTitle": "Wikipedia: United Nations Office at Geneva"
  },
  {
    "id": "b6f30edd-79a1-4027-8506-644a8b3e587f",
    "text": "Which NATO operation was the alliance's first major combat mission outside of Europe?",
    "options": [
      "Operation Desert Storm",
      "International Security Assistance Force in Afghanistan",
      "Operation Allied Force in Kosovo",
      "Operation Unified Protector in Libya"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "ISAF in Afghanistan was NATO's first major ground combat mission outside the Euro-Atlantic area, beginning in 2001.",
    "detailedExplanation": "The International Security Assistance Force (ISAF) in Afghanistan, which began in 2001 following the September 11 attacks, was NATO's first major combat mission outside of Europe and the Euro-Atlantic area. This mission marked a significant expansion of NATO's role from its original focus on collective defense in Europe to broader international security operations. ISAF involved troops from many NATO members and partner nations in a complex counterinsurgency and nation-building effort that lasted until 2014.",
    "citationUrl": "https://en.wikipedia.org/wiki/International_Security_Assistance_Force",
    "citationTitle": "Wikipedia: International Security Assistance Force"
  },
  {
    "id": "e9797d81-6844-4ca3-9314-148b7848cae1",
    "text": "Which languages are the six official languages of the United Nations?",
    "options": [
      "English, French, Spanish, Russian, Chinese, Arabic",
      "English, French, Spanish, Russian, Chinese, Japanese",
      "English, French, Spanish, Portuguese, Chinese, Arabic",
      "English, French, German, Russian, Chinese, Arabic"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The UN's six official languages are English, French, Spanish, Russian, Chinese (Mandarin), and Arabic.",
    "detailedExplanation": "The United Nations operates with six official languages that are used in meetings, documents, and official communications. These languages were chosen based on their global reach and the representation of major world regions. English and French serve as the working languages for the UN Secretariat, while all six languages are used equally in the General Assembly, Security Council, and other major UN bodies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Official_languages_of_the_United_Nations",
    "citationTitle": "Wikipedia: Official languages of the United Nations"
  },
  {
    "id": "b2ba6765-412d-4bff-9710-073e4d6c4e7b",
    "text": "What color are the helmets typically worn by UN peacekeeping forces?",
    "options": [
      "Blue",
      "White",
      "Green",
      "Gray"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "UN peacekeepers wear distinctive blue helmets, earning them the nickname 'Blue Helmets.'",
    "detailedExplanation": "United Nations peacekeeping forces are easily recognizable by their light blue helmets and berets, which have become an iconic symbol of international peacekeeping efforts. This distinctive blue color was adopted to make UN personnel clearly identifiable as neutral peacekeepers rather than combatants. The tradition dates back to the first major UN peacekeeping mission in the 1940s, and the blue helmet has since become synonymous with UN peace operations worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_peacekeeping",
    "citationTitle": "Wikipedia: United Nations peacekeeping"
  },
  {
    "id": "858adad8-d235-4382-b16c-3f7aa455d9a2",
    "text": "Which two countries joined NATO most recently in 2023 and 2024?",
    "options": [
      "Finland and Sweden",
      "Ukraine and Georgia",
      "Montenegro and North Macedonia",
      "Estonia and Latvia"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Finland joined NATO in April 2023, followed by Sweden in March 2024, both prompted by Russia's invasion of Ukraine.",
    "detailedExplanation": "Finland and Sweden, two traditionally neutral Nordic countries, abandoned their long-standing policies of military neutrality and joined NATO in response to increased security concerns following Russia's invasion of Ukraine in 2022. Finland's membership was approved in April 2023, while Sweden's application faced initial opposition from Turkey and Hungary before being approved in March 2024. These additions significantly strengthened NATO's northern flank and brought the alliance's membership to 32 countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/2023_enlargement_of_NATO",
    "citationTitle": "Wikipedia: 2023 enlargement of NATO"
  },
  {
    "id": "45773e55-0d14-43e8-83d6-7c1cfd2919c0",
    "text": "What is the name of the UN's humanitarian aid coordination office?",
    "options": [
      "OCHA",
      "UNDP",
      "UNHCR",
      "UNICEF"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "OCHA (Office for the Coordination of Humanitarian Affairs) coordinates international humanitarian response to emergencies and disasters.",
    "detailedExplanation": "The United Nations Office for the Coordination of Humanitarian Affairs (OCHA) was established in 1991 to strengthen the UN's response to complex emergencies and natural disasters. OCHA works to coordinate humanitarian action, advocate for the rights of people in need, promote preparedness and prevention, and facilitate sustainable solutions. The office plays a crucial role in mobilizing and coordinating effective and principled humanitarian action in partnership with national and international actors during crises around the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Office_for_the_Coordination_of_Humanitarian_Affairs",
    "citationTitle": "Wikipedia: United Nations Office for the Coordination of Humanitarian Affairs"
  }
]