[
  {
    "id": "65922869-e71d-40a4-b5bd-f6e0d9217b02",
    "text": "Which UN Secretary-General died in a plane crash in 1961 while on a peace mission to the Congo?",
    "options": [
      "U Thant",
      "Dag Hammarskjöld",
      "Trygve Lie",
      "Kurt Waldheim"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Dag Hammarskjöld died in a plane crash in Northern Rhodesia (now Zambia) in 1961.",
    "detailedExplanation": "Dag Hammarskjöld, the second UN Secretary-General, died on September 18, 1961, when his plane crashed near Ndola in Northern Rhodesia (now Zambia) while he was en route to negotiate a ceasefire in the Congo Crisis. The circumstances of the crash remain controversial, with some suggesting it may not have been accidental. Hammarskjöld was posthumously awarded the Nobel Peace Prize in 1961.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dag_Hammarskj%C3%B6ld",
    "citationTitle": "Wikipedia: Dag Hammarskjöld"
  },
  {
    "id": "3b4b96fa-c727-425d-92f8-f9380d8627d2",
    "text": "What does NATO's Article 5, invoked for the first time after 9/11, state?",
    "options": [
      "Collective defense - an attack on one is an attack on all",
      "Nuclear weapons sharing protocol",
      "Democratic governance requirement",
      "Joint military procurement standards"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Article 5 establishes the principle of collective defense, stating that an attack on one NATO member is considered an attack on all.",
    "detailedExplanation": "Article 5 of the North Atlantic Treaty is the cornerstone of NATO's collective defense principle. It states that an armed attack against one or more NATO members shall be considered an attack against them all. This article was invoked for the first and only time in NATO's history following the September 11, 2001 terrorist attacks on the United States, leading to NATO support for the U.S. military response in Afghanistan.",
    "citationUrl": "https://en.wikipedia.org/wiki/Article_5_of_the_NATO_Treaty",
    "citationTitle": "Wikipedia: Article 5 of the NATO Treaty"
  },
  {
    "id": "5b6d03a0-eb3f-46fb-a6d8-0c7f6001b951",
    "text": "Which country holds the record for serving the most non-consecutive terms on the UN Security Council as a non-permanent member?",
    "options": [
      "Brazil",
      "Japan",
      "India",
      "Argentina"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Brazil has served 11 terms as a non-permanent member of the UN Security Council, more than any other country.",
    "detailedExplanation": "Brazil holds the record for serving the most terms as a non-permanent member of the UN Security Council, having been elected 11 times since the UN's founding. This reflects Brazil's long-standing diplomatic engagement and its status as a major regional power in Latin America. The country has consistently sought a permanent seat on the Security Council as part of the G4 group (Brazil, Germany, India, and Japan) that advocates for Security Council reform.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brazil_and_the_United_Nations",
    "citationTitle": "Wikipedia: Brazil and the United Nations"
  },
  {
    "id": "762215c4-2e7a-4c0e-b911-f5d24d842929",
    "text": "Which NATO operation, launched in 1995, was the alliance's first major combat operation?",
    "options": [
      "Operation Allied Force",
      "Operation Deliberate Force",
      "Operation Sharp Guard",
      "Operation Deny Flight"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Operation Deliberate Force was NATO's sustained bombing campaign against Bosnian Serb forces in 1995, marking the alliance's first major combat operation.",
    "detailedExplanation": "Operation Deliberate Force was a sustained air campaign conducted by NATO against the Army of Republika Srpska in Bosnia and Herzegovina from August 30 to September 20, 1995. This operation marked NATO's first major combat engagement and was launched in response to the Srebrenica massacre and continued attacks on UN safe areas. The successful operation helped pressure the warring parties toward the Dayton Peace Accords that ended the Bosnian War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Operation_Deliberate_Force",
    "citationTitle": "Wikipedia: Operation Deliberate Force"
  },
  {
    "id": "04f5b591-1a0d-4bdd-82c4-5d19b9b80719",
    "text": "How many official languages does the United Nations have?",
    "options": [
      "4",
      "6",
      "8",
      "10"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The UN has six official languages: Arabic, Chinese, English, French, Russian, and Spanish.",
    "detailedExplanation": "The United Nations has six official languages: Arabic, Chinese (Mandarin), English, French, Russian, and Spanish. These languages are used in UN meetings, and all official UN documents are translated into these languages. English and French serve as the working languages of the UN Secretariat. The choice of official languages reflects the geopolitical realities and linguistic diversity of the UN's founding era and subsequent expansions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Official_languages_of_the_United_Nations",
    "citationTitle": "Wikipedia: Official languages of the United Nations"
  },
  {
    "id": "dcdfe4f1-b0ec-48e1-a5ab-5dd36b50d4e5",
    "text": "Which country was expelled from NATO's partnership programs after invading Georgia in 2008?",
    "options": [
      "Belarus",
      "Russia",
      "Ukraine",
      "Moldova"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Russia's cooperation with NATO was suspended following its invasion of Georgia in 2008, and further deteriorated after the 2014 Ukraine crisis.",
    "detailedExplanation": "Following Russia's military intervention in Georgia in August 2008, NATO suspended all practical cooperation with Russia under the NATO-Russia Council framework. The relationship had been established in 2002 to provide a forum for consultation and cooperation, but the Georgia conflict marked a turning point in NATO-Russia relations. Cooperation was further suspended and relations deteriorated significantly after Russia's annexation of Crimea and involvement in eastern Ukraine in 2014.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO%E2%80%93Russia_relations",
    "citationTitle": "Wikipedia: NATO–Russia relations"
  },
  {
    "id": "2d1e8c7d-f7a9-4ea4-9df9-bdd56b675066",
    "text": "Which UN specialized agency was expelled from the UN system in 1985 due to its policies toward Israel?",
    "options": [
      "UNIDO",
      "UNESCO",
      "UNRWA",
      "UNCTAD"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "UNESCO was abandoned by the United States and other countries in the 1980s, though the specific year was 1984 for the US withdrawal, effective 1985.",
    "detailedExplanation": "The United States withdrew from UNESCO (United Nations Educational, Scientific and Cultural Organization) in 1984, with the withdrawal taking effect on December 31, 1984. The U.S. cited concerns about UNESCO's alleged anti-Western bias, mismanagement, and policies perceived as hostile to Israel and supportive of restrictions on press freedom. The UK and Singapore also withdrew around the same time. The U.S. eventually rejoined UNESCO in 2003 but withdrew again in 2018 over similar concerns about anti-Israel bias.",
    "citationUrl": "https://en.wikipedia.org/wiki/UNESCO",
    "citationTitle": "Wikipedia: UNESCO"
  },
  {
    "id": "af1ce5f2-ad6c-494a-8ad8-1be8b8135042",
    "text": "What was the name of NATO's nuclear sharing arrangement during the Cold War that allowed non-nuclear members to participate in nuclear planning?",
    "options": [
      "Nuclear Planning Group",
      "Atlantic Nuclear Force",
      "Multilateral Force",
      "Nuclear Consultation Committee"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Nuclear Planning Group (NPG) was established in 1966 to involve non-nuclear NATO members in nuclear planning and consultation.",
    "detailedExplanation": "The Nuclear Planning Group (NPG) was established by NATO in 1966 as a forum for consultation among allies on nuclear matters. It was created to address concerns from non-nuclear NATO members who wanted greater involvement in nuclear planning and decision-making processes. The NPG allowed these countries to participate in discussions about NATO's nuclear strategy and policies, even though they did not possess nuclear weapons themselves. This body still exists today and includes all NATO members except France, which maintains its independent nuclear doctrine.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nuclear_Planning_Group",
    "citationTitle": "Wikipedia: Nuclear Planning Group"
  },
  {
    "id": "88610c38-999b-428a-8ef4-48642bf3c405",
    "text": "Which UN peacekeeping mission has been active the longest, having been established in 1964 and still operating today?",
    "options": [
      "UNFICYP (United Nations Peacekeeping Force in Cyprus)",
      "UNIFIL (United Nations Interim Force in Lebanon)",
      "UNDOF (United Nations Disengagement Observer Force)",
      "MINURSO (United Nations Mission for the Referendum in Western Sahara)"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "UNFICYP was established in 1964 following intercommunal violence in Cyprus and continues to operate today.",
    "detailedExplanation": "The United Nations Peacekeeping Force in Cyprus (UNFICYP) was established on March 4, 1964, in response to intercommunal fighting between Greek and Turkish Cypriots. Following the Turkish military intervention in 1974, UNFICYP's mandate was expanded to include monitoring the ceasefire lines and maintaining a buffer zone between the two sides. At nearly 60 years of operation, it holds the record as the longest-running UN peacekeeping mission still active today, highlighting the protracted nature of the Cyprus conflict.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Peacekeeping_Force_in_Cyprus",
    "citationTitle": "Wikipedia: United Nations Peacekeeping Force in Cyprus"
  },
  {
    "id": "29760ded-ebb3-4970-b1f5-7a79966639a9",
    "text": "Which founding member of NATO withdrew from the integrated command structure in 1966 but remained in the alliance?",
    "options": [
      "Italy",
      "France",
      "Norway",
      "Denmark"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "France withdrew from NATO's integrated command structure in 1966 under Charles de Gaulle but remained a member of the alliance.",
    "detailedExplanation": "In 1966, French President Charles de Gaulle announced France's withdrawal from NATO's integrated command structure, citing concerns over American dominance and France's desire for strategic independence. This decision forced NATO headquarters to relocate from Paris to Brussels. However, France remained a member of the North Atlantic Alliance and continued to participate in political consultations. France only fully rejoined NATO's integrated command structure in 2009 under President Nicolas Sarkozy, ending over four decades of partial participation.",
    "citationUrl": "https://en.wikipedia.org/wiki/France_and_NATO",
    "citationTitle": "Wikipedia: France and NATO"
  },
  {
    "id": "1ce7601b-91a5-4b5a-a040-a6a7b3393260",
    "text": "What is the minimum percentage of UN member states required to convene an Emergency Special Session of the General Assembly under the 'Uniting for Peace' resolution?",
    "options": [
      "Simple majority (50% + 1)",
      "Two-thirds majority (66.7%)",
      "Three-quarters majority (75%)",
      "Seven members of the Security Council"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The 'Uniting for Peace' resolution requires a simple majority of UN member states to convene an Emergency Special Session.",
    "detailedExplanation": "The 'Uniting for Peace' resolution, adopted by the UN General Assembly in 1950, allows the General Assembly to take action when the Security Council fails to maintain international peace due to lack of unanimity among permanent members. An Emergency Special Session can be called by a simple majority of UN member states (currently 98 out of 193 members) or by nine members of the Security Council. This mechanism has been used in various crises, including the Suez Crisis (1956), the Soviet intervention in Hungary (1956), and more recently regarding the situation in Ukraine (2022).",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_General_Assembly_Resolution_377",
    "citationTitle": "Wikipedia: United Nations General Assembly Resolution 377"
  },
  {
    "id": "9b0c5e29-8c6f-4655-a82f-ef1edd3a7e2d",
    "text": "Which NATO member country has the unique distinction of not having its own standing army?",
    "options": [
      "Luxembourg",
      "Iceland",
      "Montenegro",
      "Estonia"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Iceland has no standing army and relies on its NATO allies and coast guard for defense.",
    "detailedExplanation": "Iceland is unique among NATO members in that it maintains no standing army, navy, or air force. The country abolished its military in 1869 and has relied on diplomatic solutions and its strategic location for security. Iceland's defense is primarily handled by the Icelandic Coast Guard and through NATO collective defense agreements. During the Cold War, the United States maintained a significant military presence at the Keflavík Air Base, though this was scaled back after 2006. Iceland's membership in NATO since 1949 provides it with security guarantees despite its lack of conventional military forces.",
    "citationUrl": "https://en.wikipedia.org/wiki/Military_of_Iceland",
    "citationTitle": "Wikipedia: Military of Iceland"
  },
  {
    "id": "6688f17c-7735-41b1-9574-a8e487aed1e1",
    "text": "Which UN body has the power to elect judges to the International Court of Justice alongside the Security Council?",
    "options": [
      "Economic and Social Council",
      "Trusteeship Council",
      "General Assembly",
      "Secretariat"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The UN General Assembly and Security Council jointly elect judges to the International Court of Justice.",
    "detailedExplanation": "The International Court of Justice (ICJ) consists of 15 judges who serve nine-year terms. These judges are elected through a unique process involving both the UN General Assembly and the Security Council voting simultaneously but independently. To be elected, a candidate must receive an absolute majority in both bodies. If no candidate achieves this in the first round, multiple rounds of voting may occur. This dual-chamber election process ensures that ICJ judges have broad international support and helps maintain the court's legitimacy and independence in resolving disputes between states.",
    "citationUrl": "https://en.wikipedia.org/wiki/International_Court_of_Justice",
    "citationTitle": "Wikipedia: International Court of Justice"
  },
  {
    "id": "548bb1e3-ac5a-4538-afc5-fd078eaa988d",
    "text": "NATO's Strategic Concept is typically updated every how many years?",
    "options": [
      "Every 5 years",
      "Every 8-12 years",
      "Every 15 years",
      "Every 20 years"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "NATO's Strategic Concept is updated approximately every 8-12 years to reflect changing security environments.",
    "detailedExplanation": "NATO's Strategic Concept serves as the alliance's fundamental policy document, outlining its purpose, nature, and security challenges. Historically, these concepts have been updated roughly every 8-12 years to reflect evolving strategic environments: 1991 (post-Cold War), 1999 (Kosovo era), 2010 (Afghanistan/terrorism focus), and 2022 (return to great power competition and Russian aggression). The timing depends on significant geopolitical shifts rather than a fixed schedule. The 2022 Strategic Concept, adopted at the Madrid Summit, marked a return to collective defense as the primary mission while addressing new challenges like cyber threats, climate change, and China's rise.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO_Strategic_Concept",
    "citationTitle": "Wikipedia: NATO Strategic Concept"
  },
  {
    "id": "b6e0240d-2ced-46e3-aa43-0105a3785f21",
    "text": "Which UN specialized agency became the first to admit Palestine as a full member state in 2011?",
    "options": [
      "World Health Organization (WHO)",
      "International Labour Organization (ILO)",
      "United Nations Educational, Scientific and Cultural Organization (UNESCO)",
      "World Intellectual Property Organization (WIPO)"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "UNESCO admitted Palestine as its 195th member state in October 2011, becoming the first UN agency to do so.",
    "detailedExplanation": "In October 2011, UNESCO voted 107-14 with 52 abstentions to admit Palestine as its 195th member state, making it the first UN specialized agency to grant full membership to Palestine. This decision was highly controversial and led to significant financial consequences for UNESCO, as the United States and Israel suspended their funding contributions, which represented about 22% of UNESCO's budget. The U.S. cited domestic laws prohibiting funding to UN agencies that grant full membership to Palestine before a comprehensive peace agreement. Palestine's UNESCO membership allowed it to seek World Heritage status for sites in Palestinian territories.",
    "citationUrl": "https://en.wikipedia.org/wiki/Palestine_and_the_United_Nations",
    "citationTitle": "Wikipedia: Palestine and the United Nations"
  },
  {
    "id": "5705a469-9358-4e80-bb09-8007ccdafe7a",
    "text": "What is the total number of NATO's original founding members when the North Atlantic Treaty was signed in 1949?",
    "options": [
      "10 countries",
      "12 countries",
      "14 countries",
      "16 countries"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "NATO was founded by 12 countries when the North Atlantic Treaty was signed on April 4, 1949.",
    "detailedExplanation": "NATO was established with 12 founding members when the North Atlantic Treaty was signed in Washington, D.C. on April 4, 1949. These original members were: the United States, Canada, United Kingdom, France, Italy, Portugal, Norway, Denmark, Iceland, Belgium, the Netherlands, and Luxembourg. The alliance was created as a collective defense organization in response to growing tensions with the Soviet Union during the early Cold War period. The organization has since expanded through multiple rounds of enlargement, growing from the original 12 members to 30 members as of 2020, with the most recent additions being Montenegro (2017) and North Macedonia (2020).",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO",
    "citationTitle": "Wikipedia: NATO"
  },
  {
    "id": "ca7b8171-af89-47e0-b01c-96234d487356",
    "text": "Which UN Secretary-General was awarded the Nobel Peace Prize posthumously in 2001, sharing it with the United Nations itself?",
    "options": [
      "Kofi Annan",
      "Dag Hammarskjöld",
      "U Thant",
      "Boutros Boutros-Ghali"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Dag Hammarskjöld was awarded the Nobel Peace Prize posthumously in 2001, sharing it with the UN.",
    "detailedExplanation": "Dag Hammarskjöld, who served as UN Secretary-General from 1953 until his death in 1961, was posthumously awarded the Nobel Peace Prize in 2001, which he shared with the United Nations organization itself. The Nobel Committee recognized his dedication to the ideals of the UN and his efforts to develop the organization into an effective instrument for peace. He remains the only person to have received the Nobel Peace Prize posthumously, and his philosophical writings and leadership style continue to influence international diplomacy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dag_Hammarskj%C3%B6ld",
    "citationTitle": "Wikipedia: Dag Hammarskjöld"
  },
  {
    "id": "972c9ae7-5fbd-463d-9c09-c9f7bab9e627",
    "text": "Which NATO country triggered the alliance's first Article 4 consultation in 2003, requesting discussions about a potential threat to its security?",
    "options": [
      "Turkey",
      "Poland",
      "Estonia",
      "Norway"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Turkey was the first NATO member to invoke Article 4 consultations in 2003 regarding the Iraq War.",
    "detailedExplanation": "Turkey became the first NATO member to formally invoke Article 4 of the North Atlantic Treaty in February 2003, requesting consultations about potential threats to its security from the impending Iraq War. Article 4 allows any NATO member to request consultations when they feel their territorial integrity, political independence, or security is threatened. Turkey was concerned about potential spillover effects from the Iraq conflict, including refugee flows and security threats along its border. This was a historic moment as it was the first time Article 4 had been formally invoked since NATO's founding.",
    "citationUrl": "https://en.wikipedia.org/wiki/Article_4_of_the_North_Atlantic_Treaty",
    "citationTitle": "Wikipedia: Article 4 of the North Atlantic Treaty"
  },
  {
    "id": "5b8d22e1-a34e-4762-9f38-810aa5aa73b1",
    "text": "The UN Trusteeship Council suspended operations in 1994 after which territory achieved independence, completing the decolonization process?",
    "options": [
      "East Timor",
      "Palau",
      "Namibia",
      "Western Sahara"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Palau was the last UN Trust Territory to gain independence in 1994, leading to the suspension of the Trusteeship Council.",
    "detailedExplanation": "The UN Trusteeship Council suspended its operations in November 1994 when Palau, the last remaining UN Trust Territory, gained its independence. Palau had been administered by the United States under the UN Trusteeship System since 1947. The Trusteeship Council was one of the six main organs of the UN, established to oversee the administration of trust territories and guide them toward self-government or independence. With Palau's independence, the Council had fulfilled its historic mission of decolonization, though it technically still exists and could be reconvened if needed.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Trusteeship_Council",
    "citationTitle": "Wikipedia: United Nations Trusteeship Council"
  },
  {
    "id": "cb845f05-51c2-441c-b0e1-f6a29f6a310c",
    "text": "What is the name of NATO's collective defense planning process that involves scenarios for defending member territories against potential threats?",
    "options": [
      "Defense Planning Process",
      "Strategic Defense Review",
      "Graduated Response Planning",
      "Regional Defense Plans"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Defense Planning Process (DPP) is NATO's systematic approach to collective defense planning.",
    "detailedExplanation": "NATO's Defense Planning Process (DPP) is a systematic, capability-based approach to defense planning that ensures the alliance can effectively carry out its missions. The DPP involves detailed assessments of potential threats, development of military requirements, and identification of capability shortfalls among member nations. It operates on a four-year cycle and includes the development of Regional Defense Plans that outline how NATO would defend specific geographic areas. This process is crucial for maintaining NATO's credible deterrence and defense posture, ensuring that all members contribute appropriately to collective security.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO_Defense_Planning_Process",
    "citationTitle": "Wikipedia: NATO Defense Planning Process"
  }
]