[
  {
    "id": "b7e0bad6-d7ce-413b-9852-2ec796eb580a",
    "text": "Which country has used its UN Security Council veto power the most times in history?",
    "options": [
      "United States",
      "Russia/Soviet Union",
      "China",
      "United Kingdom"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Russia (including the Soviet Union) has used its veto power over 120 times, more than any other permanent member.",
    "detailedExplanation": "Since the UN Security Council was established in 1945, Russia and its predecessor the Soviet Union have used their veto power more frequently than any other permanent member. This includes vetoes during the Cold War period when the Soviet Union regularly blocked Western-backed resolutions, and continues with modern Russia's use of vetoes on issues like Syria, Ukraine, and other geopolitical matters.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Security_Council_veto_power",
    "citationTitle": "Wikipedia: United Nations Security Council veto power"
  },
  {
    "id": "42b22d93-03d0-4d02-a777-bd4c1998676f",
    "text": "NATO's Article 5, which states that an attack on one member is an attack on all, has been invoked how many times in the alliance's history?",
    "options": [
      "Never",
      "Once",
      "Twice",
      "Three times"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Article 5 has been invoked only once, following the September 11, 2001 terrorist attacks on the United States.",
    "detailedExplanation": "Despite NATO being formed in 1949 and experiencing decades of Cold War tensions, Article 5 was never invoked during that period. The first and only invocation came after the 9/11 attacks on the World Trade Center and Pentagon. This led to NATO's involvement in Afghanistan through the International Security Assistance Force (ISAF), marking a historic moment when the alliance's collective defense principle was put into action.",
    "citationUrl": "https://en.wikipedia.org/wiki/North_Atlantic_Treaty#Article_5",
    "citationTitle": "Wikipedia: North Atlantic Treaty Article 5"
  },
  {
    "id": "c757f6df-71de-4313-866a-6d8adddf7981",
    "text": "Which UN agency won the Nobel Peace Prize in 2020 for its efforts to combat hunger?",
    "options": [
      "UNICEF",
      "World Food Programme",
      "UNHCR",
      "World Health Organization"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The World Food Programme (WFP) won the 2020 Nobel Peace Prize for its efforts against hunger and contribution to peace in conflict-affected areas.",
    "detailedExplanation": "The World Food Programme was awarded the Nobel Peace Prize in 2020 for its efforts to combat hunger, its contribution to bettering conditions for peace in conflict-affected areas, and for acting as a driving force in efforts to prevent the use of hunger as a weapon of war and conflict. The Nobel Committee recognized WFP's work in providing food assistance to millions of people worldwide, particularly in areas affected by conflict and natural disasters.",
    "citationUrl": "https://en.wikipedia.org/wiki/World_Food_Programme",
    "citationTitle": "Wikipedia: World Food Programme"
  },
  {
    "id": "0e1f01cb-055c-4e55-b55b-54a814b2dad5",
    "text": "The UN Trusteeship Council, one of the six main organs of the UN, suspended operations in which year?",
    "options": [
      "1975",
      "1989",
      "1994",
      "2001"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Trusteeship Council suspended operations in 1994 when Palau, the last remaining trust territory, gained independence.",
    "detailedExplanation": "The UN Trusteeship Council was established to oversee the administration of trust territories and help them achieve self-governance or independence. As trust territories achieved independence throughout the decades, the Council's workload diminished. When Palau became independent in 1994, it was the last remaining trust territory, leading to the suspension of the Trusteeship Council's operations. The Council still exists formally but meets only when necessary.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Trusteeship_Council",
    "citationTitle": "Wikipedia: United Nations Trusteeship Council"
  },
  {
    "id": "f010c00d-c9bd-4bc2-94e2-2e0f0b541d47",
    "text": "NATO's headquarters moved from Paris to Brussels in which year?",
    "options": [
      "1966",
      "1967",
      "1969",
      "1973"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "NATO headquarters relocated from Paris to Brussels in 1967 after France withdrew from NATO's integrated command structure.",
    "detailedExplanation": "In 1966, French President Charles de Gaulle announced France's withdrawal from NATO's integrated command structure and requested that NATO forces leave French territory. This forced NATO to relocate its headquarters from Paris to Brussels, Belgium, which was completed in 1967. The move also involved relocating SHAPE (Supreme Headquarters Allied Powers Europe) from France to Belgium. France remained a member of the alliance but operated independently of NATO's military command until rejoining the integrated structure in 2009.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO_headquarters",
    "citationTitle": "Wikipedia: NATO headquarters"
  },
  {
    "id": "1b593c95-05fc-4810-9e91-9457870f3cff",
    "text": "Which UN specialized agency is responsible for setting international civil aviation standards?",
    "options": [
      "International Maritime Organization",
      "International Civil Aviation Organization",
      "International Telecommunication Union",
      "Universal Postal Union"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The International Civil Aviation Organization (ICAO) sets standards and regulations for international civil aviation safety, security, and sustainability.",
    "detailedExplanation": "The International Civil Aviation Organization (ICAO), headquartered in Montreal, Canada, is a UN specialized agency established in 1944 through the Chicago Convention. ICAO sets international standards and recommended practices for aviation safety, security, efficiency, and environmental protection. It coordinates international air navigation, establishes technical standards for aircraft, and works to ensure the safe and orderly growth of international civil aviation worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/International_Civil_Aviation_Organization",
    "citationTitle": "Wikipedia: International Civil Aviation Organization"
  },
  {
    "id": "4fa09905-82c3-4958-850a-a756d6387d5b",
    "text": "Which country was expelled from NATO in 1974 but later rejoined?",
    "options": [
      "Turkey was suspended but never expelled",
      "Greece withdrew temporarily",
      "Portugal was suspended briefly",
      "No country has ever been expelled from NATO"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "No country has ever been formally expelled from NATO, though some have withdrawn or been suspended from certain activities.",
    "detailedExplanation": "While NATO has faced various crises with member states, no country has ever been formally expelled from the alliance. Greece temporarily withdrew from NATO's integrated military structure in 1974 following the Cyprus crisis and tensions with Turkey, but remained a political member and returned to full participation in 1980. France withdrew from integrated command in 1966 but remained a member. The NATO treaty includes provisions for withdrawal but not for expulsion, making consensus and diplomatic solutions the preferred approach to resolving conflicts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Member_states_of_NATO",
    "citationTitle": "Wikipedia: Member states of NATO"
  },
  {
    "id": "4ef73ee2-463f-415c-89fc-65a57c68b038",
    "text": "How many permanent members sit on the UN Security Council?",
    "options": [
      "3",
      "5",
      "7",
      "10"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The UN Security Council has 5 permanent members: USA, Russia, China, France, and UK.",
    "detailedExplanation": "The United Nations Security Council consists of 15 members total, with 5 permanent members (P5) and 10 non-permanent members elected for two-year terms. The permanent members are the United States, Russia, China, France, and the United Kingdom. These five nations were the major Allied powers at the end of World War II and were granted permanent status with veto power when the UN was established in 1945.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Security_Council",
    "citationTitle": "Wikipedia: United Nations Security Council"
  },
  {
    "id": "1c4a44f4-43a3-4e8d-b6ae-405d17b5b7c8",
    "text": "Which NATO operation began in 2001 and became the alliance's longest-running mission?",
    "options": [
      "Operation Allied Force",
      "International Security Assistance Force (ISAF)",
      "Operation Ocean Shield",
      "Operation Active Endeavour"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "NATO's International Security Assistance Force (ISAF) in Afghanistan ran from 2001 to 2014.",
    "detailedExplanation": "The International Security Assistance Force (ISAF) was a NATO-led multinational military mission in Afghanistan that began in 2001 following the September 11 attacks. It was established under UN Security Council Resolution 1386 and became NATO's longest-running operation, lasting until December 2014 when it transitioned to the Resolute Support Mission. ISAF's mandate was to assist the Afghan government in maintaining security and supporting reconstruction efforts.",
    "citationUrl": "https://en.wikipedia.org/wiki/International_Security_Assistance_Force",
    "citationTitle": "Wikipedia: International Security Assistance Force"
  },
  {
    "id": "0816fa79-efc3-44cc-af60-a439c1b5c34d",
    "text": "Which city serves as the headquarters of the International Court of Justice?",
    "options": [
      "Geneva",
      "New York",
      "The Hague",
      "Vienna"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The International Court of Justice is located in The Hague, Netherlands.",
    "detailedExplanation": "The International Court of Justice (ICJ), also known as the World Court, has its seat at the Peace Palace in The Hague, Netherlands. Established in 1945 as the principal judicial organ of the United Nations, the ICJ settles legal disputes between states and provides advisory opinions on legal questions referred by UN organs and specialized agencies. The Hague was chosen as the location due to its historical association with international law and peace conferences.",
    "citationUrl": "https://en.wikipedia.org/wiki/International_Court_of_Justice",
    "citationTitle": "Wikipedia: International Court of Justice"
  },
  {
    "id": "a5c234f5-ac17-4b03-a822-168dcf8a0fb9",
    "text": "What does the acronym 'UNICEF' stand for?",
    "options": [
      "United Nations International Children's Emergency Fund",
      "Universal Network for International Child Education and Food",
      "United Nations International Committee for Education and Food",
      "Universal Initiative for Children's Education Fund"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "UNICEF originally stood for United Nations International Children's Emergency Fund.",
    "detailedExplanation": "UNICEF was originally established in 1946 as the United Nations International Children's Emergency Fund to provide emergency food and healthcare to children in countries devastated by World War II. In 1953, it became a permanent part of the UN system, and while it officially changed its name to United Nations Children's Fund in 1953, it retained the popular acronym UNICEF. The organization focuses on humanitarian aid and developmental assistance for children worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/UNICEF",
    "citationTitle": "Wikipedia: UNICEF"
  },
  {
    "id": "2c5ddeee-2447-4295-9857-fbb8b069ee2c",
    "text": "Which country joined NATO most recently as of 2024?",
    "options": [
      "Montenegro",
      "North Macedonia",
      "Finland",
      "Sweden"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Finland joined NATO in April 2023, making it the most recent member.",
    "detailedExplanation": "Finland became NATO's 31st member in April 2023, marking a historic shift in Nordic security policy. This decision was largely influenced by Russia's invasion of Ukraine in February 2022, which dramatically changed Finland's security environment. Finland had maintained a policy of military non-alignment throughout the Cold War, but the changed geopolitical situation led to overwhelming public and political support for NATO membership. Sweden has also applied for membership but faced delays due to objections from Turkey and Hungary.",
    "citationUrl": "https://en.wikipedia.org/wiki/Finland%E2%80%93NATO_relations",
    "citationTitle": "Wikipedia: Finland–NATO relations"
  },
  {
    "id": "53845a00-7664-49d0-b16c-54fc7f4e4515",
    "text": "Which UN body elects the Secretary-General?",
    "options": [
      "General Assembly",
      "Security Council",
      "Economic and Social Council",
      "Both General Assembly and Security Council"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Secretary-General is appointed by the General Assembly upon recommendation of the Security Council.",
    "detailedExplanation": "The UN Secretary-General is selected through a two-stage process involving both the Security Council and the General Assembly. First, the Security Council recommends a candidate, which requires the support of at least 9 of the 15 Security Council members and no vetoes from the five permanent members. The General Assembly then formally appoints the recommended candidate. This process ensures that the Secretary-General has broad international support while giving the permanent members of the Security Council significant influence over the selection.",
    "citationUrl": "https://en.wikipedia.org/wiki/Secretary-General_of_the_United_Nations",
    "citationTitle": "Wikipedia: Secretary-General of the United Nations"
  },
  {
    "id": "6e3d8fef-8341-4ef1-b021-ab5592f3bae2",
    "text": "What is the minimum percentage of GDP that NATO members are expected to spend on defense?",
    "options": [
      "1%",
      "2%",
      "2.5%",
      "3%"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "NATO members committed to spending at least 2% of GDP on defense by 2024.",
    "detailedExplanation": "At the 2014 NATO Summit in Wales, alliance members agreed to the 2% defense spending guideline, committing to spend at least 2% of their Gross Domestic Product on defense by 2024. This target was reaffirmed at subsequent summits and has become a significant political issue, particularly emphasized by the United States. The guideline also includes spending at least 20% of defense budgets on major equipment and research and development. As of recent assessments, only about a third of NATO members meet this target.",
    "citationUrl": "https://en.wikipedia.org/wiki/NATO#Expenditures",
    "citationTitle": "Wikipedia: NATO"
  },
  {
    "id": "8ae9660f-0162-4397-8bc5-2d4471a0f8bd",
    "text": "Which UN specialized agency is responsible for global postal services?",
    "options": [
      "International Telecommunication Union (ITU)",
      "Universal Postal Union (UPU)",
      "World Intellectual Property Organization (WIPO)",
      "International Labour Organization (ILO)"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Universal Postal Union (UPU) coordinates international postal policies and services.",
    "detailedExplanation": "The Universal Postal Union (UPU), established in 1874 and headquartered in Bern, Switzerland, is the UN specialized agency responsible for coordinating postal policies among member nations and ensuring the smooth operation of international mail services. The UPU sets the rules for international mail exchanges and makes recommendations to improve postal services worldwide. It is one of the oldest international organizations and became a UN specialized agency in 1948, playing a crucial role in facilitating global communications through postal services.",
    "citationUrl": "https://en.wikipedia.org/wiki/Universal_Postal_Union",
    "citationTitle": "Wikipedia: Universal Postal Union"
  },
  {
    "id": "2d0bc912-3f5b-431f-bd97-db1a43a78b46",
    "text": "Which language was added as an official language of the UN General Assembly most recently?",
    "options": [
      "Portuguese",
      "Arabic",
      "German",
      "Japanese"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Arabic was added as an official UN language in 1973.",
    "detailedExplanation": "The United Nations originally had five official languages: English, French, Russian, Chinese, and Spanish. Arabic was added as the sixth official language of the UN General Assembly in 1973, making it the most recent addition to the organization's official languages. This addition recognized the growing importance of Arab nations in international affairs and ensured better representation for Arabic-speaking countries in UN proceedings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Official_languages_of_the_United_Nations",
    "citationTitle": "Wikipedia: Official languages of the United Nations"
  },
  {
    "id": "d6e11eb1-f281-41e5-bb39-6720f1f56c16",
    "text": "What is the name of NATO's collective defense exercise that takes place every few years and is considered one of the largest military exercises in Europe?",
    "options": [
      "Trident Juncture",
      "Defender Europe",
      "Cold Response",
      "Steadfast Defender"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Trident Juncture is NATO's flagship collective defense exercise.",
    "detailedExplanation": "Trident Juncture is NATO's largest and most ambitious collective defense exercise, designed to test the alliance's ability to plan and conduct a major collective defense operation. The exercise involves tens of thousands of troops from NATO member countries and partner nations, testing interoperability and readiness across land, sea, air, and cyber domains. These exercises are crucial for maintaining NATO's deterrent capability and ensuring member forces can work together effectively.",
    "citationUrl": "https://en.wikipedia.org/wiki/Trident_Juncture",
    "citationTitle": "Wikipedia: Trident Juncture"
  },
  {
    "id": "d355878d-cef8-4362-847c-c1e32ab8e16f",
    "text": "Which UN peacekeeping mission has been in operation the longest, starting in 1948?",
    "options": [
      "UNFICYP in Cyprus",
      "UNTSO in the Middle East",
      "UNDOF in the Golan Heights",
      "UNIFIL in Lebanon"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "UNTSO (United Nations Truce Supervision Organization) began operations in 1948.",
    "detailedExplanation": "The United Nations Truce Supervision Organization (UNTSO) was established in 1948 to monitor the ceasefire between Israel and its Arab neighbors following the 1948 Arab-Israeli War. It is the oldest UN peacekeeping operation still in existence and has adapted its mandate several times over the decades. UNTSO military observers have been deployed throughout the Middle East and continue to play a vital role in maintaining stability in the region, working alongside other UN missions.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Truce_Supervision_Organization",
    "citationTitle": "Wikipedia: United Nations Truce Supervision Organization"
  },
  {
    "id": "20a387eb-f2e1-4c25-a29b-17a3ad7a3ff6",
    "text": "Which former Warsaw Pact country was the first to join NATO after the end of the Cold War?",
    "options": [
      "Poland",
      "Czech Republic",
      "Hungary",
      "All three joined simultaneously"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Poland, Czech Republic, and Hungary all joined NATO together on March 12, 1999.",
    "detailedExplanation": "The first expansion of NATO after the Cold War occurred on March 12, 1999, when three former Warsaw Pact members - Poland, the Czech Republic, and Hungary - joined simultaneously. This marked a historic shift in European security architecture and was part of NATO's policy of opening its doors to former communist countries that met democratic and military standards. Their accession was highly symbolic, representing the end of Europe's division and these countries' integration into Western security structures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Enlargement_of_NATO",
    "citationTitle": "Wikipedia: Enlargement of NATO"
  },
  {
    "id": "47a727ea-85f1-47f8-8b56-ab08394a3d9e",
    "text": "Which UN specialized agency is headquartered in Geneva and focuses on labor rights and working conditions worldwide?",
    "options": [
      "WHO (World Health Organization)",
      "ILO (International Labour Organization)",
      "UNHCR (UN High Commissioner for Refugees)",
      "WTO (World Trade Organization)"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The International Labour Organization (ILO) is based in Geneva and deals with labor issues.",
    "detailedExplanation": "The International Labour Organization (ILO) was established in 1919 and became a UN specialized agency in 1946. Headquartered in Geneva, Switzerland, the ILO is unique among UN agencies for its tripartite structure, bringing together governments, employers, and workers to set labor standards and develop policies promoting decent work for all. The organization focuses on issues such as freedom of association, elimination of forced labor, abolition of child labor, and elimination of workplace discrimination.",
    "citationUrl": "https://en.wikipedia.org/wiki/International_Labour_Organization",
    "citationTitle": "Wikipedia: International Labour Organization"
  }
]