[
  {
    "id": "8ef5d23a-a3d5-4f0c-8748-95a1c0ff15c6",
    "text": "Which city-state is considered the birthplace of democracy?",
    "options": [
      "Athens",
      "Sparta",
      "Corinth",
      "Thebes"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Athens developed the world's first known democracy around 508 BCE under Cleisthenes.",
    "detailedExplanation": "Athens is widely recognized as the birthplace of democracy, establishing the first known democratic system around 508 BCE under the leadership of Cleisthenes. This revolutionary system allowed citizens to participate directly in political decision-making through assemblies and voting, laying the foundation for modern democratic principles that continue to influence governments worldwide today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Athenian_democracy",
    "citationTitle": "Wikipedia: Athenian Democracy"
  },
  {
    "id": "754d7eb6-8d70-486b-963a-d403024f82df",
    "text": "What was the name of the famous temple dedicated to Athena on the Athenian Acropolis?",
    "options": [
      "Pantheon",
      "Parthenon",
      "Erechtheion",
      "Temple of Zeus"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Parthenon was built between 447-432 BCE as a temple to honor Athena, the patron goddess of Athens.",
    "detailedExplanation": "The Parthenon is the most famous temple on the Athenian Acropolis, constructed between 447-432 BCE during the height of the Athenian Empire under Pericles. Dedicated to Athena Parthenos (Athena the Virgin), the patron goddess of Athens, it represents the pinnacle of classical Greek architecture and remains one of the most recognizable symbols of ancient Greek civilization and Western culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parthenon",
    "citationTitle": "Wikipedia: Parthenon"
  },
  {
    "id": "88a27f6a-d25d-4f56-9310-b5fb7b2972ca",
    "text": "Who was the famous philosopher who taught Alexander the Great?",
    "options": [
      "Socrates",
      "Plato",
      "Aristotle",
      "Pythagoras"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Aristotle tutored young Alexander the Great from 343-340 BCE when Alexander was a teenager.",
    "detailedExplanation": "Aristotle, one of history's greatest philosophers and scientists, served as tutor to Alexander the Great from 343-340 BCE. King Philip II of Macedon hired Aristotle to educate his son when Alexander was just 13 years old. This relationship between the brilliant philosopher and the future conqueror had profound implications for both Greek culture and the wider world, as Alexander would later spread Greek ideas throughout his vast empire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aristotle",
    "citationTitle": "Wikipedia: Aristotle"
  },
  {
    "id": "dee48fbb-88d6-4dd6-9a8e-f334e48ebda8",
    "text": "What were the ancient Olympic Games originally held to honor?",
    "options": [
      "Athena",
      "Apollo",
      "Zeus",
      "Poseidon"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Olympic Games were held every four years at Olympia to honor Zeus, king of the Greek gods.",
    "detailedExplanation": "The ancient Olympic Games, first recorded in 776 BCE, were held every four years at Olympia in western Greece as a religious festival honoring Zeus, the king of the Greek gods. These games continued for nearly 12 centuries until Emperor Theodosius I banned them in 393 or 394 CE as part of the campaign to impose Christian orthodoxy. The modern Olympic Games, revived in 1896, draw their inspiration from this ancient Greek tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ancient_Olympic_Games",
    "citationTitle": "Wikipedia: Ancient Olympic Games"
  },
  {
    "id": "56f9a5e4-0629-4fe6-8b06-b7ebe764fa8d",
    "text": "What was the primary focus of Spartan society?",
    "options": [
      "Philosophy and arts",
      "Military training and warfare",
      "Trade and commerce",
      "Architecture and building"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Sparta was a militaristic society where citizens, especially men, were trained from childhood to be warriors.",
    "detailedExplanation": "Spartan society was fundamentally organized around military excellence and warfare. From age seven, Spartan boys were taken from their families and placed in the agoge, a rigorous military training program that lasted until age 30. This militaristic focus made Sparta one of the most formidable military powers in ancient Greece, though it came at the cost of cultural and intellectual development that flourished in other Greek city-states like Athens.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sparta",
    "citationTitle": "Wikipedia: Sparta"
  },
  {
    "id": "4e424a85-b82e-4f6d-8192-fc880e899f8e",
    "text": "Which epic poem tells the story of Odysseus's journey home after the Trojan War?",
    "options": [
      "The Iliad",
      "The Odyssey",
      "The Aeneid",
      "The Metamorphoses"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Odyssey, attributed to Homer, follows Odysseus's ten-year journey home to Ithaca after the fall of Troy.",
    "detailedExplanation": "The Odyssey is one of two major ancient Greek epic poems attributed to Homer (the other being the Iliad). It tells the story of Odysseus, king of Ithaca, and his arduous ten-year journey home after the Trojan War. Filled with mythical creatures, divine interventions, and tests of courage and wisdom, the Odyssey has become one of the most influential works in Western literature, giving us terms like 'odyssey' for any long, eventful journey.",
    "citationUrl": "https://en.wikipedia.org/wiki/Odyssey",
    "citationTitle": "Wikipedia: Odyssey"
  },
  {
    "id": "e756d354-6ccb-415f-8351-36870cdb822b",
    "text": "What was the name of the marketplace and gathering place in ancient Greek cities?",
    "options": [
      "Forum",
      "Acropolis",
      "Agora",
      "Gymnasium"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The agora served as the central marketplace and civic center where Greeks conducted business and political activities.",
    "detailedExplanation": "The agora was the heart of ancient Greek city-states, serving as both a marketplace and a center for civic life. More than just a place for commerce, the agora was where citizens gathered to discuss politics, philosophy, and current events. Famous philosophers like Socrates often taught in the agora, making it a crucial space for the development of Greek democracy, philosophy, and culture. The Athenian Agora is the most famous example, with its ruins still visible today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Agora",
    "citationTitle": "Wikipedia: Agora"
  },
  {
    "id": "4580e18e-ec62-48ed-b4c5-df1aab583e51",
    "text": "Which Persian king led the massive invasion of Greece that was defeated at the Battle of Salamis?",
    "options": [
      "Cyrus the Great",
      "Darius I",
      "Xerxes I",
      "Artaxerxes I"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Xerxes I led the second Persian invasion of Greece in 480 BCE, suffering a decisive naval defeat at Salamis.",
    "detailedExplanation": "Xerxes I launched the second Persian invasion of Greece in 480 BCE with a massive army and navy, seeking to complete his father Darius I's conquest of Greece. After initially defeating the Greeks at Thermopylae, Xerxes faced a crushing naval defeat at the Battle of Salamis, where the smaller but more maneuverable Greek fleet destroyed much of the Persian navy. This victory marked a turning point in the Greco-Persian Wars and preserved Greek independence and culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Xerxes_I",
    "citationTitle": "Wikipedia: Xerxes I"
  },
  {
    "id": "e9dc18de-f4c5-49cf-ae22-1599fb2cf835",
    "text": "Which ancient Greek city-state was known for its powerful military and warrior culture?",
    "options": [
      "Athens",
      "Sparta",
      "Corinth",
      "Thebes"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Sparta was famous for its disciplined military society and elite warriors.",
    "detailedExplanation": "Sparta was a prominent city-state in ancient Greece that became renowned for its military-focused society. From childhood, Spartan citizens underwent rigorous military training, and the state was organized around warfare and discipline. The Spartan army was considered one of the most formidable fighting forces in the ancient world, and their warriors were feared throughout Greece.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sparta",
    "citationTitle": "Wikipedia: Sparta"
  },
  {
    "id": "7917583c-5634-4e71-990a-868170450d5a",
    "text": "Which god was considered the king of the Greek gods?",
    "options": [
      "Apollo",
      "Poseidon",
      "Hades",
      "Zeus"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Zeus was the ruler of Mount Olympus and king of all the gods.",
    "detailedExplanation": "Zeus was the supreme deity in the Greek pantheon, ruling from Mount Olympus as the king of the gods. He was the god of the sky and thunder, wielding lightning bolts as his weapon. According to Greek mythology, Zeus overthrew his father Cronus to become the ruler of the universe. He was married to Hera and was known for his numerous affairs with both goddesses and mortal women, producing many famous offspring including Hercules, Athena, and Apollo.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zeus",
    "citationTitle": "Wikipedia: Zeus"
  },
  {
    "id": "4a0550a8-d330-4c25-9222-9c6b39c1540e",
    "text": "What were the ancient Greek warships with three rows of oars called?",
    "options": [
      "Galleys",
      "Triremes",
      "Biremes",
      "Quinqueremes"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Triremes were the primary warships of ancient Greece, featuring three levels of rowers.",
    "detailedExplanation": "Triremes were the dominant naval vessels of ancient Greece, particularly during the 5th and 4th centuries BCE. These warships featured three rows of oars on each side, with approximately 170 rowers in total. They were designed for speed and maneuverability, equipped with a bronze ram at the front for ramming enemy ships. The trireme played a crucial role in Greek naval victories, including the famous Battle of Salamis in 480 BCE where the Greek fleet defeated the much larger Persian navy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Trireme",
    "citationTitle": "Wikipedia: Trireme"
  },
  {
    "id": "2a038154-b8fb-4969-b489-ee2232e04473",
    "text": "Which ancient Greek epic poem tells the story of Odysseus's journey home?",
    "options": [
      "The Iliad",
      "The Odyssey",
      "The Aeneid",
      "Metamorphoses"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Odyssey follows Odysseus's ten-year journey home after the Trojan War.",
    "detailedExplanation": "The Odyssey is one of two major ancient Greek epic poems attributed to Homer, composed in the 8th century BCE. It tells the story of Odysseus (Ulysses in Roman mythology), king of Ithaca, and his adventurous ten-year journey home following the end of the Trojan War. The epic is filled with encounters with mythical creatures, gods, and supernatural challenges, including the Cyclops, the Sirens, and the sorceress Circe. The Odyssey remains one of the most important works of ancient literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Odyssey",
    "citationTitle": "Wikipedia: Odyssey"
  },
  {
    "id": "0f551452-34af-4149-b221-b0ce92d24bef",
    "text": "What was the name of the foot race that was part of the original Olympic Games?",
    "options": [
      "Marathon",
      "Stadion",
      "Diaulos",
      "Pentathlon"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The stadion was the original and most prestigious running event in the ancient Olympics.",
    "detailedExplanation": "The stadion was the premier running event of the ancient Olympic Games, first held in 776 BCE. It was a sprint race covering the length of the stadium, approximately 192 meters or 600 ancient Greek feet. The race was run in a straight line from one end of the stadium to the other, and the winner was considered the fastest man in Greece. The stadion was so important that the Olympic Games were often referred to by the name of the stadion winner for that particular year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ancient_Olympic_Games",
    "citationTitle": "Wikipedia: Ancient Olympic Games"
  },
  {
    "id": "4572da81-9776-4880-a79c-2c53dd9ced49",
    "text": "Which ancient Greek building is famous for its perfect proportions and stands on the Acropolis in Athens?",
    "options": [
      "The Pantheon",
      "The Parthenon",
      "The Colosseum",
      "The Temple of Zeus"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Parthenon is the iconic temple dedicated to Athena on the Acropolis.",
    "detailedExplanation": "The Parthenon is perhaps the most famous building from ancient Greece, constructed between 447-432 BCE on the Acropolis of Athens. This temple was dedicated to Athena, the patron goddess of Athens, and represents the pinnacle of classical Greek architecture. Built using the Doric order, the Parthenon is renowned for its mathematical precision and optical illusions that make it appear perfectly straight and proportioned to the human eye. It originally housed a massive gold and ivory statue of Athena created by the sculptor Phidias.",
    "citationUrl": "https://en.wikipedia.org/wiki/Parthenon",
    "citationTitle": "Wikipedia: Parthenon"
  },
  {
    "id": "2401fdea-6782-472e-8d96-33eb4cf04c37",
    "text": "Who was the famous ancient Greek philosopher who taught Alexander the Great?",
    "options": [
      "Socrates",
      "Plato",
      "Aristotle",
      "Pythagoras"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Aristotle was hired by King Philip II of Macedon to tutor his son Alexander.",
    "detailedExplanation": "Aristotle, one of the three great classical philosophers along with Socrates and Plato, served as tutor to Alexander the Great from 343 to 336 BCE. King Philip II of Macedon specifically chose Aristotle to educate his son, and this relationship had profound implications for both philosophy and history. Aristotle's teachings likely influenced Alexander's approach to governing his vast empire, including his relatively tolerant policies toward conquered peoples and his interest in natural sciences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aristotle",
    "citationTitle": "Wikipedia: Aristotle"
  },
  {
    "id": "11a587f0-179a-4f7e-ba8d-883eecd8d7f1",
    "text": "What were the ancient Olympic Games held in honor of?",
    "options": [
      "Apollo",
      "Zeus",
      "Poseidon",
      "Ares"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Olympic Games were held at Olympia as a religious festival honoring Zeus, king of the gods.",
    "detailedExplanation": "The ancient Olympic Games began in 776 BCE in Olympia, a sanctuary site in the western Peloponnese, as part of a religious festival dedicated to Zeus. The games were held every four years and included various athletic competitions such as running, wrestling, boxing, and chariot racing. The event was so important that Greek city-states would declare a sacred truce during the Olympics, allowing athletes and spectators to travel safely to Olympia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ancient_Olympic_Games",
    "citationTitle": "Wikipedia: Ancient Olympic Games"
  },
  {
    "id": "cc7ff2b7-61b7-4643-af59-573ecd188d1f",
    "text": "Which war was fought between Athens and Sparta in the 5th century BCE?",
    "options": [
      "Persian Wars",
      "Peloponnesian War",
      "Trojan War",
      "Punic Wars"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Peloponnesian War was the major conflict between Athens and Sparta from 431-404 BCE.",
    "detailedExplanation": "The Peloponnesian War (431-404 BCE) was a devastating conflict between the Athenian Empire and the Peloponnesian League led by Sparta. The war effectively ended the Golden Age of Greece and resulted in the decline of Athenian power. The conflict was famously documented by the historian Thucydides, and it demonstrated the clash between Athenian naval power and democratic ideals versus Spartan military might and oligarchic traditions. Sparta ultimately emerged victorious.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peloponnesian_War",
    "citationTitle": "Wikipedia: Peloponnesian War"
  },
  {
    "id": "af0d879f-88ae-4885-a274-32116e07466c",
    "text": "What form of government is ancient Athens most famous for developing?",
    "options": [
      "Monarchy",
      "Democracy",
      "Oligarchy",
      "Tyranny"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Athens is credited with developing the world's first democracy around the 6th century BCE.",
    "detailedExplanation": "Ancient Athens is widely regarded as the birthplace of democracy, developing this revolutionary form of government in the 6th century BCE under leaders like Cleisthenes. Athenian democracy allowed citizens (though this excluded women, slaves, and foreigners) to participate directly in political decision-making through assemblies and jury service. While different from modern representative democracy, the Athenian system established fundamental democratic principles like political equality, freedom of speech, and majority rule that continue to influence governments today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Athenian_democracy",
    "citationTitle": "Wikipedia: Athenian democracy"
  },
  {
    "id": "7d34c7fa-3bba-43d9-b8e7-70daf1f9f927",
    "text": "Which ancient Greek city-state was famous for its military strength and warrior culture?",
    "options": [
      "Athens",
      "Sparta",
      "Corinth",
      "Thebes"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Sparta was renowned for its military-focused society and elite warrior training system.",
    "detailedExplanation": "Sparta was one of the most powerful city-states in ancient Greece, famous for its military prowess and unique social system. Spartan boys were taken from their families at age 7 to begin rigorous military training called the agoge. The city-state's entire culture revolved around creating elite warriors, and Spartan soldiers were feared and respected throughout the ancient world for their discipline, courage, and fighting skills.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sparta",
    "citationTitle": "Wikipedia: Sparta"
  },
  {
    "id": "46d21fbf-9393-49f1-a09b-2b0b0ab6a51e",
    "text": "Which ancient Greek city-state was known for its powerful military and strict warrior culture?",
    "options": [
      "Athens",
      "Sparta",
      "Thebes",
      "Corinth"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Sparta was famous for its disciplined military society and warrior training.",
    "detailedExplanation": "Sparta was one of the most prominent city-states in ancient Greece, renowned for its unique social system that prioritized military training and discipline above all else. From age 7, Spartan boys underwent rigorous military education called the agoge, which prepared them to become elite warriors. This militaristic culture made Sparta one of the most feared military powers in ancient Greece, contrasting sharply with Athens' focus on democracy, philosophy, and the arts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sparta",
    "citationTitle": "Wikipedia: Sparta"
  }
]