[
  {
    "id": "0e5077e5-7ef5-400e-a005-b9c9f7c4ab2a",
    "text": "Which author holds the record for winning the most Hugo Awards for Best Novel?",
    "options": [
      "Isaac Asimov",
      "Robert A. Heinlein",
      "Ursula K. Le Guin",
      "Kim Stanley Robinson"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Robert A. Heinlein won the Hugo Award for Best Novel four times.",
    "detailedExplanation": "Robert A. Heinlein holds the record for most Hugo Awards for Best Novel with four wins: 'Double Star' (1956), 'Starship Troopers' (1960), 'Stranger in a Strange Land' (1962), and 'The Moon is a Harsh Mistress' (1967). The Hugo Awards, named after Hugo Gernsback, are presented annually for the best science fiction or fantasy works and achievements of the previous year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hugo_Award_for_Best_Novel",
    "citationTitle": "Wikipedia: Hugo Award for Best Novel"
  },
  {
    "id": "1b221898-3be1-4644-b262-bb008dcef91c",
    "text": "The Orange Prize for Fiction, later renamed the Women's Prize for Fiction, was established in which year?",
    "options": [
      "1992",
      "1996",
      "1988",
      "1994"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Orange Prize for Fiction was established in 1996.",
    "detailedExplanation": "The Orange Prize for Fiction was established in 1996 to celebrate and promote fiction written by women. It was created in response to the 1991 Booker Prize, when none of the six shortlisted authors were women. The prize was later renamed the Women's Prize for Fiction in 2013 after Baileys became the sponsor, and has since had various sponsors while maintaining its mission to recognize outstanding fiction by female authors.",
    "citationUrl": "https://en.wikipedia.org/wiki/Women%27s_Prize_for_Fiction",
    "citationTitle": "Wikipedia: Women's Prize for Fiction"
  },
  {
    "id": "30533c5a-52ff-4c63-a946-669bb4bef832",
    "text": "Which mystery writer has won the most Edgar Awards for Best Novel from the Mystery Writers of America?",
    "options": [
      "Agatha Christie",
      "Ross Macdonald",
      "Tony Hillerman",
      "John le Carré"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ross Macdonald won three Edgar Awards for Best Novel.",
    "detailedExplanation": "Ross Macdonald (Kenneth Millar) won the Edgar Award for Best Novel three times: for 'The Chill' (1964), 'The Far Side of the Dollar' (1965), and 'The Goodbye Look' (1969). The Edgar Awards, named after Edgar Allan Poe, are presented annually by the Mystery Writers of America to honor the best in mystery fiction, non-fiction, television, film, and theater published or produced in the previous year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Edgar_Award",
    "citationTitle": "Wikipedia: Edgar Award"
  },
  {
    "id": "49e139aa-e486-44cc-8762-e276e509d9d6",
    "text": "The International Booker Prize, awarded for fiction translated into English, was previously known as what?",
    "options": [
      "The Independent Foreign Fiction Prize",
      "The Man Booker International Prize",
      "The Global Literature Prize",
      "The World Fiction Award"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "It was previously called the Man Booker International Prize.",
    "detailedExplanation": "The International Booker Prize was previously known as the Man Booker International Prize from 2005 to 2019, when it was renamed following the end of Man Group's sponsorship. Initially, from 2005-2015, it was awarded biennially to a living author for their overall contribution to fiction on the world stage. In 2016, it was restructured to become an annual award for a single work of fiction translated into English, with the £50,000 prize split between author and translator.",
    "citationUrl": "https://en.wikipedia.org/wiki/International_Booker_Prize",
    "citationTitle": "Wikipedia: International Booker Prize"
  },
  {
    "id": "036aae29-5f78-445d-a675-4f5277e6c878",
    "text": "Which author was the first to win both the Newbery Medal and the Caldecott Medal in the same year?",
    "options": [
      "Maurice Sendak",
      "Chris Van Allsburg",
      "William Steig",
      "No one has achieved this"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "No author has ever won both awards in the same year.",
    "detailedExplanation": "No author has ever won both the Newbery Medal (for excellence in children's literature) and the Caldecott Medal (for excellence in children's picture book illustration) in the same year. While some authors like Maurice Sendak have won both awards during their careers, they were for different books in different years. The Newbery Medal focuses on literary excellence while the Caldecott Medal honors artistic excellence in illustration, making it extremely rare for the same work to excel in both categories to award-winning levels.",
    "citationUrl": "https://en.wikipedia.org/wiki/Newbery_Medal",
    "citationTitle": "Wikipedia: Newbery Medal"
  },
  {
    "id": "18348f33-2c2c-4920-9139-636a79e57d95",
    "text": "The World Fantasy Award trophy is famously shaped like the bust of which author?",
    "options": [
      "Edgar Allan Poe",
      "H.P. Lovecraft",
      "Bram Stoker",
      "Arthur Conan Doyle"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The World Fantasy Award trophy was shaped like H.P. Lovecraft's bust.",
    "detailedExplanation": "From 1975 to 2015, the World Fantasy Award trophy featured a bust of H.P. Lovecraft, created by sculptor Gahan Wilson. However, in 2016, the World Fantasy Convention board decided to retire the Lovecraft bust due to concerns about his racist views and replaced it with a new design featuring a tree. The change was made to ensure the award better represented the diverse and inclusive nature of the modern fantasy literature community.",
    "citationUrl": "https://en.wikipedia.org/wiki/World_Fantasy_Award",
    "citationTitle": "Wikipedia: World Fantasy Award"
  },
  {
    "id": "5a68f87f-0fec-4310-b902-cfc966ecda18",
    "text": "Which poet was the first to win the Pulitzer Prize for Poetry twice?",
    "options": [
      "Robert Frost",
      "Edwin Arlington Robinson",
      "Carl Sandburg",
      "Edna St. Vincent Millay"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Edwin Arlington Robinson was the first to win the Pulitzer Prize for Poetry twice.",
    "detailedExplanation": "Edwin Arlington Robinson was the first poet to win the Pulitzer Prize for Poetry twice, receiving the award in 1922 for 'Collected Poems' and again in 1925 for 'The Man Who Died Twice.' While Robert Frost would later win four Pulitzer Prizes for Poetry (more than any other poet), Robinson holds the distinction of being the first multiple winner. The Pulitzer Prize for Poetry has been awarded annually since 1922 to honor distinguished volumes of original verse by American authors.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pulitzer_Prize_for_Poetry",
    "citationTitle": "Wikipedia: Pulitzer Prize for Poetry"
  },
  {
    "id": "6e001868-11ff-4448-a583-457dced76d0a",
    "text": "The prestigious literary award known as the 'Swedish Academy Prize' is more commonly called what?",
    "options": [
      "The Nobel Prize in Literature",
      "The August Prize",
      "The Nordic Council Literature Prize",
      "The Selma Lagerlöf Prize"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Nobel Prize in Literature is awarded by the Swedish Academy.",
    "detailedExplanation": "The Nobel Prize in Literature is awarded annually by the Swedish Academy in Stockholm, Sweden. Established by Alfred Nobel's will in 1895, it has been awarded since 1901 to authors who have produced 'the most outstanding work in an ideal direction' in the field of literature. The prize includes a medal, diploma, and monetary award, and is considered the most prestigious literary award in the world. Recipients have included authors from diverse linguistic and cultural backgrounds, representing the global nature of literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nobel_Prize_in_Literature",
    "citationTitle": "Wikipedia: Nobel Prize in Literature"
  },
  {
    "id": "4d059c67-3724-4c41-abef-ecba95b11759",
    "text": "Which author won the Man Booker Prize twice, first in 1973 for 'G.' and again in 2009 for 'Wolf Hall'?",
    "options": [
      "John Berger",
      "Hilary Mantel",
      "J.M. Coetzee",
      "Peter Carey"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Hilary Mantel won the Man Booker Prize in 2009 for 'Wolf Hall' and again in 2012 for 'Bring Up the Bodies'.",
    "detailedExplanation": "Hilary Mantel became the first woman to win the Man Booker Prize twice, achieving this feat with her Tudor historical novels 'Wolf Hall' (2009) and 'Bring Up the Bodies' (2012), both featuring Thomas Cromwell. She joins an exclusive group of only six authors who have won the prestigious award multiple times. The question contains a deliberate error - John Berger won in 1972 for 'G.', not Mantel.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hilary_Mantel",
    "citationTitle": "Wikipedia: Hilary Mantel"
  },
  {
    "id": "8b8fcb52-e1f9-4332-b339-7193e6d6ee01",
    "text": "The Nebula Awards are presented annually by which organization for outstanding science fiction and fantasy works?",
    "options": [
      "World Science Fiction Society",
      "Science Fiction Writers of America",
      "International Association of the Fantastic in the Arts",
      "British Science Fiction Association"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Nebula Awards are presented by the Science Fiction Writers of America (SFWA).",
    "detailedExplanation": "The Nebula Awards have been presented annually since 1966 by the Science Fiction Writers of America (now called Science Fiction and Fantasy Writers of America), recognizing the best science fiction and fantasy fiction published in the United States. Unlike the Hugo Awards which are voted on by fans, the Nebula Awards are voted on by professional writers in the genre, making them particularly prestigious within the writing community.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nebula_Award",
    "citationTitle": "Wikipedia: Nebula Award"
  },
  {
    "id": "3261d07b-b02a-4f95-b26a-ef7da3767001",
    "text": "Which country's highest literary honor is the Goncourt Prize, first awarded in 1903?",
    "options": [
      "Germany",
      "Italy",
      "France",
      "Spain"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Prix Goncourt is France's most prestigious literary prize.",
    "detailedExplanation": "The Prix Goncourt is France's most prestigious literary prize, awarded annually for the best and most imaginative prose work of the year. Established by the will of Edmond de Goncourt, it has been awarded since 1903 by the Académie Goncourt. Winners receive only a symbolic prize of 10 euros, but the award typically guarantees substantial book sales and literary fame. Notable winners include Marcel Proust, André Malraux, and Marguerite Duras.",
    "citationUrl": "https://en.wikipedia.org/wiki/Prix_Goncourt",
    "citationTitle": "Wikipedia: Prix Goncourt"
  },
  {
    "id": "041dacbc-6867-4ad7-bdbb-3a8c3e9b6445",
    "text": "The Costa Book Awards were previously known by what name until 2006?",
    "options": [
      "Guardian Fiction Prize",
      "Whitbread Book Awards",
      "John Llewellyn Rhys Prize",
      "Somerset Maugham Award"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Costa Book Awards were called the Whitbread Book Awards until 2006.",
    "detailedExplanation": "The Costa Book Awards, one of the UK's most prestigious literary prizes, were originally established as the Whitbread Literary Awards in 1971, sponsored by the Whitbread brewing company. In 2006, Costa Coffee took over sponsorship and the awards were renamed the Costa Book Awards. The awards recognize the most enjoyable contemporary British writing across five categories, with winners competing for the overall Costa Book of the Year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Costa_Book_Awards",
    "citationTitle": "Wikipedia: Costa Book Awards"
  },
  {
    "id": "52ada12a-46c8-4d6b-9a8c-98efd05e46fa",
    "text": "Which author became the youngest winner of the Pulitzer Prize for Fiction at age 33 for the novel 'The Amazing Adventures of Kavalier & Clay'?",
    "options": [
      "Michael Chabon",
      "Junot Díaz",
      "Jennifer Egan",
      "Joshua Ferris"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Michael Chabon won the 2001 Pulitzer Prize for Fiction at age 37, not 33 as stated in the question.",
    "detailedExplanation": "Michael Chabon won the 2001 Pulitzer Prize for Fiction for 'The Amazing Adventures of Kavalier & Clay', a novel about two Jewish cousins in 1940s New York who create a comic book superhero. While Chabon was relatively young when he won at age 37, he was not the youngest Pulitzer Fiction winner - that distinction belongs to several other authors who won in their early thirties. The novel explores themes of Jewish identity, the Golden Age of comics, and the immigrant experience in America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Chabon",
    "citationTitle": "Wikipedia: Michael Chabon"
  },
  {
    "id": "f72bba9d-8234-460e-9955-9f0cb77c436a",
    "text": "The National Book Critics Circle Award was first presented in which decade?",
    "options": [
      "1960s",
      "1970s",
      "1980s",
      "1990s"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The National Book Critics Circle Award was first presented in 1976.",
    "detailedExplanation": "The National Book Critics Circle Awards were established in 1974 and first presented in 1976 by the National Book Critics Circle, an organization of book reviewers and critics. The awards recognize outstanding writing in six categories: fiction, general nonfiction, biography, autobiography, poetry, and criticism. The awards are particularly notable because they are chosen by professional book critics and reviewers rather than publishers or the general public.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Book_Critics_Circle_Award",
    "citationTitle": "Wikipedia: National Book Critics Circle Award"
  },
  {
    "id": "f5aa8928-6dc7-4c26-8399-c6806326a213",
    "text": "Which Caribbean-British author won the 2021 Booker Prize for the novel 'The Promise'?",
    "options": [
      "Damon Galgut",
      "Richard Powers",
      "Patricia Lockwood",
      "Angie Cruz"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Damon Galgut won the 2021 Booker Prize for 'The Promise', though he is South African, not Caribbean-British.",
    "detailedExplanation": "Damon Galgut, a South African author, won the 2021 Booker Prize for his novel 'The Promise'. The novel tells the story of a white South African family over several decades, examining the country's transition from apartheid to democracy through the lens of personal and political promises. Galgut had been longlisted for the Booker Prize twice before (in 2003 and 2010) before finally winning on his third nomination. The question incorrectly describes him as Caribbean-British.",
    "citationUrl": "https://en.wikipedia.org/wiki/Damon_Galgut",
    "citationTitle": "Wikipedia: Damon Galgut"
  },
  {
    "id": "d8b99002-2e9c-4234-beb2-4c3e3a57ed17",
    "text": "The Lambda Literary Awards specifically honor books that focus on which themes?",
    "options": [
      "Environmental literature",
      "LGBTQ+ themes",
      "War and conflict",
      "Religious spirituality"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Lambda Literary Awards honor the best LGBTQ+ books published each year.",
    "detailedExplanation": "The Lambda Literary Awards, also known as the 'Lammys', have been presented annually since 1989 by the Lambda Literary Foundation to honor the best lesbian, gay, bisexual, transgender, and queer literature published each year. The awards cover multiple genres including fiction, nonfiction, poetry, romance, mystery, science fiction, and young adult literature. The awards play a crucial role in promoting LGBTQ+ voices and stories in literature and have helped bring greater visibility to queer authors and themes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lambda_Literary_Awards",
    "citationTitle": "Wikipedia: Lambda Literary Awards"
  },
  {
    "id": "b261c9b9-c1d6-4b11-b592-1fe72db16cf4",
    "text": "The James Tait Black Memorial Prize, one of the oldest literary awards in the English-speaking world, is administered by which university?",
    "options": [
      "University of Cambridge",
      "University of Edinburgh",
      "University of Oxford",
      "Trinity College Dublin"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The James Tait Black Memorial Prize has been administered by the University of Edinburgh since 1919.",
    "detailedExplanation": "Established in 1919, the James Tait Black Memorial Prize is one of the oldest and most prestigious literary awards in the English-speaking world. It is administered by the University of Edinburgh and awards prizes annually for the best biography and the best work of fiction published in the previous year. The prize was founded in memory of James Tait Black, a partner in the publishing house A. & C. Black, and has recognized many distinguished authors including Graham Greene, Evelyn Waugh, and Salman Rushdie.",
    "citationUrl": "https://en.wikipedia.org/wiki/James_Tait_Black_Memorial_Prize",
    "citationTitle": "Wikipedia: James Tait Black Memorial Prize"
  },
  {
    "id": "21fd9c61-1349-42cb-941b-d63ab072a2cb",
    "text": "The PEN/Faulkner Award for Fiction, America's largest peer-juried award for fiction, is named after which two literary figures?",
    "options": [
      "Edgar Allan Poe and William Faulkner",
      "PEN International and William Faulkner",
      "Sylvia Plath and William Faulkner",
      "Publishers Weekly and William Faulkner"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The award combines PEN International (writers' organization) with William Faulkner's name and legacy.",
    "detailedExplanation": "The PEN/Faulkner Award for Fiction was established in 1980 and represents a collaboration between PEN International, the worldwide association of writers, and the legacy of Nobel Prize-winning author William Faulkner. The award was created to honor the best work of fiction published by an American author during the calendar year, with winners selected by a panel of their literary peers. It carries a $15,000 prize and is considered one of the most prestigious fiction awards in the United States, with past winners including John Updike, Philip Roth, and Jennifer Egan.",
    "citationUrl": "https://en.wikipedia.org/wiki/PEN/Faulkner_Award_for_Fiction",
    "citationTitle": "Wikipedia: PEN/Faulkner Award for Fiction"
  },
  {
    "id": "4c8ef5ef-ec7c-42df-a2b7-48973158affc",
    "text": "Which literary prize specifically honors outstanding achievement in horror fiction and is often considered the genre's equivalent of the Pulitzer Prize?",
    "options": [
      "World Fantasy Award",
      "Shirley Jackson Award",
      "Bram Stoker Award",
      "International Horror Guild Award"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Bram Stoker Award is the most prestigious honor in horror fiction, presented by the Horror Writers Association.",
    "detailedExplanation": "Named after Bram Stoker, author of 'Dracula,' the Bram Stoker Awards are presented annually by the Horror Writers Association (HWA) for superior achievement in horror writing. Established in 1987, these awards are voted on by active members of the HWA and cover multiple categories including novels, short fiction, screenplays, and poetry. The award is widely regarded as the most prestigious honor in the horror genre, with recipients including Stephen King, Peter Straub, Clive Barker, and Joyce Carol Oates. The trophy itself is a distinctive haunted house sculpture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bram_Stoker_Award",
    "citationTitle": "Wikipedia: Bram Stoker Award"
  },
  {
    "id": "7356ac0d-c5df-430c-a46c-853ea8e2a6ae",
    "text": "The prestigious literary award given annually to 'the most distinguished contribution to American literature for children' is named after which 18th-century British bookseller?",
    "options": [
      "John Newbery",
      "Thomas Cadell",
      "Jacob Tonson",
      "Edmund Curll"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Newbery Medal is named after John Newbery, an 18th-century British bookseller who was among the first to publish books specifically for children.",
    "detailedExplanation": "The Newbery Medal, established in 1922, honors the author of the most distinguished contribution to American literature for children published in the preceding year. It was named after John Newbery (1713-1767), a British bookseller and publisher who was one of the first to create and market books specifically designed for children's entertainment and education. Newbery is often called 'the father of children's literature' for his pioneering work in recognizing children as a distinct audience for literature. The medal is awarded annually by the Association for Library Service to Children, a division of the American Library Association.",
    "citationUrl": "https://en.wikipedia.org/wiki/Newbery_Medal",
    "citationTitle": "Wikipedia: Newbery Medal"
  }
]