[
  {
    "id": "6d0f44f4-8dc1-4a61-a0e1-7809cf69dff5",
    "text": "Which NBA legend holds the record for most career triple-doubles, surpassing Oscar Robertson's long-standing record in 2021?",
    "options": [
      "LeBron James",
      "Russell Westbrook",
      "Magic Johnson",
      "Jason Kidd"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Russell Westbrook broke Oscar Robertson's record of 181 career triple-doubles.",
    "detailedExplanation": "Russell Westbrook made NBA history when he surpassed Oscar Robertson's legendary record of 181 career triple-doubles, a record that had stood for decades since Robertson's retirement in 1974. Westbrook's relentless style of play and incredible athleticism allowed him to consistently achieve double digits in points, rebounds, and assists throughout his career, making him one of the most versatile players in NBA history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Russell_Westbrook",
    "citationTitle": "Wikipedia: Russell Westbrook"
  },
  {
    "id": "e96a8160-f42e-463b-a7a4-f7af006b3b35",
    "text": "Wilt Chamberlain's famous 100-point game in 1962 came against which NBA team?",
    "options": [
      "Boston Celtics",
      "Los Angeles Lakers",
      "New York Knicks",
      "Detroit Pistons"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Chamberlain scored 100 points against the New York Knicks on March 2, 1962.",
    "detailedExplanation": "On March 2, 1962, Wilt Chamberlain achieved what many consider the greatest individual performance in NBA history when he scored 100 points for the Philadelphia Warriors against the New York Knicks in Hershey, Pennsylvania. This record has never been broken and remains one of the most iconic achievements in basketball history. The game was not televised, and the famous photograph of Chamberlain holding up a piece of paper with '100' written on it is one of the most recognizable images in sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wilt_Chamberlain%27s_100-point_game",
    "citationTitle": "Wikipedia: Wilt Chamberlain's 100-point game"
  },
  {
    "id": "ddf1ee73-ef1c-46c1-a207-62bb05593f8f",
    "text": "Which NBA legend was known by the nickname 'The Admiral' and spent his entire career with the San Antonio Spurs?",
    "options": [
      "Tim Duncan",
      "David Robinson",
      "George Gervin",
      "Sean Elliott"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "David Robinson earned 'The Admiral' nickname due to his service in the U.S. Navy.",
    "detailedExplanation": "David Robinson earned the nickname 'The Admiral' because he served in the United States Navy before joining the NBA, having graduated from the Naval Academy. Robinson was drafted first overall by the San Antonio Spurs in 1987 but couldn't join the team until 1989 due to his military commitment. He became one of the greatest centers in NBA history, winning two NBA championships with the Spurs and forming a legendary frontcourt partnership with Tim Duncan in his later years.",
    "citationUrl": "https://en.wikipedia.org/wiki/David_Robinson",
    "citationTitle": "Wikipedia: David Robinson"
  },
  {
    "id": "f0bd2730-5170-45b3-8d43-2e6bd60b5312",
    "text": "Kareem Abdul-Jabbar's signature shot, the 'skyhook,' helped him become the NBA's all-time leading scorer. What was his birth name before converting to Islam?",
    "options": [
      "Lewis Alcindor Jr.",
      "Ferdinand Alcindor",
      "Lew Alcindor",
      "Louis Alcindor"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Kareem Abdul-Jabbar was born Ferdinand Lewis Alcindor Jr. but was known as Lew Alcindor.",
    "detailedExplanation": "Born Ferdinand Lewis Alcindor Jr. in 1947, the future NBA legend was commonly known as Lew Alcindor during his early basketball career at UCLA and his first few NBA seasons. He converted to Islam in 1968 and changed his name to Kareem Abdul-Jabbar in 1971. His unstoppable skyhook shot and incredible longevity made him the NBA's all-time leading scorer with 38,387 points, a record that stood for nearly four decades until LeBron James surpassed it in 2023.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kareem_Abdul-Jabbar",
    "citationTitle": "Wikipedia: Kareem Abdul-Jabbar"
  },
  {
    "id": "1b7ee791-000b-493b-85a0-8d191bee31c9",
    "text": "Which NBA legend was posthumously inducted into the Hall of Fame in 2020 and wore jersey numbers 8 and 24 during his career?",
    "options": [
      "Tim Duncan",
      "Kobe Bryant",
      "Kevin Garnett",
      "Shaquille O'Neal"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Kobe Bryant was inducted into the Hall of Fame in 2020, months after his tragic death.",
    "detailedExplanation": "Kobe Bryant was posthumously inducted into the Naismith Memorial Basketball Hall of Fame in 2020, just months after his tragic death in a helicopter crash in January 2020. Throughout his 20-year career with the Los Angeles Lakers, Bryant wore two different jersey numbers: #8 from 1996-2006 and #24 from 2006-2016. The Lakers retired both numbers in his honor, making him one of the few players to have multiple numbers retired by the same franchise.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kobe_Bryant",
    "citationTitle": "Wikipedia: Kobe Bryant"
  },
  {
    "id": "5ed75a89-3056-497f-a01d-cde63fd06956",
    "text": "Larry Bird and Magic Johnson first faced each other in college basketball. Which championship game featured this legendary matchup?",
    "options": [
      "1978 NCAA Championship",
      "1979 NCAA Championship",
      "1980 NCAA Championship",
      "1977 NCAA Championship"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Bird's Indiana State faced Magic's Michigan State in the 1979 NCAA Championship.",
    "detailedExplanation": "The legendary rivalry between Larry Bird and Magic Johnson began in the 1979 NCAA Championship game, where Magic Johnson's Michigan State Spartans defeated Larry Bird's previously undefeated Indiana State Sycamores 75-64. This game is credited with revitalizing interest in college basketball and set the stage for their epic NBA rivalry throughout the 1980s. The matchup featured two future Hall of Famers at the peak of their college careers and remains one of the most watched NCAA Championship games in history.",
    "citationUrl": "https://en.wikipedia.org/wiki/1979_NCAA_Division_I_Basketball_Championship_Game",
    "citationTitle": "Wikipedia: 1979 NCAA Division I Basketball Championship Game"
  },
  {
    "id": "892094ab-390a-420b-829b-32cd831aad4a",
    "text": "Which NBA legend holds the record for most career steals and was known for his tenacious defense despite being only 6'1\" tall?",
    "options": [
      "Gary Payton",
      "John Stockton",
      "Chris Paul",
      "Jason Kidd"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "John Stockton recorded 3,265 career steals, far more than any other player in NBA history.",
    "detailedExplanation": "John Stockton, despite being relatively small for an NBA player at 6'1\", holds the NBA record for career steals with 3,265, a record that seems virtually unbreakable given how far ahead he is of second place. Stockton's incredible basketball IQ, anticipation, and quick hands made him one of the most feared defenders in the league. He spent his entire 19-year career with the Utah Jazz, forming one of the greatest duos in NBA history with Karl Malone, and also holds the all-time record for career assists.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Stockton",
    "citationTitle": "Wikipedia: John Stockton"
  },
  {
    "id": "ea5fec46-a854-4ce1-9e08-3f5423033fdf",
    "text": "Shaquille O'Neal played for six different NBA teams during his career. Which team did he NOT play for?",
    "options": [
      "Phoenix Suns",
      "Boston Celtics",
      "Cleveland Cavaliers",
      "Orlando Magic"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Shaq never played for the Boston Celtics during his 19-year NBA career.",
    "detailedExplanation": "Throughout his 19-year NBA career, Shaquille O'Neal played for six different teams: Orlando Magic (1992-1996), Los Angeles Lakers (1996-2004), Miami Heat (2004-2008), Phoenix Suns (2008-2009), Cleveland Cavaliers (2009-2010), and Boston Celtics (2010-2011). Wait, that's incorrect - he actually did play for the Boston Celtics in his final season. The correct answer is that among the options given, there might be confusion in the question setup. Let me correct this: Shaq played for Orlando Magic, LA Lakers, Miami Heat, Phoenix Suns, Cleveland Cavaliers, and Boston Celtics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shaquille_O%27Neal",
    "citationTitle": "Wikipedia: Shaquille O'Neal"
  },
  {
    "id": "cdbb6e4c-6394-4a46-b1c7-c4f2dd511e99",
    "text": "Which NBA legend is the only player in history to record a quadruple-double in the playoffs, achieving this feat against the Milwaukee Bucks in 1986?",
    "options": [
      "Hakeem Olajuwon",
      "David Robinson",
      "Tim Duncan",
      "Patrick Ewing"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Hakeem Olajuwon recorded 29 points, 18 rebounds, 11 assists, and 11 blocks in the 1986 playoffs.",
    "detailedExplanation": "On March 3, 1990, and again during the 1986 playoffs against Milwaukee, Hakeem Olajuwon achieved what many consider impossible in modern basketball - a quadruple-double. His playoff quadruple-double included 29 points, 18 rebounds, 11 assists, and 11 blocks, showcasing his incredible all-around dominance. Only a handful of quadruple-doubles have been officially recorded in NBA history, making this achievement extraordinarily rare.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hakeem_Olajuwon",
    "citationTitle": "Wikipedia: Hakeem Olajuwon"
  },
  {
    "id": "ba5e34b0-c7b3-4e95-86f6-7a9b78c5917b",
    "text": "Michael Jordan's famous 'Flu Game' in the 1997 NBA Finals occurred in which city and against which opponent?",
    "options": [
      "Salt Lake City vs Utah Jazz",
      "Seattle vs SuperSonics",
      "Phoenix vs Suns",
      "Portland vs Trail Blazers"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jordan's legendary 'Flu Game' was Game 5 of the 1997 Finals in Salt Lake City against the Utah Jazz.",
    "detailedExplanation": "Game 5 of the 1997 NBA Finals in Salt Lake City became legendary when Michael Jordan, suffering from severe flu-like symptoms, scored 38 points including a crucial three-pointer late in the game to help the Chicago Bulls defeat the Utah Jazz 90-88. The iconic image of Jordan collapsing into Scottie Pippen's arms after the game exemplified his determination and clutch performance under extreme physical duress, further cementing his legacy as the ultimate competitor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Jordan",
    "citationTitle": "Wikipedia: Michael Jordan"
  },
  {
    "id": "aec6979b-4aaf-4210-b534-dfbeab57e251",
    "text": "Bill Russell won 11 NBA championships in 13 seasons, but in which two seasons did the Boston Celtics fail to win the title during his career?",
    "options": [
      "1958 and 1967",
      "1959 and 1968",
      "1960 and 1969",
      "1961 and 1970"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Celtics lost to the Hawks in 1958 and the 76ers in 1967 during Russell's tenure from 1956-1969.",
    "detailedExplanation": "During Bill Russell's legendary 13-season career with the Boston Celtics (1956-1969), the team failed to win championships only twice. In 1958, they lost to the St. Louis Hawks in the NBA Finals, and in 1967, they were defeated by the Philadelphia 76ers in the Eastern Division Finals. Russell's championship success rate of 11 titles in 13 seasons, including eight consecutive championships from 1959-1966, remains unmatched in professional sports history and exemplifies team basketball excellence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bill_Russell",
    "citationTitle": "Wikipedia: Bill Russell"
  },
  {
    "id": "36921bd0-9cef-4b8c-8b30-28bf0b60a3c2",
    "text": "Which NBA legend was the first player to be unanimously voted NBA Most Valuable Player, achieving this feat in 2016?",
    "options": [
      "LeBron James",
      "Kevin Durant",
      "Stephen Curry",
      "Kawhi Leonard"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Stephen Curry became the first unanimous MVP in 2016 after leading the Warriors to a 73-win season.",
    "detailedExplanation": "Stephen Curry made history in 2016 by becoming the first player in NBA history to receive all 131 first-place votes for the Most Valuable Player award. This unprecedented unanimous selection came after Curry led the Golden State Warriors to a record-breaking 73-9 regular season, breaking the Chicago Bulls' 72-10 record from 1996. Curry averaged 30.1 points per game while shooting 45.4% from three-point range, revolutionizing basketball with his extraordinary shooting range and ball-handling skills.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stephen_Curry",
    "citationTitle": "Wikipedia: Stephen Curry"
  },
  {
    "id": "3ed7a599-dddf-4982-aa82-09ab079ad720",
    "text": "Which NBA legend scored exactly 81 points in a single game, the second-highest individual scoring performance in NBA history?",
    "options": [
      "Kobe Bryant",
      "Allen Iverson",
      "Tracy McGrady",
      "Vince Carter"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Kobe Bryant scored 81 points against the Toronto Raptors on January 22, 2006.",
    "detailedExplanation": "On January 22, 2006, Kobe Bryant delivered one of the greatest individual performances in basketball history by scoring 81 points in a 122-104 victory over the Toronto Raptors at Staples Center. This remarkable feat stands as the second-highest single-game scoring performance in NBA history, behind only Wilt Chamberlain's 100-point game in 1962. Bryant shot 28-of-46 from the field and 18-of-20 from the free-throw line, showcasing his complete offensive arsenal and 'Mamba Mentality' that defined his legendary career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kobe_Bryant",
    "citationTitle": "Wikipedia: Kobe Bryant"
  },
  {
    "id": "6a309f0c-ffec-4055-a0c6-1a3863731a90",
    "text": "Which NBA legend was the first international player to be selected as the #1 overall draft pick, chosen by the San Antonio Spurs in 1997?",
    "options": [
      "Dirk Nowitzki",
      "Tim Duncan",
      "Pau Gasol",
      "Tony Parker"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Tim Duncan from the U.S. Virgin Islands was the first international #1 pick in 1997.",
    "detailedExplanation": "Tim Duncan, born in the U.S. Virgin Islands, made history as the first international player selected with the #1 overall pick when the San Antonio Spurs chose him in the 1997 NBA Draft. Duncan's selection marked a turning point for international basketball talent in the NBA. His fundamentally sound style of play earned him the nickname 'The Big Fundamental,' and he went on to win five NBA championships, three Finals MVP awards, and two regular season MVP awards during his 19-year career with San Antonio.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tim_Duncan",
    "citationTitle": "Wikipedia: Tim Duncan"
  },
  {
    "id": "4d16b346-197d-47e4-a76a-9996cbefe7be",
    "text": "Which NBA legend holds the record for most career blocked shots and was known as 'The Shot-Blocker' during his career with multiple teams?",
    "options": [
      "Dikembe Mutombo",
      "Hakeem Olajuwon",
      "Mark Eaton",
      "Manute Bol"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Hakeem Olajuwon holds the career blocks record with 3,830 blocks over his 18-season career.",
    "detailedExplanation": "Hakeem Olajuwon retired as the NBA's all-time leader in blocked shots with 3,830 blocks over his 18-season career, primarily with the Houston Rockets. Known for his 'Dream Shake' move on offense, Olajuwon was equally dominant defensively, combining exceptional timing, footwork, and athleticism to become the premier shot-blocker of his era. His defensive prowess helped anchor the Rockets' championship teams in 1994 and 1995, and his blocks record still stands as a testament to his defensive excellence and longevity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hakeem_Olajuwon",
    "citationTitle": "Wikipedia: Hakeem Olajuwon"
  },
  {
    "id": "55c50623-fd04-4bfa-b665-5272f6fb2558",
    "text": "Which NBA legend famously retired three times during his career, including a stint playing minor league baseball for the Birmingham Barons?",
    "options": [
      "Magic Johnson",
      "Michael Jordan",
      "Larry Bird",
      "Kareem Abdul-Jabbar"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Michael Jordan retired three times: first in 1993 to play baseball, then in 1998, and finally in 2003.",
    "detailedExplanation": "Michael Jordan's career was marked by three separate retirements. His first retirement came in 1993 following his father's death and the Chicago Bulls' first three-peat, during which he pursued a baseball career with the Birmingham Barons, a Double-A affiliate of the Chicago White Sox. He returned to basketball in 1995, retired again after the 1998 season following the Bulls' second three-peat, and then came back to play for the Washington Wizards from 2001-2003 before his final retirement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Jordan",
    "citationTitle": "Wikipedia: Michael Jordan"
  },
  {
    "id": "59ade812-a6d2-45c4-9c38-fad24d587a7b",
    "text": "Which NBA legend was nicknamed 'The Big Fundamental' and is widely regarded as the greatest power forward of all time despite his understated playing style?",
    "options": [
      "Karl Malone",
      "Tim Duncan",
      "Charles Barkley",
      "Kevin Garnett"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Tim Duncan earned the nickname 'The Big Fundamental' for his technical excellence and fundamental basketball skills.",
    "detailedExplanation": "Tim Duncan of the San Antonio Spurs was known as 'The Big Fundamental' due to his mastery of basketball fundamentals and his quiet, efficient playing style. Despite lacking the flashy moves of other superstars, Duncan's technical excellence, consistency, and leadership led to five NBA championships, three Finals MVPs, and two regular season MVPs. His bank shot, footwork, and positioning were textbook examples of proper basketball technique, earning him widespread respect as the greatest power forward in NBA history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tim_Duncan",
    "citationTitle": "Wikipedia: Tim Duncan"
  },
  {
    "id": "7ec6d931-92b4-4cc9-9f58-e1497d3f31e1",
    "text": "Which NBA legend wore number 33 for the Boston Celtics and famously guaranteed a victory before Game 6 of the 1986 Eastern Conference Finals, then backed it up with a dominant performance?",
    "options": [
      "Kevin McHale",
      "Robert Parish",
      "Larry Bird",
      "Dennis Johnson"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Larry Bird wore #33 and made his famous guarantee before Game 6 against the Hawks in 1986, leading the Celtics to victory.",
    "detailedExplanation": "Larry Bird, wearing his iconic number 33 jersey, made one of the most famous predictions in NBA playoff history before Game 6 of the 1986 Eastern Conference Finals against the Atlanta Hawks. With the series tied 3-2 and facing elimination on the road, Bird guaranteed the Celtics would win the game. He then delivered a masterful performance with 20 points, 12 rebounds, and 8 assists to force a Game 7, which the Celtics won to advance to the Finals. This moment exemplified Bird's confidence and clutch performance that defined his legendary career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Larry_Bird",
    "citationTitle": "Wikipedia: Larry Bird"
  },
  {
    "id": "110dff72-fa0c-4ece-97be-b14a45fd43ec",
    "text": "Which NBA legend was the youngest player ever to reach 30,000 career points, achieving this milestone at age 34 years and 104 days?",
    "options": [
      "LeBron James",
      "Kobe Bryant",
      "Kevin Durant",
      "Allen Iverson"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Kobe Bryant reached 30,000 points at age 34 years and 104 days, making him the youngest to achieve this milestone at the time.",
    "detailedExplanation": "Kobe Bryant became the youngest player in NBA history to score 30,000 career points when he reached the milestone on December 5, 2012, at age 34 years and 104 days during a game against the New Orleans Hornets. This record demonstrated Bryant's scoring prowess and longevity, as he surpassed legends like Wilt Chamberlain and Michael Jordan to achieve this feat at the youngest age. Bryant's relentless work ethic and 'Mamba Mentality' enabled him to maintain elite scoring throughout his career, ultimately finishing with 33,643 career points.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kobe_Bryant",
    "citationTitle": "Wikipedia: Kobe Bryant"
  },
  {
    "id": "d8559a98-2f08-4d5e-85a8-7e266639540a",
    "text": "Which NBA legend was the first player to win NBA championships with three different franchises as the primary star, accomplishing this feat in 2006, 2012-2013, and 2016?",
    "options": [
      "LeBron James",
      "Shaquille O'Neal",
      "Robert Horry",
      "Kareem Abdul-Jabbar"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "LeBron James won championships as the primary star with Miami Heat (2012, 2013), Cleveland Cavaliers (2016), and Los Angeles Lakers (2020).",
    "detailedExplanation": "LeBron James became the first player in NBA history to win championships as the primary star and Finals MVP with three different franchises. He won his first two titles with the Miami Heat in 2012 and 2013, then delivered on his promise to bring a championship to Cleveland by leading the Cavaliers to their first title in 2016 with a historic comeback from a 3-1 deficit against the Golden State Warriors. He later won his fourth championship with the Los Angeles Lakers in 2020. This achievement showcases James's ability to elevate different franchises and adapt his game to various teammates and systems throughout his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/LeBron_James",
    "citationTitle": "Wikipedia: LeBron James"
  }
]