[
  {
    "id": "698de52b-c4a5-4e45-9896-24b7585c0eb3",
    "text": "Which NBA legend was known by the nickname 'The Dream' and is considered one of the greatest centers of all time?",
    "options": [
      "Shaquille O'Neal",
      "Hakeem Olajuwon",
      "David Robinson",
      "Patrick Ewing"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Hakeem Olajuwon was nicknamed 'The Dream' for his smooth footwork and graceful playing style.",
    "detailedExplanation": "Hakeem Olajuwon, who played primarily for the Houston Rockets from 1984-2001, earned the nickname 'The Dream' due to his incredible footwork, post moves, and seemingly effortless playing style. He led the Rockets to back-to-back NBA championships in 1994 and 1995, and was known for his signature 'Dream Shake' move that left defenders bewildered.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hakeem_Olajuwon",
    "citationTitle": "Wikipedia: Hakeem Olajuwon"
  },
  {
    "id": "f5b3d85c-3dd6-415f-8a92-956ee35133f1",
    "text": "Magic Johnson won five NBA championships with the Lakers, but in which year did he announce his retirement due to HIV?",
    "options": [
      "1989",
      "1991",
      "1993",
      "1995"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Magic Johnson announced his retirement in November 1991 after testing positive for HIV.",
    "detailedExplanation": "On November 7, 1991, Magic Johnson shocked the sports world by announcing his immediate retirement from basketball after testing positive for HIV. At the time, this was considered a death sentence by many, but Johnson became an advocate for HIV awareness and treatment. He did make brief comebacks, including playing in the 1992 Olympics and returning for part of the 1995-96 season.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magic_Johnson",
    "citationTitle": "Wikipedia: Magic Johnson"
  },
  {
    "id": "f86c7c23-74d5-4d4c-baa1-f863262dbcc5",
    "text": "Which NBA legend holds the record for most career steals in NBA history?",
    "options": [
      "Gary Payton",
      "Jason Kidd",
      "John Stockton",
      "Chris Paul"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "John Stockton holds the NBA record with 3,265 career steals.",
    "detailedExplanation": "John Stockton, the Utah Jazz point guard who played from 1984 to 2003, holds the NBA record for career steals with 3,265. This record, like his assists record of 15,806, is considered virtually unbreakable. Stockton's incredible court vision, anticipation, and basketball IQ allowed him to excel at reading passing lanes and creating turnovers throughout his 19-year career.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Stockton",
    "citationTitle": "Wikipedia: John Stockton"
  },
  {
    "id": "f0a8b1ea-7700-4ced-be13-fc37d6367e8b",
    "text": "Larry Bird famously won the NBA Three-Point Contest three consecutive times. In which years did this occur?",
    "options": [
      "1984-1986",
      "1985-1987",
      "1986-1988",
      "1987-1989"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Larry Bird won the NBA Three-Point Contest three straight years from 1986-1988.",
    "detailedExplanation": "Larry Bird of the Boston Celtics dominated the NBA Three-Point Contest during its early years, winning the competition in 1986, 1987, and 1988. Bird was known for his incredible shooting ability and competitive nature. Legend has it that before the 1988 contest, he walked into the locker room and asked the other competitors 'Who's coming in second?' before going out and winning his third consecutive title.",
    "citationUrl": "https://en.wikipedia.org/wiki/Larry_Bird",
    "citationTitle": "Wikipedia: Larry Bird"
  },
  {
    "id": "47c564a9-0b13-4ddc-b554-e7a0411f6058",
    "text": "Which team drafted Kobe Bryant before trading him to the Lakers on draft night in 1996?",
    "options": [
      "Philadelphia 76ers",
      "Charlotte Hornets",
      "New Jersey Nets",
      "Miami Heat"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Charlotte Hornets drafted Kobe Bryant 13th overall before trading him to the Lakers.",
    "detailedExplanation": "Kobe Bryant was selected 13th overall by the Charlotte Hornets in the 1996 NBA Draft, but the pick was immediately traded to the Los Angeles Lakers along with center Vlade Divac going to Charlotte. This trade was pre-arranged, as Bryant had made it clear he wanted to play for the Lakers and had worked out only for them. The trade proved to be one of the most lopsided in NBA history, as Bryant went on to win five championships with the Lakers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kobe_Bryant",
    "citationTitle": "Wikipedia: Kobe Bryant"
  },
  {
    "id": "67120ba0-a348-4cb9-833c-0abed0959d8a",
    "text": "Shaquille O'Neal played for six different NBA teams during his career. Which was the last team he played for before retiring?",
    "options": [
      "Phoenix Suns",
      "Cleveland Cavaliers",
      "Boston Celtics",
      "Atlanta Hawks"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Shaquille O'Neal's final NBA season was with the Boston Celtics in 2010-11.",
    "detailedExplanation": "Shaquille O'Neal ended his illustrious NBA career with the Boston Celtics during the 2010-11 season. After playing for the Orlando Magic, Los Angeles Lakers, Miami Heat, Phoenix Suns, and Cleveland Cavaliers, Shaq joined the Celtics hoping to win another championship. However, injuries limited his effectiveness, and he officially announced his retirement on June 1, 2011, via Twitter with his characteristic humor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shaquille_O%27Neal",
    "citationTitle": "Wikipedia: Shaquille O'Neal"
  },
  {
    "id": "370e5691-15b7-485b-a8aa-5e1f0da13059",
    "text": "Tim Duncan, known as 'The Big Fundamental', spent his entire 19-year career with which team?",
    "options": [
      "Miami Heat",
      "San Antonio Spurs",
      "Los Angeles Lakers",
      "Chicago Bulls"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Tim Duncan played his entire career with the San Antonio Spurs from 1997-2016.",
    "detailedExplanation": "Tim Duncan, nicknamed 'The Big Fundamental' for his textbook basketball technique and fundamentally sound play, spent his entire 19-year NBA career (1997-2016) with the San Antonio Spurs. During this time, he won five NBA championships (1999, 2003, 2005, 2007, 2014) and was known for his consistency, leadership, and team-first mentality. Duncan is considered one of the greatest power forwards of all time and the cornerstone of the Spurs' dynasty.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tim_Duncan",
    "citationTitle": "Wikipedia: Tim Duncan"
  },
  {
    "id": "f81d887d-3dde-432a-8ac7-b33c1ec97d92",
    "text": "Which NBA legend was the first player in league history to record a quadruple-double in a playoff game?",
    "options": [
      "Hakeem Olajuwon",
      "David Robinson",
      "Nate Thurmond",
      "Alvin Robertson"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Hakeem Olajuwon recorded the first playoff quadruple-double with 29 points, 18 rebounds, 11 assists, and 11 blocks in 1986.",
    "detailedExplanation": "On March 29, 1990, Hakeem Olajuwon became the first player to record a quadruple-double in an NBA playoff game. Playing for the Houston Rockets against the Milwaukee Bucks, Olajuwon recorded 29 points, 18 rebounds, 11 assists, and 11 blocks. This incredible feat showcased his versatility and dominance on both ends of the court, demonstrating why he's considered one of the most complete centers in NBA history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Double_(basketball)",
    "citationTitle": "Wikipedia: Double (basketball)"
  },
  {
    "id": "2759af69-dd19-462b-be40-17959358ca05",
    "text": "Which NBA legend scored 81 points in a single game, the second-highest individual scoring performance in NBA history?",
    "options": [
      "Michael Jordan",
      "Kobe Bryant",
      "Wilt Chamberlain",
      "Elgin Baylor"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Kobe Bryant scored 81 points against the Toronto Raptors on January 22, 2006.",
    "detailedExplanation": "Kobe Bryant's 81-point performance against the Toronto Raptors on January 22, 2006, stands as the second-highest single-game scoring performance in NBA history, behind only Wilt Chamberlain's legendary 100-point game. Bryant shot 28-of-46 from the field and 18-of-20 from the free-throw line in this masterful display of scoring prowess at Staples Center.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kobe_Bryant",
    "citationTitle": "Wikipedia: Kobe Bryant"
  },
  {
    "id": "15e7bb80-a737-49cf-aa9d-37abad39470b",
    "text": "Michael Jordan's famous 'Flu Game' performance of 38 points occurred during which NBA Finals series?",
    "options": [
      "1991 vs Lakers",
      "1993 vs Suns",
      "1996 vs SuperSonics",
      "1997 vs Jazz"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Jordan's 'Flu Game' was Game 5 of the 1997 NBA Finals against the Utah Jazz.",
    "detailedExplanation": "Michael Jordan's legendary 'Flu Game' occurred during Game 5 of the 1997 NBA Finals against the Utah Jazz. Despite being severely ill with what was described as flu-like symptoms, Jordan scored 38 points and hit a crucial three-pointer to help the Bulls win 90-88, giving them a 3-2 series lead. The image of Jordan collapsing into Scottie Pippen's arms after the game became one of the most iconic moments in NBA history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Jordan",
    "citationTitle": "Wikipedia: Michael Jordan"
  },
  {
    "id": "a8f2ad09-7ae0-4781-9138-379b82c0f60c",
    "text": "Which NBA legend was nicknamed 'The Answer' and famously delivered a rant about practice during a 2002 press conference?",
    "options": [
      "Stephon Marbury",
      "Allen Iverson",
      "Steve Francis",
      "Jason Williams"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Allen Iverson was known as 'The Answer' and gave the famous 'practice' press conference.",
    "detailedExplanation": "Allen Iverson, nicknamed 'The Answer,' became infamous for his passionate 2002 press conference where he repeatedly mentioned 'practice' while defending his approach to the game. The 6-foot guard was known for his incredible scoring ability despite his small stature, winning the NBA MVP award in 2001 and leading the Philadelphia 76ers to the NBA Finals that same year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Allen_Iverson",
    "citationTitle": "Wikipedia: Allen Iverson"
  },
  {
    "id": "1831253a-9929-4a26-a97b-a0cda64d3e18",
    "text": "Kareem Abdul-Jabbar's signature shot, which helped him become the NBA's all-time leading scorer (until 2023), was known as what?",
    "options": [
      "The Dream Shake",
      "The Sky Hook",
      "The Fade Away",
      "The Hook Shot"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Kareem's unstoppable signature move was called 'The Sky Hook.'",
    "detailedExplanation": "Kareem Abdul-Jabbar's 'Sky Hook' was arguably the most unstoppable shot in NBA history. The high-arcing hook shot, released at the peak of his 7'2\" frame's reach, was virtually impossible to block and became his trademark throughout his 20-year career. This shot was instrumental in helping him score 38,387 career points, a record that stood until LeBron James surpassed it in 2023.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kareem_Abdul-Jabbar",
    "citationTitle": "Wikipedia: Kareem Abdul-Jabbar"
  },
  {
    "id": "33668fda-bbea-4e3d-b2cf-ece0cce70e2f",
    "text": "Which NBA legend was known as 'The Mailman' and formed a legendary duo with John Stockton in Utah?",
    "options": [
      "Karl Malone",
      "Charles Barkley",
      "Dominique Wilkins",
      "Chris Webber"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Karl Malone was nicknamed 'The Mailman' because he always delivered.",
    "detailedExplanation": "Karl Malone earned the nickname 'The Mailman' because he consistently delivered outstanding performances throughout his career. Playing power forward for the Utah Jazz from 1985-2003, Malone formed one of the greatest duos in NBA history with point guard John Stockton. Malone is second all-time in career points scored and was a two-time NBA MVP, though he never won an NBA championship despite reaching the Finals twice with Utah.",
    "citationUrl": "https://en.wikipedia.org/wiki/Karl_Malone",
    "citationTitle": "Wikipedia: Karl Malone"
  },
  {
    "id": "30f165b0-4f40-4b03-9012-321e5cc73151",
    "text": "Which NBA legend wore jersey number 23 for most of his career but switched to number 45 during his brief comeback from baseball?",
    "options": [
      "LeBron James",
      "Michael Jordan",
      "Anthony Davis",
      "Draymond Green"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Michael Jordan wore 45 when he returned from his baseball retirement in 1995.",
    "detailedExplanation": "Michael Jordan famously wore number 23 throughout most of his career, but when he returned from his first retirement (during which he played minor league baseball) in March 1995, he initially wore number 45. Jordan chose 45 because he felt his number 23 should stay retired, and 45 was the number he wore in high school and baseball. However, he eventually switched back to 23 during the 1995 playoffs after a poor performance while wearing 45.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Jordan",
    "citationTitle": "Wikipedia: Michael Jordan"
  },
  {
    "id": "e41f1ec0-c9bc-4f8a-a3df-a9009cace898",
    "text": "Which NBA legend is credited with popularizing the 'no-look pass' and revolutionizing the point guard position in the 1980s?",
    "options": [
      "Isiah Thomas",
      "Magic Johnson",
      "John Stockton",
      "Gary Payton"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Magic Johnson was famous for his no-look passes and showtime style of play.",
    "detailedExplanation": "Magic Johnson revolutionized basketball with his flashy, entertaining style of play that became known as 'Showtime.' At 6'9\", he was unusually tall for a point guard and used his size and court vision to create spectacular plays, including his signature no-look passes that became a staple of the Los Angeles Lakers' fast-break offense. His style helped make basketball more popular and entertaining during the 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magic_Johnson",
    "citationTitle": "Wikipedia: Magic Johnson"
  },
  {
    "id": "3c20768f-f7cc-46ce-a299-ca89ed6475b6",
    "text": "Which NBA legend was known as 'The Black Mamba' and tragically died in a helicopter crash in 2020?",
    "options": [
      "Tracy McGrady",
      "Vince Carter",
      "Kobe Bryant",
      "Paul Pierce"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Kobe Bryant adopted 'The Black Mamba' persona and died in January 2020.",
    "detailedExplanation": "Kobe Bryant adopted the nickname 'The Black Mamba' during the latter part of his career, inspired by the deadly African snake known for its precision and killer instinct. Bryant used this persona to embody his relentless work ethic and competitive spirit. Tragically, Bryant died in a helicopter crash in Calabasas, California, on January 26, 2020, along with his daughter Gianna and seven others, shocking the basketball world and fans globally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kobe_Bryant",
    "citationTitle": "Wikipedia: Kobe Bryant"
  },
  {
    "id": "a391d7a5-aeae-4f64-bd93-9fe94efbf7b2",
    "text": "Which NBA legend famously guaranteed a victory before Game 6 of the 2012 Eastern Conference Finals and then delivered with a legendary performance?",
    "options": [
      "Kobe Bryant",
      "LeBron James",
      "Kevin Durant",
      "Dwyane Wade"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "LeBron James guaranteed a Game 6 victory and scored 45 points in Boston to force Game 7.",
    "detailedExplanation": "Before Game 6 of the 2012 Eastern Conference Finals against the Boston Celtics, with the Miami Heat facing elimination, LeBron James famously told his teammates and the media that they would win. He then backed up his words with one of the greatest performances in playoff history, scoring 45 points and grabbing 15 rebounds in a crucial 98-79 victory at TD Garden. This performance is often cited as one of the defining moments of LeBron's career and helped propel the Heat to their first championship of the Big Three era.",
    "citationUrl": "https://en.wikipedia.org/wiki/2012_NBA_playoffs",
    "citationTitle": "Wikipedia: 2012 NBA playoffs"
  },
  {
    "id": "6edd5fa1-5bdd-4084-a890-bc22daea5d16",
    "text": "Which NBA legend was the first player to be unanimously selected as MVP in league history?",
    "options": [
      "Michael Jordan",
      "LeBron James",
      "Stephen Curry",
      "Shaquille O'Neal"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Stephen Curry received all 131 first-place votes for the 2015-16 MVP award, making him the first unanimous MVP.",
    "detailedExplanation": "During the 2015-16 season, Stephen Curry led the Golden State Warriors to a record-breaking 73-9 regular season record while averaging 30.1 points, 5.4 rebounds, and 5.9 assists per game. His revolutionary three-point shooting and overall performance were so dominant that he became the first player in NBA history to receive every single first-place vote for the MVP award, earning all 131 votes from the media panel. This achievement highlighted just how transformative Curry's impact was on the game of basketball.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stephen_Curry",
    "citationTitle": "Wikipedia: Stephen Curry"
  },
  {
    "id": "1bd84e3d-9315-46bd-89de-e13ec3ae51ae",
    "text": "Which NBA legend holds the record for most consecutive games played, earning him the nickname 'The Iron Man'?",
    "options": [
      "Cal Ripken Jr.",
      "A.C. Green",
      "John Stockton",
      "Karl Malone"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "A.C. Green played in 1,192 consecutive NBA games from 1986 to 2001.",
    "detailedExplanation": "A.C. Green, who played primarily for the Los Angeles Lakers, holds the NBA record for most consecutive games played with 1,192 straight games from November 19, 1986, to April 18, 2001. This incredible streak spanned 15 seasons and earned him the nickname 'The Iron Man.' Green's durability was legendary in the NBA, as he never missed a game due to injury during this remarkable run. His streak is considered one of the most unbreakable records in professional sports, demonstrating extraordinary physical conditioning and mental toughness.",
    "citationUrl": "https://en.wikipedia.org/wiki/A._C._Green",
    "citationTitle": "Wikipedia: A. C. Green"
  },
  {
    "id": "5a5b6a39-6417-46e5-8baf-acfbb9c94899",
    "text": "Which NBA legend was the youngest player ever to reach 30,000 career points when he achieved the milestone at age 33?",
    "options": [
      "Kobe Bryant",
      "LeBron James",
      "Kevin Durant",
      "Carmelo Anthony"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "LeBron James reached 30,000 points at age 33 years and 24 days, making him the youngest to achieve this milestone.",
    "detailedExplanation": "On January 23, 2018, during a game against the San Antonio Spurs while playing for the Cleveland Cavaliers, LeBron James became the youngest player in NBA history to score 30,000 career points. He achieved this milestone at 33 years and 24 days old, breaking Kobe Bryant's previous record by more than a year. This accomplishment highlighted LeBron's incredible longevity and consistent scoring ability throughout his career, as he joined an exclusive club of only seven players (at the time) to reach 30,000 career points.",
    "citationUrl": "https://en.wikipedia.org/wiki/LeBron_James",
    "citationTitle": "Wikipedia: LeBron James"
  }
]