[
  {
    "id": "39ddb5be-ea6a-43a7-9f12-8d2675efeb61",
    "text": "Which amendment to the U.S. Constitution gave women the right to vote?",
    "options": [
      "18th Amendment",
      "19th Amendment",
      "20th Amendment",
      "21st Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 19th Amendment, ratified in 1920, granted women the right to vote.",
    "detailedExplanation": "The 19th Amendment to the United States Constitution prohibits the United States and its states from denying the right to vote to citizens of the United States on the basis of sex. It was passed by Congress on June 4, 1919, and ratified on August 18, 1920. The amendment was the culmination of decades of activism by the women's suffrage movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nineteenth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Nineteenth Amendment to the United States Constitution"
  },
  {
    "id": "ce8f59dc-89b3-4849-b4d6-d04ba591d000",
    "text": "How many amendments have been added to the U.S. Constitution?",
    "options": [
      "25",
      "26",
      "27",
      "28"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "There have been 27 amendments added to the U.S. Constitution since its ratification.",
    "detailedExplanation": "The United States Constitution has been amended 27 times since its original ratification in 1788. The first ten amendments, known as the Bill of Rights, were ratified in 1791. The most recent amendment, the 27th Amendment dealing with congressional pay changes, was ratified in 1992, despite being originally proposed in 1789.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_amendments_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: List of amendments to the United States Constitution"
  },
  {
    "id": "743fe3d3-4b8a-47df-a543-5b5432a57749",
    "text": "Which amendment repealed Prohibition in the United States?",
    "options": [
      "20th Amendment",
      "21st Amendment",
      "22nd Amendment",
      "23rd Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 21st Amendment repealed the 18th Amendment and ended Prohibition in 1933.",
    "detailedExplanation": "The 21st Amendment to the United States Constitution repealed the 18th Amendment to the United States Constitution, which had mandated nationwide prohibition on alcohol. The 21st Amendment was ratified on December 5, 1933, making it the only constitutional amendment to repeal another amendment entirely. It remains the only amendment to have been ratified by state ratifying conventions rather than state legislatures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-first_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-first Amendment to the United States Constitution"
  },
  {
    "id": "01148773-272c-487a-b8ca-15493fd9a730",
    "text": "What do the first ten amendments to the Constitution collectively known as?",
    "options": [
      "The Articles of Confederation",
      "The Bill of Rights",
      "The Declaration of Independence",
      "The Federalist Papers"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The first ten amendments are collectively called the Bill of Rights.",
    "detailedExplanation": "The United States Bill of Rights comprises the first ten amendments to the United States Constitution. Proposed following the often bitter 1787–88 debate over the ratification of the Constitution, these amendments were written to address the concerns of Anti-Federalists who feared that the new national government would be too powerful and threaten individual liberties. They guarantee specific rights and civil liberties to individuals.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_States_Bill_of_Rights",
    "citationTitle": "Wikipedia: United States Bill of Rights"
  },
  {
    "id": "e596f253-fce4-41bb-a4fc-f12870eb27f4",
    "text": "Which amendment established the federal income tax?",
    "options": [
      "15th Amendment",
      "16th Amendment",
      "17th Amendment",
      "18th Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 16th Amendment, ratified in 1913, gave Congress the power to levy income taxes.",
    "detailedExplanation": "The 16th Amendment to the United States Constitution allows Congress to levy an income tax without regard to the population of each state. It was ratified on February 3, 1913. Prior to this amendment, the Supreme Court had ruled that direct taxes needed to be apportioned among the states according to population, which made a federal income tax practically impossible to implement effectively.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sixteenth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Sixteenth Amendment to the United States Constitution"
  },
  {
    "id": "3f1d9ca9-a7ba-4f5d-8897-ead05fbc8b8d",
    "text": "Which amendment limited presidents to two terms in office?",
    "options": [
      "20th Amendment",
      "21st Amendment",
      "22nd Amendment",
      "23rd Amendment"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 22nd Amendment, ratified in 1951, limits presidents to two terms in office.",
    "detailedExplanation": "The 22nd Amendment to the United States Constitution limits the number of times a person is eligible for election to the office of President of the United States to two. It was passed by Congress in 1947 and ratified by the states on February 27, 1951. The amendment was largely a reaction to Franklin D. Roosevelt's four presidential election victories, breaking the two-term precedent set by George Washington.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-second_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-second Amendment to the United States Constitution"
  },
  {
    "id": "e88fa89d-33a4-48eb-89fd-b92fafaebe9d",
    "text": "Which amendment lowered the voting age to 18?",
    "options": [
      "24th Amendment",
      "25th Amendment",
      "26th Amendment",
      "27th Amendment"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 26th Amendment, ratified in 1971, lowered the voting age from 21 to 18.",
    "detailedExplanation": "The 26th Amendment to the United States Constitution prohibits the states and the federal government from using age as a reason for denying the right to vote to citizens of the United States who are at least eighteen years old. It was proposed by Congress on March 23, 1971, and ratified on July 1, 1971. The amendment was prompted by the Vietnam War, with the argument that those old enough to be drafted and fight should be old enough to vote.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-sixth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-sixth Amendment to the United States Constitution"
  },
  {
    "id": "6f3e3e76-72cd-4ff9-8334-38d35a796dc8",
    "text": "Which amendment abolished slavery in the United States?",
    "options": [
      "13th Amendment",
      "14th Amendment",
      "15th Amendment",
      "16th Amendment"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 13th Amendment, ratified in 1865, abolished slavery and involuntary servitude.",
    "detailedExplanation": "The 13th Amendment to the United States Constitution abolished slavery and involuntary servitude, except as punishment for a crime. It was passed by the Senate on April 8, 1864, by the House on January 31, 1865, and adopted by the states on December 6, 1865. This amendment was one of the three Reconstruction Amendments adopted in the five years following the American Civil War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thirteenth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Thirteenth Amendment to the United States Constitution"
  },
  {
    "id": "dfe1db09-2868-4bc0-aa29-de8edede45aa",
    "text": "Which amendment gave Congress the power to directly elect U.S. Senators instead of state legislatures choosing them?",
    "options": [
      "15th Amendment",
      "17th Amendment",
      "19th Amendment",
      "23rd Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 17th Amendment established direct election of U.S. Senators by popular vote.",
    "detailedExplanation": "Ratified in 1913, the 17th Amendment fundamentally changed how U.S. Senators are chosen by requiring direct election by the people of each state rather than appointment by state legislatures. This amendment was part of the Progressive Era reforms aimed at making government more democratic and reducing corruption in the Senate selection process.",
    "citationUrl": "https://en.wikipedia.org/wiki/Seventeenth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Seventeenth Amendment to the United States Constitution"
  },
  {
    "id": "dc6260c0-03fc-49d3-ab56-4df85b81f6ab",
    "text": "What is the minimum number of states required to ratify a constitutional amendment for it to become law?",
    "options": [
      "26 states",
      "34 states",
      "38 states",
      "42 states"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "38 states (three-fourths of the 50 states) must ratify an amendment for it to become part of the Constitution.",
    "detailedExplanation": "Article V of the Constitution requires that amendments be ratified by three-fourths of the states. With 50 states in the Union, this means 38 states must approve an amendment. This high threshold ensures that constitutional changes have broad national support and prevents a simple majority from easily altering the nation's fundamental law.",
    "citationUrl": "https://en.wikipedia.org/wiki/Article_Five_of_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Article Five of the United States Constitution"
  },
  {
    "id": "17efb4e3-b78e-4849-b9f6-15e70c532ad2",
    "text": "Which amendment prohibited the manufacture, sale, and transportation of alcoholic beverages?",
    "options": [
      "16th Amendment",
      "17th Amendment",
      "18th Amendment",
      "19th Amendment"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 18th Amendment established Prohibition, banning alcohol in the United States.",
    "detailedExplanation": "Ratified in 1919, the 18th Amendment ushered in the Prohibition era by banning the manufacture, sale, and transportation of intoxicating liquors. This amendment was unique as it was later completely repealed by the 21st Amendment in 1933, making it the only constitutional amendment to be entirely overturned by another amendment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eighteenth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Eighteenth Amendment to the United States Constitution"
  },
  {
    "id": "c7e7b434-6a6a-48d8-8f00-acf4ef4fdbd1",
    "text": "Which amendment guaranteed residents of Washington D.C. the right to vote in presidential elections?",
    "options": [
      "21st Amendment",
      "22nd Amendment",
      "23rd Amendment",
      "24th Amendment"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 23rd Amendment gave Washington D.C. electoral votes in presidential elections.",
    "detailedExplanation": "Ratified in 1961, the 23rd Amendment granted the District of Columbia the right to participate in presidential elections by allocating it electoral votes equal to the least populous state (currently three electoral votes). Before this amendment, D.C. residents, despite being U.S. citizens, could not vote for president because the District was not a state.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-third_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-third Amendment to the United States Constitution"
  },
  {
    "id": "3ca1d2e2-30e2-4bee-8221-12653560df2d",
    "text": "Which amendment prohibited poll taxes in federal elections?",
    "options": [
      "23rd Amendment",
      "24th Amendment",
      "25th Amendment",
      "26th Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 24th Amendment banned poll taxes in federal elections.",
    "detailedExplanation": "Ratified in 1964, the 24th Amendment eliminated poll taxes as a requirement for voting in federal elections. Poll taxes had been used, particularly in Southern states, as a way to prevent poor citizens, especially African Americans, from voting. This amendment was a significant step in ensuring equal voting rights regardless of economic status.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-fourth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-fourth Amendment to the United States Constitution"
  },
  {
    "id": "fee9d6c9-711b-410c-b173-9cf647f7d3c2",
    "text": "Which amendment established the procedures for presidential succession when the president becomes unable to perform their duties?",
    "options": [
      "22nd Amendment",
      "24th Amendment",
      "25th Amendment",
      "27th Amendment"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 25th Amendment outlines presidential succession and disability procedures.",
    "detailedExplanation": "Ratified in 1967, the 25th Amendment clarifies what happens when a president dies, resigns, or becomes incapacitated. It established procedures for the vice president to assume presidential duties and for filling vice presidential vacancies. This amendment was partly motivated by concerns following President Kennedy's assassination and has been invoked several times, including when presidents have undergone medical procedures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-fifth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-fifth Amendment to the United States Constitution"
  },
  {
    "id": "e423f08e-75df-413d-a9fd-631add0ca510",
    "text": "What is the most recent amendment to be ratified to the U.S. Constitution?",
    "options": [
      "25th Amendment",
      "26th Amendment",
      "27th Amendment",
      "28th Amendment"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 27th Amendment, dealing with congressional pay raises, was ratified in 1992.",
    "detailedExplanation": "The 27th Amendment, ratified in 1992, prevents Congress from giving itself immediate pay raises by requiring that any changes to congressional compensation take effect only after the next election of representatives. Interestingly, this amendment was originally proposed in 1789 as part of the original Bill of Rights but lay dormant for over 200 years before being rediscovered and ratified.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twenty-seventh_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twenty-seventh Amendment to the United States Constitution"
  },
  {
    "id": "498c1c48-989d-4225-a44f-a324d6603c53",
    "text": "How many methods does the Constitution provide for proposing amendments?",
    "options": [
      "One method",
      "Two methods",
      "Three methods",
      "Four methods"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Constitution provides two methods for proposing amendments.",
    "detailedExplanation": "Article V of the Constitution outlines two ways to propose amendments: either by a two-thirds vote in both houses of Congress, or by a constitutional convention called by two-thirds of state legislatures. While all current amendments have been proposed through the first method (Congressional approval), the second method of a constitutional convention has never been used, though it has been attempted several times in American history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Article_Five_of_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Article Five of the United States Constitution"
  },
  {
    "id": "d089cdf5-51b3-43dd-8e6c-ab8b641c1d19",
    "text": "Which amendment guarantees protection against unreasonable searches and seizures by the government?",
    "options": [
      "Second Amendment",
      "Fourth Amendment",
      "Sixth Amendment",
      "Eighth Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Fourth Amendment protects citizens from unreasonable searches and seizures.",
    "detailedExplanation": "The Fourth Amendment to the U.S. Constitution protects people from unreasonable searches and seizures by the government. It requires law enforcement to have probable cause and, in most cases, a warrant before searching someone's property or person. This amendment is a cornerstone of privacy rights and due process in the American legal system, establishing the principle that the government cannot arbitrarily invade citizens' privacy without proper legal justification.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fourth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Fourth Amendment to the United States Constitution"
  },
  {
    "id": "d8ce5196-2259-4a0d-aa21-7e38c01c458a",
    "text": "What fraction of state legislatures must vote to call for a constitutional convention to propose amendments?",
    "options": [
      "One-half",
      "Two-thirds",
      "Three-fourths",
      "Four-fifths"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Two-thirds of state legislatures can call for a constitutional convention to propose amendments.",
    "detailedExplanation": "Article V of the Constitution provides two methods for proposing amendments. While Congress can propose amendments with a two-thirds vote in both houses, the states can also initiate the amendment process by having two-thirds of state legislatures (34 states) call for a constitutional convention. This method has never been successfully used, though several attempts have come close. The convention method was included by the founders as a way for states to bypass Congress if needed to propose constitutional changes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Article_Five_of_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Article Five of the United States Constitution"
  },
  {
    "id": "ae9e7372-be99-4518-ba72-7cd4ba0d605e",
    "text": "Which amendment established that powers not specifically granted to the federal government are reserved to the states?",
    "options": [
      "Ninth Amendment",
      "Tenth Amendment",
      "Eleventh Amendment",
      "Twelfth Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Tenth Amendment reserves powers not granted to the federal government to the states and people.",
    "detailedExplanation": "The Tenth Amendment, ratified in 1791 as part of the Bill of Rights, states that powers not delegated to the United States by the Constitution, nor prohibited by it to the states, are reserved to the states respectively, or to the people. This amendment was designed to limit the federal government's power and ensure that states retained significant authority over their own affairs. It has been central to many debates about federalism and the balance of power between state and federal governments throughout American history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tenth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Tenth Amendment to the United States Constitution"
  },
  {
    "id": "895d91fb-4fa5-468f-ac65-09ec8a6c4af3",
    "text": "Which amendment changed the original method for electing the President and Vice President together?",
    "options": [
      "Eleventh Amendment",
      "Twelfth Amendment",
      "Thirteenth Amendment",
      "Fourteenth Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Twelfth Amendment modified the electoral process for President and Vice President.",
    "detailedExplanation": "The Twelfth Amendment, ratified in 1804, changed how the President and Vice President are elected by the Electoral College. Originally, electors cast two votes for President, with the runner-up becoming Vice President. This system created problems, particularly in 1796 when political rivals John Adams and Thomas Jefferson ended up as President and Vice President. The amendment requires electors to cast separate votes for President and Vice President, ensuring they can be from the same political party and work together effectively.",
    "citationUrl": "https://en.wikipedia.org/wiki/Twelfth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Twelfth Amendment to the United States Constitution"
  }
]