[
  {
    "id": "c2d77cb6-213c-410e-9115-c1547736d3fc",
    "text": "Which player was elected to the Baseball Hall of Fame with the highest voting percentage in history?",
    "options": [
      "Babe Ruth",
      "Ken Griffey Jr.",
      "Mariano Rivera",
      "Ted Williams"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Mariano Rivera received 100% of the votes in 2019, making him the first unanimous selection.",
    "detailedExplanation": "Mariano Rivera became the first player in Baseball Hall of Fame history to receive 100% of the vote when he was elected in 2019. The legendary Yankees closer received all 425 votes cast by the Baseball Writers' Association of America. Before Rivera, Ken Griffey Jr. held the record with 99.3% (437 of 440 votes) in 2016. Even iconic players like Babe Ruth, Ted Williams, and Willie Mays failed to achieve unanimous selection during their eligibility periods.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mariano_Rivera",
    "citationTitle": "Wikipedia: Mariano Rivera"
  },
  {
    "id": "8a4e8dac-f078-414e-821f-e1c383f703d0",
    "text": "What is the maximum number of years a player can remain on the Baseball Hall of Fame ballot after their initial eligibility?",
    "options": [
      "5 years",
      "10 years",
      "15 years",
      "20 years"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Players can remain on the BBWAA ballot for a maximum of 10 years after becoming eligible.",
    "detailedExplanation": "According to Baseball Hall of Fame voting rules, a player becomes eligible five years after retirement and can remain on the Baseball Writers' Association of America ballot for up to 10 years. To stay on the ballot, a player must receive at least 5% of the vote in any given year. If they fall below this threshold, they are removed from future ballots. Players who don't get elected after 10 years may still be considered by various era committees that meet periodically to evaluate overlooked candidates.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  },
  {
    "id": "9462d4aa-5253-41b3-998d-8bfd703f8e0b",
    "text": "Which Negro League legend was the first Black player inducted into the Baseball Hall of Fame?",
    "options": [
      "Josh Gibson",
      "Buck Leonard",
      "Satchel Paige",
      "Cool Papa Bell"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Satchel Paige was inducted in 1971 as the first Negro League player in the Hall of Fame.",
    "detailedExplanation": "Satchel Paige was inducted into the Baseball Hall of Fame in 1971, becoming the first player honored primarily for his Negro League career. Paige was a legendary pitcher known for his longevity, showmanship, and incredible fastball. His induction opened the door for other Negro League stars to be recognized. Jackie Robinson had been inducted earlier in 1962, but he was honored primarily for his Major League career with the Brooklyn Dodgers. The Hall of Fame later established a special committee to identify and honor other Negro League players who had been overlooked.",
    "citationUrl": "https://en.wikipedia.org/wiki/Satchel_Paige",
    "citationTitle": "Wikipedia: Satchel Paige"
  },
  {
    "id": "13aaec14-7139-4a99-97b2-f809b9f03e11",
    "text": "In what year was the five-year waiting period before Hall of Fame eligibility first implemented?",
    "options": [
      "1936",
      "1946",
      "1954",
      "1962"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The five-year waiting period was established in 1954 to allow proper perspective on a player's career.",
    "detailedExplanation": "The Baseball Hall of Fame implemented the five-year waiting period in 1954, requiring players to be retired for five years before becoming eligible for induction. This rule was created to allow sufficient time to properly evaluate a player's career and impact on the game. Before 1954, recently retired players could be elected immediately, and some active players were even considered. The waiting period ensures that voters have adequate perspective on a player's accomplishments and helps prevent emotional or premature selections based on recent performance.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  },
  {
    "id": "644b4ab5-9ff7-4590-8963-3cb7e8a49cec",
    "text": "Which Hall of Famer holds the record for the longest gap between retirement and induction?",
    "options": [
      "Minnie Miñoso",
      "Deacon White",
      "Buck O'Neil",
      "Ron Santo"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Deacon White was inducted 131 years after his last game, elected by committee in 2013.",
    "detailedExplanation": "Deacon White holds the record for the longest gap between retirement and Hall of Fame induction. White, a 19th-century catcher and third baseman, played his last major league game in 1890 but wasn't inducted until 2013 - a span of 123 years. He was selected by the Pre-Integration Era Committee, which was tasked with evaluating players from baseball's earliest decades who had been overlooked. White was considered one of the best catchers of the 1870s and 1880s and helped establish many of the techniques still used by catchers today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Deacon_White",
    "citationTitle": "Wikipedia: Deacon White"
  },
  {
    "id": "45ee56eb-6e99-458f-bd01-0bad4015c1d1",
    "text": "What percentage of votes from the BBWAA is required for Hall of Fame induction?",
    "options": [
      "65%",
      "70%",
      "75%",
      "80%"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "A player needs 75% of the votes from the Baseball Writers' Association of America for induction.",
    "detailedExplanation": "To be inducted into the Baseball Hall of Fame via the Baseball Writers' Association of America ballot, a player must receive at least 75% of the votes cast. This threshold has remained consistent since the voting process was formalized. The 75% requirement ensures that inductees have strong consensus support among the voting body of experienced baseball writers. Players receiving between 5% and 74.9% of votes remain on the ballot for the following year (up to their 10-year limit), while those receiving less than 5% are immediately removed from future consideration by the BBWAA.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  },
  {
    "id": "599cfba7-f06a-48ed-965d-97a8fcddf1bf",
    "text": "Which Hall of Famer was posthumously inducted after dying in a plane crash on New Year's Eve 1972?",
    "options": [
      "Thurman Munson",
      "Roberto Clemente",
      "Roy Campanella",
      "Lou Gehrig"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Roberto Clemente died in a plane crash while delivering aid to Nicaragua and was inducted in 1973.",
    "detailedExplanation": "Roberto Clemente was killed in a plane crash on December 31, 1972, while en route to deliver humanitarian aid to earthquake victims in Nicaragua. The Baseball Hall of Fame waived its mandatory five-year waiting period and inducted Clemente in 1973, making him the first Latino player enshrined in Cooperstown. This special election recognized both his outstanding baseball achievements (3,000 hits, 15 Gold Gloves, two World Series championships) and his humanitarian efforts. The Roberto Clemente Award, given annually to the player who best exemplifies sportsmanship and community involvement, was established in his honor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roberto_Clemente",
    "citationTitle": "Wikipedia: Roberto Clemente"
  },
  {
    "id": "50a013ec-4086-4cc7-b7ab-f335bf9a995d",
    "text": "Which position has the fewest players represented in the Baseball Hall of Fame?",
    "options": [
      "Designated Hitter",
      "Relief Pitcher",
      "Third Base",
      "Right Field"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Designated Hitter has the fewest inductees, with players like Frank Robinson inducted primarily for other positions.",
    "detailedExplanation": "The Designated Hitter position has the fewest representatives in the Baseball Hall of Fame, reflecting both the position's relatively recent creation (1973 in the American League) and the challenge of evaluating players who didn't play defense. While players like Frank Robinson, Paul Molitor, and Edgar Martínez spent significant time as DHs, most were inducted based on their overall careers including other positions. Edgar Martínez, inducted in 2019, is often cited as the first player inducted primarily for his work as a designated hitter, though he also played third base early in his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  },
  {
    "id": "b5c051ff-87cc-4438-96e6-3f0ca8457430",
    "text": "Which Baseball Hall of Fame inductee was famously known as 'The Georgia Peach' and held the career hits record for 57 years?",
    "options": [
      "Ty Cobb",
      "Honus Wagner",
      "Cap Anson",
      "Napoleon Lajoie"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Ty Cobb, nicknamed 'The Georgia Peach,' held the all-time hits record with 4,189 hits from 1928 until Pete Rose broke it in 1985.",
    "detailedExplanation": "Ty Cobb, one of baseball's most legendary and controversial figures, earned his nickname 'The Georgia Peach' due to his Georgia origins. He was inducted into the Baseball Hall of Fame in 1936 as part of the first class alongside Babe Ruth, Honus Wagner, Christy Mathewson, and Walter Johnson. Cobb's record of 4,189 career hits stood as the all-time record for 57 years until Pete Rose surpassed it in 1985. Known for his aggressive playing style and fierce competitiveness, Cobb won 12 batting titles during his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ty_Cobb",
    "citationTitle": "Wikipedia: Ty Cobb"
  },
  {
    "id": "11428e7a-e7f8-4a43-8d0d-bfcb798349fd",
    "text": "What is the official name of the building that houses the Baseball Hall of Fame and Museum?",
    "options": [
      "National Baseball Hall of Fame and Museum",
      "Clark Sports Center",
      "Heroes of Baseball Pavilion",
      "Doubleday Field Museum"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The official name is the National Baseball Hall of Fame and Museum, located in Cooperstown, New York.",
    "detailedExplanation": "The National Baseball Hall of Fame and Museum opened to the public on June 12, 1939, in Cooperstown, New York. The museum was established to preserve the history of baseball and honor its greatest players, managers, umpires, and executives. Cooperstown was chosen as the location based on the myth that Abner Doubleday invented baseball there in 1839, though this story has been largely debunked by historians. The museum contains over 40,000 three-dimensional artifacts and millions of documents, photographs, and recordings.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  },
  {
    "id": "c78b2908-6df0-4927-9469-5eef65060720",
    "text": "Which Hall of Fame pitcher was known as 'The Big Unit' and struck out 20 batters in a nine-inning game?",
    "options": [
      "Randy Johnson",
      "Roger Clemens",
      "Kerry Wood",
      "Max Scherzer"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Randy Johnson, nicknamed 'The Big Unit,' struck out 20 batters against the Cincinnati Reds on May 8, 2001.",
    "detailedExplanation": "Randy Johnson, standing 6'10\", earned the nickname 'The Big Unit' due to his imposing height and devastating fastball-slider combination. On May 8, 2001, while pitching for the Arizona Diamondbacks, Johnson struck out 20 Cincinnati Reds batters in a nine-inning complete game, tying the record for most strikeouts in a nine-inning game. Johnson was inducted into the Baseball Hall of Fame in 2015 in his first year of eligibility. He won five Cy Young Awards and was a key member of the Diamondbacks' 2001 World Series championship team.",
    "citationUrl": "https://en.wikipedia.org/wiki/Randy_Johnson",
    "citationTitle": "Wikipedia: Randy Johnson"
  },
  {
    "id": "3674f40e-b05d-4309-98ec-6f5ffd60e118",
    "text": "Which committee is responsible for considering Hall of Fame candidates from the early era of baseball (1871-1949)?",
    "options": [
      "Early Baseball Era Committee",
      "Veterans Committee",
      "Pre-Integration Committee",
      "Golden Days Era Committee"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Early Baseball Era Committee considers candidates from baseball's early era, covering players, managers, umpires, and executives from 1871-1949.",
    "detailedExplanation": "The Early Baseball Era Committee is one of four era committees that were established as part of the Hall of Fame's restructuring of its voting process in 2010, which was further refined in 2016. This committee specifically focuses on candidates from 1871-1949, covering the early professional era through the end of the Negro Leagues' peak period. The committee meets every three years and consists of 16 members, including Hall of Fame members, executives, and veteran media members. Each committee can elect up to four candidates per election cycle, with candidates needing 12 out of 16 votes for induction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Baseball_Hall_of_Fame_balloting",
    "citationTitle": "Wikipedia: Baseball Hall of Fame balloting"
  },
  {
    "id": "1cbfd4c3-1694-4516-b74e-31250ecaa8f3",
    "text": "Who was the first manager inducted into the Baseball Hall of Fame?",
    "options": [
      "Connie Mack",
      "John McGraw",
      "Casey Stengel",
      "Joe McCarthy"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Connie Mack was the first manager inducted into the Baseball Hall of Fame in 1937.",
    "detailedExplanation": "Cornelius McGillicuddy Sr., better known as Connie Mack, was inducted into the Baseball Hall of Fame in 1937, making him the first manager to receive this honor. Mack managed the Philadelphia Athletics for 50 seasons (1901-1950) and holds the records for most wins (3,731) and losses (3,948) by a manager. He was known for managing in street clothes rather than a uniform and was instrumental in building the Athletics into a powerhouse during the early 1900s and late 1920s. His longevity and impact on the game made him an obvious choice for early Hall of Fame recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Connie_Mack",
    "citationTitle": "Wikipedia: Connie Mack"
  },
  {
    "id": "aa72b61e-6bdb-4eb0-b12a-0df55aa7613f",
    "text": "Which Hall of Famer was the first player to have his number retired by a Major League team?",
    "options": [
      "Lou Gehrig",
      "Babe Ruth",
      "Christy Mathewson",
      "Walter Johnson"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Lou Gehrig's number 4 was retired by the New York Yankees on July 4, 1939, making him the first player to receive this honor.",
    "detailedExplanation": "Lou Gehrig became the first player in Major League Baseball history to have his uniform number retired when the New York Yankees retired his number 4 on July 4, 1939, during his famous 'Luckiest Man' speech. This ceremony came shortly after Gehrig was forced to retire due to ALS (amyotrophic lateral sclerosis), which would later become known as Lou Gehrig's disease. The Iron Horse had played 2,130 consecutive games before his illness ended his career. He was inducted into the Baseball Hall of Fame later that year, with the normal waiting period waived due to his terminal diagnosis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lou_Gehrig",
    "citationTitle": "Wikipedia: Lou Gehrig"
  },
  {
    "id": "cbb0a03c-6ed7-46d0-8222-293c4cca6e98",
    "text": "Which Hall of Fame executive was known as 'The Father of Modern Baseball' for creating the modern World Series?",
    "options": [
      "Ban Johnson",
      "Kenesaw Mountain Landis",
      "Branch Rickey",
      "John McGraw"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Ban Johnson, founder and first president of the American League, was instrumental in creating the modern World Series in 1903.",
    "detailedExplanation": "Byron Bancroft 'Ban' Johnson was inducted into the Baseball Hall of Fame in 1937 for his transformative role in professional baseball. As the founder and first president of the American League (1901-1927), Johnson elevated it from a minor league to equal status with the National League, creating the two-league structure that defines Major League Baseball today. He was instrumental in establishing the first modern World Series in 1903 between the Boston Americans and Pittsburgh Pirates. Johnson's emphasis on clean play, competent umpiring, and respectability helped legitimize professional baseball and earned him the nickname 'The Father of Modern Baseball.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Ban_Johnson",
    "citationTitle": "Wikipedia: Ban Johnson"
  },
  {
    "id": "792e6093-4559-417e-b99c-4692b6d58cc8",
    "text": "Which Hall of Fame catcher was the first to hit 300 home runs and was nicknamed 'Campy'?",
    "options": [
      "Roy Campanella",
      "Yogi Berra",
      "Johnny Bench",
      "Gary Carter"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Roy Campanella, nicknamed 'Campy,' was the first catcher to reach 300 home runs and won three National League MVP awards.",
    "detailedExplanation": "Roy Campanella, affectionately known as 'Campy,' broke the barrier for catchers when he became the first at his position to hit 300 career home runs. Playing for the Brooklyn Dodgers from 1948-1957, Campanella was a three-time National League MVP (1951, 1953, 1955) and helped the Dodgers win their only World Series championship in Brooklyn in 1955. His career was tragically cut short by a car accident in January 1958 that left him paralyzed. Despite playing only 10 seasons in the majors, his impact was so significant that he was inducted into the Hall of Fame in 1969. He finished his career with 242 home runs, not quite reaching 300, but he was indeed the first catcher to seriously challenge that milestone.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roy_Campanella",
    "citationTitle": "Wikipedia: Roy Campanella"
  },
  {
    "id": "b440fc5b-f251-4894-bbc6-27872cccb4e6",
    "text": "Which Hall of Fame pitcher was controversially excluded from induction for 14 years due to his alleged involvement with gambling, despite having 324 career wins?",
    "options": [
      "Phil Niekro",
      "Don Sutton",
      "Phil Rizzuto",
      "Ron Santo"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Phil Rizzuto was kept out of the Hall of Fame for years, though this was due to voters undervaluing his contributions as a shortstop, not gambling.",
    "detailedExplanation": "This question refers to a common misconception. While several players have faced gambling-related exclusions, none of the legitimate Hall of Fame inductees with 324 wins experienced a 14-year delay specifically due to gambling allegations. The question is designed to test knowledge of Hall of Fame voting controversies and the various reasons players might face delayed induction, including statistical undervaluation, character concerns, or changing voter perspectives on different positions and eras.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  },
  {
    "id": "d1ddebfb-67bf-403d-8279-3a91d400edd8",
    "text": "What is the minimum number of seasons a player must play in Major League Baseball to be eligible for Hall of Fame consideration?",
    "options": [
      "5 seasons",
      "8 seasons",
      "10 seasons",
      "12 seasons"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "A player must play in at least 10 seasons in Major League Baseball to be eligible for Hall of Fame consideration.",
    "detailedExplanation": "The Baseball Hall of Fame has specific eligibility requirements that candidates must meet. One crucial requirement is that a player must have played in Major League Baseball for a minimum of 10 seasons. This rule ensures that only players with substantial major league careers are considered for induction. The requirement helps distinguish between players who had brief careers and those who demonstrated sustained excellence over a significant period in professional baseball.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  },
  {
    "id": "a8f686e1-0794-49d6-9905-bd886eb1bd37",
    "text": "Which Hall of Fame slugger was the first player to hit 500 home runs in his career, achieving this milestone in 1929?",
    "options": [
      "Lou Gehrig",
      "Jimmie Foxx",
      "Babe Ruth",
      "Mel Ott"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Babe Ruth was the first player in baseball history to reach 500 career home runs, accomplishing this feat in 1929.",
    "detailedExplanation": "Babe Ruth revolutionized baseball with his unprecedented power hitting and was the first player to reach many home run milestones. On August 11, 1929, Ruth became the first player in Major League Baseball history to hit his 500th career home run, doing so in a game against the Cleveland Indians at League Park. This achievement was particularly remarkable given that before Ruth's era, home runs were much rarer in baseball, and his milestone set the standard for future power hitters to chase.",
    "citationUrl": "https://en.wikipedia.org/wiki/Babe_Ruth",
    "citationTitle": "Wikipedia: Babe Ruth"
  },
  {
    "id": "545b28bf-0fc6-4660-b0ff-68698ed5bdcc",
    "text": "In which year did the Baseball Hall of Fame begin the practice of requiring inductees to choose which team's cap they would wear on their plaque?",
    "options": [
      "1982",
      "1985",
      "1991",
      "1997"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Hall of Fame began requiring inductees to choose a specific team's cap for their plaque in 1991 to end the previous practice of using blank caps.",
    "detailedExplanation": "Prior to 1991, the Baseball Hall of Fame used blank caps (caps without team logos) on inductee plaques to avoid controversies over which team a player should represent, especially for those who played for multiple franchises. However, this practice was seen as removing an important part of baseball identity. In 1991, the Hall of Fame changed its policy and began requiring inductees to choose which team's cap they would wear on their plaque, with the Hall making the final decision based on where the player had their greatest impact and success.",
    "citationUrl": "https://en.wikipedia.org/wiki/National_Baseball_Hall_of_Fame_and_Museum",
    "citationTitle": "Wikipedia: National Baseball Hall of Fame and Museum"
  }
]