[
  {
    "id": "7436c5c3-e682-4ab4-bd65-2672e8bd9d84",
    "text": "In Korematsu v. United States (1944), which Justice wrote the sole dissent calling the internment of Japanese Americans 'one of the most sweeping and complete deprivations of constitutional rights'?",
    "options": [
      "Justice Robert Jackson",
      "Justice Owen Roberts",
      "Justice Frank Murphy",
      "Justice Hugo Black"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Justice Frank Murphy wrote the passionate dissent comparing the internment to racism and calling it a deprivation of constitutional rights.",
    "detailedExplanation": "In Korematsu v. United States, the Supreme Court upheld the internment of Japanese Americans during World War II in a 6-3 decision. Justice Frank Murphy wrote one of three dissents, but his was particularly forceful, calling the majority decision a 'legalization of racism' and stating it represented 'one of the most sweeping and complete deprivations of constitutional rights in the history of this nation in the absence of martial law.' Murphy's dissent has been vindicated by history, and the Korematsu decision is now widely regarded as one of the Court's worst rulings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Korematsu_v._United_States",
    "citationTitle": "Wikipedia: Korematsu v. United States"
  },
  {
    "id": "eb39a5f8-ed3e-4a04-ad74-4e51dd028e6d",
    "text": "Which Supreme Court case established the 'clear and present danger' test for restricting free speech, arising from prosecutions under the Espionage Act during World War I?",
    "options": [
      "Gitlow v. New York",
      "Schenck v. United States",
      "Dennis v. United States",
      "Brandenburg v. Ohio"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Schenck v. United States (1919) established the 'clear and present danger' test when upholding the conviction of a socialist for distributing anti-draft leaflets.",
    "detailedExplanation": "Schenck v. United States (1919) involved Charles Schenck, who was convicted under the Espionage Act for distributing leaflets urging resistance to the military draft during World War I. Justice Oliver Wendell Holmes Jr. wrote the unanimous opinion establishing the 'clear and present danger' test, arguing that speech could be restricted when it presents a clear and present danger of bringing about substantive evils that Congress has a right to prevent. Holmes famously wrote that free speech would not protect someone 'falsely shouting fire in a theatre and causing a panic,' creating one of the most quoted phrases in First Amendment jurisprudence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Schenck_v._United_States",
    "citationTitle": "Wikipedia: Schenck v. United States"
  },
  {
    "id": "d1af65d8-13a0-4821-b8c1-d6cb2fbe8c40",
    "text": "In Citizens United v. FEC (2010), the Court overturned which previous case that had allowed restrictions on corporate expenditures in federal elections?",
    "options": [
      "Buckley v. Valeo",
      "Austin v. Michigan Chamber of Commerce",
      "McConnell v. FEC",
      "FEC v. Wisconsin Right to Life"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Citizens United explicitly overturned Austin v. Michigan Chamber of Commerce (1990), which had upheld restrictions on corporate expenditures in elections.",
    "detailedExplanation": "In Citizens United v. FEC (2010), the Supreme Court ruled 5-4 that corporations and unions have the same First Amendment rights as individuals to spend money on elections. The decision explicitly overturned Austin v. Michigan Chamber of Commerce (1990), which had upheld a Michigan law prohibiting corporations from using treasury funds for independent expenditures in state elections. The Citizens United decision also overturned part of McConnell v. FEC (2003), but Austin was the primary precedent being reversed. The ruling was highly controversial and fundamentally changed campaign finance law by allowing unlimited independent political expenditures by corporations and unions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Citizens_United_v._FEC",
    "citationTitle": "Wikipedia: Citizens United v. FEC"
  },
  {
    "id": "a59d79df-93d8-4627-9429-fd498da927ea",
    "text": "Which Supreme Court case established that police officers need a warrant to search the digital contents of a cell phone incident to arrest?",
    "options": [
      "United States v. Jones",
      "Kyllo v. United States",
      "Riley v. California",
      "Carpenter v. United States"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Riley v. California (2014) unanimously held that police generally need a warrant to search digital information on cell phones seized during arrests.",
    "detailedExplanation": "Riley v. California (2014) was a landmark unanimous decision that addressed Fourth Amendment protections in the digital age. The case consolidated two separate incidents where police searched cell phones without warrants during arrests. Chief Justice John Roberts wrote the opinion, establishing that the digital contents of cell phones cannot be searched without a warrant, even when the phone is seized during a lawful arrest. The Court recognized that modern cell phones contain vast amounts of personal information and that the traditional exceptions to the warrant requirement for searches incident to arrest do not apply to digital data, marking a significant victory for privacy rights in the digital era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Riley_v._California",
    "citationTitle": "Wikipedia: Riley v. California"
  },
  {
    "id": "77d9d1ef-bb07-40e6-877d-43c078dcb405",
    "text": "In Bush v. Gore (2000), how many justices joined the per curiam opinion that effectively decided the presidential election?",
    "options": [
      "Five justices",
      "Six justices",
      "Seven justices",
      "The opinion was unsigned"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Five justices joined the per curiam opinion stopping the Florida recount, with four justices dissenting in separate opinions.",
    "detailedExplanation": "Bush v. Gore (2000) resulted in a highly controversial 5-4 decision that effectively determined the outcome of the 2000 presidential election. The per curiam (unsigned) opinion was joined by five justices: Chief Justice William Rehnquist and Justices Sandra Day O'Connor, Antonin Scalia, Anthony Kennedy, and Clarence Thomas. The decision held that the Florida Supreme Court's method for recounting ballots violated the Equal Protection Clause and that no alternative method could be established within the legal deadline. Four justices dissented in separate opinions: John Paul Stevens, David Souter, Ruth Bader Ginsburg, and Stephen Breyer, with some arguing that the Court should not have taken the case at all.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bush_v._Gore",
    "citationTitle": "Wikipedia: Bush v. Gore"
  },
  {
    "id": "18a7b690-0b5a-4c23-9736-e4b13e0882f2",
    "text": "Which Supreme Court case established the doctrine of 'substantive due process' by striking down a New York law regulating working hours for bakers?",
    "options": [
      "Muller v. Oregon",
      "Adkins v. Children's Hospital",
      "Lochner v. New York",
      "West Coast Hotel Co. v. Parrish"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Lochner v. New York (1905) struck down maximum hour laws for bakers, establishing the controversial 'substantive due process' doctrine protecting economic rights.",
    "detailedExplanation": "Lochner v. New York (1905) was a pivotal case in which the Supreme Court struck down a New York law that limited bakers' working hours to 60 hours per week and 10 hours per day. The 5-4 majority held that the law violated the 'liberty of contract' protected by the Fourteenth Amendment's Due Process Clause, establishing the doctrine of substantive due process in economic matters. This decision ushered in the 'Lochner era' (roughly 1897-1937), during which the Court frequently struck down progressive legislation regulating working conditions, minimum wages, and other economic reforms. The case is now generally viewed as judicial overreach, and the Lochner era ended with cases like West Coast Hotel Co. v. Parrish (1937).",
    "citationUrl": "https://en.wikipedia.org/wiki/Lochner_v._New_York",
    "citationTitle": "Wikipedia: Lochner v. New York"
  },
  {
    "id": "ac18f200-a33f-4493-b119-f112bfcb0e89",
    "text": "In Youngstown Sheet & Tube Co. v. Sawyer (1952), the Supreme Court rejected President Truman's claim of inherent executive power during which conflict?",
    "options": [
      "World War II",
      "The Cold War",
      "The Korean War",
      "The Berlin Crisis"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Steel Seizure Case arose when Truman seized steel mills during the Korean War to prevent a strike that would disrupt steel production for the war effort.",
    "detailedExplanation": "Youngstown Sheet & Tube Co. v. Sawyer (1952), also known as the Steel Seizure Case, arose during the Korean War when President Harry Truman ordered the seizure of steel mills to prevent a nationwide strike that would have disrupted steel production needed for the war effort. The Supreme Court ruled 6-3 that Truman lacked the constitutional authority to seize the mills without explicit congressional authorization. Justice Hugo Black wrote the majority opinion rejecting Truman's claims of inherent executive power, while Justice Robert Jackson's influential concurrence established a three-part framework for analyzing presidential power that continues to be cited today. The case established important limits on presidential power during wartime.",
    "citationUrl": "https://en.wikipedia.org/wiki/Youngstown_Sheet_%26_Tube_Co._v._Sawyer",
    "citationTitle": "Wikipedia: Youngstown Sheet & Tube Co. v. Sawyer"
  },
  {
    "id": "9cb771ba-b86e-4698-a95d-ce9dad19176a",
    "text": "Which Supreme Court case established the 'incorporation doctrine' by applying the First Amendment's protection of free speech to state governments for the first time?",
    "options": [
      "Barron v. Baltimore",
      "Gitlow v. New York",
      "Palko v. Connecticut",
      "Mapp v. Ohio"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Gitlow v. New York (1925) was the first case to apply a Bill of Rights provision to state governments through the Fourteenth Amendment's Due Process Clause.",
    "detailedExplanation": "Gitlow v. New York (1925) marked a revolutionary moment in constitutional law by establishing the incorporation doctrine, which applies Bill of Rights protections to state and local governments through the Fourteenth Amendment. Benjamin Gitlow was convicted under New York's Criminal Anarchy Act for publishing socialist materials. While the Court upheld his conviction, it assumed 'for present purposes' that the First Amendment's free speech protections applied to state governments via the Fourteenth Amendment's Due Process Clause. This seemingly casual assumption fundamentally changed American constitutional law, beginning the process of incorporating most Bill of Rights protections against state action, which previously had only applied to the federal government since Barron v. Baltimore (1833).",
    "citationUrl": "https://en.wikipedia.org/wiki/Gitlow_v._New_York",
    "citationTitle": "Wikipedia: Gitlow v. New York"
  },
  {
    "id": "7855677b-a074-4b3d-a1d2-c84e2df8b70e",
    "text": "In Miranda v. Arizona (1966), Chief Justice Earl Warren's majority opinion established the famous 'Miranda rights.' Which specific amendment did the Court primarily rely upon for this decision?",
    "options": [
      "Fourth Amendment",
      "Fifth Amendment",
      "Sixth Amendment",
      "Eighth Amendment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Court based Miranda rights on the Fifth Amendment's protection against self-incrimination.",
    "detailedExplanation": "In Miranda v. Arizona, the Supreme Court ruled 5-4 that suspects must be informed of their constitutional rights before police interrogation. Chief Justice Warren's majority opinion grounded this requirement in the Fifth Amendment's Self-Incrimination Clause, which protects individuals from being compelled to testify against themselves. The Court determined that the coercive atmosphere of custodial interrogation required specific procedural safeguards to preserve this constitutional protection.",
    "citationUrl": "https://en.wikipedia.org/wiki/Miranda_v._Arizona",
    "citationTitle": "Wikipedia: Miranda v. Arizona"
  },
  {
    "id": "775ce3fb-b657-4596-8d81-142d2e902e2e",
    "text": "Which Supreme Court case established the principle of judicial review, allowing federal courts to declare acts of Congress unconstitutional?",
    "options": [
      "McCulloch v. Maryland (1819)",
      "Marbury v. Madison (1803)",
      "Fletcher v. Peck (1810)",
      "Martin v. Hunter's Lessee (1816)"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Marbury v. Madison established judicial review when Chief Justice Marshall declared a portion of the Judiciary Act unconstitutional.",
    "detailedExplanation": "Marbury v. Madison (1803) is arguably the most important case in Supreme Court history, as it established the principle of judicial review - the power of federal courts to review and strike down laws that violate the Constitution. Chief Justice John Marshall's opinion declared that a section of the Judiciary Act of 1789 was unconstitutional, marking the first time the Court had invalidated a federal law. This decision fundamentally shaped the balance of power among the three branches of government.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marbury_v._Madison",
    "citationTitle": "Wikipedia: Marbury v. Madison"
  },
  {
    "id": "65705f22-c9c5-4999-b256-cf30688a0c48",
    "text": "In New York Times Co. v. Sullivan (1964), what legal standard did the Supreme Court establish for public officials suing media outlets for defamation?",
    "options": [
      "Reasonable doubt",
      "Clear and convincing evidence",
      "Actual malice",
      "Preponderance of evidence"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Court established the 'actual malice' standard, requiring proof that statements were made with knowledge of falsity or reckless disregard for truth.",
    "detailedExplanation": "New York Times Co. v. Sullivan revolutionized First Amendment law by establishing the 'actual malice' standard for defamation cases involving public officials. The Court ruled unanimously that public officials cannot recover damages for defamatory statements unless they prove the statements were made with 'actual malice' - meaning with knowledge that they were false or with reckless disregard of whether they were false or not. This landmark decision significantly strengthened press freedom and made it much harder for public figures to successfully sue for libel.",
    "citationUrl": "https://en.wikipedia.org/wiki/New_York_Times_Co._v._Sullivan",
    "citationTitle": "Wikipedia: New York Times Co. v. Sullivan"
  },
  {
    "id": "d19cd46a-6e91-4fc1-8054-602439d7d8bd",
    "text": "Which Supreme Court case upheld the constitutionality of Social Security by ruling that Congress has broad power to tax and spend for the general welfare?",
    "options": [
      "Helvering v. Davis (1937)",
      "United States v. Butler (1936)",
      "Steward Machine Co. v. Davis (1937)",
      "NLRB v. Jones & Laughlin Steel Corp. (1937)"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Helvering v. Davis upheld Social Security's old-age benefits program under Congress's taxing and spending powers.",
    "detailedExplanation": "Helvering v. Davis (1937) was a crucial New Deal case that upheld the constitutionality of Social Security's old-age benefits program. Justice Benjamin Cardozo's majority opinion ruled that Congress has broad authority under the General Welfare Clause to tax and spend for the general welfare, and that Social Security fell within this power. The decision came during the Court's famous 'switch in time that saved nine,' when the Court began upholding New Deal programs after initially striking many down, possibly in response to FDR's court-packing plan.",
    "citationUrl": "https://en.wikipedia.org/wiki/Helvering_v._Davis",
    "citationTitle": "Wikipedia: Helvering v. Davis"
  },
  {
    "id": "4502d8f2-6e43-4b6d-a1a4-895c393fe588",
    "text": "In Griswold v. Connecticut (1965), Justice William O. Douglas located the constitutional right to privacy in which concept?",
    "options": [
      "Substantive due process",
      "Penumbras of the Bill of Rights",
      "Equal protection clause",
      "Privileges and immunities"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Douglas argued that privacy rights existed in the 'penumbras' or shadows cast by various Bill of Rights guarantees.",
    "detailedExplanation": "Griswold v. Connecticut struck down a state law banning contraceptives for married couples, establishing a constitutional right to privacy. Justice Douglas's majority opinion famously located this right not in any specific constitutional provision, but in the 'penumbras' - or zones of privacy - created by the 'emanations' from various Bill of Rights guarantees. This creative constitutional interpretation was controversial but became foundational for later privacy rights cases, including Roe v. Wade. The decision marked a significant expansion of individual liberty against government intrusion into personal relationships.",
    "citationUrl": "https://en.wikipedia.org/wiki/Griswold_v._Connecticut",
    "citationTitle": "Wikipedia: Griswold v. Connecticut"
  },
  {
    "id": "922d8af7-6de5-4278-9906-a38411874535",
    "text": "Which Supreme Court case established that criminal defendants have a constitutional right to legal counsel, even if they cannot afford an attorney?",
    "options": [
      "Powell v. Alabama (1932)",
      "Johnson v. Zerbst (1938)",
      "Gideon v. Wainwright (1963)",
      "Argersinger v. Hamlin (1972)"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Gideon v. Wainwright established the right to counsel for all felony defendants, overturning the previous case-by-case approach.",
    "detailedExplanation": "Gideon v. Wainwright (1963) was a landmark unanimous decision that established the constitutional right to legal counsel for all criminal defendants in felony cases, regardless of their ability to pay. The case involved Clarence Earl Gideon, who was forced to represent himself in a Florida burglary trial and was convicted. Justice Hugo Black's opinion held that the Sixth Amendment's guarantee of counsel is fundamental to a fair trial and applies to state courts through the Fourteenth Amendment. This decision overruled Betts v. Brady (1942) and led to the creation of public defender systems nationwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gideon_v._Wainwright",
    "citationTitle": "Wikipedia: Gideon v. Wainwright"
  },
  {
    "id": "0bc4e1ef-9be7-43f5-9c56-0c4bd3c92c98",
    "text": "In Wickard v. Filburn (1942), the Supreme Court ruled that Congress could regulate a farmer's wheat production under the Commerce Clause, even though he never sold the wheat. What was Roscoe Filburn doing with his excess wheat?",
    "options": [
      "Storing it for future sale",
      "Feeding it to his livestock",
      "Giving it to neighbors",
      "Exporting it overseas"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Filburn was using his excess wheat to feed his own livestock, but the Court ruled this still affected interstate commerce in the aggregate.",
    "detailedExplanation": "Wickard v. Filburn dramatically expanded Congress's Commerce Clause powers by ruling that even purely local, non-commercial activity could be regulated if it substantially affects interstate commerce when viewed in the aggregate. Roscoe Filburn grew wheat on his Ohio farm in excess of federal quotas, but used the surplus to feed his own livestock rather than selling it. The Court unanimously held that even this personal consumption affected the national wheat market because it reduced his need to purchase feed, and when multiplied across all farmers, could substantially impact interstate commerce.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wickard_v._Filburn",
    "citationTitle": "Wikipedia: Wickard v. Filburn"
  },
  {
    "id": "fc7162ed-d553-43d3-b173-956f41f146db",
    "text": "Which Supreme Court case established the 'exclusionary rule,' preventing prosecutors from using evidence obtained through illegal searches and seizures?",
    "options": [
      "Wolf v. Colorado (1949)",
      "Silverthorne Lumber Co. v. United States (1920)",
      "Mapp v. Ohio (1961)",
      "Terry v. Ohio (1968)"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Mapp v. Ohio applied the exclusionary rule to state courts, ruling that illegally obtained evidence cannot be used in criminal prosecutions.",
    "detailedExplanation": "Mapp v. Ohio (1961) was a pivotal Fourth Amendment case that applied the exclusionary rule to state criminal proceedings. The case involved Dollree Mapp, whose home was searched by Cleveland police without a proper warrant, leading to her conviction for possessing obscene materials. Justice Tom Clark's majority opinion ruled 6-3 that evidence obtained in violation of the Fourth Amendment cannot be used in state criminal prosecutions, extending the exclusionary rule (which previously applied only to federal courts) to all American courts. This decision significantly strengthened Fourth Amendment protections and changed police practices nationwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mapp_v._Ohio",
    "citationTitle": "Wikipedia: Mapp v. Ohio"
  },
  {
    "id": "7f6208e3-c3f6-433e-98e4-051c9a2f765f",
    "text": "In Worcester v. Georgia (1832), Chief Justice John Marshall ruled that Georgia had no authority to impose its laws on Cherokee territory. What was President Andrew Jackson's alleged response to this decision?",
    "options": [
      "John Marshall has made his decision; now let him enforce it!",
      "The Court has spoken, and we must obey the law of the land.",
      "This ruling threatens the very foundation of our Union.",
      "The Cherokee Nation shall have justice under federal protection."
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Jackson allegedly said 'John Marshall has made his decision; now let him enforce it!' expressing his defiance of the Court's ruling.",
    "detailedExplanation": "Worcester v. Georgia established that individual states could not impose their laws on Native American territory, as tribal nations were under federal jurisdiction. President Andrew Jackson reportedly responded with the famous quote expressing his intention to ignore the Supreme Court's decision, highlighting the early tensions between executive power and judicial authority. This case became a landmark example of a president defying the Supreme Court, though Jackson's administration ultimately forced the Cherokee removal through the Trail of Tears despite the Court's ruling in their favor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Worcester_v._Georgia",
    "citationTitle": "Wikipedia: Worcester v. Georgia"
  },
  {
    "id": "e3c616d9-70fe-4335-83bb-56284b7cd8bb",
    "text": "Which Supreme Court case established the 'separate but equal' doctrine that legally sanctioned racial segregation for nearly 60 years until Brown v. Board overturned it?",
    "options": [
      "Dred Scott v. Sandford (1857)",
      "Plessy v. Ferguson (1896)",
      "Slaughter-House Cases (1873)",
      "Civil Rights Cases (1883)"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Plessy v. Ferguson (1896) established the 'separate but equal' doctrine that justified racial segregation until Brown v. Board in 1954.",
    "detailedExplanation": "Plessy v. Ferguson arose when Homer Plessy, who was 7/8 white and 1/8 black, deliberately violated Louisiana's Separate Car Act by sitting in a whites-only railroad car. The Supreme Court ruled 7-1 that segregation was constitutional as long as facilities were 'separate but equal.' Justice John Marshall Harlan wrote the lone dissent, famously declaring that 'the Constitution is color-blind.' This decision provided the legal foundation for Jim Crow laws across the South and remained the law of the land until the Court reversed course in Brown v. Board of Education in 1954.",
    "citationUrl": "https://en.wikipedia.org/wiki/Plessy_v._Ferguson",
    "citationTitle": "Wikipedia: Plessy v. Ferguson"
  },
  {
    "id": "c9ec8672-bc7d-4726-a631-d645ff311cca",
    "text": "In Tinker v. Des Moines (1969), the Supreme Court ruled that students don't 'shed their constitutional rights at the schoolhouse gate.' What form of protest were the students engaging in?",
    "options": [
      "Refusing to stand for the Pledge of Allegiance",
      "Wearing black armbands to protest the Vietnam War",
      "Distributing anti-war pamphlets in hallways",
      "Organizing a walkout during morning announcements"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Students wore black armbands to school to protest the Vietnam War, which the Court ruled was protected symbolic speech.",
    "detailedExplanation": "The case began when Mary Beth Tinker, her brother John, and friend Christopher Eckhardt wore black armbands to school to protest American involvement in the Vietnam War. School officials, anticipating the protest, had preemptively banned armbands and suspended the students when they refused to remove them. The Supreme Court ruled 7-2 that students retain their First Amendment rights in school and that the armbands constituted symbolic speech protected by the Constitution. Justice Abe Fortas wrote the majority opinion establishing that student expression could only be restricted if it would 'substantially interfere' with the school environment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tinker_v._Des_Moines_Independent_Community_School_District",
    "citationTitle": "Wikipedia: Tinker v. Des Moines"
  },
  {
    "id": "283a83b2-facb-4e4d-aef8-95c35debae11",
    "text": "Which Supreme Court case established the principle that the death penalty, as then practiced, constituted 'cruel and unusual punishment' and effectively suspended all executions in the United States from 1972-1976?",
    "options": [
      "Gregg v. Georgia (1976)",
      "Furman v. Georgia (1972)",
      "Coker v. Georgia (1977)",
      "McCleskey v. Kemp (1987)"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Furman v. Georgia (1972) ruled that the death penalty as then applied was unconstitutional, leading to a nationwide moratorium on executions.",
    "detailedExplanation": "Furman v. Georgia was a landmark 5-4 decision where the Supreme Court ruled that the death penalty, as it was then being applied, violated the Eighth and Fourteenth Amendments. The Court found that capital punishment was being applied in an arbitrary and discriminatory manner, particularly against minorities and the poor. This decision effectively commuted the sentences of 629 death row inmates and led to a four-year moratorium on executions while states rewrote their capital punishment laws. The moratorium ended in 1976 with Gregg v. Georgia, which allowed states to resume executions under revised statutory frameworks that provided guided discretion to juries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Furman_v._Georgia",
    "citationTitle": "Wikipedia: Furman v. Georgia"
  }
]