[
  {
    "id": "96c20de7-5715-4b62-a8ce-67e1ae0ef717",
    "text": "Who co-founded Microsoft alongside Bill Gates in 1975?",
    "options": [
      "Steve Wozniak",
      "Paul Allen",
      "Steve Ballmer",
      "Larry Ellison"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Paul Allen co-founded Microsoft with Bill Gates in 1975.",
    "detailedExplanation": "Paul Allen and Bill Gates founded Microsoft together in Albuquerque, New Mexico in 1975. Allen was instrumental in the early development of Microsoft's programming languages and operating systems. He left Microsoft in 1982 due to health concerns but remained on the board of directors until 2000. Allen was also known for his philanthropic efforts and ownership of sports teams including the Seattle Seahawks and Portland Trail Blazers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paul_Allen",
    "citationTitle": "Wikipedia: Paul Allen"
  },
  {
    "id": "e9c0a854-dfb3-47cd-972b-88ebe99f65bb",
    "text": "Which tech company was founded by Larry Page and Sergey Brin?",
    "options": [
      "Yahoo",
      "Google",
      "Amazon",
      "eBay"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Google was founded by Larry Page and Sergey Brin in 1998.",
    "detailedExplanation": "Larry Page and Sergey Brin founded Google in 1998 while they were Ph.D. students at Stanford University. Their research project on a search engine called 'BackRub' evolved into Google, which was incorporated on September 4, 1998. The company started in a garage in Menlo Park, California, and has since grown to become one of the world's largest technology companies, now operating under parent company Alphabet Inc.",
    "citationUrl": "https://en.wikipedia.org/wiki/Google",
    "citationTitle": "Wikipedia: Google"
  },
  {
    "id": "c97bb7f3-effd-4133-a295-0eb253e54e26",
    "text": "Who is the founder and CEO of Tesla and SpaceX?",
    "options": [
      "Jeff Bezos",
      "Elon Musk",
      "Tim Cook",
      "Mark Zuckerberg"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Elon Musk is the founder and CEO of both Tesla and SpaceX.",
    "detailedExplanation": "Elon Musk founded SpaceX in 2002 and became CEO of Tesla in 2008 (though Tesla was originally founded by Martin Eberhard and Marc Tarpenning in 2003, with Musk joining as chairman and product architect in 2004). Musk has been instrumental in advancing electric vehicle technology through Tesla and private space exploration through SpaceX. He's also been involved with other ventures including PayPal, Neuralink, and The Boring Company.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elon_Musk",
    "citationTitle": "Wikipedia: Elon Musk"
  },
  {
    "id": "27d62430-bb97-4ce3-bb88-ff6450a2909b",
    "text": "What company did Jack Dorsey co-found in 2006?",
    "options": [
      "Instagram",
      "Snapchat",
      "Twitter",
      "TikTok"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Jack Dorsey co-founded Twitter in 2006.",
    "detailedExplanation": "Jack Dorsey co-founded Twitter in March 2006 along with Biz Stone, Evan Williams, and Noah Glass. Dorsey sent the first tweet on March 21, 2006, which simply read 'just setting up my twttr.' He served as CEO twice - from 2006-2008 and again from 2015-2021. Dorsey also founded Square (now Block), a financial services and mobile payment company, in 2009. Twitter was later acquired by Elon Musk in 2022 and rebranded as X.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jack_Dorsey",
    "citationTitle": "Wikipedia: Jack Dorsey"
  },
  {
    "id": "88346d82-c9ae-41db-afbe-9b58e28ce64e",
    "text": "Which company was founded by Reed Hastings in 1997?",
    "options": [
      "Hulu",
      "Netflix",
      "Spotify",
      "Disney+"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Netflix was founded by Reed Hastings and Marc Randolph in 1997.",
    "detailedExplanation": "Reed Hastings co-founded Netflix with Marc Randolph in 1997 in Scotts Valley, California. The company initially operated as a DVD-by-mail rental service, competing with traditional video rental stores like Blockbuster. Hastings served as CEO from the company's founding until 2023, successfully transitioning Netflix from a DVD service to the world's leading streaming platform with over 200 million subscribers worldwide. The company began producing original content in 2013 and has become a major force in entertainment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reed_Hastings",
    "citationTitle": "Wikipedia: Reed Hastings"
  },
  {
    "id": "39fd8b0c-790c-4e6d-a116-0565836655c7",
    "text": "Who founded Amazon in 1994?",
    "options": [
      "Larry Ellison",
      "Michael Dell",
      "Jeff Bezos",
      "Andy Jassy"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Jeff Bezos founded Amazon in 1994.",
    "detailedExplanation": "Jeff Bezos founded Amazon on July 5, 1994, initially as an online bookstore operating out of his garage in Bellevue, Washington. Bezos left his job on Wall Street to pursue the opportunity he saw in internet commerce. Amazon has since grown from a simple online bookstore into one of the world's largest e-commerce and cloud computing companies. Bezos served as CEO until 2021 when he stepped down to focus on other ventures, handing the CEO role to Andy Jassy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jeff_Bezos",
    "citationTitle": "Wikipedia: Jeff Bezos"
  },
  {
    "id": "e411bd09-91c3-4187-955d-3c8e053b14e1",
    "text": "Which social media platform was founded by Mark Zuckerberg while he was a Harvard student?",
    "options": [
      "MySpace",
      "LinkedIn",
      "Facebook",
      "Friendster"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Mark Zuckerberg founded Facebook while studying at Harvard University in 2004.",
    "detailedExplanation": "Mark Zuckerberg launched Facebook (originally called 'The Facebook') from his Harvard University dormitory room on February 4, 2004. Initially, the platform was exclusive to college students, starting with Harvard and then expanding to other Ivy League schools and universities. Zuckerberg dropped out of Harvard in 2005 to focus on expanding Facebook full-time. The company went public in 2012 and was later renamed Meta in 2021 as it pivoted toward building the metaverse.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mark_Zuckerberg",
    "citationTitle": "Wikipedia: Mark Zuckerberg"
  },
  {
    "id": "566c8d8c-e5f9-47a0-8ecf-5f09758bc856",
    "text": "Who co-founded Apple Computer Company with Steve Jobs in 1976?",
    "options": [
      "Steve Wozniak",
      "Tim Cook",
      "John Sculley",
      "Jonathan Ive"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Steve Wozniak co-founded Apple with Steve Jobs in 1976.",
    "detailedExplanation": "Steve Wozniak co-founded Apple Computer Company with Steve Jobs and Ronald Wayne on April 1, 1976. Wozniak, often called 'Woz,' was the technical genius behind Apple's early computers, designing the Apple I and Apple II computers. While Jobs focused on marketing and business strategy, Wozniak handled the engineering and technical development. The Apple II, released in 1977, became one of the first successful mass-produced microcomputers and established Apple as a major player in the personal computer industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Steve_Wozniak",
    "citationTitle": "Wikipedia: Steve Wozniak"
  },
  {
    "id": "a802a158-8585-4220-bd84-94537c5d816b",
    "text": "Which company did Steve Jobs help found after leaving Apple in 1985?",
    "options": [
      "Pixar",
      "NeXT Computer",
      "Sun Microsystems",
      "Oracle"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Steve Jobs founded NeXT Computer in 1985 after his departure from Apple.",
    "detailedExplanation": "After a boardroom dispute led to Steve Jobs leaving Apple in 1985, he founded NeXT Computer, a company focused on high-end workstations for higher education and business markets. NeXT developed innovative hardware and software, including the NeXTSTEP operating system. Though NeXT had limited commercial success, Apple acquired the company in 1997, bringing Jobs back to Apple and using NeXT's technology as the foundation for Mac OS X.",
    "citationUrl": "https://en.wikipedia.org/wiki/NeXT",
    "citationTitle": "Wikipedia: NeXT"
  },
  {
    "id": "4b1c2c52-4996-495a-afe1-49dc2e4f349d",
    "text": "Who founded Dell Technologies from his University of Texas dorm room in 1984?",
    "options": [
      "Michael Dell",
      "Larry Ellison",
      "John Sculley",
      "Andy Grove"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Michael Dell founded Dell Computer Corporation in 1984 while he was a student at the University of Texas.",
    "detailedExplanation": "Michael Dell started his computer company in 1984 at age 19 while studying at the University of Texas at Austin. Initially called PC's Limited, the company began with Dell selling upgraded PCs and add-on components from his dorm room. His direct-to-consumer business model, bypassing traditional retail channels, revolutionized the computer industry and made Dell one of the world's largest technology companies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Dell",
    "citationTitle": "Wikipedia: Michael Dell"
  },
  {
    "id": "fc0cdf37-a20c-442c-baac-ad5597ba8e10",
    "text": "Which messaging app was co-founded by Brian Acton and Jan Koum before being sold to Facebook?",
    "options": [
      "Telegram",
      "WhatsApp",
      "Signal",
      "Viber"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "WhatsApp was co-founded by Brian Acton and Jan Koum in 2009 and sold to Facebook for $19 billion in 2014.",
    "detailedExplanation": "Brian Acton and Jan Koum, both former Yahoo employees, co-founded WhatsApp in 2009. The messaging app focused on simple, reliable messaging without ads. WhatsApp grew rapidly to become one of the world's most popular messaging platforms. In 2014, Facebook acquired WhatsApp for approximately $19 billion, one of the largest tech acquisitions in history. Both founders later left Facebook due to disagreements over data privacy and monetization strategies.",
    "citationUrl": "https://en.wikipedia.org/wiki/WhatsApp",
    "citationTitle": "Wikipedia: WhatsApp"
  },
  {
    "id": "e0ba3513-b456-4883-9aad-969f860c911c",
    "text": "Who co-founded Oracle Corporation and served as its CEO for 37 years?",
    "options": [
      "Scott McNealy",
      "Larry Ellison",
      "Marc Benioff",
      "John Chambers"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Larry Ellison co-founded Oracle Corporation in 1977 and served as CEO until 2014.",
    "detailedExplanation": "Larry Ellison co-founded Software Development Laboratories in 1977, which later became Oracle Corporation. The company specialized in database management systems and became one of the largest software companies in the world. Ellison served as CEO for 37 years until stepping down in 2014 to become Executive Chairman and Chief Technology Officer. Known for his flamboyant personality and competitive nature, Ellison built Oracle into a database software giant and became one of the world's wealthiest individuals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Larry_Ellison",
    "citationTitle": "Wikipedia: Larry Ellison"
  },
  {
    "id": "9a79d9ad-8461-4d98-b1de-67d3acd28053",
    "text": "Which video game company was co-founded by Gabe Newell and Mike Harrington in 1996?",
    "options": [
      "Blizzard Entertainment",
      "Valve Corporation",
      "Epic Games",
      "id Software"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Valve Corporation was co-founded by Gabe Newell and Mike Harrington in 1996.",
    "detailedExplanation": "Gabe Newell and Mike Harrington, both former Microsoft employees, founded Valve Corporation in 1996. The company is best known for creating the Half-Life video game series and operating Steam, the world's largest digital distribution platform for PC games. Newell, often called 'Gaben' by fans, has led Valve to become one of the most influential companies in PC gaming, though the company maintains a relatively small size and unique flat organizational structure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Valve_Corporation",
    "citationTitle": "Wikipedia: Valve Corporation"
  },
  {
    "id": "345f169b-bc99-4f7a-a04e-2f0394d2e5f9",
    "text": "Who founded Salesforce and pioneered the Software-as-a-Service (SaaS) model?",
    "options": [
      "Marc Benioff",
      "Patrick Collison",
      "Daniel Ek",
      "Drew Houston"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Marc Benioff founded Salesforce in 1999 and was instrumental in popularizing cloud-based software delivery.",
    "detailedExplanation": "Marc Benioff founded Salesforce in 1999 after leaving Oracle, where he had been a successful executive. Benioff pioneered the Software-as-a-Service (SaaS) model, delivering customer relationship management (CRM) software through web browsers rather than traditional installed software. This 'No Software' approach revolutionized how businesses access and use enterprise applications. Under Benioff's leadership, Salesforce grew from a startup to one of the world's largest software companies and a leader in cloud computing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marc_Benioff",
    "citationTitle": "Wikipedia: Marc Benioff"
  },
  {
    "id": "b75b40a1-af02-4356-809a-0234dc3d53bd",
    "text": "Which ride-sharing company was co-founded by Travis Kalanick and Garrett Camp?",
    "options": [
      "Lyft",
      "Uber",
      "Didi",
      "Grab"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Uber was co-founded by Travis Kalanick and Garrett Camp in 2009.",
    "detailedExplanation": "Travis Kalanick and Garrett Camp co-founded Uber in 2009, initially called UberCab. The idea emerged after Camp and Kalanick had difficulty hailing a taxi in San Francisco and envisioned a simple app-based solution to request rides. Uber revolutionized transportation by connecting riders with drivers through a smartphone app, creating the ride-sharing industry. Despite various controversies and leadership changes, Uber expanded globally and went public in 2019, fundamentally changing urban transportation worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Uber",
    "citationTitle": "Wikipedia: Uber"
  },
  {
    "id": "9923cda8-d142-47b0-8662-045f9dbca516",
    "text": "Who co-founded PayPal and later became known as one of the 'PayPal Mafia'?",
    "options": [
      "Peter Thiel",
      "Reid Hoffman",
      "Max Levchin",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Peter Thiel, Reid Hoffman, and Max Levchin were all co-founders of PayPal and members of the 'PayPal Mafia.'",
    "detailedExplanation": "PayPal was co-founded by several individuals who later became known as the 'PayPal Mafia' due to their subsequent success in founding or investing in major tech companies. Peter Thiel co-founded PayPal and later founded Palantir and was the first outside investor in Facebook. Max Levchin was PayPal's CTO and later founded Affirm. Reid Hoffman was an executive vice president and later founded LinkedIn. Other PayPal alumni went on to found or lead companies like Tesla, SpaceX, YouTube, and Yelp, making it one of the most influential groups in Silicon Valley history.",
    "citationUrl": "https://en.wikipedia.org/wiki/PayPal_Mafia",
    "citationTitle": "Wikipedia: PayPal Mafia"
  },
  {
    "id": "ad875ad6-7cbe-41e7-94fa-981ee0a027ed",
    "text": "Which tech entrepreneur founded eBay in 1995, originally calling it 'AuctionWeb'?",
    "options": [
      "Pierre Omidyar",
      "Marc Benioff",
      "Reid Hoffman",
      "Peter Thiel"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Pierre Omidyar founded eBay in 1995, initially as AuctionWeb.",
    "detailedExplanation": "Pierre Omidyar, a French-born Iranian-American computer programmer, founded what would become eBay in September 1995. He initially called the online auction site 'AuctionWeb' and hosted it on his personal website. The first item sold was reportedly a broken laser pointer for $14.83. The company was renamed eBay in 1997, taking its name from Echo Bay Technology Group, Omidyar's consulting firm.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pierre_Omidyar",
    "citationTitle": "Wikipedia: Pierre Omidyar"
  },
  {
    "id": "fe3239be-d8a6-43e6-baaa-756a115cd723",
    "text": "Who co-founded LinkedIn, the professional networking platform, in 2002?",
    "options": [
      "Kevin Systrom",
      "Reid Hoffman",
      "Drew Houston",
      "Daniel Ek"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Reid Hoffman co-founded LinkedIn in 2002.",
    "detailedExplanation": "Reid Hoffman co-founded LinkedIn in December 2002 along with several colleagues from PayPal and SocialNet.com. Hoffman served as LinkedIn's founding CEO and later as Executive Chairman. The professional networking platform launched publicly in May 2003 and became the world's largest professional network. Hoffman is often called the 'father of professional networking' and was part of the famous 'PayPal Mafia' group of entrepreneurs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reid_Hoffman",
    "citationTitle": "Wikipedia: Reid Hoffman"
  },
  {
    "id": "27f63148-d1e7-46d1-a899-9faf314b5a49",
    "text": "Which company did Tony Hsieh lead as CEO, becoming famous for its unique corporate culture?",
    "options": [
      "Etsy",
      "Zappos",
      "Airbnb",
      "Dropbox"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Tony Hsieh was CEO of Zappos, known for its distinctive company culture.",
    "detailedExplanation": "Tony Hsieh joined Zappos as CEO in 2000 and transformed the online shoe retailer into a company renowned for its exceptional customer service and unique corporate culture. Though he didn't found Zappos (it was founded by Nick Swinmurn), Hsieh became its most famous leader and grew it from a startup to a billion-dollar company. He implemented innovative policies like paying employees to quit if they weren't happy and focusing heavily on company culture and employee satisfaction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tony_Hsieh",
    "citationTitle": "Wikipedia: Tony Hsieh"
  },
  {
    "id": "ef6766e3-3552-4fa1-a8f7-6bdddecb9092",
    "text": "Who founded Spotify, the music streaming service, in Sweden in 2006?",
    "options": [
      "Mikael Hed",
      "Markus Persson",
      "Daniel Ek",
      "Niklas Zennström"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Daniel Ek founded Spotify in 2006 in Sweden.",
    "detailedExplanation": "Daniel Ek co-founded Spotify in 2006 alongside Martin Lorentzon in Stockholm, Sweden. Ek, who had been programming since age 7 and was already a millionaire by his teens from various web ventures, created Spotify to combat music piracy by offering a legal, convenient alternative. The music streaming service launched publicly in 2008 and revolutionized how people consume music, growing to become one of the world's largest music streaming platforms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Daniel_Ek",
    "citationTitle": "Wikipedia: Daniel Ek"
  }
]