[
  {
    "id": "d6dc8a30-bebd-4d8a-a71f-c56deac72202",
    "text": "What Latin phrase did Julius Caesar reportedly utter when crossing the Rubicon River in 49 BCE?",
    "options": [
      "Veni, vidi, vici",
      "Alea iacta est",
      "Et tu, Brute?",
      "Carpe diem"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "'Alea iacta est' means 'The die is cast,' referring to the irreversible decision to march on Rome.",
    "detailedExplanation": "According to the historian Suetonius, Julius Caesar uttered the phrase 'Alea iacta est' ('The die is cast') when he crossed the Rubicon River with his army in 49 BCE. This act was tantamount to declaring war on the Roman Senate and Pompey, as Roman law forbade any general from bringing his army into Italy proper. The phrase has since become synonymous with passing a point of no return and making an irreversible decision. The crossing of the Rubicon marked the beginning of Caesar's civil war and ultimately led to the end of the Roman Republic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alea_iacta_est",
    "citationTitle": "Wikipedia: Alea iacta est"
  },
  {
    "id": "8fafe4d6-c1ab-4a1e-9782-14a651457cba",
    "text": "In which city did Martin Luther King Jr. deliver his 'I Have a Dream' speech?",
    "options": [
      "Birmingham, Alabama",
      "Memphis, Tennessee",
      "Washington, D.C.",
      "Atlanta, Georgia"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The speech was delivered on August 28, 1963, during the March on Washington for Jobs and Freedom at the Lincoln Memorial.",
    "detailedExplanation": "Martin Luther King Jr. delivered his iconic 'I Have a Dream' speech on August 28, 1963, in Washington, D.C., from the steps of the Lincoln Memorial during the March on Washington for Jobs and Freedom. This pivotal moment in the American Civil Rights Movement saw over 250,000 participants gather to advocate for civil and economic rights for African Americans. King's speech, which was largely improvised from his prepared text, became one of the most famous and influential speeches in American history, helping to galvanize support for the Civil Rights Act of 1964.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Have_a_Dream",
    "citationTitle": "Wikipedia: I Have a Dream"
  },
  {
    "id": "9f1a28bb-f714-489e-a122-baecc42a8a94",
    "text": "Which Roman politician's funeral oration was so powerful it allegedly caused riots in Rome in 44 BCE?",
    "options": [
      "Cicero",
      "Mark Antony",
      "Brutus",
      "Octavian"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Mark Antony's funeral oration for Julius Caesar, as depicted in Shakespeare's play, supposedly incited the Roman mob against Caesar's assassins.",
    "detailedExplanation": "Mark Antony's funeral oration for Julius Caesar in 44 BCE was reportedly so emotionally charged and politically cunning that it turned the Roman populace against Caesar's assassins, leading to riots in the city. While Shakespeare's dramatic interpretation in 'Julius Caesar' may have embellished the historical details, ancient sources like Plutarch and Appian confirm that Antony's speech was instrumental in stirring public sentiment against Brutus and the other conspirators. The speech effectively displayed Caesar's bloody toga and read his will, which left generous bequests to the Roman people, thereby transforming public opinion from relief at a tyrant's death to outrage at the murder of a benefactor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Assassination_of_Julius_Caesar",
    "citationTitle": "Wikipedia: Assassination of Julius Caesar"
  },
  {
    "id": "f5b4a7d7-1229-4d5b-8a0f-af3de793230f",
    "text": "What was the name of the speech delivered by Sojourner Truth at a women's rights convention in 1851?",
    "options": [
      "'And I Am a Woman'",
      "'Ain't I a Woman?'",
      "'I Am Woman'",
      "'Woman's Rights'"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The speech is commonly known as 'Ain't I a Woman?' though the exact phrasing may have been altered by later transcripts.",
    "detailedExplanation": "Sojourner Truth delivered her famous 'Ain't I a Woman?' speech at the Ohio Women's Rights Convention in Akron in 1851. The speech powerfully challenged prevailing notions of racial and gender inferiority by highlighting her own strength and capabilities as both a woman and a formerly enslaved person. However, the exact words of her speech are disputed, as the famous 'Ain't I a Woman?' refrain appears only in a version published by Frances Gage twelve years later, written in a Southern dialect that Truth, who was from New York, likely did not use. Contemporary accounts suggest her actual words were different, but the speech remains a cornerstone of both feminist and abolitionist rhetoric.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ain%27t_I_a_Woman%3F",
    "citationTitle": "Wikipedia: Ain't I a Woman?"
  },
  {
    "id": "991d75a8-b1e3-4e77-846e-de0eb5506470",
    "text": "Which Greek orator was known as 'the greatest orator of antiquity' and delivered the famous Philippics against Philip II of Macedon?",
    "options": [
      "Pericles",
      "Isocrates",
      "Demosthenes",
      "Lysias"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Demosthenes delivered a series of political speeches called the Philippics, warning Athens about the threat posed by Philip II of Macedon.",
    "detailedExplanation": "Demosthenes (384-322 BCE) was considered the greatest orator of ancient Greece and delivered the famous series of speeches known as the Philippics between 351-341 BCE. These speeches were directed against Philip II of Macedon, whom Demosthenes viewed as a threat to Athenian independence and Greek freedom. The term 'philippic' (meaning a bitter verbal attack) derives from these speeches and has entered common usage. Despite his oratorical brilliance and warnings, Demosthenes was ultimately unsuccessful in preventing Philip's conquest of Greece, and later his son Alexander the Great would build upon his father's victories to create a vast empire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Demosthenes",
    "citationTitle": "Wikipedia: Demosthenes"
  },
  {
    "id": "0caea2f3-7869-40bb-9bac-f1f19f37d9eb",
    "text": "In which speech did Franklin D. Roosevelt use the phrase 'a date which will live in infamy'?",
    "options": [
      "First Inaugural Address",
      "Pearl Harbor Address",
      "Four Freedoms Speech",
      "Arsenal of Democracy Speech"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Roosevelt used this phrase when addressing Congress on December 8, 1941, the day after the attack on Pearl Harbor.",
    "detailedExplanation": "Franklin D. Roosevelt delivered his 'Pearl Harbor Address to the Nation' to a joint session of Congress on December 8, 1941, the day after the Japanese attack on Pearl Harbor. The speech, which lasted only about six and a half minutes, began with the now-famous line: 'Yesterday, December 7, 1941—a date which will live in infamy—the United States of America was suddenly and deliberately attacked by naval and air forces of the Empire of Japan.' The speech was instrumental in galvanizing American public opinion in favor of entering World War II, and Congress declared war on Japan within hours of the address, with only one dissenting vote.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pearl_Harbor_speech",
    "citationTitle": "Wikipedia: Pearl Harbor speech"
  },
  {
    "id": "9055ba61-e4f4-420a-b5e5-3d71ccf1c346",
    "text": "Which historical figure delivered the 'Funeral Oration' during the Peloponnesian War, as recorded by Thucydides?",
    "options": [
      "Alcibiades",
      "Pericles",
      "Themistocles",
      "Cleon"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Pericles delivered the famous funeral oration in 431 BCE to honor the Athenian soldiers who died in the first year of the Peloponnesian War.",
    "detailedExplanation": "Pericles delivered the famous 'Funeral Oration' (Epitaphios) in 431 BCE during the first year of the Peloponnesian War, as recorded by the historian Thucydides in his 'History of the Peloponnesian War.' The speech was given to honor the Athenian soldiers who had fallen in battle and is considered one of the greatest speeches in ancient literature. In it, Pericles praised Athenian democracy, culture, and values, describing Athens as 'the school of Hellas.' The oration has been influential throughout history and has been compared to Abraham Lincoln's Gettysburg Address for its similar themes of honoring the war dead while celebrating democratic ideals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pericles%27_Funeral_Oration",
    "citationTitle": "Wikipedia: Pericles' Funeral Oration"
  },
  {
    "id": "37ffc622-0cfb-4a84-88e9-612d0617ea7a",
    "text": "In which speech did Winston Churchill famously declare 'We shall fight on the beaches, we shall fight on the landing grounds'?",
    "options": [
      "Speech to the House of Commons, June 4, 1940",
      "Blood, Toil, Tears and Sweat speech",
      "The Few speech",
      "Iron Curtain speech"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "This iconic phrase came from Churchill's speech to the House of Commons on June 4, 1940, following the Dunkirk evacuation.",
    "detailedExplanation": "Winston Churchill delivered this defiant speech to the House of Commons on June 4, 1940, in the aftermath of the Dunkirk evacuation. The speech was intended to rally British morale and demonstrate unwavering resolve in the face of potential German invasion. The full quote continues 'we shall never surrender,' and became one of the most memorable expressions of British determination during World War II.",
    "citationUrl": "https://en.wikipedia.org/wiki/We_shall_fight_on_the_beaches",
    "citationTitle": "Wikipedia: We shall fight on the beaches"
  },
  {
    "id": "250f1c45-254b-4bf0-b363-cf0bd0610e72",
    "text": "What Latin phrase did Julius Caesar allegedly utter as his final words upon seeing Brutus among his assassins?",
    "options": [
      "Et tu, Brute?",
      "Veni, vidi, vici",
      "Alea iacta est",
      "Tu quoque, mi fili?"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "hard",
    "explanation": "According to Suetonius, Caesar's actual last words were 'Tu quoque, mi fili?' (You too, my son?), not Shakespeare's famous 'Et tu, Brute?'",
    "detailedExplanation": "While Shakespeare popularized 'Et tu, Brute?' in his play Julius Caesar, the Roman historian Suetonius recorded that Caesar's actual final words were 'Tu quoque, mi fili?' meaning 'You too, my son?' This suggests Caesar viewed Brutus as a son figure, making the betrayal even more personal. Some sources suggest Caesar may have said nothing at all, but Suetonius's account is the most historically credible record of his final utterance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Last_words_of_Julius_Caesar",
    "citationTitle": "Wikipedia: Last words of Julius Caesar"
  },
  {
    "id": "cddb7748-cd4e-47b0-9388-607f0aa46cae",
    "text": "In Patrick Henry's famous 1775 speech, what specific phrase immediately preceded 'give me death'?",
    "options": [
      "Give me liberty, or",
      "Give me freedom, or",
      "I know not what course others may take, but as for me,",
      "Is life so dear, or peace so sweet, as to be purchased at the price of chains and slavery? Forbid it, Almighty God! I know not what course others may take; but as for me,"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The full famous ending was a longer dramatic buildup, not just the commonly quoted short phrase 'Give me liberty, or give me death.'",
    "detailedExplanation": "Patrick Henry's speech to the Second Virginia Convention on March 23, 1775, built to its climactic ending with a much longer phrase than commonly remembered. The full ending was: 'Is life so dear, or peace so sweet, as to be purchased at the price of chains and slavery? Forbid it, Almighty God! I know not what course others may take; but as for me, give me liberty or give me death!' This extended buildup made the final declaration much more dramatic and powerful in its original context.",
    "citationUrl": "https://en.wikipedia.org/wiki/Give_me_liberty,_or_give_me_death!",
    "citationTitle": "Wikipedia: Give me liberty, or give me death!"
  },
  {
    "id": "8d5624f2-aa55-4ed8-b629-4b9562a95bef",
    "text": "What was the original intended audience size for Lincoln's Gettysburg Address when it was planned?",
    "options": [
      "It was meant to be the main keynote speech",
      "About 15,000-20,000 people attending the cemetery dedication",
      "A small private ceremony for government officials only",
      "It wasn't originally planned - Lincoln spoke spontaneously"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Lincoln was invited to give brief remarks at the dedication of the Gettysburg National Cemetery, with Edward Everett delivering the main two-hour oration.",
    "detailedExplanation": "The Gettysburg Address was delivered on November 19, 1863, at the dedication of the Gettysburg National Cemetery. Lincoln was not the main speaker - that honor went to Edward Everett, a renowned orator who spoke for two hours. Lincoln was invited almost as an afterthought to deliver 'a few appropriate remarks.' The audience of 15,000-20,000 people had come primarily to hear Everett, making Lincoln's brief but immortal 272-word speech all the more remarkable for its lasting impact.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gettysburg_Address",
    "citationTitle": "Wikipedia: Gettysburg Address"
  },
  {
    "id": "af7cedb7-ce98-4cef-a5ff-6640c32e14e9",
    "text": "In Martin Luther King Jr.'s 'I Have a Dream' speech, which specific American document did he reference when he said 'This note was a promissory note'?",
    "options": [
      "The Declaration of Independence",
      "The Constitution",
      "The Emancipation Proclamation",
      "The Bill of Rights"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "King referred to the Constitution and Declaration of Independence as a 'promissory note' that America had defaulted on regarding equality for African Americans.",
    "detailedExplanation": "In his speech at the March on Washington on August 28, 1963, King used the metaphor of a bad check to describe America's failure to fulfill its constitutional promises. He stated: 'When the architects of our republic wrote the magnificent words of the Constitution and the Declaration of Independence, they were signing a promissory note to which every American was to fall heir.' He then explained that America had given African Americans a bad check marked 'insufficient funds' when it came to equality and justice.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Have_a_Dream",
    "citationTitle": "Wikipedia: I Have a Dream"
  },
  {
    "id": "8aa4a6f5-b7f9-463a-8cae-cfe72416aabb",
    "text": "What was the actual attendance at the speech where Lou Gehrig declared himself 'the luckiest man on the face of the earth'?",
    "options": [
      "41,816 people at Yankee Stadium",
      "61,808 people at Yankee Stadium",
      "55,000 people at Yankee Stadium",
      "The stadium was closed to the public for the ceremony"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Lou Gehrig Appreciation Day at Yankee Stadium on July 4, 1939, drew 61,808 fans who witnessed his emotional farewell speech.",
    "detailedExplanation": "On July 4, 1939, Yankee Stadium hosted Lou Gehrig Appreciation Day, drawing 61,808 fans to honor the Iron Horse who had been diagnosed with ALS. Initially reluctant to speak, Gehrig was persuaded by the crowd's prolonged applause. His brief speech, delivered without notes, included the famous line about being 'the luckiest man on the face of the earth' despite his terminal diagnosis. The speech lasted less than two minutes but became one of the most moving farewell addresses in sports history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lou_Gehrig_Farewell_Speech",
    "citationTitle": "Wikipedia: Lou Gehrig Farewell Speech"
  },
  {
    "id": "ba260e6f-23c4-473f-b83d-e442e4b81de8",
    "text": "What unusual delivery method did Franklin D. Roosevelt use for his first 'Fireside Chat' radio address?",
    "options": [
      "He broadcast from the Oval Office",
      "He spoke from the White House diplomatic reception room",
      "He delivered it from a radio studio in New York",
      "He broadcast from his private study in the White House residence"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Roosevelt delivered his first Fireside Chat on March 12, 1933, from his private study in the White House residence to create an intimate atmosphere.",
    "detailedExplanation": "FDR's first Fireside Chat on March 12, 1933, addressing the banking crisis, was deliberately broadcast from his private study in the White House residence rather than from a formal office or radio studio. This choice was part of Roosevelt's strategy to create an intimate, conversational tone that made listeners feel he was speaking directly to them in their homes. The informal setting helped establish the 'fireside' atmosphere that gave these radio addresses their name and made them incredibly effective in building public confidence during the Great Depression.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fireside_chats",
    "citationTitle": "Wikipedia: Fireside chats"
  },
  {
    "id": "333a3a71-7569-42d1-8e37-2eac229f1fc4",
    "text": "What specific time of day did General Douglas MacArthur deliver his famous 'Old soldiers never die' farewell speech to Congress?",
    "options": [
      "12:30 PM",
      "2:30 PM",
      "10:00 AM",
      "4:00 PM"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "MacArthur addressed a joint session of Congress at 12:30 PM on April 19, 1951, after being dismissed by President Truman.",
    "detailedExplanation": "General Douglas MacArthur delivered his farewell address to a joint session of Congress at 12:30 PM on April 19, 1951, just days after President Truman had relieved him of command during the Korean War. The speech was broadcast live on radio and television to an estimated 30 million Americans. MacArthur concluded with the famous line referencing an old British military ballad: 'Old soldiers never die; they just fade away.' The timing allowed maximum audience reach, as many Americans could listen during their lunch break.",
    "citationUrl": "https://en.wikipedia.org/wiki/Douglas_MacArthur%27s_farewell_address",
    "citationTitle": "Wikipedia: Douglas MacArthur's farewell address"
  },
  {
    "id": "15ed8920-cb61-41a1-92ae-38cf1b85834a",
    "text": "In which speech did Winston Churchill famously declare 'We shall never surrender,' and what was the specific historical context that prompted this defiant proclamation?",
    "options": [
      "Speech to the House of Commons on June 4, 1940, following the Dunkirk evacuation",
      "Radio broadcast to the British people on May 13, 1940, after becoming Prime Minister",
      "Address to Parliament on June 18, 1940, before the Battle of Britain",
      "Speech at the Lord Mayor's Luncheon on November 10, 1942, after the Battle of El Alamein"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Churchill delivered this famous line in his June 4, 1940 House of Commons speech following the Dunkirk evacuation.",
    "detailedExplanation": "Winston Churchill delivered his famous 'We shall never surrender' speech to the House of Commons on June 4, 1940, immediately following the evacuation of British and Allied forces from Dunkirk. The speech, officially titled 'We Shall Fight on the Beaches,' was given during one of Britain's darkest hours in World War II, when invasion seemed imminent after the fall of France. Churchill used this address to rally both Parliament and the British people, acknowledging the military disaster while simultaneously declaring Britain's determination to continue fighting alone if necessary.",
    "citationUrl": "https://en.wikipedia.org/wiki/We_shall_fight_on_the_beaches",
    "citationTitle": "Wikipedia: We shall fight on the beaches"
  },
  {
    "id": "5c0291f5-b058-417f-b36a-ae7bc21a39fb",
    "text": "Frederick Douglass delivered his powerful speech 'What to the Slave Is the Fourth of July?' in 1852, but in which specific city did he deliver this scathing critique of American hypocrisy?",
    "options": [
      "Boston, Massachusetts",
      "Rochester, New York",
      "Philadelphia, Pennsylvania",
      "New York City, New York"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Douglass delivered this famous speech in Rochester, New York, on July 5, 1852, at Corinthian Hall.",
    "detailedExplanation": "Frederick Douglass delivered his renowned speech 'What to the Slave Is the Fourth of July?' in Rochester, New York, on July 5, 1852, at Corinthian Hall. He had been invited by the Rochester Ladies' Anti-Slavery Society to speak as part of their Fourth of July celebration. In this powerful oration, Douglass challenged his predominantly white audience by questioning how they could celebrate freedom and independence while millions of African Americans remained enslaved. The speech is considered one of the greatest pieces of American oratory, masterfully combining Biblical references, classical rhetoric, and moral argumentation to expose the hypocrisy of celebrating liberty in a nation that permitted slavery.",
    "citationUrl": "https://en.wikipedia.org/wiki/What_to_the_Slave_Is_the_Fourth_of_July%3F",
    "citationTitle": "Wikipedia: What to the Slave Is the Fourth of July?"
  },
  {
    "id": "631fbc68-1c07-4839-bc77-ce17d9376eee",
    "text": "Pericles' famous Funeral Oration, which praised Athenian democracy and those who died in war, was delivered during which specific conflict and recorded by which ancient historian?",
    "options": [
      "During the Persian Wars, recorded by Herodotus",
      "During the Peloponnesian War, recorded by Thucydides",
      "During the Ionian Revolt, recorded by Xenophon",
      "During the Battle of Marathon, recorded by Plutarch"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Pericles' Funeral Oration was delivered during the Peloponnesian War and was recorded by the historian Thucydides.",
    "detailedExplanation": "Pericles delivered his famous Funeral Oration in 431 BCE during the first year of the Peloponnesian War between Athens and Sparta. The speech was given at the public funeral ceremony for Athenian soldiers who had died in the first battles of the war. The oration was recorded by the historian Thucydides in his 'History of the Peloponnesian War,' who may have been present at the ceremony. In this speech, Pericles praised Athenian democratic values, the city's cultural achievements, and the sacrifice of the fallen soldiers, while also serving as propaganda to boost morale during the lengthy conflict. The speech remains one of the most influential defenses of democratic ideals in Western literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pericles%27_Funeral_Oration",
    "citationTitle": "Wikipedia: Pericles' Funeral Oration"
  },
  {
    "id": "7bd104a7-0003-4008-947d-5e02b41ca8dc",
    "text": "In Nelson Mandela's speech from the dock during the Rivonia Trial in 1964, he concluded with which famous phrase that encapsulated his willingness to die for his ideals?",
    "options": [
      "\"I am prepared to die for the cause of freedom and equality\"",
      "\"It is an ideal for which I am prepared to die\"",
      "\"I would rather die fighting than live in chains\"",
      "\"Death before dishonor, freedom above all else\""
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Mandela concluded his speech with 'It is an ideal for which I am prepared to die,' referring to a democratic and free society.",
    "detailedExplanation": "Nelson Mandela's speech from the dock on April 20, 1964, during the Rivonia Trial, concluded with the powerful words: 'It is an ideal for which I am prepared to die.' The full final sentence was: 'It is an ideal which I hope to live for and to achieve. But if needs be, it is an ideal for which I am prepared to die.' This speech was Mandela's defense against charges of sabotage and conspiracy to overthrow the apartheid government. Rather than denying the charges, Mandela used the opportunity to explain the African National Congress's turn to armed resistance and to articulate his vision of a democratic South Africa. The speech lasted over four hours and is considered one of the greatest political speeches of the 20th century, demonstrating Mandela's courage and moral authority even while facing the death penalty.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Am_Prepared_to_Die",
    "citationTitle": "Wikipedia: I Am Prepared to Die"
  },
  {
    "id": "123c1277-0f31-4b8e-84e5-5e800d11417b",
    "text": "In which famous speech did Sojourner Truth reportedly ask 'Ain't I a Woman?' four times, though historians now debate whether she actually used this exact phrase?",
    "options": [
      "Her 1851 speech at the Women's Convention in Akron, Ohio",
      "Her 1853 address at the Broadway Tabernacle in New York",
      "Her 1864 meeting with President Lincoln at the White House",
      "Her 1867 speech at the American Equal Rights Association meeting"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The famous refrain 'Ain't I a Woman?' is attributed to Truth's 1851 Akron speech, though the exact wording is historically disputed.",
    "detailedExplanation": "Sojourner Truth's most famous speech was delivered at the Women's Convention in Akron, Ohio in 1851. However, the iconic phrase 'Ain't I a Woman?' was not recorded in contemporary accounts. The phrase first appeared in Frances Gage's 1863 recollection of the speech, written 12 years later, where Gage also rendered Truth's speech in a Southern dialect that Truth, being from New York, likely didn't have. Contemporary newspaper accounts from 1851 show Truth made similar points about women's strength and religious faith, but without the now-famous refrain. This demonstrates how historical speeches can be transformed in collective memory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ain%27t_I_a_Woman%3F",
    "citationTitle": "Wikipedia: Ain't I a Woman?"
  }
]