[
  {
    "id": "f95ae8a9-c2bb-4606-9860-c87e2f8d3ae7",
    "text": "Which 1970s scandal involved the FBI's ABSCAM operation that led to the conviction of six members of Congress?",
    "options": [
      "A fake Middle Eastern sheik offering bribes for political favors",
      "Illegal wiretapping of Democratic Party headquarters",
      "Arms sales to Iran to fund Nicaraguan rebels",
      "Trading weapons for hostages in Lebanon"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "ABSCAM involved FBI agents posing as representatives of a fictional Arab sheik offering bribes.",
    "detailedExplanation": "ABSCAM (Arab Scam) was an FBI sting operation from 1978-1980 where agents posed as representatives of fictional Arab sheiks offering bribes to politicians in exchange for political favors. The operation resulted in the conviction of six members of the House of Representatives and one Senator, along with several other officials. The scandal was particularly shocking as it was caught on hidden cameras, showing politicians accepting briefcases full of cash.",
    "citationUrl": "https://en.wikipedia.org/wiki/Abscam",
    "citationTitle": "Wikipedia: Abscam"
  },
  {
    "id": "f753c717-c2e6-4a80-96cf-ef98ff0f86cb",
    "text": "What was the name of the Italian political corruption scandal of the 1990s that led to the collapse of the post-war political system?",
    "options": [
      "Operazione Mani Pulite",
      "Tangentopoli",
      "Propaganda Due",
      "Banco Ambrosiano"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Tangentopoli (Bribesville) was the massive corruption scandal that destroyed Italy's First Republic.",
    "detailedExplanation": "Tangentopoli, meaning 'Bribesville' or 'Kickback City,' was a massive political corruption scandal that rocked Italy in the 1990s. The scandal involved systematic corruption where businesses paid bribes (tangenti) to political parties and individual politicians to secure public contracts. The investigation, known as Mani Pulite (Clean Hands), led by magistrates including Antonio Di Pietro, resulted in the arrest of thousands of politicians, businessmen, and civil servants, ultimately causing the collapse of Italy's post-war political system known as the First Republic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tangentopoli",
    "citationTitle": "Wikipedia: Tangentopoli"
  },
  {
    "id": "ce456051-210c-4333-b79b-d806661e9370",
    "text": "Which Canadian Prime Minister was involved in the 'Sponsorship Scandal' that helped bring down the Liberal Party government?",
    "options": [
      "Pierre Trudeau",
      "Jean Chrétien",
      "Paul Martin",
      "Kim Campbell"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Sponsorship Scandal occurred under Jean Chrétien's government, though it was investigated under Paul Martin.",
    "detailedExplanation": "The Canadian Sponsorship Scandal, also known as 'Adscam,' involved the Liberal government under Jean Chrétien paying advertising agencies in Quebec millions of dollars for minimal work between 1996-2006. The program was designed to promote Canadian federalism in Quebec after the 1995 sovereignty referendum, but instead became a vehicle for kickbacks to the Liberal Party. The Gomery Commission investigation revealed that $100 million had been misspent, with some funds illegally flowing back to the Liberal Party, contributing to their electoral defeat in 2006.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sponsorship_scandal",
    "citationTitle": "Wikipedia: Sponsorship scandal"
  },
  {
    "id": "859efde3-3838-4eb9-ba65-45627554f8e4",
    "text": "What was the code name for the French political scandal involving illegal party funding that implicated President Jacques Chirac?",
    "options": [
      "Affaire des HLM",
      "Affaire Clearstream",
      "Affaire Bettencourt",
      "Affaire Karachi"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Affaire des HLM involved illegal funding of Chirac's RPR party through public housing contracts.",
    "detailedExplanation": "The Affaire des HLM (Public Housing Affair) was a major French political scandal involving the illegal funding of Jacques Chirac's RPR party through inflated public housing contracts in Paris while he was mayor (1977-1995). Companies were awarded public contracts at inflated prices, with the excess money flowing back to the party as illegal campaign contributions. The scandal protected Chirac from prosecution while he was President due to immunity, but investigations continued for years and tainted his political legacy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Corruption_charges_against_Jacques_Chirac",
    "citationTitle": "Wikipedia: Corruption charges against Jacques Chirac"
  },
  {
    "id": "749d0e4d-ebe9-413b-b066-1e286c90e53b",
    "text": "Which South Korean president was impeached in 2017 following the influence-peddling scandal involving Choi Soon-sil?",
    "options": [
      "Lee Myung-bak",
      "Park Geun-hye",
      "Moon Jae-in",
      "Roh Moo-hyun"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Park Geun-hye was impeached over the Choi Soon-sil scandal involving corruption and influence peddling.",
    "detailedExplanation": "Park Geun-hye became the first South Korean president to be impeached and removed from office in 2017 due to a massive corruption scandal involving her confidante Choi Soon-sil. Despite having no official government position, Choi had extraordinary influence over Park, allegedly editing presidential speeches and pressuring chaebols (large business conglomerates) to donate billions to foundations she controlled. The scandal led to massive protests with millions of South Koreans demanding Park's removal, ultimately resulting in her impeachment, removal from office, and later criminal conviction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Impeachment_of_Park_Geun-hye",
    "citationTitle": "Wikipedia: Impeachment of Park Geun-hye"
  },
  {
    "id": "51c5dd7f-277b-406d-8957-719944511850",
    "text": "What was the name of the 1980s British scandal involving the secret sale of defense equipment to Iraq despite an arms embargo?",
    "options": [
      "Arms-to-Iraq Affair",
      "Matrix Churchill Scandal",
      "Pergau Dam Affair",
      "Al-Yamamah Deal"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Arms-to-Iraq Affair involved secretly allowing arms sales to Iraq while publicly maintaining an embargo.",
    "detailedExplanation": "The Arms-to-Iraq Affair was a British political scandal that emerged in the early 1990s, revealing that the government had secretly relaxed guidelines on arms sales to Iraq during the Iran-Iraq War in the 1980s, while publicly maintaining an arms embargo. The scandal involved the prosecution of executives from Matrix Churchill, a machine tool company, for illegally exporting equipment that could be used for weapons manufacturing. The trial collapsed when it was revealed that the government had known about and encouraged these exports, leading to the Scott Inquiry which criticized government secrecy and misleading of Parliament.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arms-to-Iraq",
    "citationTitle": "Wikipedia: Arms-to-Iraq"
  },
  {
    "id": "80ddb00d-5dc2-40f4-bfd2-eef1f1ed8d51",
    "text": "Which Brazilian president was impeached in 2016 amid accusations of manipulating government accounts to hide budget deficits?",
    "options": [
      "Luiz Inácio Lula da Silva",
      "Jair Bolsonaro",
      "Dilma Rousseff",
      "Fernando Collor de Mello"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Dilma Rousseff was impeached for 'pedaladas fiscais' - manipulating government accounts to hide budget problems.",
    "detailedExplanation": "Dilma Rousseff was impeached and removed from office in 2016 on charges of fiscal irresponsibility, specifically for engaging in 'pedaladas fiscais' (fiscal pedaling) - using funds from state banks to cover government expenses and delay payments to make the budget deficit appear smaller than it actually was. While supporters argued this was a common practice and constituted a parliamentary coup, opponents maintained it violated fiscal responsibility laws. The impeachment occurred amid Brazil's worst recession in decades and the massive Lava Jato (Car Wash) corruption investigation that had weakened her Workers' Party.",
    "citationUrl": "https://en.wikipedia.org/wiki/Impeachment_of_Dilma_Rousseff",
    "citationTitle": "Wikipedia: Impeachment of Dilma Rousseff"
  },
  {
    "id": "c5a8391f-b2e6-4282-ab84-6379f5f8e562",
    "text": "What was the name of the German political scandal involving illegal party donations that led to Helmut Kohl's downfall as CDU honorary chairman?",
    "options": [
      "Flick Affair",
      "CDU donations scandal",
      "Neue Heimat scandal",
      "Barschel Affair"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The CDU donations scandal involved Kohl's refusal to reveal secret party donors, damaging his legacy.",
    "detailedExplanation": "The CDU donations scandal (CDU-Spendenskandal) erupted in 1999 when it was revealed that the Christian Democratic Union had received millions in illegal donations during Helmut Kohl's time as party leader and Chancellor. Kohl admitted to accepting undeclared donations but refused to name the donors, claiming he had given his 'word of honor' to protect their identities. The scandal revealed a complex system of secret accounts and money laundering involving arms dealer Karlheinz Schreiber and others. It severely damaged Kohl's reputation and led to his resignation as the CDU's honorary chairman, tarnishing the legacy of the man who had overseen German reunification.",
    "citationUrl": "https://en.wikipedia.org/wiki/CDU_donations_scandal",
    "citationTitle": "Wikipedia: CDU donations scandal"
  },
  {
    "id": "bafcabbd-84ea-471a-8458-6b66a490315a",
    "text": "Which Nixon administration official famously declared 'I am not a crook' before ultimately being convicted of conspiracy, obstruction of justice, and perjury in the Watergate scandal?",
    "options": [
      "John Mitchell",
      "H.R. Haldeman",
      "John Ehrlichman",
      "Richard Nixon himself"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Nixon declared 'I am not a crook' at a press conference in 1973, though he resigned before impeachment proceedings concluded.",
    "detailedExplanation": "President Richard Nixon made his famous 'I am not a crook' declaration during a televised press conference at Disney World on November 17, 1973, as the Watergate scandal intensified. While Nixon was never technically convicted (he resigned in August 1974 before impeachment proceedings concluded and was subsequently pardoned by Gerald Ford), he would have faced charges for conspiracy, obstruction of justice, and abuse of power. The other officials listed were all convicted for their roles in Watergate.",
    "citationUrl": "https://en.wikipedia.org/wiki/Watergate_scandal",
    "citationTitle": "Wikipedia: Watergate scandal"
  },
  {
    "id": "9f7d9ee1-40d5-4b42-afa5-b695fb7f8df4",
    "text": "The 'Cash for Questions' affair in the 1990s involved Members of Parliament being paid to ask parliamentary questions in which country's legislature?",
    "options": [
      "Australia",
      "United Kingdom",
      "New Zealand",
      "Ireland"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Cash for Questions affair was a major British political scandal involving Conservative MPs being paid by lobbyist Ian Greer.",
    "detailedExplanation": "The Cash for Questions affair was a significant British political scandal that emerged in the mid-1990s during John Major's Conservative government. It involved allegations that Members of Parliament, particularly Conservative MPs Neil Hamilton and Tim Smith, had accepted cash payments from lobbyist Ian Greer to ask specific questions in Parliament on behalf of Harrods owner Mohamed Al-Fayed. The scandal contributed to the Conservative Party's credibility crisis and their eventual defeat in the 1997 general election.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cash-for-questions_affair",
    "citationTitle": "Wikipedia: Cash-for-questions affair"
  },
  {
    "id": "c3bbf9ec-eac4-489d-94f2-7bc863154157",
    "text": "Which Japanese Prime Minister was forced to resign in 1989 following the Recruit scandal involving insider trading and bribery?",
    "options": [
      "Noboru Takeshita",
      "Yasuhiro Nakasone",
      "Toshiki Kaifu",
      "Kiichi Miyazawa"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Noboru Takeshita resigned as Prime Minister in June 1989 due to his involvement in the Recruit insider trading scandal.",
    "detailedExplanation": "The Recruit scandal was a major Japanese political corruption case that erupted in 1988-1989, involving the Recruit company offering pre-flotation shares at below-market prices to politicians and business leaders. Prime Minister Noboru Takeshita was implicated when it was revealed that his political funding organization had received shares and donations from Recruit. The scandal severely damaged public trust in the Liberal Democratic Party and forced Takeshita to resign in June 1989, despite his initial attempts to weather the crisis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Recruit_scandal",
    "citationTitle": "Wikipedia: Recruit scandal"
  },
  {
    "id": "4417b85b-aa52-4dd6-a764-ee9367e4caab",
    "text": "The 'Bofors scandal' of the 1980s involved allegations of kickbacks in a defense deal and significantly impacted which Indian Prime Minister's political career?",
    "options": [
      "Indira Gandhi",
      "Morarji Desai",
      "Rajiv Gandhi",
      "V.P. Singh"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Bofors scandal involved alleged kickbacks in a howitzer deal during Rajiv Gandhi's tenure, contributing to his electoral defeat in 1989.",
    "detailedExplanation": "The Bofors scandal emerged in 1987 during Rajiv Gandhi's tenure as Prime Minister, involving allegations that Swedish arms manufacturer Bofors AB paid kickbacks to Indian politicians and military officials to secure a contract for 155mm howitzer guns worth $1.4 billion. The scandal severely damaged Gandhi's reputation for clean governance and was a major factor in the Congress Party's defeat in the 1989 general elections. Investigations continued for decades, with various Indian officials and middlemen implicated in the corruption scheme.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bofors_scandal",
    "citationTitle": "Wikipedia: Bofors scandal"
  },
  {
    "id": "72d52d20-64d9-42d8-aa7b-a4cfc246a580",
    "text": "Which Australian politician was involved in the 'Whitlam Loans Affair' of 1975, attempting to borrow $4 billion from Middle Eastern sources without Treasury approval?",
    "options": [
      "Rex Connor",
      "Jim Cairns",
      "Gough Whitlam",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Loans Affair involved multiple Labor politicians, including Deputy PM Jim Cairns, Minister Rex Connor, and PM Gough Whitlam himself.",
    "detailedExplanation": "The Whitlam Loans Affair was a major Australian political scandal in 1975 where the Labor government attempted to borrow $4 billion from Middle Eastern money markets through Pakistani financier Tirath Khemlani, bypassing normal Treasury and parliamentary procedures. The scheme involved Deputy Prime Minister Jim Cairns, Minerals and Energy Minister Rex Connor, and ultimately implicated Prime Minister Gough Whitlam himself. The scandal contributed to the constitutional crisis that led to Whitlam's dismissal by Governor-General John Kerr in November 1975.",
    "citationUrl": "https://en.wikipedia.org/wiki/Loans_affair",
    "citationTitle": "Wikipedia: Loans affair"
  },
  {
    "id": "6450c860-c754-466a-a216-8663e7d04e8f",
    "text": "The 'Dreyfus Affair' that divided French society for over a decade involved a military officer falsely convicted of what crime?",
    "options": [
      "Treason",
      "Desertion",
      "Embezzlement",
      "Insubordination"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Captain Alfred Dreyfus was falsely convicted of treason in 1894, accused of passing military secrets to Germany.",
    "detailedExplanation": "The Dreyfus Affair was a notorious French political scandal that began in 1894 when Captain Alfred Dreyfus, a Jewish artillery officer, was falsely convicted of treason for allegedly passing military secrets to the German Embassy in Paris. The case was built on forged evidence and anti-Semitic prejudice. The affair divided French society between 'Dreyfusards' who believed in his innocence and 'anti-Dreyfusards' who supported the military establishment. Émile Zola's famous open letter 'J'Accuse...!' helped expose the injustice. Dreyfus was eventually exonerated in 1906.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dreyfus_affair",
    "citationTitle": "Wikipedia: Dreyfus affair"
  },
  {
    "id": "75c48b76-256a-4715-a7b4-5e8d2c363960",
    "text": "Which Spanish political party was at the center of the 'Gürtel case,' one of the largest corruption scandals in modern Spanish history?",
    "options": [
      "Spanish Socialist Workers' Party (PSOE)",
      "People's Party (PP)",
      "Podemos",
      "Citizens (Ciudadanos)"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Gürtel case primarily involved corruption within the conservative People's Party (Partido Popular), leading to significant legal consequences.",
    "detailedExplanation": "The Gürtel case (Caso Gürtel) was a major Spanish corruption scandal that emerged in 2009, involving a vast network of kickbacks, illegal party funding, and money laundering centered around the conservative People's Party (PP). The investigation revealed that businessman Francisco Correa ran a corrupt network that overcharged for public contracts and channeled the excess funds to PP officials. The scandal implicated numerous high-ranking PP members and contributed to the party's electoral defeats. In 2018, the Spanish Supreme Court's ruling on the case led to a successful no-confidence vote against PP Prime Minister Mariano Rajoy.",
    "citationUrl": "https://en.wikipedia.org/wiki/G%C3%BCrtel_case",
    "citationTitle": "Wikipedia: Gürtel case"
  },
  {
    "id": "1d1c7e7d-a91b-4808-82c3-7b0748e280cb",
    "text": "The 'Petrobras scandal' (Operation Car Wash) that began in 2014 ultimately led to the imprisonment of which former Brazilian President?",
    "options": [
      "Fernando Henrique Cardoso",
      "Luiz Inácio Lula da Silva",
      "Jair Bolsonaro",
      "Michel Temer"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Former President Lula da Silva was convicted and imprisoned as part of Operation Car Wash, though his conviction was later annulled.",
    "detailedExplanation": "Operation Car Wash (Operação Lava Jato) was Brazil's largest anti-corruption investigation, beginning in 2014 with investigations into money laundering at a car wash but expanding to reveal massive corruption at state oil company Petrobras. The scandal implicated numerous high-profile politicians across party lines. Former President Luiz Inácio Lula da Silva was convicted of corruption and money laundering in 2017 and imprisoned in 2018, though his conviction was later annulled by the Supreme Court in 2021. The investigation reshaped Brazilian politics and led to the impeachment of President Dilma Rousseff.",
    "citationUrl": "https://en.wikipedia.org/wiki/Operation_Car_Wash",
    "citationTitle": "Wikipedia: Operation Car Wash"
  },
  {
    "id": "c3f670ee-352f-48f7-abf8-9faebdf996ba",
    "text": "Which Russian oligarch's arrest in 2003 on tax evasion and fraud charges was widely viewed as President Putin's move to assert control over politically influential business figures?",
    "options": [
      "Boris Berezovsky",
      "Mikhail Khodorkovsky",
      "Roman Abramovich",
      "Oleg Deripaska"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Mikhail Khodorkovsky, head of Yukos oil company, was arrested in 2003 in what many saw as Putin's crackdown on oligarchs with political ambitions.",
    "detailedExplanation": "Mikhail Khodorkovsky, once Russia's richest man and CEO of oil giant Yukos, was arrested in 2003 on charges of tax evasion and fraud. His arrest was widely interpreted as President Vladimir Putin's message to Russia's powerful oligarchs that political opposition would not be tolerated. Khodorkovsky had been funding opposition parties and criticizing the Kremlin's policies. He spent over 10 years in prison before being pardoned in 2013, while his company Yukos was dismantled and its assets largely transferred to state-controlled Rosneft.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mikhail_Khodorkovsky",
    "citationTitle": "Wikipedia: Mikhail Khodorkovsky"
  },
  {
    "id": "65f077cd-142c-4ca7-895b-a8058127a0a6",
    "text": "The 'Profumo Affair' of 1963 that rocked British politics involved Secretary of State for War John Profumo's relationship with whom?",
    "options": [
      "A Soviet spy",
      "Christine Keeler",
      "A parliamentary secretary",
      "Mandy Rice-Davies"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "John Profumo had an affair with Christine Keeler, who was simultaneously involved with a Soviet naval attaché, creating a security scandal.",
    "detailedExplanation": "The Profumo Affair was a major British political scandal in 1963 involving John Profumo, Secretary of State for War, who had an extramarital affair with 19-year-old model Christine Keeler. The scandal erupted because Keeler was simultaneously involved with Yevgeny Ivanov, a Soviet naval attaché, raising serious national security concerns during the Cold War. Profumo initially lied to Parliament about the relationship but was forced to admit the truth and resign. The scandal contributed to the Conservative government's reputation for sleaze and helped lead to Harold Macmillan's resignation as Prime Minister.",
    "citationUrl": "https://en.wikipedia.org/wiki/Profumo_affair",
    "citationTitle": "Wikipedia: Profumo affair"
  },
  {
    "id": "ff81e3b6-ff8b-42f8-bb78-49769191a667",
    "text": "Which American Vice President was forced to resign in 1973 after pleading 'no contest' to tax evasion charges stemming from kickbacks received while Governor of Maryland?",
    "options": [
      "Gerald Ford",
      "Spiro Agnew",
      "Nelson Rockefeller",
      "Walter Mondale"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Spiro Agnew resigned as Vice President in 1973 after pleading no contest to tax evasion related to kickbacks he received as Maryland Governor.",
    "detailedExplanation": "Spiro Agnew, Richard Nixon's Vice President, was forced to resign in October 1973 after federal prosecutors uncovered evidence that he had received kickbacks from contractors while serving as Baltimore County Executive and Governor of Maryland, and had continued to receive payments while Vice President. Rather than face trial on charges of extortion, tax fraud, bribery, and conspiracy, Agnew pleaded 'no contest' to a single charge of tax evasion. He became only the second Vice President in U.S. history to resign from office, doing so just months before the Watergate scandal would force Nixon's own resignation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spiro_Agnew",
    "citationTitle": "Wikipedia: Spiro Agnew"
  },
  {
    "id": "75eeaf16-c965-4782-a8df-4c2c7b4ec7ba",
    "text": "The 'Calciopoli' scandal of 2006 involved match-fixing allegations that led to which Italian football club being relegated to Serie B despite being the defending champions?",
    "options": [
      "AC Milan",
      "Inter Milan",
      "Juventus",
      "AS Roma"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Juventus was relegated to Serie B and stripped of two titles in the Calciopoli match-fixing scandal of 2006.",
    "detailedExplanation": "Calciopoli was a major Italian football scandal that erupted in 2006, involving match-fixing allegations against several top clubs. The scandal centered on telephone interceptions that revealed conversations between club officials and referee selectors aimed at influencing referee appointments. Juventus, despite being the defending Serie A champions, received the harshest punishment: relegation to Serie B, being stripped of their 2005 and 2006 titles, and starting the 2006-07 season with a points deduction. The scandal also implicated other major clubs and led to resignations of key football federation officials, fundamentally changing Italian football governance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Calciopoli",
    "citationTitle": "Wikipedia: Calciopoli"
  }
]