[
  {
    "id": "eb126ca6-c373-4184-8495-a4d63d73042f",
    "text": "Which U.S. President was forced to resign in 1974 following the Watergate scandal?",
    "options": [
      "Gerald Ford",
      "Richard Nixon",
      "Lyndon Johnson",
      "Jimmy Carter"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Richard Nixon resigned on August 9, 1974, to avoid impeachment over the Watergate break-in and cover-up.",
    "detailedExplanation": "The Watergate scandal began with a break-in at the Democratic National Committee headquarters in 1972 and escalated into a major political crisis involving wiretapping, campaign finance violations, and abuse of power. As investigations revealed Nixon's involvement in covering up the scandal, he became the first U.S. President to resign from office rather than face certain impeachment and removal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Watergate_scandal",
    "citationTitle": "Wikipedia: Watergate scandal"
  },
  {
    "id": "8f598521-e569-4e94-8b17-5ac96994b105",
    "text": "The 'Cash-for-Honours' scandal in 2006-2007 involved which country's political system?",
    "options": [
      "Canada",
      "Australia",
      "United Kingdom",
      "New Zealand"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Cash-for-Honours scandal involved allegations that the UK Labour Party was selling peerages in exchange for loans.",
    "detailedExplanation": "The Cash-for-Honours affair was a political scandal that erupted in 2006 when it was alleged that the UK Labour Party had been offering peerages and knighthoods in exchange for loans to the party. The scandal led to a police investigation and significantly damaged Tony Blair's government, contributing to his decision to step down as Prime Minister in 2007.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cash-for-Honours_scandal",
    "citationTitle": "Wikipedia: Cash-for-Honours scandal"
  },
  {
    "id": "c71029a9-7b2c-4e5a-b143-8d52d845b5d7",
    "text": "What was the name of the French political scandal involving President François Mitterrand's illegal wiretapping program?",
    "options": [
      "L'Affaire Dreyfus",
      "L'Affaire des Écoutes",
      "L'Affaire Stavisky",
      "L'Affaire Cahuzac"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "L'Affaire des Écoutes (The Wiretapping Affair) involved President Mitterrand's secret surveillance of journalists and political opponents.",
    "detailedExplanation": "L'Affaire des Écoutes was a major French political scandal that came to light in the 1990s, revealing that President François Mitterrand had authorized an extensive illegal wiretapping program from 1983 to 1986. The program targeted journalists, lawyers, and political opponents, including future President Nicolas Sarkozy. The scandal severely damaged Mitterrand's reputation and raised serious questions about civil liberties in France.",
    "citationUrl": "https://en.wikipedia.org/wiki/%C3%89lys%C3%A9e_wiretapping_scandal",
    "citationTitle": "Wikipedia: Élysée wiretapping scandal"
  },
  {
    "id": "503483e7-dedd-49be-89b9-850042dc842c",
    "text": "Which Italian Prime Minister was involved in numerous scandals collectively known as 'Bunga Bunga' parties?",
    "options": [
      "Mario Monti",
      "Silvio Berlusconi",
      "Matteo Renzi",
      "Giuseppe Conte"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Silvio Berlusconi faced multiple scandals involving alleged inappropriate parties and relationships, dubbed 'Bunga Bunga' by the media.",
    "detailedExplanation": "Silvio Berlusconi, Italy's longest-serving post-war Prime Minister, became embroiled in numerous personal and political scandals throughout his career. The 'Bunga Bunga' affairs referred to alleged wild parties at his residences involving young women, leading to charges of abuse of power and personal conduct that dominated Italian headlines and contributed to his resignation in 2011.",
    "citationUrl": "https://en.wikipedia.org/wiki/Silvio_Berlusconi",
    "citationTitle": "Wikipedia: Silvio Berlusconi"
  },
  {
    "id": "bebdddb5-057d-46d7-b9cc-f3e913bd4ed4",
    "text": "The 'Sponsorship Scandal' that rocked Canada in the early 2000s primarily involved misuse of funds intended for what purpose?",
    "options": [
      "Healthcare promotion",
      "Quebec unity advertising",
      "Olympic Games preparation",
      "Military equipment"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The sponsorship scandal involved the misuse of federal funds meant to promote Canadian unity in Quebec following the 1995 sovereignty referendum.",
    "detailedExplanation": "Canada's Sponsorship Scandal emerged in 2004 when it was revealed that the Liberal government had channeled millions of dollars to Quebec advertising agencies for federal sponsorship of events, with much of the money being misappropriated. The program was designed to raise Canada's profile in Quebec after the narrow defeat of the 1995 sovereignty referendum, but instead became a major corruption scandal that contributed to the Liberal Party's defeat in 2006.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sponsorship_scandal",
    "citationTitle": "Wikipedia: Sponsorship scandal"
  },
  {
    "id": "0267fc9c-4beb-4447-a591-9c50032448d9",
    "text": "What was the name of the 1980s scandal involving senior Reagan administration officials secretly selling arms to Iran?",
    "options": [
      "Iran-Contra Affair",
      "Teapot Dome Scandal",
      "Arms-for-Hostages Deal",
      "Operation Cyclone"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Iran-Contra Affair involved secretly selling weapons to Iran and using proceeds to fund Contra rebels in Nicaragua.",
    "detailedExplanation": "The Iran-Contra Affair was a major political scandal during Ronald Reagan's presidency in which senior administration officials secretly facilitated the sale of arms to Iran, which was under an arms embargo, and used the proceeds to fund Contra rebels in Nicaragua, circumventing a Congressional ban. The scandal came to light in 1986 and led to multiple indictments and a major investigation that threatened Reagan's presidency.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iran%E2%80%93Contra_affair",
    "citationTitle": "Wikipedia: Iran–Contra affair"
  },
  {
    "id": "7c86ae69-68ca-40d8-932d-4941a6b77895",
    "text": "Which South Korean President was impeached in 2016 over influence-peddling involving her confidante Choi Soon-sil?",
    "options": [
      "Moon Jae-in",
      "Lee Myung-bak",
      "Park Geun-hye",
      "Roh Moo-hyun"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Park Geun-hye was impeached and removed from office over a corruption scandal involving her friend Choi Soon-sil's inappropriate influence over government affairs.",
    "detailedExplanation": "Park Geun-hye became the first South Korean president to be successfully impeached and removed from office in 2017. The scandal centered on allegations that she allowed her longtime friend Choi Soon-sil, who held no official government position, to influence state affairs and extort money from major corporations. The revelation sparked massive protests across South Korea and led to Park's arrest and eventual conviction on charges of abuse of power and coercion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Impeachment_of_Park_Geun-hye",
    "citationTitle": "Wikipedia: Impeachment of Park Geun-hye"
  },
  {
    "id": "4b07c662-f0d6-4bed-acb2-76507fca862f",
    "text": "The 'Expenses Scandal' that dominated UK headlines in 2009 primarily concerned which group of people?",
    "options": [
      "Civil servants",
      "Members of Parliament",
      "Local councillors",
      "European Union officials"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The 2009 expenses scandal involved widespread abuse of the parliamentary expenses system by Members of Parliament.",
    "detailedExplanation": "The UK Parliamentary expenses scandal erupted in 2009 when The Daily Telegraph published leaked details of MPs' expense claims, revealing widespread abuse of the system. Claims included everything from duck houses and moat cleaning to flipping second homes for profit. The scandal led to several resignations, criminal prosecutions, and a complete overhaul of the parliamentary expenses system, while severely damaging public trust in politicians.",
    "citationUrl": "https://en.wikipedia.org/wiki/2009_British_MPs%27_expenses_scandal",
    "citationTitle": "Wikipedia: 2009 British MPs' expenses scandal"
  },
  {
    "id": "b95218ab-d2db-4e62-a4b7-4f956fd30e85",
    "text": "What was the name of the 1970s scandal involving payments to FBI Associate Director Mark Felt, later revealed to be 'Deep Throat'?",
    "options": [
      "ABSCAM",
      "COINTELPRO",
      "Teapot Dome",
      "Pentagon Papers"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "COINTELPRO was the FBI's controversial domestic intelligence program that involved illegal surveillance and disruption activities.",
    "detailedExplanation": "COINTELPRO (Counter Intelligence Program) was a series of covert and often illegal projects conducted by the FBI aimed at surveilling, infiltrating, discrediting, and disrupting domestic American political organizations. The scandal broke in 1971 when activists burglarized an FBI office and released documents exposing the program. Mark Felt, who later became known as 'Deep Throat' in the Watergate scandal, was involved in COINTELPRO operations and was later convicted for authorizing illegal break-ins.",
    "citationUrl": "https://en.wikipedia.org/wiki/COINTELPRO",
    "citationTitle": "Wikipedia: COINTELPRO"
  },
  {
    "id": "646c539c-de67-4673-852d-1170e439abbf",
    "text": "Which German Chancellor was forced to resign in 1974 after it was discovered that his close aide was an East German spy?",
    "options": [
      "Helmut Kohl",
      "Willy Brandt",
      "Helmut Schmidt",
      "Ludwig Erhard"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Willy Brandt resigned after his aide Günter Guillaume was exposed as an East German spy in the Guillaume Affair.",
    "detailedExplanation": "The Guillaume Affair was a major political scandal in West Germany in 1974. Günter Guillaume, a close aide to Chancellor Willy Brandt, was discovered to be a spy for East Germany's intelligence service, the Stasi. Guillaume had been feeding classified information to East Germany for years while serving in the Chancellor's office. When the scandal broke, Brandt took full responsibility and resigned from his position as Chancellor, though he remained leader of the Social Democratic Party.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guillaume_Affair",
    "citationTitle": "Wikipedia: Guillaume Affair"
  },
  {
    "id": "a68b0ae7-729d-41cb-b317-ac1f78314074",
    "text": "The 'Profumo Affair' that rocked British politics in 1963 involved a cabinet minister's relationship with whom?",
    "options": [
      "A Soviet diplomat",
      "A call girl named Christine Keeler",
      "A journalist",
      "A business lobbyist"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Profumo Affair involved War Secretary John Profumo's affair with Christine Keeler, who was also involved with a Soviet naval attaché.",
    "detailedExplanation": "The Profumo Affair was a British political scandal in 1963 involving John Profumo, the Secretary of State for War, who had an extramarital affair with Christine Keeler, a 19-year-old model and call girl. The scandal became a national security issue because Keeler was simultaneously involved with Yevgeny Ivanov, a Soviet naval attaché suspected of being a spy. Profumo initially denied the affair in Parliament but later admitted to lying, leading to his resignation and contributing to the Conservative government's downfall in 1964.",
    "citationUrl": "https://en.wikipedia.org/wiki/Profumo_affair",
    "citationTitle": "Wikipedia: Profumo affair"
  },
  {
    "id": "e395bcbc-3d89-4579-985b-fcbe87c07dab",
    "text": "Which Brazilian President was impeached in 2016 over allegations of manipulating government accounts to hide budget deficits?",
    "options": [
      "Jair Bolsonaro",
      "Luiz Inácio Lula da Silva",
      "Dilma Rousseff",
      "Fernando Collor"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Dilma Rousseff was impeached for 'pedaladas fiscais' - fiscal maneuvers that allegedly violated budget laws.",
    "detailedExplanation": "Dilma Rousseff became the second Brazilian president to be impeached when she was removed from office in 2016. She was accused of 'pedaladas fiscais' (fiscal pedaling), which involved using funds from state banks to cover government expenses and delay loan payments, allegedly to make the budget deficit appear smaller than it actually was. Critics argued this violated fiscal responsibility laws, while Rousseff maintained that these were common accounting practices used by previous governments. The impeachment was highly controversial and occurred amid Brazil's worst recession in decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Impeachment_of_Dilma_Rousseff",
    "citationTitle": "Wikipedia: Impeachment of Dilma Rousseff"
  },
  {
    "id": "ba588f00-bf4c-4a12-a7e6-0d25b68ea555",
    "text": "The 'Bofors scandal' that dominated headlines in the late 1980s involved arms deals in which country?",
    "options": [
      "Sweden",
      "India",
      "South Africa",
      "Netherlands"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Bofors scandal involved alleged kickbacks in a howitzer deal between Swedish company Bofors and the Indian government.",
    "detailedExplanation": "The Bofors scandal was a major arms deal controversy in India during the late 1980s involving the purchase of 155mm howitzers from Swedish manufacturer Bofors AB. The scandal centered on allegations that Bofors paid kickbacks to Indian politicians and defense officials, including claims that Prime Minister Rajiv Gandhi's government received illegal commissions. The controversy significantly damaged Gandhi's reputation and contributed to his Congress Party's defeat in the 1989 general election. The case involved complex international investigations and remained in Indian courts for decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bofors_scandal",
    "citationTitle": "Wikipedia: Bofors scandal"
  },
  {
    "id": "2ccb024a-c360-4a2c-b0cb-77c23468c32a",
    "text": "The 'Chappaquiddick incident' in 1969 severely damaged the presidential ambitions of which U.S. Senator?",
    "options": [
      "Robert Kennedy",
      "Edward Kennedy",
      "George McGovern",
      "Hubert Humphrey"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Edward 'Ted' Kennedy's car accident at Chappaquiddick, which resulted in Mary Jo Kopechne's death, ended his presidential prospects.",
    "detailedExplanation": "The Chappaquiddick incident occurred on July 18, 1969, when Senator Edward 'Ted' Kennedy drove his car off a bridge on Chappaquiddick Island, Massachusetts. His passenger, 28-year-old campaign worker Mary Jo Kopechne, drowned in the submerged vehicle. Kennedy's behavior following the accident - including his failure to immediately report it to authorities and conflicting accounts of events - created a major scandal. The incident effectively ended Kennedy's chances of becoming President, despite his continued success as a Senator. He pleaded guilty to leaving the scene of an accident and received a suspended sentence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chappaquiddick_incident",
    "citationTitle": "Wikipedia: Chappaquiddick incident"
  },
  {
    "id": "9c5bd9a3-75b8-409d-ad7d-4addabb410df",
    "text": "Which Japanese Prime Minister resigned in 1989 following the Recruit scandal involving insider trading?",
    "options": [
      "Noboru Takeshita",
      "Yasuhiro Nakasone",
      "Toshiki Kaifu",
      "Kiichi Miyazawa"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Noboru Takeshita resigned as Prime Minister after being implicated in the Recruit scandal involving unlisted shares.",
    "detailedExplanation": "The Recruit scandal was a major corruption case in Japan during the late 1980s involving Recruit Co., a publishing and employment agency company. The company provided unlisted shares at below-market prices to numerous politicians, bureaucrats, and business leaders before the shares went public, allowing recipients to make substantial profits. Prime Minister Noboru Takeshita was among those implicated and was forced to resign in 1989. The scandal also brought down other senior politicians and significantly damaged public trust in Japan's ruling Liberal Democratic Party, contributing to major political reforms in the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Recruit_scandal",
    "citationTitle": "Wikipedia: Recruit scandal"
  },
  {
    "id": "3a0b3133-ff80-4c8a-9fe8-593e9ebdc7a3",
    "text": "The 'Teapot Dome Scandal' of the 1920s, considered one of the worst corruption cases in U.S. history before Watergate, involved the secret leasing of what?",
    "options": [
      "National oil reserves",
      "Military weapons stockpiles",
      "Gold mining rights",
      "Railroad construction contracts"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Teapot Dome Scandal involved Interior Secretary Albert Fall secretly leasing naval oil reserves to private companies in exchange for bribes.",
    "detailedExplanation": "The Teapot Dome Scandal erupted during Warren G. Harding's presidency when Interior Secretary Albert Fall secretly leased the Teapot Dome Naval Oil Reserve in Wyoming and other reserves to private oil companies without competitive bidding. Fall received substantial bribes and became the first Cabinet member in U.S. history to be convicted of a felony and sentenced to prison. The scandal symbolized the corruption of the Harding administration and remained the benchmark for government corruption until Watergate.",
    "citationUrl": "https://en.wikipedia.org/wiki/Teapot_Dome_scandal",
    "citationTitle": "Wikipedia: Teapot Dome scandal"
  },
  {
    "id": "cc443700-2fc9-4a59-a4b6-098e6317a67c",
    "text": "Which Russian oligarch's arrest in 2003 on fraud and tax evasion charges was widely seen as politically motivated punishment for opposing Vladimir Putin?",
    "options": [
      "Roman Abramovich",
      "Mikhail Khodorkovsky",
      "Boris Berezovsky",
      "Alisher Usmanov"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Mikhail Khodorkovsky, once Russia's richest man and head of Yukos oil company, was arrested after publicly criticizing Putin and funding opposition parties.",
    "detailedExplanation": "Mikhail Khodorkovsky's arrest and subsequent prosecution became a defining moment in Putin's consolidation of power. As the head of Yukos oil company and Russia's richest man, Khodorkovsky had openly criticized government corruption and funded opposition political parties. His arrest in 2003 and conviction on charges widely viewed as politically motivated effectively ended the political influence of Russia's oligarchs and demonstrated Putin's willingness to use the justice system against opponents. Khodorkovsky spent over 10 years in prison before being pardoned in 2013.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mikhail_Khodorkovsky",
    "citationTitle": "Wikipedia: Mikhail Khodorkovsky"
  },
  {
    "id": "bb88eaba-8fca-4e3c-97de-f923ceb3e336",
    "text": "The 'Dreyfus Affair' that divided French society in the 1890s involved a Jewish army officer falsely accused of what crime?",
    "options": [
      "Embezzling military funds",
      "Selling military secrets to Germany",
      "Deserting during wartime",
      "Assassinating a government minister"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Captain Alfred Dreyfus was falsely convicted of treason for allegedly selling military secrets to Germany, exposing deep anti-Semitism in French society.",
    "detailedExplanation": "The Dreyfus Affair began in 1894 when Captain Alfred Dreyfus, a Jewish artillery officer, was falsely accused and convicted of selling military secrets to Germany. The case divided French society for over a decade, exposing deep-rooted anti-Semitism and corruption within the military and government. The affair gained international attention when writer Émile Zola published his famous open letter 'J'Accuse...!' defending Dreyfus. The scandal ultimately led to Dreyfus's exoneration in 1906 and contributed to the separation of church and state in France.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dreyfus_affair",
    "citationTitle": "Wikipedia: Dreyfus affair"
  },
  {
    "id": "e7d73887-4ee4-402f-9a90-8df2fa0a7bc0",
    "text": "What was the name of the 2011-2016 Brazilian corruption investigation that uncovered massive kickbacks in the state oil company Petrobras?",
    "options": [
      "Operation Clean Hands",
      "Operation Car Wash",
      "Operation Green Ice",
      "Operation Condor"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Operation Car Wash (Operação Lava Jato) was the largest corruption investigation in Brazilian history, exposing billions in kickbacks at Petrobras.",
    "detailedExplanation": "Operation Car Wash began in 2014 as an investigation into money laundering at a car wash and gas station, but quickly expanded to uncover a massive corruption scheme at Petrobras, Brazil's state oil company. The investigation revealed that construction companies had systematically overcharged Petrobras for contracts, with the excess money being distributed as kickbacks to company executives and politicians. The scandal implicated hundreds of politicians across multiple parties and led to the imprisonment of former President Lula da Silva and contributed to President Dilma Rousseff's impeachment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Operation_Car_Wash",
    "citationTitle": "Wikipedia: Operation Car Wash"
  },
  {
    "id": "a163a105-758e-4d09-8ab1-ae1ae17c783b",
    "text": "The 'Pentagon Papers' leak in 1971 revealed U.S. government deception about which conflict, leading to a landmark Supreme Court case on press freedom?",
    "options": [
      "Korean War",
      "Vietnam War",
      "Bay of Pigs invasion",
      "Iran hostage crisis"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Pentagon Papers revealed government lies about U.S. involvement in Vietnam, leading to the landmark New York Times Co. v. United States Supreme Court case.",
    "detailedExplanation": "The Pentagon Papers were classified documents leaked by Daniel Ellsberg that revealed the U.S. government had systematically lied to the public about the extent and conduct of American involvement in Vietnam. When The New York Times began publishing excerpts in 1971, the Nixon administration sought to stop publication through prior restraint. The resulting Supreme Court case, New York Times Co. v. United States, established important precedents for press freedom. The leak contributed to growing public distrust of government and played a role in Nixon's eventual downfall, as his administration's efforts to stop further leaks led to the creation of the 'Plumbers' unit that later conducted the Watergate break-in.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pentagon_Papers",
    "citationTitle": "Wikipedia: Pentagon Papers"
  }
]