[
  {
    "id": "bef0899c-4201-428d-a55d-d1a04c274bb4",
    "text": "Which Italian city hosts the annual Salone del Gusto, one of the world's most prestigious slow food festivals?",
    "options": [
      "Bologna",
      "Turin",
      "Milan",
      "Naples"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Turin hosts the Salone del Gusto every two years, organized by Slow Food International.",
    "detailedExplanation": "The Salone del Gusto, held biennially in Turin, Italy, is one of the world's largest food and wine events dedicated to sustainable gastronomy. Founded by the Slow Food movement in 1996, this festival brings together producers, chefs, and food enthusiasts from around the globe to celebrate artisanal food production, biodiversity, and traditional cooking methods. The event features tastings, workshops, and conferences focused on preserving food traditions and promoting sustainable agriculture practices.",
    "citationUrl": "https://en.wikipedia.org/wiki/Salone_del_Gusto",
    "citationTitle": "Wikipedia: Salone del Gusto"
  },
  {
    "id": "fe87c305-56c4-4084-8c23-3d3f6e389859",
    "text": "During Mexico's Día de los Muertos celebrations, what is the traditional significance of leaving pan de muerto on family altars?",
    "options": [
      "To ward off evil spirits",
      "To feed the souls of deceased relatives",
      "To ensure a good harvest",
      "To honor the bread makers' guild"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Pan de muerto is placed on ofrendas (altars) to nourish the souls of deceased family members during their annual visit.",
    "detailedExplanation": "Pan de muerto, a sweet bread decorated with bone-shaped dough pieces, is an essential element of Día de los Muertos celebrations in Mexico. According to tradition, the souls of the deceased return to visit their families on November 1st and 2nd, and they require sustenance for their journey. The bread is placed on elaborate home altars called ofrendas, alongside other favorite foods of the departed, marigold flowers, candles, and photographs. The circular shape represents the cycle of life and death, while the decorative 'bones' symbolize the deceased.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pan_de_muerto",
    "citationTitle": "Wikipedia: Pan de muerto"
  },
  {
    "id": "ebdded4d-cdc8-4278-b97e-844b15bcc7e6",
    "text": "What unique cooking method characterizes the traditional Pachamanca festival celebrated in the Peruvian Andes?",
    "options": [
      "Clay pot steaming",
      "Underground earth oven cooking",
      "Solar panel heating",
      "Ice cave preservation"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Pachamanca involves cooking food in underground ovens using hot stones, celebrating the earth goddess Pachamama.",
    "detailedExplanation": "Pachamanca is an ancient Peruvian cooking tradition that serves as both a culinary technique and a spiritual ceremony honoring Pachamama, the Andean earth goddess. The process involves digging a pit, heating volcanic stones with fire, then layering marinated meats, potatoes, corn, and other vegetables between the hot stones and covering everything with earth and blankets. The food cooks slowly underground for several hours, creating incredibly tender and flavorful dishes. This communal cooking method is often performed during harvest festivals and special celebrations throughout the Andean regions of Peru.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pachamanca",
    "citationTitle": "Wikipedia: Pachamanca"
  },
  {
    "id": "117558a1-64de-443f-94b8-37b7995a328f",
    "text": "Which Korean festival traditionally involves communities coming together to make and share large quantities of kimchi for winter storage?",
    "options": [
      "Chuseok",
      "Kimjang",
      "Seollal",
      "Dano"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Kimjang is the traditional Korean practice of making and sharing kimchi, recognized by UNESCO as an Intangible Cultural Heritage.",
    "detailedExplanation": "Kimjang is a time-honored Korean tradition that typically occurs in late autumn when communities, families, and neighbors gather to prepare large quantities of kimchi for the winter months. This practice involves multiple generations working together to wash, salt, and season napa cabbage and other vegetables with a spicy paste made from red pepper flakes, garlic, ginger, and fish sauce. In 2013, UNESCO recognized kimjang as an Intangible Cultural Heritage of Humanity, acknowledging its role in strengthening family bonds and community solidarity while preserving traditional knowledge about food preparation and fermentation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kimjang",
    "citationTitle": "Wikipedia: Kimjang"
  },
  {
    "id": "07ad5881-9955-44af-adbb-f00897719bfc",
    "text": "The La Tomatina festival in Buñol, Spain traditionally begins with which specific challenge?",
    "options": [
      "Climbing a greased pole to retrieve a ham",
      "Running through a maze of tomato plants",
      "Eating the largest tomato in 60 seconds",
      "Blindfolded tomato sorting contest"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "La Tomatina officially begins when someone successfully climbs a greased wooden pole (palo jabón) to retrieve a ham at the top.",
    "detailedExplanation": "La Tomatina, held annually on the last Wednesday of August in Buñol, Spain, is the world's largest food fight festival where participants throw overripe tomatoes at each other. The festival traditionally begins with the 'palo jabón' challenge, where brave participants attempt to climb a tall, greased wooden pole to retrieve a ham hanging at the top. Once someone successfully retrieves the ham, trucks loaded with tomatoes enter the town square and the massive tomato battle begins. This unique tradition started in 1945 and now attracts thousands of international visitors each year to the small Valencian town.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_Tomatina",
    "citationTitle": "Wikipedia: La Tomatina"
  },
  {
    "id": "dc3dd6fc-baa1-48d3-92d5-15a07931b734",
    "text": "In traditional Japanese New Year celebrations, what is the symbolic meaning of eating toshikoshi soba noodles on New Year's Eve?",
    "options": [
      "To ensure prosperity in business",
      "To cut away the previous year's misfortunes",
      "To honor the noodle makers",
      "To guarantee a long marriage"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Toshikoshi soba noodles are eaten to symbolically cut away bad luck and misfortunes from the previous year.",
    "detailedExplanation": "Toshikoshi soba, literally meaning 'year-crossing noodles,' is a deeply rooted Japanese New Year tradition where families eat buckwheat noodles on New Year's Eve before midnight. The custom symbolizes cutting away the hardships and bad luck of the previous year, as the thin noodles are easily cut with chopsticks or teeth. The tradition is believed to have originated in the Kamakura period (1185-1333) and represents a fresh start for the coming year. The buckwheat is also considered to bring resilience and strength, as the grain can withstand harsh weather conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toshikoshi_soba",
    "citationTitle": "Wikipedia: Toshikoshi soba"
  },
  {
    "id": "499ccde9-0b41-4745-9019-85a54c9e577f",
    "text": "Which traditional Middle Eastern festival involves the preparation and sharing of ma'amoul cookies filled with dates, nuts, or figs?",
    "options": [
      "Ramadan Iftar",
      "Eid al-Fitr",
      "Nowruz",
      "Sukkot"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Ma'amoul cookies are traditionally prepared for Eid al-Fitr, marking the end of Ramadan fasting.",
    "detailedExplanation": "Ma'amoul are traditional Middle Eastern shortbread cookies that play a central role in Eid al-Fitr celebrations, marking the end of the holy month of Ramadan. These delicate cookies are made with semolina flour and filled with dates, walnuts, or pistachios, then pressed in special wooden molds called ma'amoul that create intricate decorative patterns on the surface. Families often spend days preparing large quantities of ma'amoul to share with neighbors, friends, and visitors during the Eid festivities. The tradition spans across many countries including Lebanon, Syria, Palestine, and Jordan, with each region having slight variations in preparation methods and fillings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ma%27amoul",
    "citationTitle": "Wikipedia: Ma'amoul"
  },
  {
    "id": "f0ff5723-0441-4c82-b830-464841e0f475",
    "text": "The Pongal festival in Tamil Nadu, India, traditionally involves cooking rice in which type of vessel to symbolize abundance?",
    "options": [
      "Silver urns",
      "Bamboo containers",
      "New clay pots",
      "Copper cauldrons"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Pongal rice is traditionally cooked in new clay pots, which are broken after the festival to symbolize renewal and abundance.",
    "detailedExplanation": "Pongal is a four-day harvest festival celebrated in Tamil Nadu, India, where the centerpiece is the preparation of a sweet rice dish also called pongal. The rice is traditionally cooked in brand new clay pots (called 'panai' in Tamil) along with milk, jaggery, and cardamom until it overflows, symbolizing abundance and prosperity. The overflowing is considered auspicious and represents a bountiful harvest. After the festival, these clay pots are intentionally broken, symbolizing the breaking away of old habits and the welcoming of new beginnings. The festival typically occurs in mid-January and coincides with the winter harvest season.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pongal_(festival)",
    "citationTitle": "Wikipedia: Pongal (festival)"
  },
  {
    "id": "3a63b142-e70c-48ba-a3cc-e6b317a8ec27",
    "text": "What traditional fermented beverage is central to the Oktoberfest celebration in Munich, and must be brewed within the city limits to be served at the festival?",
    "options": [
      "Märzen",
      "Weissbier",
      "Pilsner",
      "Kölsch"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Märzen is the traditional amber lager specifically brewed for Oktoberfest.",
    "detailedExplanation": "Märzen, meaning 'March' in German, is a medium-bodied, malty amber lager that was traditionally brewed in March and stored through the summer months. At Oktoberfest, only beer brewed within Munich's city limits by the six traditional breweries (Augustiner, Hofbräu, Löwenbräu, Franziskaner, Spaten-Löwenbräu, and Weissbier) can be served. The beer must also adhere to strict brewing standards and be served in the traditional 1-liter Maß steins.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oktoberfest",
    "citationTitle": "Wikipedia: Oktoberfest"
  },
  {
    "id": "7396d9d7-fe88-4248-a7fa-de2f1cfc1a46",
    "text": "The Cheese Rolling Festival at Cooper's Hill in England traditionally uses which specific type of cheese that participants chase down the steep hillside?",
    "options": [
      "Double Gloucester",
      "Stilton",
      "Wensleydale",
      "Red Leicester"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "A wheel of Double Gloucester cheese is traditionally rolled down Cooper's Hill.",
    "detailedExplanation": "The Cooper's Hill Cheese-Rolling and Wake has been held annually for over 200 years in Gloucestershire, England. A 7-9 pound wheel of Double Gloucester cheese is rolled down the extremely steep Cooper's Hill, and participants chase after it. The first person to reach the bottom wins the cheese. Double Gloucester is specifically chosen because it's a hard, aged cheese that can withstand the tumble down the hill without completely breaking apart, and it has historical significance to the Gloucestershire region where the festival takes place.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cooper%27s_Hill_Cheese-Rolling_and_Wake",
    "citationTitle": "Wikipedia: Cooper's Hill Cheese-Rolling and Wake"
  },
  {
    "id": "38acf386-3f87-4561-b91e-8e8529fb4c32",
    "text": "During the traditional Greek Orthodox Easter celebration, what is the significance of the red-dyed eggs (kokkina avga) that are cracked together?",
    "options": [
      "To predict the weather for the coming year",
      "To symbolize Christ's blood and resurrection",
      "To determine who will have good fortune",
      "To represent the twelve apostles"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Red eggs symbolize Christ's blood and the resurrection, with the cracking representing Christ breaking free from the tomb.",
    "detailedExplanation": "In Greek Orthodox tradition, eggs are dyed red on Holy Thursday to represent the blood of Christ and the promise of eternal life. During Easter celebrations, people tap their eggs together while saying 'Christos Anesti' (Christ is Risen) and 'Alithos Anesti' (Truly He is Risen). The cracking of the eggshell symbolizes Christ's emergence from the tomb and His resurrection. The person whose egg remains uncracked is said to have good luck for the year. This tradition dates back centuries and is deeply embedded in Greek Orthodox Easter customs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Easter_traditions",
    "citationTitle": "Wikipedia: Easter traditions"
  },
  {
    "id": "a5c83dd9-dfcb-4f44-82bb-f97f770c690d",
    "text": "The Mid-Autumn Festival in China traditionally features mooncakes with how many egg yolks to represent the full moon?",
    "options": [
      "One",
      "Two",
      "Three",
      "Four"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Traditional mooncakes contain one salted egg yolk to symbolize the full moon.",
    "detailedExplanation": "During the Mid-Autumn Festival, also known as the Moon Festival, families gather to appreciate the full moon and share mooncakes. Traditional mooncakes often contain a single salted duck egg yolk at their center, which when cut reveals a golden orb resembling the full moon. The egg yolk is surrounded by sweet paste made from ingredients like lotus seeds, red beans, or mixed nuts. While modern variations may include multiple yolks or different fillings, the classic preparation features one yolk to maintain the symbolic representation of the full moon that is central to the festival's celebration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mid-Autumn_Festival",
    "citationTitle": "Wikipedia: Mid-Autumn Festival"
  },
  {
    "id": "916a40de-f2bf-4a41-8658-cf427fda82ae",
    "text": "Which spice is traditionally thrown by participants during the Holi festival in India, giving the celebration its distinctive colorful appearance?",
    "options": [
      "Saffron",
      "Turmeric",
      "Paprika",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Multiple spices including turmeric, saffron, and paprika are used to create the colorful powders thrown during Holi.",
    "detailedExplanation": "Holi, known as the Festival of Colors, traditionally uses natural colored powders called 'gulal' made from various spices and natural ingredients. Turmeric creates yellow colors, saffron produces orange and yellow hues, paprika contributes red shades, and other natural materials like beetroot, spinach, and flower petals are also used. These colored powders are thrown and smeared on participants as they celebrate the arrival of spring and the triumph of good over evil. The tradition has ancient roots in Hindu mythology and represents joy, love, and the breaking down of social barriers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Holi",
    "citationTitle": "Wikipedia: Holi"
  },
  {
    "id": "8bcb456a-8915-4323-9f8b-2c1967cc2c49",
    "text": "The traditional Thanksgiving feast in the United States historically included which indigenous cooking technique that is rarely used in modern celebrations?",
    "options": [
      "Smoking in bark containers",
      "Earth pit roasting",
      "Clay pot steaming",
      "Ash cooking"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Indigenous peoples traditionally used earth pit roasting to cook large game and vegetables for communal feasts.",
    "detailedExplanation": "Before European colonization, indigenous peoples of North America commonly used earth pit roasting for large communal feasts. This technique involved digging a pit, lining it with stones, building a fire to heat the stones, then placing wrapped food (often whole animals, corn, squash, and beans) in the pit and covering it with earth to cook slowly over many hours. This method was likely used at early harvest celebrations that would later influence the Thanksgiving tradition. The technique allowed for cooking large quantities of food for community gatherings and imparted unique flavors through the slow, smoky cooking process.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thanksgiving_(United_States)",
    "citationTitle": "Wikipedia: Thanksgiving (United States)"
  },
  {
    "id": "07148afe-d5e7-4335-8581-8cfc839249b6",
    "text": "During Ramadan, the traditional breaking of the fast (Iftar) customarily begins with eating which specific food, following the practice of Prophet Muhammad?",
    "options": [
      "Dates",
      "Olives",
      "Almonds",
      "Figs"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Muslims traditionally break their fast with dates, following the Sunnah of Prophet Muhammad.",
    "detailedExplanation": "The tradition of breaking the Ramadan fast with dates is based on the Sunnah (practices) of Prophet Muhammad, who reportedly broke his fasts with fresh dates when available, or dried dates and water when fresh ones were not available. This practice has both religious and practical significance: dates provide quick energy through natural sugars after a day of fasting, they're easily digestible, and they contain essential nutrients like potassium and fiber. The Iftar meal typically begins with dates and water or milk, followed by prayer, and then a larger meal. This tradition is observed by Muslims worldwide during the holy month of Ramadan.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iftar",
    "citationTitle": "Wikipedia: Iftar"
  },
  {
    "id": "8652b192-b453-4f1b-80d0-ee47b29fae2c",
    "text": "The traditional Scottish Burns Night celebration features a ceremonial presentation of which dish, accompanied by a recitation of Robert Burns' poem?",
    "options": [
      "Shepherd's pie",
      "Haggis",
      "Cock-a-leekie soup",
      "Shortbread"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Haggis is ceremonially presented during Burns Night while 'Address to a Haggis' is recited.",
    "detailedExplanation": "Burns Night, celebrated annually on January 25th to honor Scottish poet Robert Burns, features the ceremonial 'Address to a Haggis' where the traditional Scottish dish is presented with great fanfare. Haggis, made from sheep's heart, liver, and lungs mixed with oatmeal, suet, and spices, is carried in on a platter while bagpipes play. A designated person then recites Burns' famous poem 'Address to a Haggis,' which includes dramatic gestures and culminates in cutting open the haggis with a knife. This theatrical presentation is central to Burns Night celebrations worldwide and honors both the national dish of Scotland and the poet who immortalized it in verse.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burns_supper",
    "citationTitle": "Wikipedia: Burns supper"
  },
  {
    "id": "80d914ee-f006-4dd5-ab84-ee51d199d1f8",
    "text": "Which traditional Spanish festival involves participants creating elaborate towers of human bodies while eating specific pastries called 'panellets' made from marzipan and pine nuts?",
    "options": [
      "La Castanyada",
      "San Fermín",
      "Feria de Abril",
      "Las Fallas"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "La Castanyada is a Catalan autumn festival featuring human towers (castells) and traditional panellets pastries.",
    "detailedExplanation": "La Castanyada is a traditional Catalan festival celebrated on All Saints' Day (November 1st) that combines spectacular human tower competitions called 'castells' with the consumption of seasonal foods including panellets - small round cakes made from marzipan, sugar, and egg, often covered with pine nuts. The festival also features roasted chestnuts and sweet potatoes, marking the transition from autumn to winter. The human towers can reach up to 10 levels high and require incredible coordination and trust among participants.",
    "citationUrl": "https://en.wikipedia.org/wiki/Castanyada",
    "citationTitle": "Wikipedia: Castanyada"
  },
  {
    "id": "1fb491be-c68e-452c-a809-9f8c04b9c784",
    "text": "The ancient Roman festival of Saturnalia, which influenced many modern winter celebrations, traditionally featured the consumption of which honey-sweetened fried pastry that was considered sacred to the gods?",
    "options": [
      "Libum",
      "Panis quadratus",
      "Mulsum cakes",
      "Crustulum"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Libum was a sacred honey-sweetened cheesecake offered to Roman gods during Saturnalia and other religious festivals.",
    "detailedExplanation": "During Saturnalia, the ancient Roman winter solstice festival that ran from December 17-23, Romans prepared libum - a sacred cake made from flour, cheese, and honey that was baked on bay leaves. This offering was considered essential for pleasing the gods and ensuring good fortune. The festival reversed social norms, with masters serving slaves, and featured elaborate feasts where libum held special ceremonial importance. The honey in libum was believed to carry prayers to the gods, making it more than just food but a spiritual conduit.",
    "citationUrl": "https://en.wikipedia.org/wiki/Saturnalia",
    "citationTitle": "Wikipedia: Saturnalia"
  },
  {
    "id": "e6f7145a-d210-4c86-8add-8d8ce0d30a0b",
    "text": "Which traditional Moroccan festival celebration requires families to slaughter a lamb and prepare specific organ meats within exactly seven days, with the liver being consumed first as a test of the meat's quality?",
    "options": [
      "Eid al-Fitr",
      "Eid al-Adha",
      "Mawlid al-Nabi",
      "Ashura"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Eid al-Adha involves the ritual sacrifice and consumption of lamb, with specific traditions about organ preparation and timing.",
    "detailedExplanation": "Eid al-Adha, the 'Festival of Sacrifice,' commemorates Abraham's willingness to sacrifice his son and involves the ritual slaughter of a lamb or other livestock. In Moroccan tradition, the entire animal must be consumed within seven days, with nothing wasted. The liver is traditionally prepared and eaten first, often grilled with spices, as it spoils quickly and serves as an indicator of the animal's health and the quality of the meat. Families carefully plan the consumption of different parts throughout the week, with specific dishes like tangia and mrouzia being prepared from various cuts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eid_al-Adha",
    "citationTitle": "Wikipedia: Eid al-Adha"
  },
  {
    "id": "87ea2cc9-ddf7-4dac-8e78-280ae437df34",
    "text": "The traditional Thai festival of Loy Krathong involves floating decorative baskets on water, but participants must also consume which specific type of traditional sweet made from coconut and shaped like flowers to ensure good luck?",
    "options": [
      "Thong yip",
      "Khanom chan",
      "Look choop",
      "Thong yod"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Thong yip are traditional Thai flower-shaped sweets made from coconut and egg yolks, consumed during Loy Krathong for good fortune.",
    "detailedExplanation": "During Loy Krathong, Thailand's festival of lights held on the full moon of the 12th lunar month, participants create and float decorative krathong (baskets) on rivers and lakes to honor the water goddess. The festival also includes the consumption of traditional desserts, particularly thong yip - delicate flower-shaped sweets made from coconut milk, sugar, and duck egg yolks. These golden treats are believed to bring prosperity and good fortune, with their flower shape symbolizing blooming luck. The preparation is considered an art form, requiring skill to achieve the perfect petal-like appearance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Loy_Krathong",
    "citationTitle": "Wikipedia: Loy Krathong"
  }
]