[
  {
    "id": "93f89aff-3a64-4deb-948e-2461e2e72048",
    "text": "Which Spanish city is famous for its annual tomato-throwing festival called La Tomatina?",
    "options": [
      "Valencia",
      "Buñol",
      "Seville",
      "Granada"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "La Tomatina takes place in the small town of Buñol, near Valencia.",
    "detailedExplanation": "La Tomatina is held annually on the last Wednesday of August in Buñol, a small town in the Valencia region of Spain. The festival involves thousands of participants throwing overripe tomatoes at each other in the town's main square. What began as a spontaneous food fight among locals in 1945 has grown into one of Spain's most famous festivals, attracting visitors from around the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_Tomatina",
    "citationTitle": "Wikipedia: La Tomatina"
  },
  {
    "id": "ab992f30-6846-47c4-9fb6-ca4eb10a402c",
    "text": "What traditional German festival food consists of a large, soft pretzel typically served with mustard or cheese?",
    "options": [
      "Strudel",
      "Bratwurst",
      "Bretzel",
      "Schnitzel"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Bretzel (or Brezel) is the traditional German pretzel commonly enjoyed at Oktoberfest and other German festivals.",
    "detailedExplanation": "The Bretzel, known internationally as a pretzel, is a traditional German baked bread product that has become synonymous with German festivals, particularly Oktoberfest. These large, twisted bread rolls are characterized by their distinctive knot shape and are traditionally topped with coarse salt. At German festivals, they're often served warm with sweet mustard (Süßer Senf) or cheese sauce, and pair perfectly with German beer.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pretzel",
    "citationTitle": "Wikipedia: Pretzel"
  },
  {
    "id": "97034d24-1fa1-4a5b-83e7-a08df9c1c710",
    "text": "During which Hindu festival do people traditionally prepare and share sweets like laddu and barfi?",
    "options": [
      "Holi",
      "Diwali",
      "Dussehra",
      "Navratri"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Diwali, the Festival of Lights, is traditionally celebrated with the preparation and sharing of various sweets.",
    "detailedExplanation": "Diwali, also known as the Festival of Lights, is one of the most important Hindu festivals where food plays a central role in the celebrations. Traditional sweets like laddu (round sweets made from flour, ghee, and sugar), barfi (milk-based confections), and gulab jamun are prepared in homes and shared with family, friends, and neighbors. The preparation and exchange of these sweets symbolizes the spreading of joy, prosperity, and goodwill during this auspicious time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diwali",
    "citationTitle": "Wikipedia: Diwali"
  },
  {
    "id": "61b7fd93-c6a7-4b3e-a0ac-9f1977d4a968",
    "text": "What is the main ingredient in the traditional Mexican Día de los Muertos bread called 'Pan de Muerto'?",
    "options": [
      "Corn flour",
      "Wheat flour",
      "Rice flour",
      "Almond flour"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Pan de Muerto is made primarily from wheat flour, similar to brioche, and is often flavored with anise or orange.",
    "detailedExplanation": "Pan de Muerto (Bread of the Dead) is a traditional Mexican sweet bread prepared specifically for Día de los Muertos (Day of the Dead) celebrations. Made primarily from wheat flour, this enriched bread is similar to brioche in texture and is often flavored with anise seeds or orange zest. The bread is typically shaped in a round loaf with bone-shaped pieces of dough arranged on top, symbolizing the cycle of life and death. It's placed on altars (ofrendas) to honor deceased loved ones and is shared among families during the celebration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pan_de_muerto",
    "citationTitle": "Wikipedia: Pan de muerto"
  },
  {
    "id": "6f68e233-0ce2-4286-a9e0-dc6225ac0e00",
    "text": "Which American city is famous for hosting the annual Nathan's Famous Hot Dog Eating Contest on July 4th?",
    "options": [
      "New York City",
      "Chicago",
      "Philadelphia",
      "Boston"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The contest takes place at the original Nathan's Famous location in Coney Island, Brooklyn, New York City.",
    "detailedExplanation": "The Nathan's Famous Fourth of July International Hot Dog Eating Contest has been held annually since 1972 at the original Nathan's Famous restaurant in Coney Island, Brooklyn, New York City. This competitive eating event has become an iconic American Independence Day tradition, drawing thousands of spectators and television viewers. The contest is sanctioned by Major League Eating and has produced legendary competitive eaters like Joey Chestnut, who holds the current world record of 76 hot dogs and buns consumed in 10 minutes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nathan%27s_Famous_Fourth_of_July_International_Hot_Dog_Eating_Contest",
    "citationTitle": "Wikipedia: Nathan's Famous Fourth of July International Hot Dog Eating Contest"
  },
  {
    "id": "445bbcb3-6c5b-4dbd-ac3a-6328fc07f23d",
    "text": "What type of food is traditionally eaten during the Chinese Mid-Autumn Festival?",
    "options": [
      "Dumplings",
      "Noodles",
      "Mooncakes",
      "Spring rolls"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Mooncakes are the traditional food associated with the Mid-Autumn Festival, symbolizing completeness and reunion.",
    "detailedExplanation": "Mooncakes are dense, round pastries that are the quintessential food of the Chinese Mid-Autumn Festival, also known as the Moon Festival. These traditional treats are typically filled with sweet bean paste, lotus seed paste, or egg yolks, and are often decorated with intricate designs on top. The round shape symbolizes completeness and reunion, making them perfect for a festival that celebrates family unity and the full moon. Families gather to share mooncakes while admiring the full moon, and they're also given as gifts to relatives and friends.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mooncake",
    "citationTitle": "Wikipedia: Mooncake"
  },
  {
    "id": "b1ea9e52-814a-42ae-aec2-564ce46cd457",
    "text": "Which Italian region is home to the annual White Truffle Festival in Alba?",
    "options": [
      "Tuscany",
      "Piedmont",
      "Umbria",
      "Emilia-Romagna"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Alba is located in the Piedmont region of northwestern Italy, famous for its white truffles.",
    "detailedExplanation": "The International White Truffle Fair of Alba takes place in Alba, a city in the Piedmont region of northwestern Italy. This prestigious festival, held annually from October to November, celebrates the prized white truffle (Tuber magnatum), which grows naturally in the hills around Alba. The festival features truffle hunting demonstrations, auctions of the finest specimens, and restaurants serving truffle-based dishes. Alba's white truffles are considered among the most valuable and aromatic in the world, making this festival a pilgrimage site for food enthusiasts and chefs globally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alba,_Piedmont",
    "citationTitle": "Wikipedia: Alba, Piedmont"
  },
  {
    "id": "6a6a6a7e-c8a9-46c6-9f5a-78c397de4966",
    "text": "What is the traditional food prepared during the Jewish festival of Passover to replace regular bread?",
    "options": [
      "Challah",
      "Bagels",
      "Matzo",
      "Pita"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Matzo is unleavened bread eaten during Passover to commemorate the Exodus from Egypt.",
    "detailedExplanation": "Matzo (also spelled matzah) is an unleavened flatbread that becomes the central bread substitute during the Jewish festival of Passover. According to Jewish tradition, matzo commemorates the haste with which the Israelites left Egypt during the Exodus, when they didn't have time to let their bread rise. During the eight days of Passover, observant Jews avoid all leavened products (chametz) and instead eat matzo. The preparation of matzo is strictly regulated, with the entire process from mixing flour and water to baking completed within 18 minutes to prevent any fermentation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Matzo",
    "citationTitle": "Wikipedia: Matzo"
  },
  {
    "id": "fabac435-a3ec-4dc0-935e-72d32abb257e",
    "text": "What is the traditional dish prepared during the Greek Orthodox Easter celebration, typically featuring lamb as the main ingredient?",
    "options": [
      "Souvlaki",
      "Arni me patates",
      "Moussaka",
      "Gyros"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Arni me patates (lamb with potatoes) is the traditional Greek Orthodox Easter dish.",
    "detailedExplanation": "During Greek Orthodox Easter, families traditionally prepare 'Arni me patates,' which is roast lamb with potatoes. This dish is central to the Easter celebration in Greece, often cooked in large ovens or on spits outdoors. The lamb symbolizes the sacrifice of Christ, and the meal is shared after the midnight Easter service, breaking the 40-day Lenten fast. The preparation is often a community affair, bringing families and neighbors together.",
    "citationUrl": "https://en.wikipedia.org/wiki/Greek_Orthodox_Easter",
    "citationTitle": "Wikipedia: Greek Orthodox Easter"
  },
  {
    "id": "bca91981-45d0-404f-8dc1-3108924dbd4b",
    "text": "Which famous French wine region hosts an annual harvest festival called 'Les Trois Glorieuses' every November?",
    "options": [
      "Champagne",
      "Bordeaux",
      "Burgundy",
      "Loire Valley"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Burgundy hosts Les Trois Glorieuses, a three-day wine harvest celebration.",
    "detailedExplanation": "Les Trois Glorieuses (The Three Glorious Days) is Burgundy's most prestigious wine festival, held annually in November. The three-day celebration takes place in Beaune, Meursault, and Dijon, featuring wine auctions, tastings, and elaborate banquets. The highlight is the charity wine auction at the Hospices de Beaune, where rare Burgundy wines are sold to benefit the historic hospital. The festival celebrates the end of the harvest season and has been a tradition for over 150 years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hospices_de_Beaune",
    "citationTitle": "Wikipedia: Hospices de Beaune"
  },
  {
    "id": "e0d8eaea-b506-49c6-baa6-b5ec77b0bbed",
    "text": "What is the name of the traditional Korean fermented cabbage dish that has its own dedicated festival in Seoul?",
    "options": [
      "Bulgogi",
      "Bibimbap",
      "Kimchi",
      "Japchae"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Kimchi is celebrated at the annual Seoul Kimchi Festival.",
    "detailedExplanation": "The Seoul Kimchi Festival is held annually to celebrate kimchi, Korea's most iconic fermented food. The festival typically takes place in autumn, coinciding with kimjang season when families traditionally prepare large quantities of kimchi for winter storage. Visitors can learn to make various types of kimchi, participate in tastings, and witness cultural performances. The festival has helped promote Korean culture internationally and was particularly significant after kimjang was recognized by UNESCO as an Intangible Cultural Heritage.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kimchi",
    "citationTitle": "Wikipedia: Kimchi"
  },
  {
    "id": "6022eb25-ea32-453e-9a8f-8801906be1c2",
    "text": "During which season is the traditional Japanese cherry blossom viewing party called 'Hanami' celebrated, featuring special seasonal foods?",
    "options": [
      "Winter",
      "Spring",
      "Summer",
      "Autumn"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Hanami takes place in spring during cherry blossom season.",
    "detailedExplanation": "Hanami, literally meaning 'flower viewing,' is a traditional Japanese custom of enjoying cherry blossoms in spring, typically from March to May. During hanami parties, families and friends gather under blooming sakura trees to share special seasonal foods like sakura mochi (pink rice cakes), hanami dango (colored dumplings), and chirashi sushi. The practice dates back over 1,000 years and represents the ephemeral nature of life, as cherry blossoms bloom briefly before falling.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hanami",
    "citationTitle": "Wikipedia: Hanami"
  },
  {
    "id": "b40e6338-a4e8-4274-87c8-a618fcfbf350",
    "text": "What type of seafood is the focus of the annual Galway International Oyster Festival in Ireland?",
    "options": [
      "Mussels",
      "Oysters",
      "Lobsters",
      "Scallops"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Galway festival specifically celebrates oysters from Galway Bay.",
    "detailedExplanation": "The Galway International Oyster Festival, held annually since 1954, celebrates the famous Galway Bay oysters. The festival typically takes place in September and features oyster opening competitions, tastings, and traditional Irish music and dancing. Galway Bay oysters are renowned for their distinctive flavor, influenced by the unique combination of fresh and salt water where the River Corrib meets Galway Bay. The festival attracts visitors from around the world and includes events like the World Oyster Opening Championship.",
    "citationUrl": "https://en.wikipedia.org/wiki/Galway_International_Oyster_Festival",
    "citationTitle": "Wikipedia: Galway International Oyster Festival"
  },
  {
    "id": "d577cb95-682c-4386-8f6e-5afb943a27a8",
    "text": "Which spice is traditionally used to flavor the hot cross buns eaten during Easter in many Christian countries?",
    "options": [
      "Cardamom",
      "Cinnamon",
      "Nutmeg",
      "Allspice"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Cinnamon is the primary spice used in traditional hot cross buns.",
    "detailedExplanation": "Hot cross buns are traditional Easter treats marked with a cross on top, symbolizing the crucifixion of Jesus Christ. These spiced sweet buns are typically flavored with cinnamon, along with other spices like nutmeg and allspice, and often contain currants or raisins. The tradition dates back to medieval England, and the buns are traditionally eaten on Good Friday. According to folklore, hot cross buns baked on Good Friday would never go moldy and could ward off evil spirits.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hot_cross_bun",
    "citationTitle": "Wikipedia: Hot cross bun"
  },
  {
    "id": "bd48bba1-8d00-4a95-9701-8687979f9840",
    "text": "What is the name of the Italian festival celebrating the harvest of the 'black gold' truffles in the town of Norcia?",
    "options": [
      "Festa del Tartufo Nero",
      "Sagra della Castagna",
      "Festa dell'Uva",
      "Sagra del Cinghiale"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Festa del Tartufo Nero celebrates the black truffle harvest in Norcia.",
    "detailedExplanation": "The Festa del Tartufo Nero (Black Truffle Festival) is held annually in Norcia, Umbria, typically in February and March to celebrate the prized black truffles found in the surrounding mountains. Norcia is famous for producing some of Italy's finest black truffles, often called 'black gold' due to their high value. The festival features truffle hunting demonstrations, cooking competitions, tastings of truffle-based dishes, and markets where visitors can purchase fresh truffles and truffle products directly from local hunters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Norcia",
    "citationTitle": "Wikipedia: Norcia"
  },
  {
    "id": "b797ffdf-951b-46cd-ad7d-7e224b14a8a9",
    "text": "Which Middle Eastern pastry, traditionally eaten during Ramadan to break the fast, is deep-fried and soaked in sugar syrup?",
    "options": [
      "Baklava",
      "Jalebi",
      "Qatayef",
      "Kunafa"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Qatayef is the traditional Ramadan pancake filled and fried, then soaked in syrup.",
    "detailedExplanation": "Qatayef is a traditional Middle Eastern dessert particularly associated with Ramadan. These small pancakes are made from a special batter, filled with cheese, nuts, or cream, then folded and either fried or baked before being soaked in sugar syrup or honey. They are commonly eaten during iftar (the evening meal that breaks the daily fast) throughout the holy month. The dish varies across different Arab countries, with each region having its own preferred fillings and preparation methods.",
    "citationUrl": "https://en.wikipedia.org/wiki/Qatayef",
    "citationTitle": "Wikipedia: Qatayef"
  },
  {
    "id": "fb450cb0-a8c1-4baf-af42-b45d1b954cbf",
    "text": "What is the traditional Christmas cake eaten in Italy that originated in Milan and is now enjoyed worldwide during the holiday season?",
    "options": [
      "Panettone",
      "Tiramisu",
      "Cannoli",
      "Sfogliatelle"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Panettone is the traditional Italian Christmas cake from Milan, filled with candied fruits and raisins.",
    "detailedExplanation": "Panettone is a sweet bread loaf that originated in Milan in the 15th century and has become synonymous with Christmas celebrations in Italy and around the world. This dome-shaped cake is made with eggs, butter, and sugar, and traditionally contains candied orange, citron, and lemon zest, as well as raisins. The preparation process is lengthy and complex, requiring multiple rising periods that can take several days. During Christmas season, panettone festivals and competitions are held throughout Italy, celebrating this iconic holiday bread that has become a symbol of Italian Christmas tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Panettone",
    "citationTitle": "Wikipedia: Panettone"
  },
  {
    "id": "71657295-be18-471c-ade6-1473479ff2cb",
    "text": "Which traditional Scottish celebration involves the ceremonial addressing and eating of a sheep's organ pudding, accompanied by neeps and tatties?",
    "options": [
      "Hogmanay",
      "Burns Night",
      "Highland Games",
      "St. Andrew's Day"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Burns Night celebrates Scottish poet Robert Burns with a traditional meal featuring haggis, neeps (turnips), and tatties (potatoes).",
    "detailedExplanation": "Burns Night, celebrated annually on January 25th, honors Scotland's national poet Robert Burns. The centerpiece of the celebration is the traditional Burns Supper, which features haggis as the main course. Haggis is a savory pudding made from sheep's heart, liver, and lungs, mixed with onion, oatmeal, suet, and spices, traditionally encased in the animal's stomach. The evening includes the famous 'Address to a Haggis,' a poem by Burns that is recited while the haggis is ceremonially cut open with a sgian-dubh (Scottish knife). The meal is completed with neeps (mashed turnips) and tatties (mashed potatoes), creating a feast that has remained largely unchanged for over 200 years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burns_supper",
    "citationTitle": "Wikipedia: Burns supper"
  },
  {
    "id": "36cd14ae-adfc-4c9e-addd-27eae822cf8e",
    "text": "What is the name of the traditional New Orleans festival that features king cakes, a pastry traditionally eaten from Epiphany until the start of Lent?",
    "options": [
      "Jazz Fest",
      "Mardi Gras",
      "French Quarter Festival",
      "Voodoo Music Experience"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Mardi Gras season in New Orleans is when king cakes are traditionally eaten, from January 6th until Fat Tuesday.",
    "detailedExplanation": "Mardi Gras, also known as Carnival season, is a vibrant celebration in New Orleans that begins on January 6th (Epiphany or Twelfth Night) and culminates on Fat Tuesday, the day before Ash Wednesday. During this period, king cakes become an essential part of the festivities. These oval-shaped pastries are braided, baked, and decorated with purple, gold, and green icing representing justice, power, and faith. Hidden inside each king cake is a small plastic baby figurine, and tradition dictates that whoever finds the baby in their slice must host the next king cake party or buy the next cake. This sweet tradition dates back to 12th century France and has become deeply embedded in New Orleans culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/King_cake",
    "citationTitle": "Wikipedia: King cake"
  },
  {
    "id": "408e5b2a-170a-4a6d-a833-0c77978ec66d",
    "text": "Which annual food festival in the Netherlands celebrates herring season, where people traditionally eat the fish raw with onions and pickles?",
    "options": [
      "Nieuwjaarsduik",
      "Vlaggetjesdag",
      "Koningsdag",
      "Prinsjesdag"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Vlaggetjesdag (Flag Day) marks the start of herring season in the Netherlands, celebrating the first catch of new herring.",
    "detailedExplanation": "Vlaggetjesdag, literally meaning 'Flag Day,' is a Dutch maritime tradition that marks the official start of the new herring season, typically held in May or June in the fishing port of Scheveningen. On this day, the first barrel of 'Hollandse Nieuwe' (Dutch New Herring) is auctioned for charity, often fetching thousands of euros. The festival celebrates the young, lightly-salted herring that has been a Dutch delicacy for centuries. Traditional consumption involves holding the fish by its tail and eating it whole, often accompanied by chopped raw onions and pickles. The event features maritime parades, traditional fishing boats, and cultural performances, celebrating both the fishing industry and this unique culinary tradition that defines Dutch food culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vlaggetjesdag",
    "citationTitle": "Wikipedia: Vlaggetjesdag"
  }
]