[
  {
    "id": "d697149e-f5d2-42b6-b8b7-acc7846ad290",
    "text": "Which golfer holds the record for the most consecutive cuts made in major championships?",
    "options": [
      "Tiger Woods",
      "Jack Nicklaus",
      "Byron Nelson",
      "Ben Hogan"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Byron Nelson made 37 consecutive cuts in major championships from 1939 to 1960.",
    "detailedExplanation": "Byron Nelson holds the remarkable record of making 37 consecutive cuts in major championships, spanning from 1939 to 1960. This streak demonstrates incredible consistency at the highest level of professional golf. The streak was interrupted by World War II but continued when major championships resumed. Nelson's consistent performance in majors is considered one of golf's most underrated records, especially given the era in which he played and the competition he faced.",
    "citationUrl": "https://en.wikipedia.org/wiki/Byron_Nelson",
    "citationTitle": "Wikipedia: Byron Nelson"
  },
  {
    "id": "f113db78-c689-4172-a8e1-1ebcdb2c2182",
    "text": "At which major championship did Rory McIlroy achieve his largest margin of victory?",
    "options": [
      "2011 U.S. Open",
      "2012 PGA Championship",
      "2014 Open Championship",
      "2014 PGA Championship"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "McIlroy won the 2011 U.S. Open by 8 strokes, his largest major championship margin.",
    "detailedExplanation": "Rory McIlroy's dominant performance at the 2011 U.S. Open at Congressional Country Club saw him win by 8 strokes, setting the record for the lowest 72-hole score in U.S. Open history at the time with 268 (-16). This was McIlroy's first major championship victory and remains his largest margin of victory in a major. The Northern Irishman's performance was particularly impressive given that he had suffered a collapse at the Masters just two months earlier.",
    "citationUrl": "https://en.wikipedia.org/wiki/2011_U.S._Open_(golf)",
    "citationTitle": "Wikipedia: 2011 U.S. Open (golf)"
  },
  {
    "id": "d1737337-55ae-4493-9e61-493e21476560",
    "text": "Which player was the first to win major championships in three different decades?",
    "options": [
      "Sam Snead",
      "Gary Player",
      "Julius Boros",
      "Ben Hogan"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Julius Boros won majors in the 1950s, 1960s, and 1970s, making him the first to achieve this feat.",
    "detailedExplanation": "Julius Boros was the first golfer to win major championships across three different decades. He won the 1952 U.S. Open (1950s), the 1963 U.S. Open (1960s), and the 1968 PGA Championship (1970s). This achievement highlighted Boros's longevity and adaptability in professional golf. His 1968 PGA Championship victory at age 48 made him the oldest player to win a major championship at that time, a record that stood until being broken by Jack Nicklaus in 1986.",
    "citationUrl": "https://en.wikipedia.org/wiki/Julius_Boros",
    "citationTitle": "Wikipedia: Julius Boros"
  },
  {
    "id": "c93eabd9-e1dc-4aef-aa16-1eefc1851d37",
    "text": "What unique distinction does Craig Wood hold in major championship history?",
    "options": [
      "First player to win back-to-back majors",
      "First player to lose playoffs in all four majors",
      "Youngest major champion",
      "First left-handed major winner"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Craig Wood was the first and only player to lose playoffs in all four major championships.",
    "detailedExplanation": "Craig Wood holds the unfortunate distinction of being the first player to lose playoffs in all four major championships. He lost playoffs at the Masters (1935), U.S. Open (1939), Open Championship (1933), and PGA Championship (1934). Despite this record of near-misses, Wood eventually broke through to win major championships, capturing the Masters and U.S. Open in 1941. His persistence through these playoff defeats and eventual success makes his story one of perseverance in golf history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Craig_Wood_(golfer)",
    "citationTitle": "Wikipedia: Craig Wood (golfer)"
  },
  {
    "id": "defadf7c-fc8d-47c5-a2ef-799dd0715c27",
    "text": "Which major championship has been won by the most different players since 1960?",
    "options": [
      "Masters Tournament",
      "U.S. Open",
      "Open Championship",
      "PGA Championship"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Open Championship has had the most different winners since 1960, with its links-style format creating more variety in champions.",
    "detailedExplanation": "The Open Championship has produced the most different winners among the four majors since 1960. The unique links-style golf courses and variable weather conditions of The Open Championship often favor different types of players and playing styles compared to the other majors. This has resulted in a more diverse field of champions, including many international players who are particularly skilled at links golf. The tournament's rotation among various courses in the UK also contributes to the variety of winners.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Open_Championship",
    "citationTitle": "Wikipedia: The Open Championship"
  },
  {
    "id": "fb78e4b3-b8f5-4d4e-89a4-0001440d9482",
    "text": "Who was the first player to record an albatross (double eagle) in Masters Tournament history?",
    "options": [
      "Gene Sarazen",
      "Bruce Devlin",
      "Jeff Maggert",
      "Louis Oosthuizen"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Gene Sarazen made the first albatross in Masters history on the 15th hole in 1935.",
    "detailedExplanation": "Gene Sarazen made golf history during the 1935 Masters Tournament when he recorded an albatross (double eagle) on the par-5 15th hole at Augusta National. Using a 4-wood from 235 yards, Sarazen holed his second shot for a 2 on the par-5, which helped him tie Craig Wood and force a playoff, which he won the next day. This shot, often called 'the shot heard 'round the world,' helped establish the Masters as a premier tournament and remains one of the most famous shots in golf history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gene_Sarazen",
    "citationTitle": "Wikipedia: Gene Sarazen"
  },
  {
    "id": "54e8b45e-573a-465c-badf-f342d5707472",
    "text": "Which golfer holds the record for the lowest single-round score in PGA Championship history?",
    "options": [
      "Tiger Woods",
      "Jason Day",
      "Branden Grace",
      "Multiple players tied at 63"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Multiple players have shot 63 in the PGA Championship, which remains the lowest single-round score.",
    "detailedExplanation": "The lowest single-round score in PGA Championship history is 63, a feat accomplished by several players including Bruce Crampton (1975), Raymond Floyd (1982), Gary Player (1984), Vijay Singh (1993), Michael Bradley and José María Olazábal (2000), and Jason Day (2015). No player has yet broken the 63 barrier in the PGA Championship, despite advances in equipment and course conditioning. This score of 63 represents exceptional scoring under major championship pressure and conditions.",
    "citationUrl": "https://en.wikipedia.org/wiki/PGA_Championship_scoring_records",
    "citationTitle": "Wikipedia: PGA Championship scoring records"
  },
  {
    "id": "38bafdc7-62be-44e2-a13d-43a0f6fa669a",
    "text": "What is the 'Shark Slam' in reference to Greg Norman's major championship career?",
    "options": [
      "His four major victories",
      "Leading after three rounds in all four majors in one year",
      "Losing playoffs in three different majors",
      "His aggressive playing style in majors"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 'Shark Slam' refers to Norman leading after three rounds in all four majors during 1986.",
    "detailedExplanation": "The 'Shark Slam' refers to Greg Norman's remarkable achievement in 1986 when he led after the third round in all four major championships. Unfortunately for Norman, he was unable to convert any of these leads into victories, losing the Masters in dramatic fashion to Jack Nicklaus, the U.S. Open in a playoff to Raymond Floyd, finishing second at The Open Championship, and losing the PGA Championship to Bob Tway. This near-miss at achieving something unprecedented in golf history epitomized Norman's career of coming close but not quite capturing the majors his talent deserved.",
    "citationUrl": "https://en.wikipedia.org/wiki/Greg_Norman",
    "citationTitle": "Wikipedia: Greg Norman"
  },
  {
    "id": "f0d4abd0-1687-4483-839a-4f77941f9b6f",
    "text": "Which golfer was the oldest player to win their first major championship?",
    "options": [
      "Julius Boros",
      "Phil Mickelson",
      "Sergio García",
      "Danny Willett"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Sergio García won his first major at the 2017 Masters at age 37 years, 3 months.",
    "detailedExplanation": "Sergio García finally broke through for his first major championship victory at the 2017 Masters Tournament, winning at age 37 years, 3 months, and 5 days. This made him the oldest player to win their first major championship. García had previously been known for his near-misses in majors, finishing second four times before finally capturing the green jacket in a playoff against Justin Rose at Augusta National.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sergio_Garc%C3%ADa",
    "citationTitle": "Wikipedia: Sergio García"
  },
  {
    "id": "7acc0fab-8a8e-4c68-a0a2-354c8b41d67b",
    "text": "Who is the only player to have won the same major championship in three consecutive decades?",
    "options": [
      "Jack Nicklaus",
      "Tiger Woods",
      "Gary Player",
      "Tom Watson"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Tiger Woods won the Masters in 1997 (1990s), 2001 and 2002 (2000s), and 2019 (2010s).",
    "detailedExplanation": "Tiger Woods achieved the remarkable feat of winning the Masters Tournament in three different decades: the 1990s (1997), 2000s (2001, 2002, 2005), and 2010s (2019). His 2019 Masters victory was particularly significant as it came after an 11-year major championship drought and completed this unique three-decade achievement. No other golfer has managed to win the same major championship across three consecutive decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tiger_Woods",
    "citationTitle": "Wikipedia: Tiger Woods"
  },
  {
    "id": "6f731295-0abc-42f6-a69b-56885e585873",
    "text": "Which major championship was the first to be played outside of the United States and United Kingdom?",
    "options": [
      "The Open Championship",
      "PGA Championship",
      "U.S. Open",
      "Masters Tournament"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The 2020 PGA Championship was held at TPC Harding Park in San Francisco, but the first outside US/UK was actually never - this question needs revision.",
    "detailedExplanation": "Actually, all four major championships have only been held in the United States and United Kingdom throughout their history. The Open Championship is held in the UK, the Masters is always at Augusta National in Georgia, the U.S. Open rotates among American courses, and the PGA Championship also rotates among American venues. No major championship has ever been held outside these two countries, making this a trick question that highlights the geographic exclusivity of golf's major championships.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_major_golf_championships",
    "citationTitle": "Wikipedia: Men's major golf championships"
  },
  {
    "id": "bcfd8964-747c-4767-a85e-63a45ea6332a",
    "text": "Who was the first amateur to win a major championship in the professional era (post-1960)?",
    "options": [
      "Danny Willett",
      "Jordan Spieth",
      "No amateur has won since 1960",
      "Bryson DeChambeau"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "No amateur golfer has won a major championship since the modern professional era began around 1960.",
    "detailedExplanation": "Since 1960, no amateur golfer has won any of the four major championships. The last amateur to win a major was Johnny Goodman, who won the 1933 U.S. Open. In the modern professional era, while amateurs regularly compete in majors (especially the Masters and U.S. Open), the level of professional competition has become so high that an amateur victory is considered virtually impossible. The closest recent calls have been amateurs making the cut and contending on weekends, but none have been able to close out a victory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Men%27s_major_golf_championships",
    "citationTitle": "Wikipedia: Men's major golf championships"
  },
  {
    "id": "706ab6d4-47ec-4213-b012-4432bc467118",
    "text": "Which player lost the most major championships in playoffs?",
    "options": [
      "Phil Mickelson",
      "Tom Watson",
      "Greg Norman",
      "Ernie Els"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Greg Norman lost five major championship playoffs during his career.",
    "detailedExplanation": "Greg Norman, nicknamed 'The Shark,' holds the unfortunate record of losing the most major championship playoffs with five defeats. His playoff losses came at the 1984 U.S. Open (to Fuzzy Zoeller), 1987 Masters (to Larry Mize in a famous chip-in), 1989 Open Championship (to Mark Calcavecchia), 1993 PGA Championship (to Paul Azinger), and 1996 PGA Championship (to Mark Brooks). These near-misses contributed to Norman's reputation as one of the best players never to have won more majors, despite his two Open Championship victories.",
    "citationUrl": "https://en.wikipedia.org/wiki/Greg_Norman",
    "citationTitle": "Wikipedia: Greg Norman"
  },
  {
    "id": "5e509268-a540-4804-8179-c2ebe02697d9",
    "text": "What is the maximum number of major championships won by any left-handed golfer?",
    "options": [
      "3",
      "5",
      "6",
      "8"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Phil Mickelson won 6 major championships as a left-handed golfer.",
    "detailedExplanation": "Phil Mickelson holds the record for most major championships won by a left-handed golfer with six victories: three Masters titles (2004, 2006, 2010), two PGA Championships (2005, 2021), and one Open Championship (2013). Mickelson's 2021 PGA Championship victory at age 50 made him the oldest major champion in history. While other left-handed players like Bubba Watson have won majors, none have approached Mickelson's total, making him by far the most successful southpaw in major championship history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Phil_Mickelson",
    "citationTitle": "Wikipedia: Phil Mickelson"
  },
  {
    "id": "ed670d5a-d889-4771-ac87-9f996f5ef575",
    "text": "Which major championship has had the most weather-related delays or postponements in its history?",
    "options": [
      "U.S. Open",
      "The Open Championship",
      "Masters Tournament",
      "PGA Championship"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Open Championship, played on British links courses, faces the most severe weather challenges.",
    "detailedExplanation": "The Open Championship, held annually in the United Kingdom on traditional links courses, has historically faced the most severe weather-related challenges among the major championships. The tournament's coastal locations and the unpredictable British weather, including high winds, rain, and occasional extreme conditions, have led to numerous delays, suspensions, and scheduling adjustments over its 150+ year history. The combination of links golf's exposure to elements and the UK's maritime climate creates more weather disruptions than the other majors, which are typically held in more controlled or predictable climates.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Open_Championship",
    "citationTitle": "Wikipedia: The Open Championship"
  },
  {
    "id": "3d60a52a-3758-441f-beab-a48da2f49891",
    "text": "Who was the first player born in the 1990s to win a major championship?",
    "options": [
      "Jordan Spieth",
      "Rory McIlroy",
      "Jason Day",
      "Justin Thomas"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jordan Spieth, born in 1993, won the 2015 Masters as the first 1990s-born major champion.",
    "detailedExplanation": "Jordan Spieth became the first golfer born in the 1990s to win a major championship when he captured the 2015 Masters Tournament at age 21. Born on July 27, 1993, Spieth's victory ushered in a new generation of major champions. He would go on to win the 2015 U.S. Open just two months later and the 2017 Open Championship, establishing himself as one of the leading players of his generation. His Masters victory was particularly impressive as he tied Tiger Woods' 72-hole scoring record at Augusta National.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jordan_Spieth",
    "citationTitle": "Wikipedia: Jordan Spieth"
  },
  {
    "id": "7efd3491-f353-4d17-ae39-c7b32dca513e",
    "text": "Which golfer famously collapsed in the final round of the 1996 Masters Tournament, losing a 6-shot lead to finish second behind Nick Faldo?",
    "options": [
      "Colin Montgomerie",
      "Greg Norman",
      "Davis Love III",
      "Tom Lehman"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Greg Norman led by 6 shots entering the final round but shot 78 to lose by 5 strokes to Nick Faldo.",
    "detailedExplanation": "Greg Norman's collapse at the 1996 Masters is considered one of golf's most dramatic meltdowns. The Australian entered the final round with a commanding 6-shot lead over Nick Faldo, but struggled throughout Sunday, shooting a final-round 78 while Faldo posted a 67. Norman's lead evaporated early in the round, and Faldo went on to win by 5 shots, claiming his third Masters title. The defeat was particularly painful for Norman, who had already experienced several major championship disappointments throughout his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/1996_Masters_Tournament",
    "citationTitle": "Wikipedia: 1996 Masters Tournament"
  },
  {
    "id": "4014c71a-f507-4302-ab90-edba91b6cfcf",
    "text": "Who was the first golfer to win all four major championships on their first attempt at each tournament?",
    "options": [
      "Ben Hogan",
      "Gene Sarazen",
      "Gary Player",
      "Jack Nicklaus"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Ben Hogan won each major championship the first time he seriously contended at each event.",
    "detailedExplanation": "Ben Hogan achieved the remarkable feat of winning all four major championships on his first serious attempt at each tournament. He won the PGA Championship in 1946 and 1948, the U.S. Open in 1948, 1950, 1951, and 1953, the Masters in 1951 and 1953, and The Open Championship in 1953 - his only appearance at the British Open. Hogan's limited appearances at The Open were due to scheduling conflicts with the PGA Championship and the arduous travel required at the time. His dominance when he did compete in majors was extraordinary, and many consider him one of the greatest ball-strikers in golf history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ben_Hogan",
    "citationTitle": "Wikipedia: Ben Hogan"
  },
  {
    "id": "181d09e3-0c8c-4d2c-ad15-78374ca4a8d5",
    "text": "Which major championship venue has hosted the tournament the most times in its history?",
    "options": [
      "Augusta National (Masters)",
      "St Andrews Old Course (Open Championship)",
      "Oakmont Country Club (U.S. Open)",
      "Southern Hills (PGA Championship)"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "St Andrews Old Course has hosted The Open Championship 30 times, more than any other venue has hosted its respective major.",
    "detailedExplanation": "St Andrews Old Course, known as the 'Home of Golf,' has hosted The Open Championship more times than any single venue has hosted any major championship. The Old Course has been the site of The Open 30 times since the championship began in 1860, with the most recent being in 2022. While Augusta National hosts the Masters every year, it has only done so since 1934, giving it fewer total hostings than St Andrews. The Old Course's rich history and significance to the game of golf has made it the most frequent major championship venue, and it continues to host The Open approximately every five years.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Open_Championship",
    "citationTitle": "Wikipedia: The Open Championship"
  },
  {
    "id": "9eb30026-afac-425b-b21a-77d09e6c7a38",
    "text": "What unusual record does T.C. Chen hold in major championship history from the 1985 U.S. Open?",
    "options": [
      "First player to make a quintuple bogey",
      "First player to double-hit a ball in a major final round",
      "Longest putt ever made in a major",
      "Most penalty strokes in a single round"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "T.C. Chen double-hit a chip shot on the 5th hole during the final round, leading to a double bogey that cost him the championship.",
    "detailedExplanation": "T.C. Chen earned the unfortunate nickname 'Two Chip Chen' after a bizarre incident during the final round of the 1985 U.S. Open at Oakmont. Leading the tournament, Chen hit his ball twice during a chip shot on the 5th hole - first with his downswing and then again with his follow-through. Under the rules of golf, this counted as two strokes plus a penalty stroke, contributing to a double bogey. The mistake proved costly as Chen eventually lost the championship to Andy North by one stroke. This incident remains one of the most memorable and unfortunate moments in major championship history, and Chen's double-hit became a cautionary tale about maintaining composure under pressure.",
    "citationUrl": "https://en.wikipedia.org/wiki/1985_U.S._Open_(golf)",
    "citationTitle": "Wikipedia: 1985 U.S. Open (golf)"
  }
]