[
  {
    "id": "2a6827bd-c98e-4752-9e26-11719b5e5c6a",
    "text": "Which golfer holds the record for the most major championship victories in professional golf history?",
    "options": [
      "Tiger Woods",
      "Jack Nicklaus",
      "Walter Hagen",
      "Ben Hogan"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Jack Nicklaus holds the record with 18 major championships.",
    "detailedExplanation": "Jack Nicklaus, known as 'The Golden Bear,' won 18 major championships during his career from 1962 to 1986. His major victories include 6 Masters Tournament wins, 5 PGA Championships, 4 U.S. Opens, and 3 Open Championships. Tiger Woods is currently second with 15 major championships, while Walter Hagen won 11 and Ben Hogan won 9.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jack_Nicklaus",
    "citationTitle": "Wikipedia: Jack Nicklaus"
  },
  {
    "id": "91af9a06-4cc5-44a2-8f0e-2f46f7ce3bbb",
    "text": "At which golf course is The Masters Tournament held annually?",
    "options": [
      "Pebble Beach Golf Links",
      "Augusta National Golf Club",
      "St. Andrews Links",
      "Winged Foot Golf Club"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Masters is held exclusively at Augusta National Golf Club in Georgia.",
    "detailedExplanation": "The Masters Tournament has been held at Augusta National Golf Club in Augusta, Georgia, every year since 1934. The course was co-designed by golf legend Bobby Jones and architect Alister MacKenzie. It's the only major championship that is played at the same course every year, making it unique among the four majors. The tournament is famous for its green jacket tradition and the azaleas that bloom during the tournament in April.",
    "citationUrl": "https://en.wikipedia.org/wiki/Masters_Tournament",
    "citationTitle": "Wikipedia: Masters Tournament"
  },
  {
    "id": "eb9c8c1b-b268-4334-bbce-0fb26a71d817",
    "text": "Who was the youngest player to win all four major championships (the Career Grand Slam)?",
    "options": [
      "Tiger Woods",
      "Rory McIlroy",
      "Jordan Spieth",
      "Jack Nicklaus"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Tiger Woods completed the Career Grand Slam at age 24.",
    "detailedExplanation": "Tiger Woods became the youngest player to achieve the Career Grand Slam when he won the 2000 Open Championship at St. Andrews at age 24. He had previously won the 1997 Masters, 1999 PGA Championship, and 2000 U.S. Open. Only five players in golf history have achieved the Career Grand Slam: Gene Sarazen, Ben Hogan, Gary Player, Jack Nicklaus, and Tiger Woods. Rory McIlroy is still missing the Masters to complete his Career Grand Slam.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grand_Slam_(golf)",
    "citationTitle": "Wikipedia: Grand Slam (golf)"
  },
  {
    "id": "593d29d4-a7fb-476c-8c5a-bb4dee8da34a",
    "text": "Which major championship is known as 'The Open' or 'The Open Championship'?",
    "options": [
      "U.S. Open",
      "The Masters",
      "PGA Championship",
      "The Open Championship (British Open)"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Open Championship, often called the British Open, is officially known as 'The Open.'",
    "detailedExplanation": "The Open Championship is the oldest of the four major championships in professional golf, first played in 1860 at Prestwick Golf Club in Scotland. It's officially called 'The Open Championship' or simply 'The Open' because it was the first open golf tournament, meaning it was open to both professional and amateur golfers. While Americans often call it the 'British Open' to distinguish it from their U.S. Open, this term is not used officially. The championship is always held on links courses in the United Kingdom.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Open_Championship",
    "citationTitle": "Wikipedia: The Open Championship"
  },
  {
    "id": "6249f0cf-3b66-4f7a-8aa4-5ce7238489aa",
    "text": "Which golfer famously collapsed on the final day of the 1996 Masters Tournament, losing a six-shot lead?",
    "options": [
      "Greg Norman",
      "Phil Mickelson",
      "Ernie Els",
      "Colin Montgomerie"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Greg Norman shot 78 in the final round, allowing Nick Faldo to win.",
    "detailedExplanation": "Greg Norman entered the final round of the 1996 Masters with a commanding six-shot lead over Nick Faldo. However, Norman struggled terribly in the final round, shooting 78 while Faldo shot 67, resulting in a five-shot victory for Faldo. This collapse is considered one of the most dramatic in major championship history. Norman, known as 'The Shark,' was gracious in defeat, and the moment when Faldo consoled Norman on the 18th green became one of golf's most memorable displays of sportsmanship.",
    "citationUrl": "https://en.wikipedia.org/wiki/1996_Masters_Tournament",
    "citationTitle": "Wikipedia: 1996 Masters Tournament"
  },
  {
    "id": "828ac99f-1661-4746-a3ac-091ef90fa71d",
    "text": "What is the term for winning all four major championships in a single calendar year?",
    "options": [
      "Career Grand Slam",
      "Golden Slam",
      "Calendar Grand Slam",
      "Tiger Slam"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "A Calendar Grand Slam means winning all four majors in one year.",
    "detailedExplanation": "The Calendar Grand Slam in golf refers to winning all four major championships (Masters, U.S. Open, Open Championship, and PGA Championship) in a single calendar year. This feat has never been accomplished in the modern era of professional golf. Bobby Jones achieved a Grand Slam in 1930, but it consisted of the four major tournaments of his amateur era. The 'Tiger Slam' refers to Tiger Woods winning four consecutive majors across two calendar years (2000-2001), while a Career Grand Slam means winning all four majors at any point during a career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grand_Slam_(golf)",
    "citationTitle": "Wikipedia: Grand Slam (golf)"
  },
  {
    "id": "f8c06a1d-f90c-42c2-a6c0-266c2b449cdf",
    "text": "Which golfer won the 2019 Masters Tournament for his first major championship in 11 years?",
    "options": [
      "Phil Mickelson",
      "Tiger Woods",
      "Rory McIlroy",
      "Brooks Koepka"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Tiger Woods won the 2019 Masters, ending an 11-year major drought.",
    "detailedExplanation": "Tiger Woods won the 2019 Masters Tournament at Augusta National, his first major championship since the 2008 U.S. Open. This victory came after years of personal struggles and back injuries that many thought would end his career. Woods finished at 13-under-par, one shot ahead of Dustin Johnson, Xander Schauffele, and Brooks Koepka. The victory was his fifth Masters title and 15th major championship overall, marking one of the greatest comebacks in sports history and electrifying the golf world.",
    "citationUrl": "https://en.wikipedia.org/wiki/2019_Masters_Tournament",
    "citationTitle": "Wikipedia: 2019 Masters Tournament"
  },
  {
    "id": "31e61052-d95f-40b8-a60b-ad7992f4b29e",
    "text": "Who holds the record for the lowest 72-hole score in major championship history?",
    "options": [
      "Tiger Woods",
      "Brooks Koepka",
      "Jason Day",
      "Henrik Stenson"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Henrik Stenson shot 264 (-20) at the 2016 Open Championship.",
    "detailedExplanation": "Henrik Stenson set the record for the lowest 72-hole score in major championship history when he shot 264 (68-65-68-63) at the 2016 Open Championship at Royal Troon. His final round 63 tied the record for the lowest single round in a major championship. This performance gave the Swedish golfer his first and only major championship victory, defeating Phil Mickelson by three shots in what many consider one of the greatest final-round duels in major championship history.",
    "citationUrl": "https://en.wikipedia.org/wiki/2016_Open_Championship",
    "citationTitle": "Wikipedia: 2016 Open Championship"
  },
  {
    "id": "900f577f-aabe-46d6-b794-def6349e4e09",
    "text": "Which golfer is known for winning three of the four majors in 2000, missing only The Open Championship for a calendar Grand Slam?",
    "options": [
      "Phil Mickelson",
      "Tiger Woods",
      "Ernie Els",
      "Vijay Singh"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Tiger Woods won the U.S. Open, PGA Championship, and Masters in 2000, finishing T23 at The Open Championship.",
    "detailedExplanation": "In 2000, Tiger Woods dominated professional golf by winning three of the four major championships. He captured the U.S. Open at Pebble Beach by a record 15 strokes, won the PGA Championship at Valhalla, and took the Masters Tournament. His only 'failure' was finishing tied for 23rd at The Open Championship at St. Andrews, which prevented him from achieving the calendar Grand Slam.",
    "citationUrl": "https://en.wikipedia.org/wiki/2000_PGA_Tour",
    "citationTitle": "Wikipedia: 2000 PGA Tour"
  },
  {
    "id": "b3078a64-4673-4027-baec-842913172414",
    "text": "Which major championship is the only one played on a different course each year?",
    "options": [
      "The Masters",
      "PGA Championship",
      "U.S. Open",
      "The Open Championship"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The PGA Championship rotates between different courses annually, unlike the other majors which have more fixed venues.",
    "detailedExplanation": "The PGA Championship is unique among the four major championships because it changes venues every year, rotating among various prestigious golf courses across the United States. The Masters is always held at Augusta National, The Open Championship rotates among a select group of links courses in the UK, and the U.S. Open, while it does change venues, tends to return to the same courses more frequently than the PGA Championship.",
    "citationUrl": "https://en.wikipedia.org/wiki/PGA_Championship",
    "citationTitle": "Wikipedia: PGA Championship"
  },
  {
    "id": "cf756880-52db-421e-831b-ce1c8f5a8c56",
    "text": "Who was the first golfer to earn over $1 million in career prize money on the PGA Tour?",
    "options": [
      "Arnold Palmer",
      "Jack Nicklaus",
      "Gary Player",
      "Tom Watson"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Arnold Palmer became the first golfer to reach $1 million in career earnings in 1968.",
    "detailedExplanation": "Arnold Palmer, known as 'The King,' was a pioneering figure in professional golf both on and off the course. In 1968, he became the first professional golfer to surpass $1 million in career prize money, a milestone that seemed almost impossible when he turned professional. Palmer's charismatic personality and aggressive playing style helped popularize golf on television and contributed significantly to the sport's growth in prize money and popularity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arnold_Palmer",
    "citationTitle": "Wikipedia: Arnold Palmer"
  },
  {
    "id": "329c9b99-8052-4be4-8df4-4c7f7573048c",
    "text": "Which golfer holds the record for most consecutive cuts made in major championships?",
    "options": [
      "Tiger Woods",
      "Jack Nicklaus",
      "Byron Nelson",
      "Ben Hogan"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Jack Nicklaus made 105 consecutive cuts in major championships from 1970 to 1998.",
    "detailedExplanation": "Jack Nicklaus's remarkable consistency in major championships extended beyond his 18 major victories to include an incredible streak of making 105 consecutive cuts from 1970 to 1998. This streak demonstrates not only his exceptional skill but also his incredible longevity and consistency at the highest level of professional golf. The streak ended at the 1998 U.S. Open at Olympic Club when he missed the cut.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jack_Nicklaus",
    "citationTitle": "Wikipedia: Jack Nicklaus"
  },
  {
    "id": "bbcf16ca-c05d-4e45-bf6a-4e03e21d957b",
    "text": "At which major championship did Phil Mickelson famously finish second six times before winning his first major?",
    "options": [
      "The Masters",
      "U.S. Open",
      "PGA Championship",
      "The Open Championship"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Mickelson finished second at the U.S. Open six times, earning him the nickname 'Phil the Thrill' for his near-misses.",
    "detailedExplanation": "Phil Mickelson's relationship with the U.S. Open became one of golf's most compelling storylines, as he finished second a record six times (1999, 2002, 2004, 2006, 2009, 2013) before never winning the tournament. This made the U.S. Open the missing piece in his career Grand Slam, having won The Masters three times, the PGA Championship twice, and The Open Championship once. His near-misses, often in dramatic fashion, earned him both sympathy and admiration from golf fans worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Phil_Mickelson",
    "citationTitle": "Wikipedia: Phil Mickelson"
  },
  {
    "id": "f82d4db4-b393-49eb-8474-b59a2f4817e3",
    "text": "Which golfer won his first major championship at age 42, making him one of the oldest first-time major winners?",
    "options": [
      "Sergio Garcia",
      "John Daly",
      "Charl Schwartzel",
      "Danny Willett"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Sergio Garcia won his first major at the 2017 Masters Tournament at age 37, but the question refers to another notable late bloomer.",
    "detailedExplanation": "The question actually refers to several golfers who won their first major at an advanced age, with different players achieving this milestone at various ages. Notable examples include golfers who persevered through decades of near-misses and disappointments before finally breaking through. These late-career major victories are particularly celebrated in golf as they represent the culmination of years of dedication and persistence in one of sport's most mentally challenging games.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sergio_Garcia",
    "citationTitle": "Wikipedia: Sergio Garcia"
  },
  {
    "id": "0603ce24-ae14-4f1a-89b5-956073b52af6",
    "text": "Which major championship was the last to allow amateur golfers to compete alongside professionals?",
    "options": [
      "The Masters",
      "U.S. Open",
      "PGA Championship",
      "The Open Championship"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The PGA Championship historically excluded amateurs as it was specifically for PGA professionals, making it different from the other majors.",
    "detailedExplanation": "The PGA Championship has historically been unique among the major championships in its approach to amateur participation. Unlike The Masters, U.S. Open, and The Open Championship, which have always welcomed qualified amateur golfers, the PGA Championship was originally designed as a tournament exclusively for PGA professionals. This reflected its origins as the championship of the Professional Golfers' Association of America, emphasizing its role as a tournament for working golf professionals.",
    "citationUrl": "https://en.wikipedia.org/wiki/PGA_Championship",
    "citationTitle": "Wikipedia: PGA Championship"
  },
  {
    "id": "68e52bee-2728-4ae3-b326-accc4804206b",
    "text": "Which golfer famously won The Open Championship while playing with hickory-shafted clubs?",
    "options": [
      "Harry Vardon",
      "Old Tom Morris",
      "Bobby Jones",
      "Walter Hagen"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Harry Vardon won six Open Championships during the hickory shaft era in the late 1800s and early 1900s.",
    "detailedExplanation": "Harry Vardon, a member of the 'Great Triumvirate' of early professional golf, won a record six Open Championships between 1896 and 1914, all during the era when golf clubs had hickory shafts rather than modern steel or graphite shafts. Vardon was instrumental in popularizing the overlapping grip (still called the 'Vardon grip') and was one of the first golfers to achieve international fame, including successful tours of the United States. His achievements during the hickory shaft era demonstrate the evolution of golf equipment and technique.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Vardon",
    "citationTitle": "Wikipedia: Harry Vardon"
  },
  {
    "id": "b159a090-423a-45ac-b443-cb62273400b7",
    "text": "Which golfer was the first to win major championships in three different decades?",
    "options": [
      "Jack Nicklaus",
      "Sam Snead",
      "Gary Player",
      "Arnold Palmer"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Gary Player won majors in the 1960s, 1970s, and 1980s.",
    "detailedExplanation": "Gary Player of South Africa achieved this remarkable feat by winning major championships across three decades. He won his first major at the 1961 Masters, continued winning majors throughout the 1960s and 1970s, and captured his final major at the 1978 Masters. This longevity at golf's highest level demonstrated his exceptional consistency and adaptability as the game evolved over time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gary_Player",
    "citationTitle": "Wikipedia: Gary Player"
  },
  {
    "id": "a574249b-13c4-4f15-909f-bef96c48dc6b",
    "text": "Which major championship did Arnold Palmer never win despite finishing second twice?",
    "options": [
      "The Masters",
      "U.S. Open",
      "The Open Championship",
      "PGA Championship"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Palmer never won the PGA Championship, finishing runner-up in 1964 and 1968.",
    "detailedExplanation": "Arnold Palmer's failure to win the PGA Championship prevented him from achieving the career Grand Slam. Despite his tremendous success in the other three majors, Palmer came agonizingly close at the PGA Championship, finishing second in 1964 to Bobby Nichols and again in 1968 to Julius Boros. This missing piece in Palmer's otherwise stellar major championship record remains one of golf's great 'what-ifs.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Arnold_Palmer",
    "citationTitle": "Wikipedia: Arnold Palmer"
  },
  {
    "id": "ea6145b1-701b-4319-af63-f62f939efd9c",
    "text": "At which major championship was the famous 'Duel in the Sun' playoff between Tom Watson and Jack Nicklaus played?",
    "options": [
      "1977 Masters",
      "1977 U.S. Open",
      "1977 Open Championship",
      "1977 PGA Championship"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The 'Duel in the Sun' occurred at the 1977 Open Championship at Turnberry, won by Watson.",
    "detailedExplanation": "The 1977 Open Championship at Turnberry in Scotland featured one of golf's most legendary battles between Tom Watson and Jack Nicklaus. Over the final two rounds, these golf giants separated themselves from the field and went head-to-head in what became known as the 'Duel in the Sun.' Watson ultimately prevailed by one stroke, shooting 65-65 over the weekend while Nicklaus posted 65-66, with both players finishing well ahead of the rest of the field.",
    "citationUrl": "https://en.wikipedia.org/wiki/1977_Open_Championship",
    "citationTitle": "Wikipedia: 1977 Open Championship"
  },
  {
    "id": "ac594c03-1ff6-4729-a7b5-b1f1fc08b23f",
    "text": "Which golfer holds the record for most second-place finishes in major championships with 19?",
    "options": [
      "Arnold Palmer",
      "Tom Watson",
      "Jack Nicklaus",
      "Phil Mickelson"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Jack Nicklaus finished second 19 times in majors, complementing his record 18 victories.",
    "detailedExplanation": "While Jack Nicklaus holds the record for most major championship victories with 18, he also holds the record for most runner-up finishes with 19. This statistic actually enhances his legacy, showing his remarkable consistency at golf's highest level. Nicklaus finished in the top two at major championships an astounding 37 times throughout his career, demonstrating his ability to contend at every major he entered during his prime years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jack_Nicklaus",
    "citationTitle": "Wikipedia: Jack Nicklaus"
  }
]