[
  {
    "id": "90c692dd-beeb-485b-b0fb-8811bb92f1eb",
    "text": "What is the name of Harry Potter's owl?",
    "options": [
      "Hedwig",
      "Errol",
      "Pigwidgeon",
      "Archimedes"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hedwig is Harry's snowy owl, given to him by Hagrid for his 11th birthday.",
    "detailedExplanation": "Hedwig is Harry Potter's pet snowy owl, purchased for him by Hagrid from Eeylops Owl Emporium in Diagon Alley as an 11th birthday present. The owl serves as Harry's postal messenger throughout most of the series and is one of his most cherished companions. Hedwig is named after a medieval saint that Harry found in his History of Magic textbook.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter#Hedwig",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  },
  {
    "id": "6a8b9ba5-735b-46e1-8c67-554b716f90a1",
    "text": "Which house at Hogwarts is Harry Potter sorted into?",
    "options": [
      "Slytherin",
      "Hufflepuff",
      "Ravenclaw",
      "Gryffindor"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Harry Potter is sorted into Gryffindor house, known for courage and bravery.",
    "detailedExplanation": "During the Sorting Ceremony in his first year at Hogwarts, Harry Potter is placed in Gryffindor house by the Sorting Hat. Although the Hat initially considers placing him in Slytherin due to some shared qualities with the house founder, Harry's request not to be in Slytherin influences the Hat's final decision. Gryffindor house values courage, bravery, nerve, and chivalry, traits that Harry demonstrates throughout the series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts#Houses",
    "citationTitle": "Wikipedia: Hogwarts Houses"
  },
  {
    "id": "9c585ffd-3f0b-4d3e-a6db-c8dfc4db0e0f",
    "text": "What is the name of the wizarding school that Harry Potter attends?",
    "options": [
      "Beauxbatons",
      "Durmstrang",
      "Hogwarts",
      "Ilvermorny"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hogwarts School of Witchcraft and Wizardry is the British wizarding school Harry attends.",
    "detailedExplanation": "Hogwarts School of Witchcraft and Wizardry is the fictional British boarding school for young witches and wizards, located in Scotland. Founded over a thousand years ago by four great wizards - Godric Gryffindor, Helga Hufflepuff, Rowena Ravenclaw, and Salazar Slytherin - the school serves as the primary setting for the Harry Potter series. Students attend Hogwarts from ages 11 to 18, studying various magical subjects.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts",
    "citationTitle": "Wikipedia: Hogwarts"
  },
  {
    "id": "3cc5e405-c4aa-4970-b010-3d087d9b455a",
    "text": "Who is Harry Potter's best friend (male)?",
    "options": [
      "Neville Longbottom",
      "Dean Thomas",
      "Ron Weasley",
      "Seamus Finnigan"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Ron Weasley becomes Harry's best friend from their first meeting on the Hogwarts Express.",
    "detailedExplanation": "Ronald Bilius Weasley, commonly known as Ron, is Harry Potter's best male friend throughout the series. They first meet on the Hogwarts Express on their way to Hogwarts and quickly form a strong friendship. Ron comes from a large pure-blood wizarding family and is one of the youngest of seven children. Along with Hermione Granger, Ron forms part of the central trio of friends who face numerous adventures together.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ron_Weasley",
    "citationTitle": "Wikipedia: Ron Weasley"
  },
  {
    "id": "5ba6b52d-1a0b-4fc8-97f6-4ca6d722bacf",
    "text": "What position does Harry play on his Quidditch team?",
    "options": [
      "Keeper",
      "Chaser",
      "Beater",
      "Seeker"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Harry plays as Seeker for the Gryffindor Quidditch team, catching the Golden Snitch.",
    "detailedExplanation": "Harry Potter plays the position of Seeker on the Gryffindor Quidditch team. The Seeker's role is to catch the Golden Snitch, a small, fast-moving golden ball with wings that ends the game and awards 150 points to the catching team. Harry becomes the youngest Seeker in a century when he joins the team in his first year, after Professor McGonagall witnesses his natural flying ability during a confrontation with Draco Malfoy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Quidditch#Positions",
    "citationTitle": "Wikipedia: Quidditch Positions"
  },
  {
    "id": "cd551208-dd01-400a-801a-28579396b8fa",
    "text": "What is the name of Harry's aunt and uncle who raise him?",
    "options": [
      "Vernon and Petunia Dursley",
      "Dudley and Marge Dursley",
      "Vernon and Marge Dursley",
      "Dudley and Petunia Dursley"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Vernon and Petunia Dursley are Harry's muggle relatives who reluctantly raise him.",
    "detailedExplanation": "Vernon and Petunia Dursley are Harry Potter's uncle and aunt who raise him from infancy after his parents' death. Petunia is Lily Potter's sister, making her Harry's only surviving blood relative. The Dursleys live at 4 Privet Drive in Little Whinging, Surrey, and are extremely hostile toward magic and Harry's wizarding heritage. They have one son, Dudley, who is Harry's spoiled and bullying cousin.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Harry_Potter_characters#Dursley_family",
    "citationTitle": "Wikipedia: Dursley family"
  },
  {
    "id": "c468502e-4cdf-4b8f-a903-b902e444cd2e",
    "text": "What is the core of Harry Potter's wand made from?",
    "options": [
      "Dragon heartstring",
      "Unicorn hair",
      "Phoenix feather",
      "Veela hair"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Harry's wand contains a phoenix feather core, specifically from Dumbledore's phoenix, Fawkes.",
    "detailedExplanation": "Harry Potter's wand is made of holly wood with a phoenix feather core, measuring eleven inches long and described as 'nice and supple.' The phoenix feather came from Fawkes, Dumbledore's phoenix, who gave only one other feather - which became the core of Tom Riddle's (Voldemort's) wand. This connection between the two wands becomes significant throughout the series, as wands with cores from the same creature are considered 'brothers' and behave unusually when forced to duel each other.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter#Wands",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter - Wands"
  },
  {
    "id": "e800864b-fe9b-4a64-b076-1c5d70e5e5aa",
    "text": "Who is the half-giant Keeper of Keys and Grounds at Hogwarts?",
    "options": [
      "Hagrid",
      "Flitwick",
      "Sprout",
      "Snape"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Rubeus Hagrid is the beloved half-giant who serves as Keeper of Keys and Grounds at Hogwarts.",
    "detailedExplanation": "Rubeus Hagrid is the Keeper of Keys and Grounds at Hogwarts School of Witchcraft and Wizardry. He is a half-giant, with a wizard father and a giant mother, standing about twice the height of a normal person. Hagrid is the one who delivers Harry's Hogwarts letter and introduces him to the wizarding world. Despite being expelled from Hogwarts in his third year, he was allowed to stay on as gamekeeper, and later becomes the Care of Magical Creatures professor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rubeus_Hagrid",
    "citationTitle": "Wikipedia: Rubeus Hagrid"
  },
  {
    "id": "dfc91729-c616-46eb-9195-d861765e7c9a",
    "text": "Which Hogwarts house is known for bravery and courage?",
    "options": [
      "Slytherin",
      "Gryffindor",
      "Ravenclaw",
      "Hufflepuff"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Gryffindor house values bravery, courage, nerve, and chivalry above all else.",
    "detailedExplanation": "Gryffindor is one of the four houses at Hogwarts School of Witchcraft and Wizardry, founded by Godric Gryffindor. The house is known for prizing courage, bravery, nerve, and chivalry in its members. The Gryffindor house colors are scarlet and gold, and its symbol is a lion. Harry Potter, Hermione Granger, and Ron Weasley are all members of Gryffindor house, along with other notable characters like Neville Longbottom and Ginny Weasley.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts#Gryffindor",
    "citationTitle": "Wikipedia: Hogwarts Houses"
  },
  {
    "id": "fdbfc38e-de85-4549-bf0a-fda3dc618fb4",
    "text": "What is the name of the three-headed dog guarding the Philosopher's Stone?",
    "options": [
      "Fang",
      "Fluffy",
      "Norbert",
      "Aragog"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Fluffy is the massive three-headed dog that guards the trapdoor leading to the Philosopher's Stone.",
    "detailedExplanation": "Fluffy is a gigantic three-headed dog owned by Hagrid, who lent him to Dumbledore to guard the Philosopher's Stone during Harry's first year at Hogwarts. Fluffy is based on Cerberus from Greek mythology. The dog can be put to sleep by playing music, which proves crucial when Harry, Ron, and Hermione need to get past him. Fluffy guards the trapdoor on the third floor that leads to the series of magical protections surrounding the Stone.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter#Fluffy",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  },
  {
    "id": "2603ab9f-21fe-4305-b483-1930be2215b4",
    "text": "What platform do students use to catch the Hogwarts Express?",
    "options": [
      "Platform 8¾",
      "Platform 9¾",
      "Platform 10¾",
      "Platform 7¾"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Platform 9¾ at King's Cross Station is the secret platform where students board the Hogwarts Express.",
    "detailedExplanation": "Platform 9¾ is the concealed train platform at King's Cross Station in London, from which the Hogwarts Express departs for Hogwarts School. The platform is hidden from Muggles and can only be accessed by walking straight at the barrier between platforms 9 and 10. The Hogwarts Express is a scarlet steam engine that transports students to and from Hogwarts at the beginning and end of each school year, as well as at Christmas and Easter.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts_Express",
    "citationTitle": "Wikipedia: Hogwarts Express"
  },
  {
    "id": "592e5820-dc1a-45e8-a44b-ced85df91c25",
    "text": "What is the name of Ron Weasley's pet rat?",
    "options": [
      "Scabbers",
      "Crookshanks",
      "Trevor",
      "Pigwidgeon"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Scabbers is Ron's pet rat, who is later revealed to be Peter Pettigrew in his Animagus form.",
    "detailedExplanation": "Scabbers is Ron Weasley's pet rat, inherited from his older brother Percy. The rat appears to be ordinary but is unusually long-lived for a rat. In Harry Potter and the Prisoner of Azkaban, it is revealed that Scabbers is actually Peter Pettigrew, one of James Potter's former friends who betrayed Harry's parents to Voldemort and has been hiding in his Animagus form for twelve years to avoid capture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Order_of_the_Phoenix_(fictional_organisation)#Peter_Pettigrew",
    "citationTitle": "Wikipedia: Peter Pettigrew"
  },
  {
    "id": "562598b6-c915-456a-a0ef-45eaf16c0002",
    "text": "What subject does Professor Snape teach in Harry's first year?",
    "options": [
      "Defense Against the Dark Arts",
      "Potions",
      "Transfiguration",
      "Charms"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Professor Severus Snape teaches Potions during Harry's first five years at Hogwarts.",
    "detailedExplanation": "Professor Severus Snape is the Potions master at Hogwarts during Harry's first five years at school. He teaches his classes in the dungeons and is known for his harsh treatment of students, particularly Harry Potter and other Gryffindors. Snape had always wanted to teach Defense Against the Dark Arts, and he finally gets this position in Harry's sixth year when he becomes the Defense Against the Dark Arts professor, while Professor Slughorn takes over the Potions position.",
    "citationUrl": "https://en.wikipedia.org/wiki/Severus_Snape",
    "citationTitle": "Wikipedia: Severus Snape"
  },
  {
    "id": "a67483d1-16ea-4ce9-9452-1db224fafb63",
    "text": "What is the name of the bank run by goblins in Diagon Alley?",
    "options": [
      "Gringotts",
      "Knockturn",
      "Borgin",
      "Olivanders"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Gringotts Wizarding Bank is the goblin-run bank located in Diagon Alley.",
    "detailedExplanation": "Gringotts Wizarding Bank is the only bank in the wizarding world, run entirely by goblins. Located in Diagon Alley, it is a massive white building that towers over the other shops. The bank is known for its high security, with underground vaults protected by various magical means including dragons. Harry first visits Gringotts with Hagrid to withdraw money from his parents' vault and later returns multiple times throughout the series, including a dramatic break-in during the final book.",
    "citationUrl": "https://en.wikipedia.org/wiki/Places_in_Harry_Potter#Gringotts_Wizarding_Bank",
    "citationTitle": "Wikipedia: Places in Harry Potter"
  },
  {
    "id": "1ee05d67-cc86-44c4-92f5-e935eac6b874",
    "text": "Which house at Hogwarts does Harry Potter belong to?",
    "options": [
      "Slytherin",
      "Gryffindor",
      "Ravenclaw",
      "Hufflepuff"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Harry Potter is sorted into Gryffindor House, known for bravery and courage.",
    "detailedExplanation": "Harry Potter is sorted into Gryffindor House during his first year at Hogwarts School of Witchcraft and Wizardry. Gryffindor is one of the four houses at Hogwarts, founded by Godric Gryffindor and known for valuing bravery, courage, nerve, and chivalry. The Sorting Hat initially considered placing Harry in Slytherin but ultimately chose Gryffindor after Harry expressed his strong desire not to be in Slytherin. Gryffindor's colors are scarlet and gold, and its symbol is a lion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts",
    "citationTitle": "Wikipedia: Hogwarts"
  },
  {
    "id": "7a610dc2-275e-4f22-8485-3619a4617cbd",
    "text": "What platform do students use to board the Hogwarts Express?",
    "options": [
      "Platform 9",
      "Platform 9¾",
      "Platform 10",
      "Platform 8½"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Platform 9¾ is the magical platform at King's Cross Station where students board the Hogwarts Express.",
    "detailedExplanation": "Platform 9¾ is the concealed train platform at King's Cross Station in London from which the Hogwarts Express departs for Hogwarts School. The platform is hidden from Muggles and accessed by running straight at the barrier between platforms 9 and 10. Students and their families can pass through this solid barrier to reach the magical platform where the scarlet Hogwarts Express steam engine waits to transport students to school at the start of each term.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts_Express",
    "citationTitle": "Wikipedia: Hogwarts Express"
  },
  {
    "id": "76b4e444-4d49-4b87-843f-e32d87491db3",
    "text": "Who is the headmaster of Hogwarts for most of the Harry Potter series?",
    "options": [
      "Professor McGonagall",
      "Professor Snape",
      "Albus Dumbledore",
      "Professor Flitwick"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Albus Dumbledore serves as Hogwarts headmaster throughout most of the series until his death in the sixth book.",
    "detailedExplanation": "Albus Percival Wulfric Brian Dumbledore is the headmaster of Hogwarts School of Witchcraft and Wizardry for the majority of the Harry Potter series. Considered one of the most powerful wizards of all time, Dumbledore serves as a mentor and father figure to Harry throughout the series. He leads the school from Harry's first year until his death at the end of the sixth book, 'Harry Potter and the Half-Blood Prince.' Dumbledore is known for his wisdom, his powerful magical abilities, and his role in the fight against Lord Voldemort.",
    "citationUrl": "https://en.wikipedia.org/wiki/Albus_Dumbledore",
    "citationTitle": "Wikipedia: Albus Dumbledore"
  },
  {
    "id": "ee6d8bf6-f728-4e4e-b58c-f0ab6e59ea1c",
    "text": "What is the name of Harry Potter's best female friend?",
    "options": [
      "Luna Lovegood",
      "Ginny Weasley",
      "Hermione Granger",
      "Cho Chang"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hermione Granger is one of Harry's two best friends, along with Ron Weasley.",
    "detailedExplanation": "Hermione Jean Granger is one of Harry Potter's two best friends throughout the series, forming the central trio along with Ron Weasley. Born to Muggle parents, Hermione is known for her exceptional intelligence, extensive knowledge of magic, and dedication to her studies. She consistently achieves top grades in nearly all subjects and often helps Harry and Ron with their homework and various challenges. Hermione's quick thinking and vast magical knowledge prove invaluable in helping Harry overcome obstacles and defeat Voldemort.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hermione_Granger",
    "citationTitle": "Wikipedia: Hermione Granger"
  },
  {
    "id": "6c331321-a46e-48c8-bcd8-4d1f5d5426c0",
    "text": "What sport is played on broomsticks in the wizarding world?",
    "options": [
      "Wizard Chess",
      "Exploding Snap",
      "Quidditch",
      "Gobstones"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Quidditch is the popular wizarding sport played on flying broomsticks with four balls and seven players per team.",
    "detailedExplanation": "Quidditch is the most popular sport in the wizarding world, played on flying broomsticks high above the ground. The game involves two teams of seven players each: three Chasers, two Beaters, one Keeper, and one Seeker. The game uses four balls: one Quaffle (used by Chasers to score goals), two Bludgers (magically enchanted to fly around and try to knock players off their brooms), and one Golden Snitch (a tiny, fast ball with wings that the Seekers try to catch to end the game). Harry Potter becomes the Seeker for the Gryffindor Quidditch team during his first year at Hogwarts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Quidditch",
    "citationTitle": "Wikipedia: Quidditch"
  },
  {
    "id": "1b4338d1-83b8-4886-a4ea-0c550cf8cba0",
    "text": "What is the name of Harry Potter's pet owl?",
    "options": [
      "Hedwig",
      "Errol",
      "Pigwidgeon",
      "Archimedes"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hedwig is Harry Potter's snowy owl, given to him by Hagrid for his 11th birthday.",
    "detailedExplanation": "Hedwig is Harry Potter's beloved snowy owl, purchased for him by Hagrid at Diagon Alley as an 11th birthday present before Harry's first year at Hogwarts. Throughout the series, Hedwig serves as Harry's loyal companion and mail carrier, delivering and receiving letters and packages. The owl's name comes from a medieval saint, and Hedwig plays an important emotional role in Harry's life, representing one of his first real gifts and connections to the wizarding world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  }
]