[
  {
    "id": "2879e01c-389a-4421-9f55-6cb7e0dd423a",
    "text": "What is the exact address of the Black family home where Sirius Black lived?",
    "options": [
      "11 Grimmauld Place",
      "12 Grimmauld Place",
      "13 Grimmauld Place",
      "10 Grimmauld Place"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "12 Grimmauld Place is the ancestral home of the Black family and headquarters of the Order of the Phoenix.",
    "detailedExplanation": "Number 12, Grimmauld Place is the London residence of the Black family, located in the Borough of Islington. The house served as the headquarters for the Order of the Phoenix during the Second Wizarding War and was inherited by Sirius Black, then later by Harry Potter after Sirius's death. The house is hidden from Muggles and can only be seen by those who have been told of its existence by the Secret Keeper.",
    "citationUrl": "https://en.wikipedia.org/wiki/Places_in_Harry_Potter#12_Grimmauld_Place",
    "citationTitle": "Wikipedia: Places in Harry Potter"
  },
  {
    "id": "d1563dfd-9064-47ca-b56c-10aa54c45757",
    "text": "Which potion ingredient is NOT required to brew Polyjuice Potion according to the recipe Hermione found?",
    "options": [
      "Lacewing flies",
      "Unicorn hair",
      "Powdered bicorn horn",
      "Shredded boomslang skin"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Unicorn hair is not an ingredient in Polyjuice Potion; the recipe requires lacewing flies, leeches, fluxweed, knotgrass, powdered bicorn horn, and shredded boomslang skin.",
    "detailedExplanation": "The Polyjuice Potion recipe that Hermione stole from Professor Snape's private stores in 'The Chamber of Secrets' contained seven ingredients: lacewing flies (stewed for 21 days), leeches, fluxweed (picked at full moon), knotgrass, powdered horn of bicorn, shredded skin of boomslang, and a bit of whoever you want to turn into. The potion takes exactly one month to brew and allows the drinker to assume the physical appearance of another person.",
    "citationUrl": "https://en.wikipedia.org/wiki/Potions_in_Harry_Potter#Polyjuice_Potion",
    "citationTitle": "Wikipedia: Potions in Harry Potter"
  },
  {
    "id": "c770ef0a-585d-4c98-8ad8-cb34e117d046",
    "text": "What is the incantation for the Memory Charm that Gilderoy Lockhart attempted to use on Harry and Ron?",
    "options": [
      "Confundus",
      "Obliviate",
      "Stupefy",
      "Petrificus Totalus"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Obliviate is the incantation for the Memory Charm, which Lockhart tried to cast but backfired due to Ron's broken wand.",
    "detailedExplanation": "In 'Harry Potter and the Chamber of Secrets,' Gilderoy Lockhart attempts to perform a Memory Charm on Harry Potter and Ron Weasley to make them forget that he had admitted to being a fraud. The incantation 'Obliviate' is used to remove specific memories from the target's mind. However, when Lockhart uses Ron's broken wand to cast the spell, it backfires spectacularly, causing Lockhart to lose his own memory instead and creating a cave-in that separates Harry from Ron and Lockhart.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magic_in_Harry_Potter#Memory_Charm",
    "citationTitle": "Wikipedia: Magic in Harry Potter"
  },
  {
    "id": "8c8984cf-cba6-472f-8518-694cca55758e",
    "text": "Which of these is NOT one of the four houses that the Sorting Hat mentioned it nearly placed Harry Potter into during their private conversation?",
    "options": [
      "Gryffindor",
      "Slytherin",
      "Hufflepuff",
      "Ravenclaw"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Sorting Hat only seriously considered Gryffindor and Slytherin for Harry, never mentioning Hufflepuff as a possibility.",
    "detailedExplanation": "During Harry's sorting ceremony and in later conversations, the Sorting Hat reveals that it primarily debated between placing Harry in Gryffindor or Slytherin. The Hat noted Harry's courage and nerve (Gryffindor traits) but also his talent, determination, and connection to Voldemort through the Horcrux in his scar (which could have led to Slytherin). While Ravenclaw was briefly considered due to Harry's quick thinking, Hufflepuff was never seriously mentioned as an option for Harry Potter by the Sorting Hat.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts#Sorting_Hat",
    "citationTitle": "Wikipedia: Hogwarts"
  },
  {
    "id": "e2171562-ff5e-4474-84dc-68f8138885a6",
    "text": "What is the name of the Salem Witches' Institute member who corresponds with Molly Weasley?",
    "options": [
      "Gladys Gudgeon",
      "Celestina Warbeck",
      "Mafalda Hopkirk",
      "Augusta Longbottom"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Gladys Gudgeon is mentioned as a member of the Salem Witches' Institute who writes to Molly Weasley.",
    "detailedExplanation": "Gladys Gudgeon is a minor character mentioned in the Harry Potter series as a member of the Salem Witches' Institute, an organization based in America. She maintains correspondence with Molly Weasley, sharing recipes and other domestic magical knowledge. This detail showcases J.K. Rowling's attention to creating a broader wizarding world beyond Britain, with international magical organizations and cross-cultural exchanges between witches and wizards from different countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Order_of_the_Phoenix_(fictional_organisation)",
    "citationTitle": "Wikipedia: Order of the Phoenix"
  },
  {
    "id": "068f08fc-229d-40cd-9103-f4aa3ed81c88",
    "text": "Which of these creatures is capable of becoming invisible at will and is known to guard wizard dwellings?",
    "options": [
      "Bowtruckle",
      "Kappa",
      "Demiguise",
      "Thestral"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bowtruckles are tree-dwelling creatures that can become invisible and are known to guard wand-quality wood trees and wizard homes.",
    "detailedExplanation": "Bowtruckles are stick-like creatures that inhabit wand-quality trees, particularly wiggentree. They have the ability to become invisible at will, which helps them blend in with the branches they call home. In the Harry Potter universe, they are known to guard both their trees and wizard dwellings, becoming aggressive when their homes are threatened. Hagrid teaches about Bowtruckles in his Care of Magical Creatures class, and they play a significant role in the 'Fantastic Beasts' film series, where Newt Scamander keeps several as companions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter#Bowtruckle",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  },
  {
    "id": "a8b4deb1-c1b5-4c9c-8cc6-d8a1917e87c9",
    "text": "In what year was the International Statute of Wizarding Secrecy established?",
    "options": [
      "1689",
      "1692",
      "1697",
      "1701"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The International Statute of Wizarding Secrecy was established in 1692 to hide the wizarding world from Muggles.",
    "detailedExplanation": "The International Statute of Wizarding Secrecy was established in 1692 as a comprehensive law designed to hide the wizarding world from Muggle society. This statute was created in response to increasing persecution of witches and wizards by Muggles, particularly during the witch trials of the late 17th century. The law requires all magical governments to hide their magical communities, prohibits wizards from revealing magic to Muggles, and establishes the principle that wizards must not interfere in Muggle affairs. Violations of this statute are taken very seriously by the Ministry of Magic and similar governing bodies worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ministry_of_Magic#International_Statute_of_Wizarding_Secrecy",
    "citationTitle": "Wikipedia: Ministry of Magic"
  },
  {
    "id": "f9c85d83-1358-42d2-8400-97f5ab8638f5",
    "text": "What is the exact incantation for the spell that creates a corporeal Patronus?",
    "options": [
      "Expecto Patronum",
      "Expecto Patronus",
      "Expectus Patronum",
      "Expecto Patrono"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The correct incantation is 'Expecto Patronum' in Latin, meaning 'I await a guardian.'",
    "detailedExplanation": "The Patronus Charm is one of the most famous defensive spells in the Harry Potter series. The incantation 'Expecto Patronum' is derived from Latin, with 'expecto' meaning 'I await' or 'I expect' and 'patronum' meaning 'guardian' or 'protector.' This spell produces a silvery-white guardian that takes the shape of an animal unique to each witch or wizard, representing their innermost positive feelings and serving as protection against Dementors.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magic_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magic in Harry Potter"
  },
  {
    "id": "84779b65-8fe5-4610-b1a4-3cd4adf76c33",
    "text": "In which year was Grindelwald defeated by Albus Dumbledore?",
    "options": [
      "1945",
      "1943",
      "1947",
      "1944"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Dumbledore defeated Grindelwald in 1945, the same year World War II ended.",
    "detailedExplanation": "The defeat of Gellert Grindelwald by Albus Dumbledore in 1945 is significant both in wizarding history and as a parallel to real-world events. J.K. Rowling deliberately chose 1945, the year World War II ended, to draw parallels between Grindelwald's reign of terror and the historical events of that time. This legendary duel took place at Nurmengard, Grindelwald's own prison fortress, where Grindelwald was subsequently imprisoned until his death at Voldemort's hands in 1998.",
    "citationUrl": "https://en.wikipedia.org/wiki/Albus_Dumbledore",
    "citationTitle": "Wikipedia: Albus Dumbledore"
  },
  {
    "id": "944bde77-fdcd-43ce-b342-da281498334f",
    "text": "What type of dragon did Viktor Krum face during the first task of the Triwizard Tournament?",
    "options": [
      "Chinese Fireball",
      "Common Welsh Green",
      "Hungarian Horntail",
      "Norwegian Ridgeback"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Viktor Krum faced the Chinese Fireball, also known as the Liondragon.",
    "detailedExplanation": "During the first task of the Triwizard Tournament in 'Harry Potter and the Goblet of Fire,' each champion had to retrieve a golden egg from a nesting dragon. Viktor Krum, the Durmstrang champion, drew the Chinese Fireball (also called Liondragon). This dragon is characterized by its scarlet scales and distinctive fringe of golden spikes around its face. Krum used the Conjunctivitis Curse to blind the dragon temporarily, though this backfired when the dragon trampled some of her real eggs in her confusion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Goblet_of_Fire",
    "citationTitle": "Wikipedia: Harry Potter and the Goblet of Fire"
  },
  {
    "id": "b38e3901-a97f-43f2-aee4-5c900bb25d21",
    "text": "What is the maximum speed of a Firebolt broomstick?",
    "options": [
      "150 mph in 10 seconds",
      "0 to 150 mph in 10 seconds",
      "200 mph",
      "0 to 100 mph in 8 seconds"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Firebolt can accelerate from 0 to 150 mph in ten seconds with superb balance and precision.",
    "detailedExplanation": "The Firebolt is described as the finest racing broom in the world at the time of the series. According to 'Quidditch Through the Ages' and references in the main series, the Firebolt's most impressive feature is its acceleration capability of reaching 150 mph from a standing start in just ten seconds. This, combined with its perfect balance, precision turns, and ability to stop on a Galleon, made it the preferred choice of professional Quidditch teams worldwide and an incredibly generous gift from Sirius Black to Harry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "91e3e660-5195-494e-aa28-9fe52a42277b",
    "text": "What is the name of the wandmaker who made Voldemort's wand?",
    "options": [
      "Garrick Ollivander",
      "Gregorovitch",
      "Antioch Peverell",
      "Mykew Gregorovitch"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Mykew Gregorovitch, the Eastern European wandmaker, created Voldemort's yew and phoenix feather wand.",
    "detailedExplanation": "While Garrick Ollivander is the most famous wandmaker in Britain, Tom Riddle (Voldemort) obtained his wand from Mykew Gregorovitch, a renowned Eastern European wandmaker. Voldemort's wand was made of yew wood with a phoenix feather core - the same phoenix (Fawkes) that provided the feather for Harry's holly wand made by Ollivander. This connection between the wands became crucial to the series' plot, creating the 'brother wands' phenomenon that saved Harry's life during their duel in the graveyard.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "89517606-2af3-440c-9d2d-0f2d998fe4d2",
    "text": "What is the incantation for the Killing Curse in its original language?",
    "options": [
      "Avada Kedavra",
      "Avada Kadavra",
      "Abada Kedavra",
      "Avada Cadavra"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The correct spelling is 'Avada Kedavra,' derived from Aramaic meaning 'let the thing be destroyed.'",
    "detailedExplanation": "Avada Kedavra is one of the three Unforgivable Curses and causes instant death with no known counter-curse. J.K. Rowling has stated that the incantation is derived from 'abracadabra,' but the spell itself comes from Aramaic and means 'let the thing be destroyed.' Unlike the common stage magic word, this version has a much darker etymology. The curse leaves no trace of damage on its victims - they simply drop dead, which made it particularly favored by Voldemort and his Death Eaters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magic_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magic in Harry Potter"
  },
  {
    "id": "197cc57c-3a40-45d9-bf83-63be1c3c95cf",
    "text": "How many Chocolate Frog cards did Ron say he had collected by his first year at Hogwarts?",
    "options": [
      "About 200",
      "About 500",
      "About 300",
      "About 400"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Ron mentioned he had about 500 Chocolate Frog cards, though he was still missing Agrippa and Ptolemy.",
    "detailedExplanation": "In 'Harry Potter and the Philosopher's Stone,' when Harry first encounters Chocolate Frogs on the Hogwarts Express, Ron mentions his extensive collection of about 500 Chocolate Frog cards. Despite this impressive number, he notes that he's still missing Agrippa and Ptolemy. This detail showcases Ron's longtime familiarity with the wizarding world compared to Harry's newcomer status, and also establishes the collectible nature of these magical trading cards that feature famous witches and wizards throughout history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Philosopher%27s_Stone",
    "citationTitle": "Wikipedia: Harry Potter and the Philosopher's Stone"
  },
  {
    "id": "540bc31a-ed16-4b08-8c63-778ae93ff5bb",
    "text": "What was the name of the Hogwarts House-elf who helped Dobby in the kitchens during Harry's fourth year?",
    "options": [
      "Kreacher",
      "Winky",
      "Hokey",
      "Pitts"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Winky was the house-elf who worked in the Hogwarts kitchens alongside Dobby after being dismissed by Mr. Crouch.",
    "detailedExplanation": "Winky was originally the house-elf of Bartemius Crouch Sr., but was dismissed after the incident at the Quidditch World Cup where she was found with Harry's wand after someone cast the Dark Mark. Devastated by her dismissal and struggling with alcoholism (drinking Butterbeer), Winky was given work in the Hogwarts kitchens by Dumbledore. She worked alongside Dobby, though she disapproved of his acceptance of wages and freedom. Winky's story highlights the complex psychology of house-elf servitude and their struggle with freedom.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  },
  {
    "id": "b7524275-4161-4ee6-9739-7cbeb5b87a4c",
    "text": "What is the exact address of the Leaky Cauldron in London?",
    "options": [
      "Charing Cross Road",
      "Diagon Alley",
      "Between numbers 12 and 13 Charing Cross Road",
      "Number 4 Privet Drive"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Leaky Cauldron is located between numbers 12 and 13 Charing Cross Road.",
    "detailedExplanation": "In the Harry Potter series, the Leaky Cauldron pub serves as the entrance to Diagon Alley and is described as being located between numbers 12 and 13 Charing Cross Road in London. This magical establishment is invisible to Muggles, who see only the gap between the numbered buildings. The pub is run by Tom the innkeeper and serves as a crucial meeting point between the Muggle and wizarding worlds.",
    "citationUrl": "https://en.wikipedia.org/wiki/Places_in_Harry_Potter#The_Leaky_Cauldron",
    "citationTitle": "Wikipedia: Places in Harry Potter"
  },
  {
    "id": "71f7685e-4b15-480d-af0c-8300d49277a9",
    "text": "Which Horcrux was destroyed first chronologically within the timeline of the story?",
    "options": [
      "Tom Riddle's Diary",
      "Marvolo Gaunt's Ring",
      "Helga Hufflepuff's Cup",
      "Harry Potter himself"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Marvolo Gaunt's Ring was destroyed by Dumbledore during the summer before Harry's sixth year.",
    "detailedExplanation": "While Tom Riddle's diary appears to be destroyed first in the series (in Chamber of Secrets), chronologically within the story's timeline, Marvolo Gaunt's ring was actually destroyed first by Albus Dumbledore during the summer of 1996, before Harry's sixth year at Hogwarts. This occurred before the events of Half-Blood Prince, though it's revealed later in the book. The ring contained the Resurrection Stone and cursed Dumbledore's hand when he destroyed it.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter#Horcruxes",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "03fcbf87-c849-4f2a-8eda-d550d3bf1b36",
    "text": "What is the incantation for the spell that creates a Patronus?",
    "options": [
      "Expecto Patronum",
      "Expelliarmus",
      "Protego Patronum",
      "Patronus Guardium"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The incantation 'Expecto Patronum' is used to conjure a Patronus.",
    "detailedExplanation": "The Patronus Charm is cast using the incantation 'Expecto Patronum,' which is Latin meaning 'I await a guardian.' This advanced defensive spell conjures a positive energy force known as a Patronus, which acts as a shield between the caster and Dementors. The spell requires the caster to focus on their happiest memory while casting. Harry Potter learns this spell from Professor Lupin in his third year and becomes exceptionally skilled at it, producing a stag Patronus like his father James.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magic_in_Harry_Potter#Patronus_Charm",
    "citationTitle": "Wikipedia: Magic in Harry Potter"
  },
  {
    "id": "611910fd-ac3e-47ad-9d49-e90302dbd5ce",
    "text": "Which character was NOT a member of the original Order of the Phoenix during the First Wizarding War?",
    "options": [
      "Mundungus Fletcher",
      "Nymphadora Tonks",
      "Marlene McKinnon",
      "Caradoc Dearborn"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Nymphadora Tonks was too young during the First Wizarding War and only joined the Order during its reformation.",
    "detailedExplanation": "Nymphadora Tonks was born in 1973, making her only about 8 years old when the First Wizarding War ended in 1981. She was far too young to be a member of the original Order of the Phoenix. Tonks joined the reconstituted Order of the Phoenix in 1995 as an adult Auror. The other three characters mentioned were all original members: Mundungus Fletcher was a petty criminal who provided intelligence, Marlene McKinnon was killed along with her family by Death Eaters, and Caradoc Dearborn disappeared and was presumed dead.",
    "citationUrl": "https://en.wikipedia.org/wiki/Order_of_the_Phoenix_(fictional_organisation)",
    "citationTitle": "Wikipedia: Order of the Phoenix"
  },
  {
    "id": "d6df8837-0363-406e-8e71-668d476f92fd",
    "text": "What does the abbreviation 'O.W.L.S.' stand for in the wizarding education system?",
    "options": [
      "Outstanding Wizarding Learning Standards",
      "Ordinary Wizarding Level examinations",
      "Official Wizarding License Studies",
      "Optimal Wizarding Level Subjects"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "O.W.L.S. stands for Ordinary Wizarding Level examinations, taken by fifth-year students.",
    "detailedExplanation": "O.W.L.S. (Ordinary Wizarding Level examinations) are standardized tests taken by fifth-year students at Hogwarts School of Witchcraft and Wizardry. These examinations are crucial for determining which N.E.W.T. (Nastily Exhausting Wizarding Tests) classes students can take in their sixth and seventh years, which in turn affects their career prospects. The O.W.L.S. are administered by the Wizarding Examinations Authority and cover both theoretical and practical components of magical subjects. Results range from Outstanding (O) to Troll (T).",
    "citationUrl": "https://en.wikipedia.org/wiki/Hogwarts#Curriculum",
    "citationTitle": "Wikipedia: Hogwarts"
  }
]