[
  {
    "id": "f80dc083-c772-4810-baf1-af2c7b1a61e4",
    "text": "Which Hogwarts professor can transform into a tabby cat?",
    "options": [
      "Professor Sprout",
      "Professor McGonagall",
      "Professor Trelawney",
      "Professor Pomfrey"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Professor McGonagall is an Animagus who can transform into a tabby cat with distinctive markings around her eyes.",
    "detailedExplanation": "Professor Minerva McGonagall is a registered Animagus, meaning she can transform into an animal at will. Her animal form is a silver tabby cat with square spectacle markings around her eyes that mirror her actual glasses. She is first seen in this form in the opening chapter of 'Harry Potter and the Philosopher's Stone,' watching the Dursley family on Privet Drive before meeting Dumbledore.",
    "citationUrl": "https://en.wikipedia.org/wiki/Minerva_McGonagall",
    "citationTitle": "Wikipedia: Minerva McGonagall"
  },
  {
    "id": "cc81e826-e29d-4c4d-b1e1-ff9a874ae0fb",
    "text": "What position does Harry play on the Gryffindor Quidditch team?",
    "options": [
      "Chaser",
      "Beater",
      "Keeper",
      "Seeker"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Harry plays as Seeker, responsible for catching the Golden Snitch to end the game and earn 150 points.",
    "detailedExplanation": "Harry Potter plays as Seeker for the Gryffindor Quidditch team, a position he obtains in his first year after Professor McGonagall witnesses his natural flying ability during a confrontation with Draco Malfoy. As Seeker, Harry's job is to catch the Golden Snitch, a small, fast-moving golden ball with wings. Catching the Snitch ends the game and awards the team 150 points, making it a crucial position that often determines the match outcome.",
    "citationUrl": "https://en.wikipedia.org/wiki/Quidditch",
    "citationTitle": "Wikipedia: Quidditch"
  },
  {
    "id": "90574b59-01e1-4219-8515-e8c74a2d0838",
    "text": "What spell is used to disarm an opponent?",
    "options": [
      "Stupefy",
      "Expelliarmus",
      "Protego",
      "Petrificus Totalus"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Expelliarmus is the Disarming Charm that forces an opponent to drop whatever they're holding, typically their wand.",
    "detailedExplanation": "Expelliarmus is the Disarming Charm, one of the most frequently used spells in the Harry Potter series. When cast successfully, it forces the target to drop whatever they're holding, usually their wand, making it an essential defensive spell in wizard dueling. Harry Potter becomes particularly associated with this spell, using it so frequently that Death Eaters can identify him by it during the Battle of the Seven Potters in 'The Deathly Hallows.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Magic_in_Harry_Potter#Disarming_Charm",
    "citationTitle": "Wikipedia: Magic in Harry Potter"
  },
  {
    "id": "f209d053-3650-43ed-93ab-56d795cce078",
    "text": "What does the Marauder's Map show?",
    "options": [
      "Hidden treasure locations",
      "Secret passages and people's locations in Hogwarts",
      "Future events at Hogwarts",
      "The location of Horcruxes"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Marauder's Map reveals all of Hogwarts' secret passages and shows the real-time location of everyone in the castle.",
    "detailedExplanation": "The Marauder's Map is a magical document created by James Potter (Prongs), Sirius Black (Padfoot), Remus Lupin (Moony), and Peter Pettigrew (Wormtail) during their time at Hogwarts. The map shows every person's location within Hogwarts castle and grounds as a dot with their name, and reveals all the secret passages. It's activated with the phrase 'I solemnly swear I am up to no good' and cleared with 'Mischief managed.' Fred and George Weasley give it to Harry in his third year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter#Marauder's_Map",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "2227bf77-a2e9-49a8-88e3-cd6450e23d2a",
    "text": "Which dragon does Harry face during the Triwizard Tournament?",
    "options": [
      "Norwegian Ridgeback",
      "Hungarian Horntail",
      "Chinese Fireball",
      "Common Welsh Green"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Harry faces the Hungarian Horntail, considered the most dangerous of the four dragons used in the first task.",
    "detailedExplanation": "During the first task of the Triwizard Tournament in 'Harry Potter and the Goblet of Fire,' each champion must retrieve a golden egg from a nesting dragon. Harry draws the Hungarian Horntail, which is described as the most vicious and dangerous of the four dragon breeds used. The Hungarian Horntail has black scales, bronze horns, and similarly colored spikes protruding from its long tail. Harry uses his flying skills and Summoning Charm to call his Firebolt broomstick to complete the task.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter#Dragons",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  },
  {
    "id": "3f95d912-1c3c-42e8-862c-b7d32cb18ef4",
    "text": "In which book does Dumbledore die?",
    "options": [
      "Order of the Phoenix",
      "Half-Blood Prince",
      "Goblet of Fire",
      "Deathly Hallows"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Dumbledore dies at the end of 'Harry Potter and the Half-Blood Prince,' killed by Severus Snape.",
    "detailedExplanation": "Albus Dumbledore dies at the end of 'Harry Potter and the Half-Blood Prince,' the sixth book in the series. He is killed by Severus Snape atop the Astronomy Tower at Hogwarts, though it's later revealed in 'The Deathly Hallows' that this was planned between them. Dumbledore was already dying from a curse he received while destroying one of Voldemort's Horcruxes, and he asked Snape to kill him to spare Draco Malfoy from having to commit murder and to maintain Snape's cover as a double agent.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Half-Blood_Prince",
    "citationTitle": "Wikipedia: Harry Potter and the Half-Blood Prince"
  },
  {
    "id": "12372f14-4bc3-403c-8fbf-1514c3b8a22d",
    "text": "What is the name of the three-headed dog that guards the Philosopher's Stone in Harry Potter's first year?",
    "options": [
      "Fluffy",
      "Fang",
      "Norbert",
      "Aragog"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Fluffy is the three-headed dog owned by Hagrid that guards the trapdoor leading to the Philosopher's Stone.",
    "detailedExplanation": "Fluffy is a massive three-headed dog that Hagrid acquired from a 'Greek chappie' and used to guard the entrance to the underground chambers protecting the Philosopher's Stone. The dog can be put to sleep by music, which Hagrid reveals to Harry, Ron, and Hermione. This weakness proves crucial when the trio needs to get past Fluffy to pursue what they believe is Snape attempting to steal the Stone.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  },
  {
    "id": "1bb3a9c6-8efc-47de-b37d-93c5772bb534",
    "text": "Which Hogwarts professor teaches Transfiguration and is also the head of Gryffindor House?",
    "options": [
      "Professor Flitwick",
      "Professor McGonagall",
      "Professor Sprout",
      "Professor Snape"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Professor McGonagall teaches Transfiguration and serves as head of Gryffindor House throughout the series.",
    "detailedExplanation": "Professor Minerva McGonagall is the Deputy Headmistress of Hogwarts and teaches Transfiguration, one of the most complex and dangerous forms of magic. She is also the head of Gryffindor House, making her Harry's head of house. McGonagall is known for her strict but fair teaching style and her ability to transform into a tabby cat (she is an Animagus). She plays a crucial role throughout the series as both mentor and protector to Harry and his friends.",
    "citationUrl": "https://en.wikipedia.org/wiki/Minerva_McGonagall",
    "citationTitle": "Wikipedia: Minerva McGonagall"
  },
  {
    "id": "52139738-8a67-4a8d-b62c-d3a33a93e959",
    "text": "What form does Harry Potter's Patronus take?",
    "options": [
      "Doe",
      "Otter",
      "Stag",
      "Phoenix"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Harry's Patronus takes the form of a stag, the same as his father James Potter's Animagus form.",
    "detailedExplanation": "Harry's Patronus manifests as a stag, which is particularly significant because it matches his father James Potter's Animagus form. This connection between father and son is deeply meaningful, especially since Harry initially believes it was his father's spirit that saved him from the Dementors by the lake in his third year. The stag Patronus first appears fully formed when Harry travels back in time and casts it himself, creating a temporal loop that saves both Sirius and his past self.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter_(character)",
    "citationTitle": "Wikipedia: Harry Potter (character)"
  },
  {
    "id": "d335302d-0b6b-47e8-b5fc-893f600757a0",
    "text": "In which book does Harry first successfully produce a corporeal Patronus?",
    "options": [
      "Chamber of Secrets",
      "Prisoner of Azkaban",
      "Goblet of Fire",
      "Order of the Phoenix"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Harry first produces a fully corporeal Patronus in 'Prisoner of Azkaban' during the time-travel sequence.",
    "detailedExplanation": "While Harry learns the Patronus charm and produces a weak, non-corporeal version during his lessons with Professor Lupin in 'The Prisoner of Azkaban,' he first successfully casts a full, corporeal Patronus (in the form of a stag) during the time-travel sequence at the end of the same book. This occurs when he and Hermione go back in time to save Sirius and Buckbeak, and Harry realizes he must be the one to cast the Patronus that saves his past self and Sirius from the Dementors.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Prisoner_of_Azkaban",
    "citationTitle": "Wikipedia: Harry Potter and the Prisoner of Azkaban"
  },
  {
    "id": "2a0a2b22-a049-4e17-a8ca-5b142198b50b",
    "text": "What is the name of the prison where wizarding criminals are held, guarded by Dementors?",
    "options": [
      "Nurmengard",
      "Azkaban",
      "Grindelwald",
      "Durmstrang"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Azkaban is the wizarding prison located on an island in the North Sea, infamous for its Dementor guards.",
    "detailedExplanation": "Azkaban is the fortress prison for wizarding criminals in Britain, located on a rocky island somewhere in the North Sea. It is guarded by Dementors, dark creatures that drain happiness and hope from humans and can perform the deadly Dementor's Kiss. The prison is notorious for driving inmates insane due to the constant presence of Dementors. Sirius Black's escape from Azkaban is central to the plot of the third book, and later many Death Eaters are imprisoned there before escaping in the fifth book.",
    "citationUrl": "https://en.wikipedia.org/wiki/Places_in_Harry_Potter#Azkaban",
    "citationTitle": "Wikipedia: Places in Harry Potter"
  },
  {
    "id": "2f491e98-a882-4e83-b118-95a5fa242caf",
    "text": "Which Horcrux is destroyed first in the series?",
    "options": [
      "Marvolo Gaunt's ring",
      "Tom Riddle's diary",
      "Salazar Slytherin's locket",
      "Helga Hufflepuff's cup"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tom Riddle's diary is the first Horcrux to be destroyed, when Harry stabs it with a basilisk fang in the Chamber of Secrets.",
    "detailedExplanation": "Tom Riddle's diary, which contains a piece of Voldemort's soul from when he was sixteen, is the first Horcrux to be destroyed in the series. Harry unknowingly destroys it at the end of 'The Chamber of Secrets' by stabbing it with a basilisk fang after the memory of Tom Riddle nearly drains the life from Ginny Weasley. At this point, neither Harry nor the readers understand the true significance of the diary as a Horcrux - this revelation comes much later in 'The Half-Blood Prince' when Dumbledore explains Voldemort's use of Horcruxes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter#Horcruxes",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "03d1f979-d878-4f17-be3a-e7f24136a3e4",
    "text": "What is the core of Harry Potter's wand?",
    "options": [
      "Dragon heartstring",
      "Unicorn hair",
      "Phoenix feather",
      "Veela hair"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Harry's wand contains a phoenix feather core, specifically a feather from Fawkes, Dumbledore's phoenix.",
    "detailedExplanation": "Harry's wand is made of holly wood and contains a phoenix feather core. The feather came from Fawkes, Dumbledore's phoenix, who gave only two feathers for wand cores. The other feather was used in Voldemort's wand, making the two wands 'brothers.' This connection explains the unusual behavior of the wands when Harry and Voldemort duel, including the reverse spell effect (Priori Incantatem) that occurs during their duel in the graveyard in 'Goblet of Fire.' Mr. Ollivander considers it very curious that Harry should be destined for the wand whose brother gave him his scar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter#Wands",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "238b362d-3eb7-4c11-86e5-c44310171833",
    "text": "What is the name of the Quidditch team that Viktor Krum plays for?",
    "options": [
      "Chudley Cannons",
      "Bulgaria National Team",
      "Puddlemere United",
      "Wimbourne Wasps"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Viktor Krum plays Seeker for the Bulgaria National Quidditch Team in the World Cup final against Ireland.",
    "detailedExplanation": "Viktor Krum is the star Seeker for the Bulgaria National Quidditch Team, whom Harry watches play against Ireland in the Quidditch World Cup final at the beginning of 'Goblet of Fire.' Despite Bulgaria losing the match 170-160, Krum catches the Golden Snitch and is regarded as one of the best Seekers in the world at just eighteen years old. He later comes to Hogwarts as the Durmstrang champion in the Triwizard Tournament, where he develops a relationship with Hermione Granger, much to Ron's jealousy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Quidditch",
    "citationTitle": "Wikipedia: Quidditch"
  },
  {
    "id": "60b9f6c3-41b9-41e8-a5ce-9d270616bb49",
    "text": "Which Hogwarts professor was revealed to be a werewolf in 'The Prisoner of Azkaban'?",
    "options": [
      "Severus Snape",
      "Remus Lupin",
      "Gilderoy Lockhart",
      "Mad-Eye Moody"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Remus Lupin, the Defense Against the Dark Arts teacher, is revealed to be a werewolf at the end of the third book.",
    "detailedExplanation": "Professor Remus Lupin taught Defense Against the Dark Arts during Harry's third year and was one of Harry's father's best friends at Hogwarts. He was bitten by the werewolf Fenrir Greyback as a child, which is how he became a werewolf. His lycanthropy is revealed during the climactic scene in the Shrieking Shack, and he subsequently resigns from his teaching position.",
    "citationUrl": "https://en.wikipedia.org/wiki/Order_of_the_Phoenix_(fictional_organisation)",
    "citationTitle": "Wikipedia: Order of the Phoenix"
  },
  {
    "id": "d18d96b6-4977-4927-acce-d2be5c317a52",
    "text": "What form does Hermione's Patronus take?",
    "options": [
      "A cat",
      "An otter",
      "A beaver",
      "A rabbit"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hermione's Patronus takes the form of an otter, which is revealed in 'The Order of the Phoenix'.",
    "detailedExplanation": "Hermione's Patronus is an otter, which J.K. Rowling chose because it's her favorite animal. The otter Patronus is first seen during Dumbledore's Army meetings in 'The Order of the Phoenix' when the students are learning to cast the Patronus Charm. Interestingly, otters are part of the weasel family, which connects symbolically to her relationship with Ron Weasley.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "5b6f306d-b4ed-4cd7-aea3-76e743212274",
    "text": "What is the name of the bank run by goblins in the wizarding world?",
    "options": [
      "Wizard's Bank",
      "Gringotts",
      "Goblin's Gold",
      "Diagon Bank"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Gringotts Wizarding Bank is the only known bank in the wizarding world and is run entirely by goblins.",
    "detailedExplanation": "Gringotts Wizarding Bank is located in Diagon Alley and is the primary financial institution of the British wizarding world. Run by goblins, it's considered the safest place to store valuables, with the exception of Hogwarts. The bank features heavily throughout the series, from Harry's first visit in 'The Philosopher's Stone' to the dramatic break-in during 'The Deathly Hallows' when Harry, Ron, and Hermione steal Hufflepuff's cup.",
    "citationUrl": "https://en.wikipedia.org/wiki/Places_in_Harry_Potter",
    "citationTitle": "Wikipedia: Places in Harry Potter"
  },
  {
    "id": "4e85a6e0-1aa2-4316-9150-7b48d76f0394",
    "text": "What is the maximum number of times a wizard can use a Time-Turner to go back in time without serious harm?",
    "options": [
      "5 hours",
      "12 hours",
      "24 hours",
      "There is no limit"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "According to wizarding law, the maximum recommended time travel is five hours to avoid serious harm to the traveler.",
    "detailedExplanation": "Time-Turners are highly regulated magical devices, and the Ministry of Magic has established that traveling back more than five hours can result in serious harm to the witch or wizard involved. This includes the risk of seeing multiple versions of yourself, which can cause madness, or accidentally changing significant events. Hermione uses her Time-Turner responsibly during her third year to attend multiple classes, typically only going back a few hours at a time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_objects_in_Harry_Potter",
    "citationTitle": "Wikipedia: Magical objects in Harry Potter"
  },
  {
    "id": "f6735bc4-902e-48d0-a33c-61076222d1b3",
    "text": "Which potion allows the drinker to take on the appearance of someone else?",
    "options": [
      "Veritaserum",
      "Felix Felicis",
      "Polyjuice Potion",
      "Amortentia"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Polyjuice Potion allows the drinker to assume the physical appearance of another person for exactly one hour.",
    "detailedExplanation": "Polyjuice Potion is a complex transformation potion that allows the drinker to take on the complete physical appearance of another person for exactly one hour. It requires a piece of the person being impersonated, such as hair. The potion is notoriously difficult to brew, taking a full month to prepare, and tastes terrible. It's used several times throughout the series, most notably by Hermione, Harry, and Ron in 'The Chamber of Secrets' to impersonate Slytherin students.",
    "citationUrl": "https://en.wikipedia.org/wiki/Potions_in_Harry_Potter",
    "citationTitle": "Wikipedia: Potions in Harry Potter"
  },
  {
    "id": "bf7a3bdc-ed50-4dab-8725-2b69027bb52c",
    "text": "What is the name of the three-headed dog that guards the Philosopher's Stone in Harry Potter's first year at Hogwarts?",
    "options": [
      "Fang",
      "Fluffy",
      "Norbert",
      "Aragog"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Fluffy is the three-headed dog that guards the trapdoor leading to the Philosopher's Stone.",
    "detailedExplanation": "Fluffy is a massive three-headed dog owned by Hagrid, borrowed by Professor Dumbledore to guard the Philosopher's Stone during Harry's first year at Hogwarts. The dog was placed in the forbidden third-floor corridor and would fall asleep when played music. Hagrid had acquired Fluffy from 'a Greek chappie' he met in a pub, and the dog serves as one of the magical protections surrounding the Stone, along with challenges created by other professors.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter#Fluffy",
    "citationTitle": "Wikipedia: Magical creatures in Harry Potter"
  }
]