[
  {
    "id": "ab868aef-9f44-4841-85de-b0a195fe026d",
    "text": "Which rapper released the groundbreaking album 'The Chronic' in 1992?",
    "options": [
      "Snoop Dogg",
      "Dr. Dre",
      "Eazy-E",
      "Ice Cube"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Dr. Dre released 'The Chronic' in 1992, which became a landmark album in West Coast hip hop.",
    "detailedExplanation": "Dr. Dre's debut solo album 'The Chronic' was released in December 1992 and is widely considered one of the most influential hip hop albums of all time. The album introduced G-funk to mainstream audiences and helped launch the career of Snoop Dogg, who was featured prominently throughout the record. It reached number three on the Billboard 200 and established Death Row Records as a major force in the music industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Chronic",
    "citationTitle": "Wikipedia: The Chronic"
  },
  {
    "id": "7ae89a17-90c0-4f60-ab34-e8a8552ca4b7",
    "text": "What is the real name of the rapper known as Jay-Z?",
    "options": [
      "Sean Carter",
      "Shawn Carter",
      "Shane Carter",
      "Shaun Carter"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jay-Z's real name is Shawn Corey Carter.",
    "detailedExplanation": "Shawn Corey Carter, known professionally as Jay-Z, was born on December 4, 1969, in Brooklyn, New York. He adopted the stage name Jay-Z as a tribute to his mentor Jaz-O and the J/Z subway lines near his neighborhood. Jay-Z has become one of the most successful rappers and businessmen in the world, with numerous Grammy Awards and business ventures including Roc-A-Fella Records and Tidal streaming service.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jay-Z",
    "citationTitle": "Wikipedia: Jay-Z"
  },
  {
    "id": "777e083a-99a7-49f2-a46d-6a8f1cea52df",
    "text": "Which Eminem album features the hit single 'Lose Yourself'?",
    "options": [
      "The Marshall Mathers LP",
      "The Eminem Show",
      "8 Mile Soundtrack",
      "Encore"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Lose Yourself' was featured on the 8 Mile Soundtrack, the album for the movie 8 Mile starring Eminem.",
    "detailedExplanation": "'Lose Yourself' was written by Eminem for the 2002 film 8 Mile, in which he starred. The song appeared on the 8 Mile Soundtrack and became Eminem's first Billboard Hot 100 number-one single. It won the Academy Award for Best Original Song, making Eminem the first rapper to win an Oscar. The track is considered one of his greatest songs and has been certified diamond by the RIAA.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lose_Yourself",
    "citationTitle": "Wikipedia: Lose Yourself"
  },
  {
    "id": "fc8933ef-51e6-466c-8a01-4ba458e43cec",
    "text": "Which female rapper released the album 'The Miseducation of Lauryn Hill' in 1998?",
    "options": [
      "Missy Elliott",
      "Queen Latifah",
      "Lauryn Hill",
      "Lil' Kim"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Lauryn Hill released 'The Miseducation of Lauryn Hill' in 1998, her debut solo album.",
    "detailedExplanation": "Lauryn Hill's debut solo album 'The Miseducation of Lauryn Hill' was released in August 1998, following her success with the Fugees. The album was both a commercial and critical success, debuting at number one on the Billboard 200 and winning five Grammy Awards, including Album of the Year. It blended hip hop, R&B, and neo soul, and is widely regarded as one of the greatest albums of the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Miseducation_of_Lauryn_Hill",
    "citationTitle": "Wikipedia: The Miseducation of Lauryn Hill"
  },
  {
    "id": "de899626-7d10-4615-b321-cd0c176ba23c",
    "text": "Which rap group released the classic album 'Straight Outta Compton' in 1988?",
    "options": [
      "Public Enemy",
      "Run-DMC",
      "N.W.A",
      "Beastie Boys"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "N.W.A released 'Straight Outta Compton' in 1988, which became a defining album of gangsta rap.",
    "detailedExplanation": "N.W.A (Niggaz Wit Attitudes) released 'Straight Outta Compton' in August 1988, which became one of the most influential and controversial albums in hip hop history. The group consisted of Eazy-E, Ice Cube, Dr. Dre, MC Ren, and DJ Yella. The album helped establish gangsta rap as a dominant force in hip hop and brought West Coast rap to national prominence, despite facing censorship and controversy over its explicit lyrics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Straight_Outta_Compton",
    "citationTitle": "Wikipedia: Straight Outta Compton"
  },
  {
    "id": "60c9e312-167a-4f23-919c-7b3a34a4ee3a",
    "text": "Which rapper is known for the hit song 'Hotline Bling'?",
    "options": [
      "Drake",
      "Kendrick Lamar",
      "J. Cole",
      "Big Sean"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Drake released 'Hotline Bling' in 2015, which became a massive hit and spawned countless memes.",
    "detailedExplanation": "Drake released 'Hotline Bling' in July 2015 as part of his surprise mixtape 'If You're Reading This It's Too Late,' though it later appeared on his album 'Views.' The song became a cultural phenomenon, reaching number two on the Billboard Hot 100. The music video, featuring Drake's distinctive dance moves, went viral and inspired numerous parodies and memes across social media platforms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hotline_Bling",
    "citationTitle": "Wikipedia: Hotline Bling"
  },
  {
    "id": "7f3acda5-3050-4258-8e52-31e1ac5ee27b",
    "text": "What does 'Wu-Tang' refer to in the name of the hip hop group Wu-Tang Clan?",
    "options": [
      "A type of martial arts",
      "A neighborhood in New York",
      "The founder's nickname",
      "An ancient Chinese weapon"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Wu-Tang refers to the Wudang style of martial arts, reflecting the group's fascination with kung fu culture.",
    "detailedExplanation": "The Wu-Tang Clan took their name from the 1983 kung fu film 'Shaolin and Wu Tang.' The group, formed in Staten Island in 1992, incorporated extensive martial arts imagery and philosophy into their music and personas. Members adopted martial arts-inspired aliases and frequently sampled dialogue from kung fu movies. This unique aesthetic helped distinguish them from other hip hop acts and became integral to their identity and mythology.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wu-Tang_Clan",
    "citationTitle": "Wikipedia: Wu-Tang Clan"
  },
  {
    "id": "a49b9a3d-b997-41be-8bb8-4b7aac9ef911",
    "text": "Which Kanye West album features the song 'Gold Digger' featuring Jamie Foxx?",
    "options": [
      "The College Dropout",
      "Late Registration",
      "Graduation",
      "808s & Heartbreak"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Gold Digger' featuring Jamie Foxx appears on Kanye West's 2005 album 'Late Registration.'",
    "detailedExplanation": "Kanye West's 'Gold Digger' featuring Jamie Foxx was released as the second single from his 2005 album 'Late Registration.' The song samples Ray Charles' 'I Got a Woman' and became West's second number-one hit on the Billboard Hot 100. Jamie Foxx performed the hook, which interpolated Ray Charles' vocals. The song was both a commercial and critical success, helping to solidify West's position as a major force in hip hop.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gold_Digger_(Kanye_West_song)",
    "citationTitle": "Wikipedia: Gold Digger (Kanye West song)"
  },
  {
    "id": "a5a91436-6118-4eab-9781-df8013dd501a",
    "text": "Which rapper is known for the hit album 'Good Kid, M.A.A.D City' released in 2012?",
    "options": [
      "Kendrick Lamar",
      "J. Cole",
      "Big Sean",
      "Childish Gambino"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kendrick Lamar released 'Good Kid, M.A.A.D City' in 2012.",
    "detailedExplanation": "'Good Kid, M.A.A.D City' is Kendrick Lamar's major-label debut studio album, released in October 2012. The album was both a commercial and critical success, debuting at number two on the Billboard 200 and earning widespread acclaim for its conceptual storytelling about Lamar's experiences growing up in Compton, California.",
    "citationUrl": "https://en.wikipedia.org/wiki/Good_Kid,_M.A.A.D_City",
    "citationTitle": "Wikipedia: Good Kid, M.A.A.D City"
  },
  {
    "id": "4c917b03-8c84-49e0-bbfd-e23eadf77262",
    "text": "What is the stage name of Marshall Bruce Mathers III?",
    "options": [
      "50 Cent",
      "Eminem",
      "Ludacris",
      "Nelly"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Marshall Bruce Mathers III is better known by his stage name Eminem.",
    "detailedExplanation": "Marshall Bruce Mathers III, known professionally as Eminem, is one of the best-selling music artists of all time. Born in 1972, he gained mainstream popularity in the late 1990s and became known for his controversial lyrics, technical rapping skills, and his alter ego Slim Shady.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eminem",
    "citationTitle": "Wikipedia: Eminem"
  },
  {
    "id": "79d593c5-5098-4a11-b06e-d4ac270f92d7",
    "text": "Which hip hop duo consists of Big Boi and André 3000?",
    "options": [
      "OutKast",
      "Run-DMC",
      "Gang Starr",
      "Pete Rock & CL Smooth"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "OutKast is the hip hop duo made up of Big Boi and André 3000.",
    "detailedExplanation": "OutKast is an American hip hop duo formed in Atlanta, Georgia in 1992. The duo consists of rappers Big Boi (Antwan André Patton) and André 3000 (André Lauren Benjamin). They are widely credited with helping to popularize Southern hip hop and are known for hits like 'Ms. Jackson' and 'Hey Ya!'",
    "citationUrl": "https://en.wikipedia.org/wiki/Outkast",
    "citationTitle": "Wikipedia: OutKast"
  },
  {
    "id": "9f4e70b8-2d3c-4e66-bb71-9abdf10132ef",
    "text": "Which Nas album is often considered his debut classic and features the track 'N.Y. State of Mind'?",
    "options": [
      "It Was Written",
      "Stillmatic",
      "Illmatic",
      "Nastradamus"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Illmatic is Nas's debut album featuring 'N.Y. State of Mind'.",
    "detailedExplanation": "'Illmatic' is the debut studio album by American rapper Nas, released in April 1994. The album is widely regarded as one of the greatest hip hop albums of all time and features the classic track 'N.Y. State of Mind' along with other acclaimed songs. It showcased Nas's lyrical prowess and storytelling ability over production from legendary producers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Illmatic",
    "citationTitle": "Wikipedia: Illmatic"
  },
  {
    "id": "532971c5-2208-4a41-a578-2210ed914c91",
    "text": "Which female rapper gained fame with the hit single 'Super Bass' in 2011?",
    "options": [
      "Cardi B",
      "Megan Thee Stallion",
      "Nicki Minaj",
      "Doja Cat"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Nicki Minaj released the hit single 'Super Bass' in 2011.",
    "detailedExplanation": "'Super Bass' was released as the fifth single from Nicki Minaj's debut album 'Pink Friday' in 2011. The song became a massive commercial success, reaching number three on the Billboard Hot 100 and helping to establish Minaj as a major force in hip hop and pop music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Super_Bass",
    "citationTitle": "Wikipedia: Super Bass"
  },
  {
    "id": "3f553a4c-6453-414b-8e55-f2c00a9634fd",
    "text": "Which rap group is known for the classic album 'Enter the Wu-Tang (36 Chambers)'?",
    "options": [
      "A Tribe Called Quest",
      "Wu-Tang Clan",
      "Public Enemy",
      "De La Soul"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Wu-Tang Clan released 'Enter the Wu-Tang (36 Chambers)' in 1993.",
    "detailedExplanation": "'Enter the Wu-Tang (36 Chambers)' is the debut studio album by American hip hop group Wu-Tang Clan, released in November 1993. The album is widely regarded as one of the most influential hip hop albums ever made, known for its raw production style and martial arts-influenced themes and samples.",
    "citationUrl": "https://en.wikipedia.org/wiki/Enter_the_Wu-Tang_(36_Chambers)",
    "citationTitle": "Wikipedia: Enter the Wu-Tang (36 Chambers)"
  },
  {
    "id": "683a4d4c-8ee6-44e2-b9eb-0b81c61b13c6",
    "text": "Which rapper released the album 'The Marshall Mathers LP' in the year 2000?",
    "options": [
      "Dr. Dre",
      "Snoop Dogg",
      "Eminem",
      "Ice Cube"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Eminem released 'The Marshall Mathers LP' in 2000.",
    "detailedExplanation": "'The Marshall Mathers LP' is the third studio album by American rapper Eminem, released in May 2000. The album was both a commercial and critical success, becoming one of the fastest-selling albums in rap history at the time and featuring controversial tracks that sparked widespread debate about censorship and artistic expression.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Marshall_Mathers_LP",
    "citationTitle": "Wikipedia: The Marshall Mathers LP"
  },
  {
    "id": "884f4def-4413-47cf-90e4-7b2f1522c8d2",
    "text": "Which hip hop artist is known for the album 'The College Dropout' released in 2004?",
    "options": [
      "Common",
      "Lupe Fiasco",
      "Kanye West",
      "Talib Kweli"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kanye West released 'The College Dropout' as his debut album in 2004.",
    "detailedExplanation": "'The College Dropout' is the debut studio album by American rapper and producer Kanye West, released in February 2004. The album was both a commercial and critical success, debuting at number two on the Billboard 200 and earning West widespread recognition for his innovative production style and introspective lyrics about education, materialism, and personal struggles.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_College_Dropout",
    "citationTitle": "Wikipedia: The College Dropout"
  },
  {
    "id": "0efeb16a-9140-481b-b19b-1a7625223bb9",
    "text": "Which rapper's debut album 'Get Rich or Die Tryin'' became one of the best-selling hip hop albums of all time?",
    "options": [
      "50 Cent",
      "Ludacris",
      "Nelly",
      "T.I."
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "50 Cent released 'Get Rich or Die Tryin'' in 2003, which sold over 12 million copies worldwide.",
    "detailedExplanation": "Curtis '50 Cent' Jackson's debut studio album 'Get Rich or Die Tryin'' was released in February 2003 and became a massive commercial success. The album, which featured hits like 'In da Club' and 'P.I.M.P.', debuted at number one on the Billboard 200 and sold over 872,000 copies in its first week. It went on to sell over 12 million copies worldwide, making it one of the best-selling hip hop albums of all time and establishing 50 Cent as a major force in the rap industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Get_Rich_or_Die_Tryin%27_(album)",
    "citationTitle": "Wikipedia: Get Rich or Die Tryin' (album)"
  },
  {
    "id": "a16f79cb-5327-4d1a-a124-758536b01765",
    "text": "Which hip hop artist is known for the hit single 'I Like Big Butts' released in 1992?",
    "options": [
      "Digital Underground",
      "Sir Mix-a-Lot",
      "House of Pain",
      "Cypress Hill"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sir Mix-a-Lot released 'Baby Got Back' (commonly known as 'I Like Big Butts') which became a number one hit.",
    "detailedExplanation": "Sir Mix-a-Lot, born Anthony Ray, released the iconic song 'Baby Got Back' in 1992, though it's often remembered by its opening lyric 'I like big butts and I cannot lie.' The song became a cultural phenomenon, reaching number one on the Billboard Hot 100 and staying there for five weeks. It won a Grammy Award for Best Rap Solo Performance in 1993 and has remained one of the most recognizable hip hop songs of the 1990s, frequently referenced in popular culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Baby_Got_Back",
    "citationTitle": "Wikipedia: Baby Got Back"
  },
  {
    "id": "6da96dd7-a1a9-4e5f-ae53-867727612308",
    "text": "Which rap group is famous for the 1979 hit 'Rapper's Delight', often considered one of the first mainstream rap songs?",
    "options": [
      "Grandmaster Flash and the Furious Five",
      "The Sugarhill Gang",
      "Run-DMC",
      "Public Enemy"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Sugarhill Gang released 'Rapper's Delight' in 1979, which is widely credited as the first rap song to gain mainstream success.",
    "detailedExplanation": "The Sugarhill Gang, consisting of Wonder Mike, Big Bank Hank, and Master Gee, released 'Rapper's Delight' in September 1979. The song is historically significant as it was the first rap song to become a mainstream hit, reaching the top 40 on the Billboard Hot 100 and introducing hip hop culture to a broader audience beyond New York City. The track helped establish the foundation for the commercial hip hop industry and is often cited as one of the most important songs in hip hop history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rapper%27s_Delight",
    "citationTitle": "Wikipedia: Rapper's Delight"
  },
  {
    "id": "31262e27-d819-4d08-ab9c-041c575d464b",
    "text": "What is the real name of the rapper Snoop Dogg?",
    "options": [
      "Calvin Broadus Jr.",
      "Andre Young",
      "Eric Wright",
      "O'Shea Jackson"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Snoop Dogg's real name is Calvin Cordozar Broadus Jr., born in Long Beach, California in 1971.",
    "detailedExplanation": "Calvin Cordozar Broadus Jr., professionally known as Snoop Dogg (and formerly Snoop Doggy Dogg), was born on October 20, 1971, in Long Beach, California. He gained fame in the early 1990s when he was featured on Dr. Dre's debut solo album 'The Chronic' and later released his own debut album 'Doggystyle' in 1993. Throughout his career, he has also gone by other monikers including Snoop Lion during a brief reggae phase, but Calvin Broadus Jr. remains his birth name.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snoop_Dogg",
    "citationTitle": "Wikipedia: Snoop Dogg"
  }
]