[
  {
    "id": "53c0229d-ca93-4bbb-b10c-1c4d0fd05e75",
    "text": "Which famous street artist created the 'Girl with Balloon' that partially shredded itself after being sold at Sotheby's for £1.04 million in 2018?",
    "options": [
      "Shepard Fairey",
      "Banksy",
      "Invader",
      "JR"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Banksy's 'Girl with Balloon' famously self-destructed moments after being sold at auction, creating art world headlines.",
    "detailedExplanation": "Banksy's 'Girl with Balloon' became one of the most famous artworks in recent history when it partially shredded itself immediately after being sold at Sotheby's auction house in October 2018. The artwork was equipped with a hidden shredder built into the frame, which activated remotely moments after the gavel fell. Rather than destroying the value, the stunt actually increased the artwork's worth and cemented Banksy's reputation as a provocative artist who challenges the traditional art market.",
    "citationUrl": "https://en.wikipedia.org/wiki/Girl_with_Balloon",
    "citationTitle": "Wikipedia: Girl with Balloon"
  },
  {
    "id": "5072d8f9-ec1b-4563-b63d-e8aaa11f8b99",
    "text": "What is the name of the New York City subway car that became legendary in hip-hop culture and featured in the documentary 'Style Wars'?",
    "options": [
      "The Freedom Train",
      "The Whole Car",
      "The 5 Pointz Express",
      "The Wild Style"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "A 'whole car' refers to a graffiti piece that covers an entire subway car from end to end.",
    "detailedExplanation": "The 'whole car' became the ultimate achievement in New York subway graffiti culture during the 1970s and 1980s. This term refers to a graffiti piece that covers an entire subway car from end to end, representing the pinnacle of skill, planning, and dedication in the scene. These elaborate pieces were featured prominently in the influential 1983 documentary 'Style Wars,' which documented the hip-hop culture and graffiti movement. Creating a whole car required significant time, resources, and risk, making successful whole car artists legends in the community.",
    "citationUrl": "https://en.wikipedia.org/wiki/Style_Wars",
    "citationTitle": "Wikipedia: Style Wars"
  },
  {
    "id": "896af48f-5201-4e8c-8d1d-29efb0a2f587",
    "text": "Which ancient city is often cited as having some of the earliest known examples of graffiti, including political slogans and advertisements scratched into walls?",
    "options": [
      "Athens",
      "Rome",
      "Pompeii",
      "Alexandria"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Pompeii's preserved walls contain thousands of ancient graffiti examples, from political messages to personal declarations.",
    "detailedExplanation": "Pompeii provides the most extensive and well-preserved examples of ancient graffiti, with over 11,000 inscriptions discovered on its walls. The volcanic ash from Mount Vesuvius in 79 AD perfectly preserved these writings, which include political campaign slogans, personal messages, advertisements, and even crude drawings. These inscriptions offer invaluable insights into daily Roman life and demonstrate that the human impulse to leave marks in public spaces is thousands of years old. The graffiti ranges from formal announcements to casual observations, showing that wall-writing was a normal part of urban Roman culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pompeii",
    "citationTitle": "Wikipedia: Pompeii"
  },
  {
    "id": "ed2815f8-dbe2-4dbb-b65c-9a549ce64929",
    "text": "What does 'CTK' stand for in graffiti writer terminology?",
    "options": [
      "Catch The King",
      "Cool To Kill",
      "Conquered The Krown",
      "Cross The Kaps"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "CTK means 'Catch The King,' referring to going over or covering a king's (respected writer's) work.",
    "detailedExplanation": "In graffiti culture, CTK stands for 'Catch The King,' which refers to the act of going over or covering the work of a highly respected writer known as a 'king.' This is considered one of the most disrespectful acts in graffiti culture and typically results in retaliation or beef between writers. A 'king' is someone who has earned respect through years of consistent, high-quality work and has achieved legendary status in their city or scene. Going over a king's work is seen as a direct challenge and is usually only done by writers who believe they can back up their disrespect with superior skills.",
    "citationUrl": "https://en.wikipedia.org/wiki/Graffiti",
    "citationTitle": "Wikipedia: Graffiti"
  },
  {
    "id": "a38947f2-cb59-4492-b989-0089b624a22f",
    "text": "Which street artist is known for creating large-scale photographic paste-ups and won the 2011 TED Prize for his project 'Inside Out'?",
    "options": [
      "Os Gemeos",
      "JR",
      "Blu",
      "ROA"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "JR is famous for his large-scale black and white photographic paste-ups and his TED Prize-winning 'Inside Out' project.",
    "detailedExplanation": "JR is a French street artist who has gained international recognition for his large-scale black and white photographic paste-ups that he displays on buildings, trains, and other urban surfaces worldwide. His 'Inside Out' project, which won the 2011 TED Prize, allows people globally to print their own portraits and paste them in their communities, creating a participatory art movement. JR's work often focuses on social and political issues, bringing attention to marginalized communities by displaying their portraits in prominent public spaces, effectively turning the whole world into his gallery.",
    "citationUrl": "https://en.wikipedia.org/wiki/JR_(artist)",
    "citationTitle": "Wikipedia: JR (artist)"
  },
  {
    "id": "8710f0ee-5ef7-4c29-8344-23ab80167366",
    "text": "What is the name of the graffiti writing style characterized by interlocking letters that are difficult to read by outsiders?",
    "options": [
      "Bubble letters",
      "Wildstyle",
      "Blockbusters",
      "Throw-ups"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Wildstyle is the complex, interlocking letter style that prioritizes artistic complexity over readability.",
    "detailedExplanation": "Wildstyle is considered the most complex and artistic form of graffiti lettering, characterized by interlocking letters, arrows, and elaborate decorative elements that make the text nearly impossible for outsiders to read. This style was developed in New York during the 1970s and represents the highest level of technical skill in graffiti writing. Wildstyle pieces often take hours or days to complete and serve as a way for writers to demonstrate their mastery of letter construction, color theory, and composition. The illegibility is intentional, creating an exclusive visual language understood primarily by those within the graffiti community.",
    "citationUrl": "https://en.wikipedia.org/wiki/Graffiti",
    "citationTitle": "Wikipedia: Graffiti"
  },
  {
    "id": "70ed0b9a-63b6-4ec5-a875-2353271b91f7",
    "text": "Which building in New York City was known as the 'graffiti Mecca' before being demolished in 2013?",
    "options": [
      "The Warehouse",
      "5 Pointz",
      "The Factory",
      "Houston Bowery Wall"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "5 Pointz was a legal graffiti site in Queens that became world-famous before its controversial demolition in 2013.",
    "detailedExplanation": "5 Pointz was a complex of warehouse buildings in Long Island City, Queens, that served as a legal outdoor art gallery and graffiti mecca from the 1990s until 2013. Curated by graffiti artist Jonathan Cohen (Meres One), the site featured constantly changing murals by artists from around the world and became a pilgrimage destination for street art enthusiasts. The building's whitewashing and subsequent demolition in 2013 to make way for luxury condominiums sparked international controversy and highlighted the ongoing tension between urban development and street art preservation. The site was often called the world's premier 'graffiti Mecca.'",
    "citationUrl": "https://en.wikipedia.org/wiki/5_Pointz",
    "citationTitle": "Wikipedia: 5 Pointz"
  },
  {
    "id": "2db13fe6-acf7-48a8-871b-7333436a43c0",
    "text": "Which French street artist is known for creating intricate stenciled insects and is often called the 'French Banksy'?",
    "options": [
      "C215",
      "JR",
      "Blek le Rat",
      "Invader"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Blek le Rat is considered a pioneer of stencil graffiti and often called the 'French Banksy'.",
    "detailedExplanation": "Blek le Rat, whose real name is Xavier Prou, began creating stenciled street art in Paris in 1981. He is widely recognized as one of the pioneers of stencil graffiti and has been called the 'French Banksy,' though he actually predates Banksy by several years. His work often features rats and other urban imagery, and he has been a major influence on contemporary street artists worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blek_le_Rat",
    "citationTitle": "Wikipedia: Blek le Rat"
  },
  {
    "id": "9695fb74-c972-4341-8008-7e1a8be014fa",
    "text": "Which Brazilian street art duo is famous for their yellow-skinned characters and became internationally known after painting in the abandoned Vila Itororó?",
    "options": [
      "Os Gemeos",
      "Nunca",
      "Cranio",
      "Zezão"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Os Gemeos are identical twin brothers known for their distinctive yellow-skinned characters and large-scale murals.",
    "detailedExplanation": "Os Gemeos (Portuguese for 'The Twins') are Otavio and Gustavo Pandolfo, identical twin brothers from São Paulo, Brazil. They are internationally renowned for their distinctive street art featuring yellow-skinned characters inspired by their dreams and Brazilian folklore. Their work in Vila Itororó, an abandoned architectural complex in São Paulo, brought them significant international attention and helped establish them as leading figures in the global street art scene.",
    "citationUrl": "https://en.wikipedia.org/wiki/Os_Gêmeos",
    "citationTitle": "Wikipedia: Os Gêmeos"
  },
  {
    "id": "8c28d17a-a439-4c49-a69e-cbe022a7b6d9",
    "text": "What is the name of the legal graffiti wall in London's Southbank that has been a site for street art since the 1970s?",
    "options": [
      "Brick Lane Wall",
      "Undercroft",
      "Shoreditch Wall",
      "Camden Tunnel"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Undercroft at Southbank Centre has been a legal space for graffiti and street art since the 1970s.",
    "detailedExplanation": "The Undercroft is the concrete space beneath the Queen Elizabeth Hall at London's Southbank Centre. It has been a hub for graffiti, skateboarding, and street culture since the 1970s. This brutalist concrete space became one of London's most important legal graffiti sites and played a crucial role in the development of British street art culture. Despite various redevelopment threats over the years, community campaigns have helped preserve its status as a cultural landmark.",
    "citationUrl": "https://en.wikipedia.org/wiki/Undercroft_(South_Bank)",
    "citationTitle": "Wikipedia: Undercroft (South Bank)"
  },
  {
    "id": "e5e8084c-e14f-4b36-85d2-3191f1013bd2",
    "text": "Which painting technique, commonly used in street art, involves applying paint through a perforated template?",
    "options": [
      "Wheatpasting",
      "Stenciling",
      "Tagging",
      "Piecing"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Stenciling involves cutting designs into material to create templates through which paint is applied.",
    "detailedExplanation": "Stenciling is a technique where artists cut designs into materials like cardboard, plastic, or metal to create templates. Paint is then applied through these perforated templates onto surfaces, allowing for quick reproduction of detailed images. This technique has become extremely popular in street art because it allows artists to work quickly while maintaining precision and detail. Famous stencil artists include Banksy, Blek le Rat, and C215.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stencil_graffiti",
    "citationTitle": "Wikipedia: Stencil graffiti"
  },
  {
    "id": "d8320a02-2fb4-4687-9b66-5a8878867c30",
    "text": "What was the name of the influential 1982 documentary that helped bring hip-hop culture and subway graffiti to mainstream attention?",
    "options": [
      "Beat Street",
      "Wild Style",
      "Style Wars",
      "Bombin'"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Wild Style was a groundbreaking 1982 film that showcased hip-hop culture and graffiti to mainstream audiences.",
    "detailedExplanation": "Wild Style, directed by Charlie Ahearn, was a seminal 1982 film that played a crucial role in introducing hip-hop culture, including graffiti, to mainstream and international audiences. The film featured real graffiti artists, rappers, and breakdancers, including legendary writer Lee Quiñones in the lead role. While fictional, it authentically portrayed the emerging hip-hop scene in the South Bronx and became a cultural touchstone that helped spread awareness of graffiti art beyond New York City.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wild_Style",
    "citationTitle": "Wikipedia: Wild Style"
  },
  {
    "id": "72adafdc-ecd6-461a-b7bb-b254f84b5a41",
    "text": "Which street artist created the 'Obey Giant' campaign that evolved from Andre the Giant stickers?",
    "options": [
      "Kaws",
      "Shepard Fairey",
      "Barry McGee",
      "Os Gemeos"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Shepard Fairey created the Andre the Giant stickers that evolved into the Obey Giant campaign.",
    "detailedExplanation": "Shepard Fairey began his street art career in 1989 with his 'Andre the Giant Has a Posse' sticker campaign while studying at the Rhode Island School of Design. This evolved into the iconic 'Obey Giant' campaign featuring a stylized image of wrestler Andre the Giant. Fairey's work combines street art with graphic design and social commentary, and he later gained worldwide recognition for creating Barack Obama's 'Hope' poster during the 2008 presidential campaign.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shepard_Fairey",
    "citationTitle": "Wikipedia: Shepard Fairey"
  },
  {
    "id": "4c135fb3-a33b-48d9-a589-d185e05c956f",
    "text": "What is the traditional graffiti term for a large, elaborate, and colorful piece that typically incorporates the artist's full name or crew?",
    "options": [
      "Throw-up",
      "Burner",
      "Tag",
      "Scribe"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "A 'burner' is graffiti terminology for an elaborate, high-quality piece with multiple colors and effects.",
    "detailedExplanation": "In graffiti culture, a 'burner' refers to a large, elaborate, and highly skilled piece of graffiti art. These works typically feature multiple colors, complex letter styles, special effects like highlights and shadows, and often include background elements or characters. Burners represent the highest level of graffiti artistry and require significant time, skill, and resources to create. The term suggests that the piece is so impressive it 'burns' or stands out dramatically from other graffiti.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glossary_of_graffiti",
    "citationTitle": "Wikipedia: Glossary of graffiti"
  },
  {
    "id": "411f4ae2-48df-4338-a4f1-31a2963279c3",
    "text": "Which controversial street artist was arrested in 2017 for vandalizing the Holocaust Memorial in Berlin with green paint?",
    "options": [
      "Shahak Shapira",
      "Alias",
      "Tasso",
      "Kidult"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Kidult, a French street artist known for targeting luxury brands, was arrested for vandalizing Berlin's Holocaust Memorial.",
    "detailedExplanation": "Kidult (real name unknown) is a French street artist who became notorious for his anti-consumerist acts of vandalism against luxury fashion stores and cultural institutions. In 2017, he was arrested by German police for spray-painting green graffiti on Berlin's Memorial to the Murdered Jews of Europe (Holocaust Memorial). This act sparked international outrage and debates about the boundaries of street art activism. Kidult has previously targeted stores like Louis Vuitton, Hermès, and Colette in Paris, viewing his actions as artistic protest against commercialism.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kidult_(artist)",
    "citationTitle": "Wikipedia: Kidult (artist)"
  },
  {
    "id": "78d301c1-fd68-4f59-8779-8124ffc29431",
    "text": "What is the name of the pioneering female graffiti writer from New York who was active in the 1980s and is considered one of the first prominent women in the scene?",
    "options": [
      "Lady Pink",
      "Miss Van",
      "Swoon",
      "Faith47"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Lady Pink, born Sandra Fabara, was one of the first prominent female graffiti writers in New York during the 1980s subway graffiti era.",
    "detailedExplanation": "Lady Pink (Sandra Fabara) began writing graffiti in New York City in 1979 at age 15 and became one of the most recognizable female writers during the golden age of subway graffiti. She was featured in the influential documentary 'Wild Style' (1983) and appeared in 'Style Wars.' Lady Pink broke significant ground as a woman in the male-dominated graffiti scene, inspiring countless female writers who followed. She transitioned from illegal subway bombing to gallery exhibitions and continues to create art today, serving as a bridge between street art's underground origins and its mainstream acceptance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lady_Pink",
    "citationTitle": "Wikipedia: Lady Pink"
  },
  {
    "id": "b0dd8411-de05-40df-9d23-e79a788cd9f3",
    "text": "Which Italian street artist is famous for creating politically charged murals and was commissioned to paint a mural on the Berlin Wall remnants in 2009?",
    "options": [
      "Blu",
      "Alice Pasquini",
      "Eron",
      "2501"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Blu is an Italian street artist known for large-scale political murals, including his controversial 2009 piece on the remaining Berlin Wall.",
    "detailedExplanation": "Blu is an anonymous Italian street artist who gained international recognition for his massive, politically charged murals that often critique capitalism, war, and social inequality. In 2009, he painted a controversial mural on a remaining section of the Berlin Wall showing figures from East and West Berlin removing masks to reveal identical skulls underneath. The work was later painted over in white in 2014 by Blu himself in protest against the gentrification and commercialization of street art. His works often feature skeletal figures, military imagery, and anti-establishment themes rendered in a distinctive style.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blu_(artist)",
    "citationTitle": "Wikipedia: Blu (artist)"
  },
  {
    "id": "e92dc4ac-3cd6-423f-ae5e-ca4f7d103a5d",
    "text": "What is the street art term for the practice of creating art by removing dirt or grime from surfaces rather than adding paint?",
    "options": [
      "Reverse graffiti",
      "Clean tagging",
      "Grime writing",
      "Negative bombing"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Reverse graffiti involves creating images by selectively cleaning dirty surfaces, revealing clean patterns underneath.",
    "detailedExplanation": "Reverse graffiti, also known as 'clean graffiti' or 'grime writing,' is a technique where artists create images by removing dirt, dust, or grime from surfaces rather than adding materials. This method involves using cleaning agents, pressure washers, or even finger-drawing on dirty surfaces to reveal clean areas that form text or images. The technique gained popularity as a way to circumvent vandalism laws since technically no property damage occurs - the surface is actually being cleaned. Artists like Moose and Paul Curtis have popularized this method, often using it for commercial advertising campaigns and environmental messages.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reverse_graffiti",
    "citationTitle": "Wikipedia: Reverse graffiti"
  },
  {
    "id": "24d3c049-f3c5-4d3d-9de5-088c618311be",
    "text": "Which Mexican street artist duo is known for their large-scale murals depicting elderly people and social issues in their neighborhood of San Miguel de Allende?",
    "options": [
      "Los Contratistas",
      "Saner & Sego",
      "Curiot & Seher",
      "Smithe & Senkoe"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "Los Contratistas are a Mexican street art duo famous for their photorealistic murals of elderly residents in San Miguel de Allende.",
    "detailedExplanation": "Los Contratistas, composed of artists Germen Crew and Monkey Bird Crew, are a Mexican street art collective based in San Miguel de Allende, Guanajuato. They gained international attention for their powerful photorealistic murals depicting elderly residents of their community, often focusing on the dignity and stories of forgotten or marginalized people. Their work addresses themes of aging, memory, and social invisibility while celebrating the wisdom and beauty of older generations. The duo's technique combines photographic precision with street art accessibility, creating deeply moving portraits that have transformed their neighborhood into an open-air gallery.",
    "citationUrl": "https://en.wikipedia.org/wiki/Street_art_in_Mexico",
    "citationTitle": "Wikipedia: Street art in Mexico"
  },
  {
    "id": "8d00ac9f-b20f-4aca-8418-5cb9b97cf241",
    "text": "What is the name of the influential graffiti crew founded by Cornbread in Philadelphia during the late 1960s that is often credited with pioneering modern graffiti writing?",
    "options": [
      "The Magnificent Seven",
      "Cool Earl's Crew",
      "The Philadelphia Kings",
      "Writers Corner 188"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "hard",
    "explanation": "The Philadelphia Kings was the influential crew associated with early graffiti pioneers in Philadelphia, though Cornbread was primarily a solo writer who inspired the movement.",
    "detailedExplanation": "While Cornbread (Darryl McCray) is widely credited as one of the originators of modern graffiti writing in Philadelphia in the late 1960s, he was primarily known as a solo writer rather than a crew founder. However, his influence led to the formation of various Philadelphia-based crews, with The Philadelphia Kings being among the most notable early collectives. Philadelphia's graffiti scene predated and influenced New York's more famous subway graffiti culture. The city's writers developed many fundamental graffiti techniques and styles that would later spread globally, making Philadelphia the true birthplace of modern graffiti culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cornbread_(graffiti_artist)",
    "citationTitle": "Wikipedia: Cornbread (graffiti artist)"
  }
]