[
  {
    "id": "5d4bf34e-7309-4fa6-bf02-2f6019ad229c",
    "text": "Which famous street artist created the artwork 'Girl with Balloon' that famously self-destructed at a Sotheby's auction in 2018?",
    "options": [
      "Shepard Fairey",
      "Banksy",
      "Jean-Michel Basquiat",
      "Keith Haring"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Banksy created 'Girl with Balloon', which partially shredded itself at auction.",
    "detailedExplanation": "Banksy's 'Girl with Balloon' made headlines worldwide when it partially self-destructed moments after being sold for £1.04 million at Sotheby's auction house in London in October 2018. The artwork had a hidden shredder built into its frame, activated remotely after the hammer fell. The stunt was widely regarded as a commentary on the commercialization of art, and ironically, the partially shredded piece likely became even more valuable.",
    "citationUrl": "https://en.wikipedia.org/wiki/Girl_with_Balloon",
    "citationTitle": "Wikipedia: Girl with Balloon"
  },
  {
    "id": "c345298c-b7ec-4e46-bb1d-3c1d71df0106",
    "text": "Which city is considered the birthplace of modern graffiti culture in the 1960s and 1970s?",
    "options": [
      "Los Angeles",
      "London",
      "New York City",
      "Berlin"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "New York City is widely recognized as the birthplace of modern graffiti culture.",
    "detailedExplanation": "New York City is universally acknowledged as the birthplace of modern graffiti culture, with the movement emerging in the late 1960s and early 1970s. Pioneers like TAKI 183, a Greek-American teenager, began tagging subway trains and walls throughout the city, inspiring countless others. The NYC subway system became the primary canvas for early graffiti artists, who developed the foundational styles, techniques, and cultural practices that spread globally and continue to influence street art today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Graffiti_in_New_York_City",
    "citationTitle": "Wikipedia: Graffiti in New York City"
  },
  {
    "id": "0f8a17e0-a349-45ec-9947-da99f49225dc",
    "text": "What is a 'throw-up' in graffiti terminology?",
    "options": [
      "A collaborative piece by multiple artists",
      "A simple, quick bubble-letter style piece",
      "Graffiti painted on a wall above head height",
      "A piece that covers another artist's work"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "A throw-up is a quick, simple bubble-letter style graffiti piece, typically done in two colors.",
    "detailedExplanation": "A 'throw-up' is a fundamental style in graffiti culture consisting of bubble letters, typically outlined in one color and filled with another. These pieces prioritize speed and visibility over artistic complexity, allowing writers to quickly establish their presence while minimizing the risk of being caught. Throw-ups sit between simple tags and complex pieces in the graffiti hierarchy, often serving as a stepping stone for developing artists or a quick way for experienced writers to maintain visibility across the urban landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/Graffiti",
    "citationTitle": "Wikipedia: Graffiti"
  },
  {
    "id": "f9c869d1-d55f-48c1-a47f-3a48e4404056",
    "text": "Which French street artist is known for invading public spaces with pixelated video game-inspired mosaic tiles?",
    "options": [
      "JR",
      "Blek le Rat",
      "Invader",
      "C215"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Invader is famous for his pixelated mosaic tile installations inspired by the Space Invaders video game.",
    "detailedExplanation": "Invader, whose real name remains anonymous, is a French street artist who has been 'invading' cities worldwide since the late 1990s with his distinctive pixelated mosaic tile artworks. Inspired by the classic arcade game Space Invaders and other 8-bit video games, his colorful ceramic tile mosaics can be found on walls, bridges, and buildings in over 80 cities across the globe. Each city he visits is considered 'invaded,' and he methodically documents and maps his installations, treating his artistic practice like a real-life video game.",
    "citationUrl": "https://en.wikipedia.org/wiki/Invader_(artist)",
    "citationTitle": "Wikipedia: Invader (artist)"
  },
  {
    "id": "00b9dd74-29e0-4e1b-93e9-08530642938b",
    "text": "What technique did artist Shepard Fairey use to create his famous 'OBEY Giant' campaign?",
    "options": [
      "Spray painting",
      "Wheat paste posters",
      "Stenciling",
      "Mosaic tiles"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Shepard Fairey primarily used wheat paste to apply his paper posters to walls and surfaces.",
    "detailedExplanation": "Shepard Fairey's 'OBEY Giant' campaign, which began in 1989, was primarily executed using wheat paste (wheatpasting) - a technique where paper posters are adhered to surfaces using a mixture of wheat flour and water as glue. This method allowed Fairey to mass-produce his designs and quickly apply them to walls, utility poles, and other urban surfaces. The campaign started with an image of wrestler André the Giant and evolved into a global street art phenomenon that questioned the role of propaganda and consumer culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shepard_Fairey",
    "citationTitle": "Wikipedia: Shepard Fairey"
  },
  {
    "id": "82e07b2e-235f-4e33-86e2-0e2444498985",
    "text": "Which term describes the practice of going over another graffiti artist's work without permission?",
    "options": [
      "Buffing",
      "Capping",
      "Piecing",
      "Wildstyle"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Capping refers to painting over another artist's graffiti work, which is generally considered disrespectful.",
    "detailedExplanation": "In graffiti culture, 'capping' refers to the controversial practice of painting over another writer's work without permission or respect for graffiti hierarchy and etiquette. This is generally considered highly disrespectful and can lead to conflicts within the graffiti community. The practice violates unwritten rules about respecting other artists' work, especially if the original piece was of higher quality or the artist had more experience. Capping differs from 'buffing,' which refers to authorities or property owners removing graffiti.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glossary_of_graffiti",
    "citationTitle": "Wikipedia: Glossary of graffiti"
  },
  {
    "id": "b43be34f-4dd7-4447-8c7f-7d045face3f4",
    "text": "The Berlin Wall became famous for street art after which historical event?",
    "options": [
      "World War II ended",
      "The wall's construction in 1961",
      "German reunification in 1990",
      "The fall of the wall in 1989"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Berlin Wall became a famous canvas for street art primarily after its fall in 1989.",
    "detailedExplanation": "While some graffiti appeared on the Berlin Wall during its existence, the structure truly became an iconic canvas for street art after its fall in November 1989. The remaining sections of the wall, particularly the East Side Gallery, were transformed into the world's largest open-air gallery, featuring murals and street art from artists around the globe. These artworks celebrated freedom, unity, and political change, turning a symbol of division into a monument to artistic expression and historical memory.",
    "citationUrl": "https://en.wikipedia.org/wiki/East_Side_Gallery",
    "citationTitle": "Wikipedia: East Side Gallery"
  },
  {
    "id": "612e3cf5-2b91-4547-8bcf-78f9e1f94a97",
    "text": "Which British street artist is famous for creating large-scale photorealistic murals and was the first graffiti writer to paint a Virgin Atlantic airplane?",
    "options": [
      "Ben Eine",
      "D*Face",
      "David Walker",
      "Eine"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "David Walker is known for his photorealistic spray-painted portraits and painted a Virgin Atlantic Boeing 747.",
    "detailedExplanation": "David Walker is a British street artist renowned for his incredible photorealistic portraits created entirely with spray paint. His technique involves building up layers of paint to create stunning detail that rivals traditional photography. In 2019, he became the first graffiti writer to paint a commercial airliner when Virgin Atlantic commissioned him to paint one of their Boeing 747 aircraft with a large-scale portrait, demonstrating how street art has gained mainstream commercial acceptance.",
    "citationUrl": "https://en.wikipedia.org/wiki/David_Walker_(street_artist)",
    "citationTitle": "Wikipedia: David Walker (street artist)"
  },
  {
    "id": "3e2f46a2-46dd-4ab5-94ee-abc3147247bc",
    "text": "What is 'wheat pasting' in street art?",
    "options": [
      "A spray painting technique",
      "Adhering paper artworks to surfaces with paste",
      "Creating 3D sculptures from wheat",
      "A type of stencil cutting method"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Wheat pasting involves using wheat-based paste to stick paper artworks onto walls and surfaces.",
    "detailedExplanation": "Wheat pasting, also known as paste-up, is a street art technique where artists create artwork on paper and then adhere it to walls, buildings, or other surfaces using a paste traditionally made from wheat flour and water. This method allows artists to create detailed work in the safety of their studio before quickly applying it in public spaces. The technique has been used by famous artists like Shepard Fairey and has become popular because it's less permanent than spray paint and can be removed more easily.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wheatpaste",
    "citationTitle": "Wikipedia: Wheatpaste"
  },
  {
    "id": "38229dfa-0bb0-47eb-a7ae-60720ca1acae",
    "text": "Which writing tool is traditionally considered the most basic implement for creating graffiti tags?",
    "options": [
      "Spray paint can",
      "Paint marker",
      "Chalk",
      "Magic marker/felt-tip pen"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Magic markers or felt-tip pens are the most basic and accessible tools for creating graffiti tags.",
    "detailedExplanation": "The magic marker or felt-tip pen is considered the most fundamental tool in graffiti writing, particularly for beginners learning to develop their tag (signature). These markers are inexpensive, portable, and allow for quick application. Many legendary graffiti writers started with simple markers before progressing to paint markers and spray paint. The marker's fine tip allows for the development of letterform styles and is essential for practicing hand styles that form the foundation of all graffiti writing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Graffiti",
    "citationTitle": "Wikipedia: Graffiti"
  },
  {
    "id": "984c216f-83e6-4fc3-ba68-622460a7f1b9",
    "text": "What is a 'wildstyle' in graffiti art?",
    "options": [
      "Graffiti painted in natural outdoor settings",
      "A complex, interlocking letter style that's difficult to read",
      "Graffiti that uses only earth tone colors",
      "Street art depicting wild animals"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Wildstyle is a complex graffiti lettering style featuring interlocking, elaborate letters that are often difficult for outsiders to read.",
    "detailedExplanation": "Wildstyle is one of the most sophisticated and respected forms of graffiti lettering, characterized by interlocking letters, arrows, spikes, and complex design elements that make the text extremely difficult to read for anyone not well-versed in graffiti culture. Developed in New York in the 1970s, wildstyle represents the pinnacle of technical skill in graffiti writing. The style serves multiple purposes: it demonstrates the writer's artistic ability, acts as a coded language within the graffiti community, and makes the work harder for authorities to identify and document.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wildstyle",
    "citationTitle": "Wikipedia: Wildstyle"
  },
  {
    "id": "726913b2-b366-4e07-918c-eead8551eea1",
    "text": "Which South American city is famous for having government-sanctioned legal graffiti zones where artists can paint freely?",
    "options": [
      "São Paulo, Brazil",
      "Buenos Aires, Argentina",
      "Bogotá, Colombia",
      "Valparaíso, Chile"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Valparaíso, Chile has designated legal zones where street artists can create murals without legal consequences.",
    "detailedExplanation": "Valparaíso, Chile has become renowned for its progressive approach to street art, with the city government creating designated legal zones where artists can paint without fear of prosecution. This UNESCO World Heritage city has embraced street art as part of its cultural identity, transforming many neighborhoods into open-air galleries. The policy has attracted international artists and has helped establish Valparaíso as one of South America's most important street art destinations, while also addressing the issue of illegal graffiti through positive channels.",
    "citationUrl": "https://en.wikipedia.org/wiki/Valparaíso",
    "citationTitle": "Wikipedia: Valparaíso"
  },
  {
    "id": "ea23b34d-0f7a-431c-b146-cbd5fc28147c",
    "text": "What does 'getting up' mean in graffiti terminology?",
    "options": [
      "Climbing to paint high places",
      "Getting caught by police",
      "Building reputation through frequent tagging",
      "Waking up early to paint"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Getting up refers to building one's reputation and presence in the graffiti scene through frequent and visible tagging.",
    "detailedExplanation": "In graffiti culture, 'getting up' is fundamental terminology that refers to the process of building one's reputation and establishing presence in the scene through consistent and visible tagging or piecing. The more a writer gets their name up around the city, the more recognition and respect they earn within the graffiti community. This concept drives much of graffiti culture, as writers compete to get up in the most visible, difficult, or prestigious locations. Getting up is about both quantity and quality - achieving maximum exposure while developing artistic skills.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glossary_of_graffiti",
    "citationTitle": "Wikipedia: Glossary of graffiti"
  },
  {
    "id": "7badcc2d-7e26-4c6f-b110-769d7eb5c74b",
    "text": "Which Portuguese street artist is famous for large-scale murals depicting half-human, half-animal characters?",
    "options": [
      "Vhils",
      "Bordalo II",
      "Add Fuel",
      "Artur Bordalo"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Vhils (Alexandre Farto) is known for his unique carving technique and often depicts human faces, though Bordalo II is famous for animal sculptures made from trash.",
    "detailedExplanation": "While the question's premise is slightly mixed, Vhils (Alexandre Farto) is Portugal's most internationally recognized street artist, famous for his unique technique of carving portraits into walls using chisels, drills, and controlled explosions rather than paint. His work typically focuses on human faces carved into urban surfaces, revealing the layers beneath. Bordalo II (Artur Bordalo) is another prominent Portuguese street artist known for creating large sculptures of animals using discarded materials and trash, highlighting environmental issues through his 'Trash Animals' series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vhils",
    "citationTitle": "Wikipedia: Vhils"
  },
  {
    "id": "da251b96-dc5a-46a0-a696-48a36c126e12",
    "text": "Which Italian street artist is famous for creating large-scale murals featuring photorealistic portraits of indigenous people and tribal communities?",
    "options": [
      "Jorit Agoch",
      "Blu",
      "Eron",
      "Mr. Klevra"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Jorit Agoch is known for his photorealistic murals of indigenous and tribal people.",
    "detailedExplanation": "Jorit Agoch (Ciro Cerullo) is an Italian street artist from Naples who has gained international recognition for his large-scale photorealistic murals. His distinctive style often features portraits of indigenous people, tribal communities, and marginalized groups, painted with remarkable detail and often incorporating traditional tribal face markings rendered in red paint. His works can be found on buildings worldwide, from Naples to New York, and he's particularly known for bringing attention to social issues through his art.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jorit",
    "citationTitle": "Wikipedia: Jorit"
  },
  {
    "id": "4e6ef483-66ac-4c2e-a76f-84641841b442",
    "text": "What does the term 'bombing' refer to in graffiti culture?",
    "options": [
      "Destroying other artists' work",
      "Painting many pieces quickly in one area",
      "Using explosive colors",
      "Creating 3D effects"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Bombing means painting multiple graffiti pieces rapidly in a concentrated area.",
    "detailedExplanation": "In graffiti terminology, 'bombing' refers to the practice of creating multiple graffiti pieces quickly and prolifically in a specific area or throughout a city. This technique prioritizes quantity and coverage over artistic detail, allowing writers to increase their visibility and reputation. Bombing typically involves simpler styles like tags or throw-ups that can be executed rapidly, and is often done to establish territorial presence or gain recognition in the graffiti community. The term emphasizes the aggressive, rapid-fire approach to getting one's name or crew up in as many locations as possible.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glossary_of_graffiti",
    "citationTitle": "Wikipedia: Glossary of graffiti"
  },
  {
    "id": "9c8340c9-bdb5-4020-9621-65fc586ddb67",
    "text": "Which train yard was considered the holy grail of graffiti writing in New York City during the 1970s and 1980s?",
    "options": [
      "Coney Island Yard",
      "The Ghost Yard",
      "Corona Yard",
      "Concourse Yard"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Ghost Yard was the most prestigious and dangerous yard for NYC graffiti writers.",
    "detailedExplanation": "The Ghost Yard, officially known as the Fresh Pond Yard in Queens, was legendary among New York City graffiti writers during the golden age of subway graffiti. It earned its nickname due to its isolated location and the difficulty of accessing it safely. Writers who successfully painted trains in the Ghost Yard earned enormous respect in the community because of the risks involved and the yard's reputation as nearly impenetrable. The trains painted there would run throughout the city's subway system, giving writers maximum exposure for their work across all five boroughs.",
    "citationUrl": "https://en.wikipedia.org/wiki/New_York_City_Subway_graffiti",
    "citationTitle": "Wikipedia: New York City Subway graffiti"
  },
  {
    "id": "2e0bc4d5-ac20-484e-adff-1c320046e6f4",
    "text": "Which street art technique involves creating stencils by cutting designs into X-ray films?",
    "options": [
      "Radiography stenciling",
      "Medical templating",
      "X-ray bombing",
      "Roentgen art"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Some street artists repurpose medical X-ray films as stencil material due to their durability.",
    "detailedExplanation": "Street artists have discovered that discarded medical X-ray films make excellent stencil material because they are durable, weather-resistant, and easy to cut precise designs into. The plastic material holds up well to repeated use with spray paint and allows for fine detail work. This recycling of medical waste into art materials represents the resourceful nature of street art culture, where artists often repurpose found materials. The technique has been used by various artists worldwide, though it requires careful handling due to potential residual chemicals on the films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stencil_graffiti",
    "citationTitle": "Wikipedia: Stencil graffiti"
  },
  {
    "id": "63894911-012c-4062-beb6-9b722b44160d",
    "text": "What is a 'heaven spot' in graffiti terminology?",
    "options": [
      "A memorial wall for deceased writers",
      "A legal graffiti area",
      "A high, dangerous, or difficult location to paint",
      "The top section of a train car"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "A heaven spot is a location that's extremely high, dangerous, or difficult to reach for painting.",
    "detailedExplanation": "In graffiti culture, a 'heaven spot' refers to any location that is exceptionally high, dangerous, or difficult to access for painting. These might include rooftops, bridge overpasses, billboards, or any elevated surface that requires significant risk or skill to reach. Painting in heaven spots is highly respected in the graffiti community because it demonstrates courage, dedication, and often athletic ability. The term plays on the idea that these locations are 'closer to heaven' due to their height, and also references the danger involved - one wrong move could send an artist to heaven permanently.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glossary_of_graffiti",
    "citationTitle": "Wikipedia: Glossary of graffiti"
  },
  {
    "id": "951fb87e-7d3d-45da-9a2e-c8988ab71e0e",
    "text": "Which ancient civilization is credited with some of the earliest forms of graffiti, including inscriptions found in Pompeii?",
    "options": [
      "Ancient Greeks",
      "Ancient Egyptians",
      "Ancient Romans",
      "Ancient Mesopotamians"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Ancient Romans created extensive graffiti, with well-preserved examples found in Pompeii.",
    "detailedExplanation": "Ancient Romans were prolific graffiti writers, with thousands of examples preserved in Pompeii after the volcanic eruption of Mount Vesuvius in 79 CE. These inscriptions include everything from political slogans and advertisements to personal messages, declarations of love, and even crude drawings. The graffiti was typically scratched or painted on walls and provides invaluable insight into daily Roman life, popular culture, and social attitudes. Some examples include gladiator fan messages, election endorsements, and tavern announcements, showing that the human impulse to mark public spaces with personal expression is thousands of years old.",
    "citationUrl": "https://en.wikipedia.org/wiki/Graffiti_in_Pompeii",
    "citationTitle": "Wikipedia: Graffiti in Pompeii"
  }
]