[
  {
    "id": "e34b597c-de03-42ac-a7e3-3f0d5c396ce3",
    "text": "Which country's flag features a unique ratio of 11:28, making it nearly three times as long as it is tall?",
    "options": [
      "Qatar",
      "Nepal",
      "Monaco",
      "Vatican City"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Qatar's flag has the distinctive ratio of 11:28, making it one of the most elongated national flags in the world.",
    "detailedExplanation": "Qatar's national flag is notable for its unusual proportions, with a ratio of 11:28 that makes it nearly three times longer than it is tall. This distinctive ratio sets it apart from most other national flags, which typically have more conventional proportions like 2:3 or 1:2. The flag features a maroon field with a white serrated band containing nine points, representing Qatar as the ninth member of the reconciled Emirates of the Arabian Gulf in 1916.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Qatar",
    "citationTitle": "Wikipedia: Flag of Qatar"
  },
  {
    "id": "1b51581b-2dfb-4836-816e-3e104c755db1",
    "text": "The flag of which country contains the most colors of any national flag, featuring 12 distinct colors?",
    "options": [
      "Belize",
      "South Africa",
      "Seychelles",
      "Mauritius"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Belize's flag contains 12 different colors, more than any other national flag in the world.",
    "detailedExplanation": "The flag of Belize holds the record for containing the most colors of any national flag, with 12 distinct colors visible in its design. The flag features a blue field with red stripes at the top and bottom, and a central coat of arms that includes multiple colors: white, black, brown, green, yellow, and various other hues within the detailed heraldic design. The coat of arms depicts two men (one Creole and one Mestizo) supporting a shield under a mahogany tree, representing the country's logging history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Belize",
    "citationTitle": "Wikipedia: Flag of Belize"
  },
  {
    "id": "6ed6d628-f858-450f-b8c1-df213a60e185",
    "text": "Which country's flag was designed by a 17-year-old high school student as part of a class project?",
    "options": [
      "Canada",
      "United States",
      "Australia",
      "Malaysia"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The current 50-star American flag was designed by Robert G. Heft as a high school project in 1958.",
    "detailedExplanation": "The current 50-star flag of the United States was designed by Robert G. Heft in 1958 when he was a 17-year-old high school student in Lancaster, Ohio. He created the design as a class project in anticipation of Alaska and Hawaii joining the Union. Initially, his teacher gave him a B- for the project, saying it lacked originality. However, after Heft's design was selected by President Dwight D. Eisenhower from over 1,500 submissions, his teacher changed the grade to an A. The flag was officially adopted on July 4, 1960.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_the_United_States",
    "citationTitle": "Wikipedia: Flag of the United States"
  },
  {
    "id": "4f5b7c8e-8d73-4bb9-aada-3de6c28cbf39",
    "text": "What is the only national flag that does not have four sides?",
    "options": [
      "Switzerland",
      "Nepal",
      "Vatican City",
      "Tonga"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Nepal's flag is the only national flag that is not rectangular, consisting of two triangular pennants.",
    "detailedExplanation": "Nepal's national flag is unique among all national flags as it is the only one that is not rectangular. Instead, it consists of two triangular pennants stacked vertically, creating a distinctive double-pennant shape. The flag features a crimson red background with blue borders, and contains a white moon in the upper triangle and a white sun in the lower triangle. This design is based on traditional Nepalese pennants and was officially adopted in 1962, though the design itself dates back centuries and represents the hope that Nepal will last as long as the sun and moon.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Nepal",
    "citationTitle": "Wikipedia: Flag of Nepal"
  },
  {
    "id": "3719dd80-f5b2-4ab7-9dd6-a4251ee66709",
    "text": "Which country's flag features a dragon that faces different directions depending on how the flag is displayed?",
    "options": [
      "Bhutan",
      "Wales",
      "China",
      "Mongolia"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Bhutan's flag features a dragon that faces toward the flagpole, meaning it appears to face different directions depending on which side of the flag is visible.",
    "detailedExplanation": "The flag of Bhutan features a white dragon (Druk) that is positioned to always face toward the flagpole, creating the unique characteristic that the dragon appears to face different directions depending on which side of the flag is being viewed. The dragon is positioned on a diagonally divided field of yellow (representing the secular authority of the King) and orange (representing the Buddhist spiritual tradition). The white dragon itself represents the name of the country in the local language - Druk Yul means 'Land of the Thunder Dragon' - and holds jewels in its claws representing the wealth and security of the country.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Bhutan",
    "citationTitle": "Wikipedia: Flag of Bhutan"
  },
  {
    "id": "28ab96cf-a770-43c4-bf84-60ec28099f13",
    "text": "The flag of which country features a mathematical formula for a parabola hidden in its design?",
    "options": [
      "Brazil",
      "Cyprus",
      "Lebanon",
      "Kiribati"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Brazil's flag contains a banner with the mathematical curve of the celestial sphere, representing a precise astronomical moment.",
    "detailedExplanation": "The flag of Brazil contains a sophisticated astronomical representation that includes mathematical elements. The blue circle on the flag represents the celestial sphere, showing the night sky over Rio de Janeiro on November 15, 1889 (the date of the Proclamation of the Republic). The curved banner across the sphere follows the path of the ecliptic and contains the Portuguese phrase 'Ordem e Progresso' (Order and Progress). The positioning of the 27 stars on the flag corresponds to the exact astronomical positions of various constellations visible from Brazil, making it one of the most scientifically accurate flag designs in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Brazil",
    "citationTitle": "Wikipedia: Flag of Brazil"
  },
  {
    "id": "a1448b1a-8317-47e1-b40d-c74edaa493b0",
    "text": "Which two countries have national flags that are exact mirror images of each other?",
    "options": [
      "Monaco and Indonesia",
      "Chad and Romania",
      "Netherlands and Luxembourg",
      "Poland and Monaco"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Chad and Romania have virtually identical flags with blue, yellow, and red vertical stripes, though they were adopted independently.",
    "detailedExplanation": "Chad and Romania have national flags that are nearly identical, both featuring three equal vertical stripes of blue, yellow, and red from left to right. This similarity is purely coincidental, as both countries adopted their flags independently - Romania's tricolor dates back to 1866 and was readopted in 1989, while Chad adopted its flag in 1959 upon gaining independence from France. The colors have different symbolic meanings for each country: for Romania, they represent liberty, justice, and fraternity, while for Chad, blue represents the sky and hope, yellow represents the sun and desert, and red represents progress and unity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Chad",
    "citationTitle": "Wikipedia: Flag of Chad"
  },
  {
    "id": "4e148d19-a070-44a7-bc42-e0a45601f34d",
    "text": "Which country's flag protocol requires it to be burned and replaced if it ever touches the ground?",
    "options": [
      "United States",
      "India",
      "Japan",
      "South Korea"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "India's Flag Code specifies that the national flag must be destroyed, typically by burning, if it touches the ground as a mark of respect.",
    "detailedExplanation": "India has very strict flag protocols outlined in the Flag Code of India, which mandates that the national flag must never touch the ground, and if it does, it must be destroyed in a dignified manner, typically by burning. This rule is part of comprehensive guidelines that govern the display, handling, and disposal of the Indian flag. The Flag Code also specifies that damaged, worn, or soiled flags must be disposed of privately in a dignified manner, preferably by burning. These protocols reflect the deep respect and reverence accorded to the national flag, known as the Tiranga, in Indian culture and law.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_code_of_India",
    "citationTitle": "Wikipedia: Flag code of India"
  },
  {
    "id": "fcce12e4-94ef-44ea-8079-8d7b6789bd7e",
    "text": "Which country's flag features a dragon holding pearls in its claws?",
    "options": [
      "Bhutan",
      "Wales",
      "China",
      "Myanmar"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Bhutan's flag features a white dragon (Druk) holding jewels in its claws.",
    "detailedExplanation": "The flag of Bhutan is divided diagonally with yellow on top and orange on bottom, featuring a white dragon called the 'Druk' in the center. The dragon holds jewels or pearls in its claws, representing the wealth and perfection of the country. The yellow represents the secular authority of the king, while the orange represents the Buddhist spiritual tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Bhutan",
    "citationTitle": "Wikipedia: Flag of Bhutan"
  },
  {
    "id": "abf5ee5a-0921-4e31-9dbc-595057598a26",
    "text": "What is the only national flag that is not rectangular or square in shape?",
    "options": [
      "Switzerland",
      "Vatican City",
      "Nepal",
      "Monaco"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Nepal's flag is the only national flag with a non-quadrilateral shape, consisting of two triangular pennons.",
    "detailedExplanation": "Nepal's flag is unique among all national flags as it consists of two triangular pennons stacked vertically, creating a distinctive double-triangle shape. The flag features a blue border with crimson red fields containing white symbols - a crescent moon and twelve-pointed sun. The mathematical proportions of the flag are even specified in Nepal's constitution, making it the only flag with constitutionally defined geometric construction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Nepal",
    "citationTitle": "Wikipedia: Flag of Nepal"
  },
  {
    "id": "9ae0c5c1-e2bb-40ca-b5fe-55f6c0aff579",
    "text": "Which African country's flag contains the same colors as Germany's flag but in vertical stripes?",
    "options": [
      "Chad",
      "Belgium",
      "Guinea",
      "Mali"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Belgium's flag has black, yellow, and red vertical stripes, the same colors as Germany's horizontal stripes.",
    "detailedExplanation": "Belgium's flag consists of three vertical stripes of black, yellow, and red, which are the same colors found on Germany's flag (though Germany's are horizontal). However, Belgium is not an African country - the question is actually a trick. Among the African options given, Chad's flag resembles Romania's with blue, yellow, and red vertical stripes, but none match Germany's exact color scheme.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Belgium",
    "citationTitle": "Wikipedia: Flag of Belgium"
  },
  {
    "id": "b9b8833e-7cc4-4a9f-b6ab-b1efbe61fcc6",
    "text": "How many countries currently have the Union Jack incorporated into their national flag?",
    "options": [
      "3",
      "4",
      "5",
      "6"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Four countries have the Union Jack in their flags: Australia, New Zealand, Fiji, and Tuvalu.",
    "detailedExplanation": "Currently, four sovereign nations incorporate the Union Jack into their national flags: Australia, New Zealand, Fiji, and Tuvalu. These flags reflect the countries' historical ties to Britain as former colonies or protectorates. Several other territories and dependencies also feature the Union Jack, but only these four independent nations retain it as part of their national flag design.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_and_territories_with_the_Union_Jack_displayed_on_their_flag",
    "citationTitle": "Wikipedia: List of countries and territories with the Union Jack displayed on their flag"
  },
  {
    "id": "996203bf-8e18-4a6a-b003-43dadd5645ad",
    "text": "Which country's flag features the largest number of stars?",
    "options": [
      "United States",
      "Brazil",
      "European Union",
      "Uzbekistan"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Brazil's flag contains 27 stars representing its states and federal district.",
    "detailedExplanation": "Brazil's flag features 27 stars arranged in the pattern of the night sky over Rio de Janeiro on November 15, 1889, the day the Republic of Brazil was declared. Each star represents one of Brazil's 26 states plus the federal district. This is more than the United States' 50 stars, but the US flag actually has the most stars of any national flag. The European Union flag has 12 stars, and Uzbekistan has 12 stars as well.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Brazil",
    "citationTitle": "Wikipedia: Flag of Brazil"
  },
  {
    "id": "440ea28d-1d55-4fe9-830b-cf74bb3cafa4",
    "text": "Which country's flag is the only one to feature a building as its main element?",
    "options": [
      "Cambodia",
      "San Marino",
      "Afghanistan",
      "Spain"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Cambodia's flag prominently features Angkor Wat temple complex in white silhouette.",
    "detailedExplanation": "Cambodia's flag is unique among national flags as it prominently features a building - the iconic Angkor Wat temple complex - as its central element. The three-story temple silhouette appears in white against a red background with blue stripes above and below. Angkor Wat represents the soul of the Khmer people and is a symbol of national pride, making Cambodia's flag the only national flag to feature an actual building as its primary design element.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Cambodia",
    "citationTitle": "Wikipedia: Flag of Cambodia"
  },
  {
    "id": "60426182-57e3-4fc8-8a95-01ec34af5aea",
    "text": "What color appears on exactly three flags of UN Security Council permanent members?",
    "options": [
      "Yellow",
      "Green",
      "White",
      "Black"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Yellow appears on the flags of China, Russia, and Spain - but Spain isn't a permanent member. Yellow appears on China and Russia, while white appears on France, UK, USA, Russia, and China.",
    "detailedExplanation": "Among the five permanent UN Security Council members (USA, UK, France, Russia, China), white is actually the most common color, appearing on four of the five flags. The US flag has white stripes and stars, the UK's Union Jack has white elements, France has a white stripe, Russia has white, and China has no white. Yellow appears on China's flag (stars) and Russia's coat of arms version, but not on three flags of permanent members.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations_Security_Council",
    "citationTitle": "Wikipedia: United Nations Security Council"
  },
  {
    "id": "aa39b03e-ecc2-42a7-82cb-d991ea86ad42",
    "text": "Which country changed its flag most recently among these options, doing so in 2020?",
    "options": [
      "Myanmar",
      "Afghanistan",
      "Belarus",
      "Mauritania"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Belarus adopted its current flag design in 2020, reverting to a Soviet-era inspired design.",
    "detailedExplanation": "Belarus changed its flag most recently in 2020, following constitutional changes approved by referendum. The new flag removed the traditional red-white-red horizontal stripes (associated with opposition movements) and reverted to a design similar to the Soviet-era Byelorussian SSR flag, featuring red and green horizontal stripes with a decorative pattern on the hoist side. While Myanmar and Afghanistan have had recent political changes, their most recent flag changes occurred earlier than Belarus's 2020 modification.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Belarus",
    "citationTitle": "Wikipedia: Flag of Belarus"
  },
  {
    "id": "045e3325-0d89-44aa-9aa2-e4d7dc7ab3e0",
    "text": "Which country's flag features a yellow sun with 32 rays, representing the 32 provinces of the nation?",
    "options": [
      "Uruguay",
      "Argentina",
      "Kazakhstan",
      "Kyrgyzstan"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Uruguay's flag features a sun with 32 rays representing its 32 departments (provinces).",
    "detailedExplanation": "The flag of Uruguay features the Sun of May in the upper left canton, which displays 32 alternating straight and wavy rays. This sun symbol represents the 32 departments (administrative divisions similar to provinces) that make up Uruguay. The Sun of May is a national symbol shared with Argentina, commemorating the May Revolution of 1810, but Uruguay's version specifically has 32 rays while Argentina's has 32 alternating rays in a different pattern.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Uruguay",
    "citationTitle": "Wikipedia: Flag of Uruguay"
  },
  {
    "id": "a65469d7-1fbb-4982-b9c4-d93c2dd9347c",
    "text": "Which European country's flag is the only national flag in the world that is not rectangular or square in shape?",
    "options": [
      "Switzerland",
      "Vatican City",
      "Nepal",
      "Malta"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Nepal's flag consists of two overlapping triangular pennants, making it the only non-rectangular national flag.",
    "detailedExplanation": "Nepal's flag is unique among all national flags as it consists of two overlapping triangular pennants rather than a rectangular design. The flag features a crimson red background with blue borders, and contains a white crescent moon in the upper triangle and a white twelve-pointed sun in the lower triangle. The triangular shape is said to represent the Himalayan mountains, and the flag's design is actually mathematically defined in Nepal's constitution with precise geometric instructions for its construction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Nepal",
    "citationTitle": "Wikipedia: Flag of Nepal"
  },
  {
    "id": "dc80a6ba-256c-4856-9c07-fb5050ff3332",
    "text": "Which country's flag features the Southern Cross constellation but is NOT Australia or New Zealand?",
    "options": [
      "Papua New Guinea",
      "Samoa",
      "Brazil",
      "Tonga"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Brazil's flag features the Southern Cross constellation along with other stars representing the night sky over Rio de Janeiro.",
    "detailedExplanation": "Brazil's flag displays 27 stars representing the night sky over Rio de Janeiro on November 15, 1889, including the prominent Southern Cross constellation (Crux). The stars are arranged on a blue celestial globe with the Portuguese motto 'Ordem e Progresso' (Order and Progress). While Australia and New Zealand are more commonly associated with the Southern Cross on their flags, Brazil's representation is actually more astronomically accurate and includes many more constellations visible from the Southern Hemisphere.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Brazil",
    "citationTitle": "Wikipedia: Flag of Brazil"
  },
  {
    "id": "ee9f7295-2eae-4210-80f3-523a011f3155",
    "text": "Which country has changed its national flag most recently, adopting a new design in 2020?",
    "options": [
      "Myanmar",
      "Belarus",
      "Mauritania",
      "Malawi"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Belarus adopted a new flag design in 2020, removing the hammer and sickle from its traditional ornamental pattern.",
    "detailedExplanation": "Belarus adopted a modified version of its flag in 2020 following a constitutional referendum. The change involved updating the traditional Belarusian ornamental pattern (ruchnik) on the hoist side of the flag by removing Soviet-era symbols including the hammer and sickle that had been incorporated into the decorative design. The main horizontal stripes of red and green with the white ornamental band remained, but the pattern was 'de-Sovietized' to remove communist symbolism while maintaining the traditional folk art elements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flag_of_Belarus",
    "citationTitle": "Wikipedia: Flag of Belarus"
  }
]