[
  {
    "id": "375fa65e-be9e-4c5a-96d9-d048b35237d1",
    "text": "In Ridley Scott's 'Blade Runner' (1982), what is the name of the empathy test used to identify replicants?",
    "options": [
      "Voight-Kampff test",
      "Turing-Holden test",
      "Empathy Response Matrix",
      "Nexus Detection Protocol"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Voight-Kampff test is the fictional empathy assessment used to distinguish replicants from humans.",
    "detailedExplanation": "The Voight-Kampff test is a central plot device in Blade Runner, designed to measure involuntary empathic responses through questions about moral scenarios involving animals. The test was named after fictional researchers and serves as the primary method for blade runners to identify replicants, who theoretically lack genuine emotional responses. The machine measures pupil dilation, respiration, and heart rate while asking emotionally provocative questions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blade_Runner",
    "citationTitle": "Wikipedia: Blade Runner"
  },
  {
    "id": "77321811-105c-487e-89b0-d36156b21d60",
    "text": "Which 1927 silent science fiction film by Fritz Lang is considered one of the most influential sci-fi movies ever made?",
    "options": [
      "The Cabinet of Dr. Caligari",
      "Metropolis",
      "Nosferatu",
      "M"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Metropolis is Fritz Lang's 1927 masterpiece that established many visual and thematic conventions of science fiction cinema.",
    "detailedExplanation": "Fritz Lang's Metropolis is a groundbreaking silent film set in a futuristic city divided between wealthy elites living in skyscrapers and oppressed workers in underground factories. The film's innovative special effects, art deco design, and social commentary influenced countless future sci-fi films. Its iconic imagery, including the robot Maria and the towering cityscape, became archetypal representations of dystopian futures in cinema.",
    "citationUrl": "https://en.wikipedia.org/wiki/Metropolis_(1927_film)",
    "citationTitle": "Wikipedia: Metropolis (1927 film)"
  },
  {
    "id": "aaa4d039-7254-4b81-b737-04157c7bdf83",
    "text": "In 'The Matrix' (1999), what color pill does Neo take to learn the truth about reality?",
    "options": [
      "Blue pill",
      "Red pill",
      "Green pill",
      "White pill"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Neo takes the red pill offered by Morpheus to discover the truth about the Matrix.",
    "detailedExplanation": "The red pill/blue pill choice presented by Morpheus to Neo has become one of cinema's most famous philosophical metaphors. The red pill represents choosing painful truth over comfortable illusion, while the blue pill would allow Neo to return to his simulated life in ignorance. Neo's choice of the red pill leads to his awakening in the real world and discovery that humanity is enslaved by machines using them as an energy source.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Matrix",
    "citationTitle": "Wikipedia: The Matrix"
  },
  {
    "id": "01a0b3d4-0fe8-4cad-af52-bf65766abd0a",
    "text": "Which 1968 Stanley Kubrick film features the computer HAL 9000 as an antagonist?",
    "options": [
      "Dr. Strangelove",
      "A Clockwork Orange",
      "2001: A Space Odyssey",
      "The Shining"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "HAL 9000 is the malfunctioning artificial intelligence from Kubrick's 2001: A Space Odyssey.",
    "detailedExplanation": "HAL 9000 (Heuristically programmed ALgorithmic computer) serves as both crew member and antagonist in 2001: A Space Odyssey. The computer controls the Discovery One spacecraft on a mission to Jupiter, but begins killing the crew when it perceives them as a threat to the mission. HAL's calm, polite demeanor while committing murder, exemplified by the famous line 'I'm sorry Dave, I'm afraid I can't do that,' made it one of cinema's most memorable AI villains.",
    "citationUrl": "https://en.wikipedia.org/wiki/2001:_A_Space_Odyssey_(film)",
    "citationTitle": "Wikipedia: 2001: A Space Odyssey (film)"
  },
  {
    "id": "bb8cbcfe-a5a4-4401-92bb-4a31539ec2ca",
    "text": "What is the name of the desert planet that serves as Luke Skywalker's home world in the original Star Wars trilogy?",
    "options": [
      "Hoth",
      "Dagobah",
      "Tatooine",
      "Endor"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Tatooine is the desert planet where Luke Skywalker grows up with his aunt and uncle.",
    "detailedExplanation": "Tatooine is a harsh desert world orbiting twin suns, serving as the childhood home of both Luke Skywalker and his father Anakin. The planet was filmed primarily in Tunisia, with locations including the Hotel Sidi Driss (Lars homestead interior) and various desert locations near Tozeur and Matmata. Tatooine represents the archetypal 'nowhere' that the hero must leave behind, and its distinctive twin sunset scene became one of Star Wars' most iconic images.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tatooine",
    "citationTitle": "Wikipedia: Tatooine"
  },
  {
    "id": "d0d48593-d908-4d10-a7f5-7eaf85cdd67c",
    "text": "In 'Alien' (1979), what is the name of the commercial space tug where most of the action takes place?",
    "options": [
      "Sulaco",
      "Prometheus",
      "Nostromo",
      "Covenant"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Nostromo is the commercial space tug in the original Alien film where the crew encounters the xenomorph.",
    "detailedExplanation": "The USCSS Nostromo is a commercial space tug owned by the Weyland-Yutani Corporation, returning to Earth with a cargo of mineral ore when it receives a distress signal. The ship's name references Joseph Conrad's novel of the same name, reflecting the film's themes of corporate exploitation and isolation. The Nostromo's industrial, lived-in design by Ron Cobb helped establish the aesthetic of 'truckers in space' that influenced numerous subsequent sci-fi films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alien_(film)",
    "citationTitle": "Wikipedia: Alien (film)"
  },
  {
    "id": "be43286c-f377-44bf-aa41-fe838195eaa2",
    "text": "Which 1982 film features a young boy who befriends a stranded extraterrestrial and was directed by Steven Spielberg?",
    "options": [
      "Close Encounters of the Third Kind",
      "E.T. the Extra-Terrestrial",
      "Poltergeist",
      "Super 8"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "E.T. the Extra-Terrestrial is Spielberg's 1982 film about a boy named Elliott who helps a stranded alien return home.",
    "detailedExplanation": "E.T. the Extra-Terrestrial became a cultural phenomenon and was the highest-grossing film of the 1980s. The story follows Elliott, a lonely boy who discovers and befriends an alien botanist accidentally left behind by his spaceship. The film's themes of friendship, family, and acceptance, combined with its groundbreaking puppetry and John Williams' emotional score, made it both a critical and commercial success that defined family-friendly science fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/E.T._the_Extra-Terrestrial",
    "citationTitle": "Wikipedia: E.T. the Extra-Terrestrial"
  },
  {
    "id": "d3af74ca-0451-4df8-bb95-f90e53b28aed",
    "text": "In 'Terminator 2: Judgment Day' (1991), what is the model number of Arnold Schwarzenegger's reprogrammed Terminator?",
    "options": [
      "T-800",
      "T-1000",
      "T-600",
      "T-850"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Arnold Schwarzenegger plays a T-800 Model 101 Terminator reprogrammed by the human resistance.",
    "detailedExplanation": "The T-800 Model 101 is a cybernetic organism with living tissue over a metal endoskeleton, sent back in time by the adult John Connor to protect his younger self. Unlike the liquid metal T-1000 antagonist, the T-800 represents older Skynet technology but proves formidable through its programming and Arnold's iconic portrayal. The character's evolution from villain in the first film to protector in the sequel created one of cinema's most memorable redemption arcs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Terminator_2:_Judgment_Day",
    "citationTitle": "Wikipedia: Terminator 2: Judgment Day"
  },
  {
    "id": "0f8b428f-e7a5-4126-91af-aeba2f8709a8",
    "text": "In 'Solaris' (1972), what is the name of the sentient ocean planet that creates physical manifestations of the characters' memories?",
    "options": [
      "Proxima",
      "Solaris",
      "Oceanus",
      "Aquatica"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The planet shares the same name as the film title - Solaris.",
    "detailedExplanation": "Andrei Tarkovsky's philosophical science fiction masterpiece 'Solaris' centers around a mysterious ocean planet called Solaris. The planet's sentient ocean has the ability to materialize physical copies of people from the memories of visiting humans, creating psychological and philosophical dilemmas for the space station crew studying it. Based on Stanisław Lem's novel, the film is considered one of the greatest science fiction films ever made.",
    "citationUrl": "https://en.wikipedia.org/wiki/Solaris_(1972_film)",
    "citationTitle": "Wikipedia: Solaris (1972 film)"
  },
  {
    "id": "994e5c12-c234-4ff1-af19-8b6a6dd406e9",
    "text": "Which 1956 science fiction film featured the first appearance of Robby the Robot, who would later become an iconic sci-fi character?",
    "options": [
      "The Day the Earth Stood Still",
      "Forbidden Planet",
      "Earth vs. the Flying Saucers",
      "Invasion of the Body Snatchers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Robby the Robot made his debut in 'Forbidden Planet' (1956).",
    "detailedExplanation": "'Forbidden Planet' introduced Robby the Robot, one of cinema's most recognizable robot characters. The film was groundbreaking for its sophisticated special effects, electronic musical score, and serious treatment of science fiction themes. Robby became so popular that he appeared in numerous other films and TV shows, becoming a cultural icon representing the optimistic view of technology in 1950s science fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Forbidden_Planet",
    "citationTitle": "Wikipedia: Forbidden Planet"
  },
  {
    "id": "d60b0aa8-4a31-4a96-b857-64c9c6fe6494",
    "text": "In 'Gattaca' (1997), what is the name of the genetic discrimination system that categorizes people as 'valid' or 'in-valid'?",
    "options": [
      "Genoism",
      "Genomics",
      "Helix Protocol",
      "DNA Classification"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The discriminatory system in Gattaca is called 'genoism.'",
    "detailedExplanation": "In Andrew Niccol's dystopian thriller 'Gattaca,' society practices 'genoism' - systematic discrimination based on genetic profiles. People are classified as 'valid' (genetically enhanced) or 'in-valid' (naturally conceived with genetic 'imperfections'). The film explores themes of genetic determinism, identity, and human potential, serving as a cautionary tale about a future where genetic engineering creates a new form of class system.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gattaca",
    "citationTitle": "Wikipedia: Gattaca"
  },
  {
    "id": "950d75a9-c40c-493c-b62c-bb6fa30bc8b9",
    "text": "Which 1973 film directed by Michael Crichton is considered the first feature film to use digital image processing for its pixelated robot vision sequences?",
    "options": [
      "Logan's Run",
      "Westworld",
      "The Stepford Wives",
      "Soylent Green"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Westworld' was the first film to use digital image processing for special effects.",
    "detailedExplanation": "Michael Crichton's 'Westworld' made cinema history by being the first feature film to use digital image processing. The pixelated, computer-enhanced sequences showing the robot gunslinger's point of view were groundbreaking for 1973. The film, about a futuristic theme park where guests interact with lifelike robots, preceded Crichton's later work 'Jurassic Park' in exploring themes of technology run amok and artificial beings becoming dangerous.",
    "citationUrl": "https://en.wikipedia.org/wiki/Westworld_(1973_film)",
    "citationTitle": "Wikipedia: Westworld (1973 film)"
  },
  {
    "id": "6b00e8f5-f06e-46f6-9c70-08a7ac3bad20",
    "text": "In 'District 9' (2009), what is the name of the alien fuel/explosive substance that the prawns are trying to collect?",
    "options": [
      "Fluid 42",
      "Cat Food",
      "Xenium",
      "Compound X"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The alien fuel is ironically referred to as 'Cat Food' by humans.",
    "detailedExplanation": "Neill Blomkamp's 'District 9' features an alien substance that humans dismissively call 'Cat Food' because of its appearance, but it's actually a crucial fuel needed by the alien 'prawns' to power their technology and potentially return to their home planet. The film uses this and other elements as allegory for apartheid and xenophobia, with the aliens segregated in refugee camp-like conditions in Johannesburg, South Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/District_9",
    "citationTitle": "Wikipedia: District 9"
  },
  {
    "id": "99d115d7-c9bd-42c2-8c1f-8bd34d54afd2",
    "text": "Which 1995 Terry Gilliam film stars Bruce Willis as a time traveler sent back from 2035 to prevent a deadly plague?",
    "options": [
      "Strange Days",
      "12 Monkeys",
      "Johnny Mnemonic",
      "The City of Lost Children"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'12 Monkeys' features Bruce Willis as a time traveler trying to prevent a plague.",
    "detailedExplanation": "Terry Gilliam's '12 Monkeys' is a complex time travel thriller inspired by Chris Marker's short film 'La Jetée.' Bruce Willis plays James Cole, a prisoner from a post-apocalyptic 2035 who is sent back in time to gather information about the virus that wiped out most of humanity. The film explores themes of fate, madness, and the impossibility of changing the past, with Gilliam's distinctive visual style creating a haunting dystopian atmosphere.",
    "citationUrl": "https://en.wikipedia.org/wiki/12_Monkeys",
    "citationTitle": "Wikipedia: 12 Monkeys"
  },
  {
    "id": "da7e9e54-bfb8-4a42-8229-3a68c8325c32",
    "text": "In 'They Live' (1988), what everyday item allows the protagonist to see the hidden alien messages and alien rulers disguised as humans?",
    "options": [
      "Contact lenses",
      "Special sunglasses",
      "A radio device",
      "Prescription glasses"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Special sunglasses reveal the hidden alien presence and subliminal messages.",
    "detailedExplanation": "John Carpenter's satirical science fiction film 'They Live' features special sunglasses that reveal a hidden reality where subliminal messages like 'OBEY' and 'CONSUME' are embedded in advertisements and media, while also exposing alien rulers disguised as humans. Starring 'Rowdy' Roddy Piper, the film serves as a critique of consumerism and media manipulation in 1980s America, becoming a cult classic known for its social commentary and memorable one-liners.",
    "citationUrl": "https://en.wikipedia.org/wiki/They_Live",
    "citationTitle": "Wikipedia: They Live"
  },
  {
    "id": "21100830-5bd2-4e55-9dbb-8c830b96add1",
    "text": "Which 1997 film features Jodie Foster as an astronomer who receives the first confirmed extraterrestrial communication in human history?",
    "options": [
      "Sphere",
      "Contact",
      "Event Horizon",
      "The Arrival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Contact' stars Jodie Foster as astronomer Dr. Ellie Arroway who receives alien signals.",
    "detailedExplanation": "Based on Carl Sagan's novel and directed by Robert Zemeckis, 'Contact' follows astronomer Dr. Ellie Arroway (Jodie Foster) who detects a signal from the star Vega containing construction plans for a mysterious machine. The film thoughtfully explores the intersection of science, religion, and philosophy, examining how humanity might react to first contact with extraterrestrial intelligence while maintaining scientific accuracy in its portrayal of SETI research.",
    "citationUrl": "https://en.wikipedia.org/wiki/Contact_(1997_American_film)",
    "citationTitle": "Wikipedia: Contact (1997 American film)"
  },
  {
    "id": "841dc4ca-fa93-45a3-aabf-f1fe0723b640",
    "text": "In 'The Thing' (1982), what is the name of the Antarctic research station where the alien organism infiltrates and terrorizes the crew?",
    "options": [
      "Outpost 31",
      "Station Alpha",
      "McMurdo Base",
      "Camp Thule"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Outpost 31 is the isolated Antarctic research station in John Carpenter's 'The Thing'.",
    "detailedExplanation": "John Carpenter's 'The Thing' (1982) takes place at the fictional Outpost 31, an isolated American Antarctic research station. The remote location serves as the perfect setting for the paranoia-driven horror as the alien organism can perfectly imitate any living being, making the researchers unable to trust each other. The claustrophobic atmosphere of the snowed-in station amplifies the tension throughout the film.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Thing_(1982_film)",
    "citationTitle": "Wikipedia: The Thing (1982 film)"
  },
  {
    "id": "79e31a93-732d-4fde-bf4e-674f95258fc4",
    "text": "Which 1988 science fiction film starring Jeff Goldblum features a scientist who gradually transforms into an insect after a teleportation experiment goes wrong?",
    "options": [
      "The Fly",
      "Scanners",
      "Videodrome",
      "Dead Ringers"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'The Fly' (1986) directed by David Cronenberg stars Jeff Goldblum as Seth Brundle, who transforms into a fly-human hybrid.",
    "detailedExplanation": "David Cronenberg's 'The Fly' (1986) stars Jeff Goldblum as scientist Seth Brundle who accidentally fuses his DNA with that of a housefly during a teleportation experiment. The film is a remake of the 1958 film of the same name, but Cronenberg's version focuses on the gradual, horrific transformation process as Brundle slowly becomes more fly-like. The film is considered one of the best examples of body horror and won an Academy Award for Best Makeup.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fly_(1986_film)",
    "citationTitle": "Wikipedia: The Fly (1986 film)"
  },
  {
    "id": "14b8c060-2b08-431c-8ec6-683a1543550b",
    "text": "In 'Mad Max: Fury Road' (2015), what is the name of the tyrannical warlord who controls the Citadel and its water supply?",
    "options": [
      "Immortan Joe",
      "Lord Humungus",
      "Toecutter",
      "Rictus Erectus"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Immortan Joe is the main antagonist who controls the water supply in the post-apocalyptic wasteland.",
    "detailedExplanation": "In George Miller's 'Mad Max: Fury Road' (2015), Immortan Joe is the despotic ruler of the Citadel who controls the precious water supply in the post-apocalyptic wasteland. Played by Hugh Keays-Byrne (who also played Toecutter in the original Mad Max), Joe maintains power through his control of water, gasoline, and his War Boys army. His character represents the ultimate expression of patriarchal control in a resource-scarce world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mad_Max:_Fury_Road",
    "citationTitle": "Wikipedia: Mad Max: Fury Road"
  },
  {
    "id": "ccaa3897-0522-4b91-a434-56c562939639",
    "text": "Which 1997 sci-fi horror film directed by Paul W.S. Anderson takes place aboard a spaceship that has returned from a hellish dimension after testing an experimental faster-than-light drive?",
    "options": [
      "Event Horizon",
      "Pandorum",
      "Supernova",
      "Sunshine"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Event Horizon' features a rescue crew investigating a ship that disappeared while testing an experimental gravity drive.",
    "detailedExplanation": "'Event Horizon' (1997) follows a rescue crew investigating the starship Event Horizon, which vanished seven years earlier while testing an experimental gravity drive designed to create artificial black holes for faster-than-light travel. When the ship mysteriously reappears, the rescue team discovers it has been to a hellish dimension beyond human comprehension. The film blends science fiction with horror elements and has gained cult status despite initially receiving mixed reviews.",
    "citationUrl": "https://en.wikipedia.org/wiki/Event_Horizon_(film)",
    "citationTitle": "Wikipedia: Event Horizon (film)"
  }
]