[
  {
    "id": "3c04dd4b-e9a4-4b1c-9814-3cde09855503",
    "text": "Which 1982 science fiction film features the famous line 'I've seen things you people wouldn't believe'?",
    "options": [
      "The Thing",
      "Blade Runner",
      "E.T. the Extra-Terrestrial",
      "Tron"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The iconic 'Tears in Rain' monologue is delivered by Roy Batty in Blade Runner.",
    "detailedExplanation": "Rutger Hauer's character Roy Batty delivers the famous 'Tears in Rain' monologue in Ridley Scott's Blade Runner. The speech begins with 'I've seen things you people wouldn't believe' and ends with 'All those moments will be lost in time, like tears in rain.' Hauer improvised parts of this speech, making it one of cinema's most memorable death scenes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tears_in_rain_monologue",
    "citationTitle": "Wikipedia: Tears in Rain Monologue"
  },
  {
    "id": "c05a1b68-f3c4-4abe-a1c3-7d9b9adfa840",
    "text": "Which director is known for the 'Cornetto Trilogy' that includes the sci-fi comedy 'The World's End'?",
    "options": [
      "Duncan Jones",
      "Edgar Wright",
      "Neill Blomkamp",
      "Rian Johnson"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Edgar Wright directed the Three Flavours Cornetto Trilogy, concluding with The World's End.",
    "detailedExplanation": "Edgar Wright, along with actors Simon Pegg and Nick Frost, created the Three Flavours Cornetto Trilogy. The trilogy consists of Shaun of the Dead (2004), Hot Fuzz (2007), and The World's End (2013). The final film deals with an alien invasion during a pub crawl, blending Wright's signature rapid-fire editing and humor with science fiction elements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three_Flavours_Cornetto_trilogy",
    "citationTitle": "Wikipedia: Three Flavours Cornetto Trilogy"
  },
  {
    "id": "406fdbf9-ab52-43e7-8759-52175da443a7",
    "text": "In 'The Matrix' (1999), what color pill does Neo take to learn the truth?",
    "options": [
      "Blue",
      "Red",
      "Green",
      "White"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Neo takes the red pill to escape the Matrix and see reality.",
    "detailedExplanation": "In the famous scene from The Matrix, Morpheus offers Neo a choice between a red pill and a blue pill. The red pill represents awakening to reality and escaping the simulated world of the Matrix, while the blue pill would allow him to remain in comfortable ignorance. Neo's choice of the red pill launches him into the real world and the film's central conflict.",
    "citationUrl": "https://en.wikipedia.org/wiki/Red_pill_and_blue_pill",
    "citationTitle": "Wikipedia: Red Pill and Blue Pill"
  },
  {
    "id": "e45e52bd-374c-45b7-8cd3-17b555da54eb",
    "text": "What year is the setting for the original 'Planet of the Apes' film when Taylor crash-lands?",
    "options": [
      "2673 AD",
      "3978 AD",
      "3001 AD",
      "4000 AD"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Taylor's ship crashes in the year 3978 AD according to the film's timeline.",
    "detailedExplanation": "In the 1968 Planet of the Apes, astronaut George Taylor and his crew crash-land on what they believe is an alien planet in the year 3978 AD, approximately 2000 years after their departure from Earth. The far-future setting emphasizes the film's themes about the rise and fall of civilizations, culminating in the famous revelation that they never left Earth at all.",
    "citationUrl": "https://en.wikipedia.org/wiki/Planet_of_the_Apes_(1968_film)",
    "citationTitle": "Wikipedia: Planet of the Apes (1968 film)"
  },
  {
    "id": "f016aa90-75a4-46bb-9765-2bc3750dffcb",
    "text": "Which actor played the villain Biff Tannen in the 'Back to the Future' trilogy?",
    "options": [
      "James Tolkan",
      "Crispin Glover",
      "Thomas F. Wilson",
      "Jeffrey Weissman"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Thomas F. Wilson portrayed Biff Tannen and his various ancestors/descendants throughout the trilogy.",
    "detailedExplanation": "Thomas F. Wilson played multiple versions of the character Biff Tannen across different time periods in the Back to the Future trilogy. He portrayed the teenage bully Biff in 1955, the middle-aged Biff in 1985, the elderly Biff in 2015, and the powerful alternate-timeline Biff, as well as ancestor Buford 'Mad Dog' Tannen in 1885. Wilson's versatile performance helped create one of cinema's most memorable recurring antagonists.",
    "citationUrl": "https://en.wikipedia.org/wiki/Biff_Tannen",
    "citationTitle": "Wikipedia: Biff Tannen"
  },
  {
    "id": "2d178227-821f-4f1b-b63e-c1f02d2a806b",
    "text": "Which 1997 film features Will Smith battling aliens in New York City on July 4th?",
    "options": [
      "Men in Black",
      "Independence Day",
      "Mars Attacks!",
      "Stargate"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Independence Day features the iconic July 4th alien invasion with Will Smith as a fighter pilot.",
    "detailedExplanation": "Independence Day (1996, not 1997) features Will Smith as Captain Steven Hiller, a Marine fighter pilot who helps lead the counterattack against invading aliens on July 4th. The film's climactic battle takes place on Independence Day, making the holiday symbolically significant as humanity fights for its independence from alien oppression. The movie became a summer blockbuster success and spawned a sequel in 2016.",
    "citationUrl": "https://en.wikipedia.org/wiki/Independence_Day_(1996_film)",
    "citationTitle": "Wikipedia: Independence Day (1996 film)"
  },
  {
    "id": "6313c219-421c-4b9a-8ee2-a334e7fcacfd",
    "text": "Which 1979 science fiction horror film used the tagline 'In space no one can hear you scream'?",
    "options": [
      "Event Horizon",
      "Alien",
      "The Thing",
      "Invasion of the Body Snatchers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Alien (1979) used this famous tagline.",
    "detailedExplanation": "Ridley Scott's 'Alien' (1979) became legendary not only for its terrifying xenomorph creature but also for its memorable marketing tagline 'In space no one can hear you scream.' The tagline perfectly captured the film's claustrophobic horror atmosphere aboard the commercial space vessel Nostromo, emphasizing the isolation and helplessness of the crew facing the deadly alien creature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alien_(film)",
    "citationTitle": "Wikipedia: Alien (film)"
  },
  {
    "id": "75ee1f50-242b-43c9-8f65-2a97c2154291",
    "text": "What is the name of the computer system that controls the ship in '2001: A Space Odyssey'?",
    "options": [
      "MOTHER",
      "HAL 9000",
      "GERTY",
      "SHODAN"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "HAL 9000 is the AI computer in 2001: A Space Odyssey.",
    "detailedExplanation": "HAL 9000 (Heuristically programmed ALgorithmic computer) is the artificial intelligence computer that controls the Discovery One spacecraft in Stanley Kubrick's '2001: A Space Odyssey' (1968). HAL becomes one of cinema's most iconic AI villains when it begins to malfunction and turns against the human crew members, leading to the famous scene where HAL refuses to open the pod bay doors.",
    "citationUrl": "https://en.wikipedia.org/wiki/HAL_9000",
    "citationTitle": "Wikipedia: HAL 9000"
  },
  {
    "id": "8eb5f81d-ada8-4388-97c1-af2ed1674d09",
    "text": "Which Philip K. Dick novel was adapted into the 1982 film 'Blade Runner'?",
    "options": [
      "Total Recall",
      "Minority Report",
      "Do Androids Dream of Electric Sheep?",
      "The Man in the High Castle"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Do Androids Dream of Electric Sheep?' was adapted into Blade Runner.",
    "detailedExplanation": "Ridley Scott's 'Blade Runner' (1982) was based on Philip K. Dick's 1968 novel 'Do Androids Dream of Electric Sheep?' The film adaptation took significant creative liberties with the source material, focusing on the story of Rick Deckard hunting down replicants (bioengineered androids) in a dystopian future Los Angeles, while exploring themes of what makes someone human.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blade_Runner",
    "citationTitle": "Wikipedia: Blade Runner"
  },
  {
    "id": "42d03a54-7b5c-4a0d-9529-8c192a432fab",
    "text": "In 'Terminator 2: Judgment Day', what is the model number of Arnold Schwarzenegger's Terminator?",
    "options": [
      "T-800",
      "T-1000",
      "T-600",
      "T-850"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Arnold Schwarzenegger plays the T-800 model Terminator.",
    "detailedExplanation": "In 'Terminator 2: Judgment Day' (1991), Arnold Schwarzenegger reprises his role as the T-800 Terminator, but this time reprogrammed by the human resistance to protect John Connor. The T-800 is a cybernetic organism with living tissue over a metal endoskeleton, in contrast to the liquid metal T-1000 antagonist played by Robert Patrick.",
    "citationUrl": "https://en.wikipedia.org/wiki/Terminator_(character)",
    "citationTitle": "Wikipedia: Terminator (character)"
  },
  {
    "id": "5255c1bb-31f3-41e0-a08c-86de46d66549",
    "text": "What fictional corporation manufactures the androids in the 'Alien' film series?",
    "options": [
      "Umbrella Corporation",
      "Tyrell Corporation",
      "Weyland-Yutani",
      "Cyberdyne Systems"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Weyland-Yutani is the corporation in the Alien franchise.",
    "detailedExplanation": "Weyland-Yutani Corporation, often referred to as 'The Company,' is the powerful mega-corporation in the 'Alien' film series that manufactures synthetic androids and operates space missions. Throughout the franchise, Weyland-Yutani serves as a secondary antagonist, consistently prioritizing the capture of xenomorph specimens for weapons development over human lives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Weyland-Yutani",
    "citationTitle": "Wikipedia: Weyland-Yutani"
  },
  {
    "id": "80eeb39f-a540-40aa-b5da-f1437929cf51",
    "text": "Which director helmed both 'The Terminator' (1984) and 'Avatar' (2009)?",
    "options": [
      "Ridley Scott",
      "Steven Spielberg",
      "James Cameron",
      "George Lucas"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "James Cameron directed both The Terminator and Avatar.",
    "detailedExplanation": "James Cameron is renowned for directing groundbreaking science fiction films that pushed the boundaries of visual effects technology. He directed 'The Terminator' (1984), which launched his career and the franchise, and later 'Avatar' (2009), which became the highest-grossing film of all time and revolutionized 3D cinema technology. Cameron is known for his technical innovation and epic storytelling in the sci-fi genre.",
    "citationUrl": "https://en.wikipedia.org/wiki/James_Cameron",
    "citationTitle": "Wikipedia: James Cameron"
  },
  {
    "id": "45fb15b0-fc0b-436d-8cbe-979630747f3b",
    "text": "In 'E.T. the Extra-Terrestrial', what candy does Elliott use to lure E.T.?",
    "options": [
      "M&Ms",
      "Skittles",
      "Reese's Pieces",
      "Hershey's Kisses"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Elliott uses Reese's Pieces to communicate with and lure E.T.",
    "detailedExplanation": "In Steven Spielberg's 'E.T. the Extra-Terrestrial' (1982), young Elliott uses Reese's Pieces candy to create a trail leading from the forest to his house, successfully luring the friendly alien. This product placement became one of the most successful in film history, reportedly increasing Reese's Pieces sales by 65% following the movie's release. Interestingly, M&M's was originally approached for this placement but declined.",
    "citationUrl": "https://en.wikipedia.org/wiki/E.T._the_Extra-Terrestrial",
    "citationTitle": "Wikipedia: E.T. the Extra-Terrestrial"
  },
  {
    "id": "5085b3c9-8ccc-40e4-ac0b-b8f6ad68d33a",
    "text": "In the 1968 film '2001: A Space Odyssey', what is the name of the mysterious black rectangular object that appears throughout human evolution?",
    "options": [
      "The Sentinel",
      "The Monolith",
      "The Obelisk",
      "The Prism"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Monolith is the enigmatic black rectangular structure that triggers evolutionary leaps in the film.",
    "detailedExplanation": "Stanley Kubrick's '2001: A Space Odyssey' features the Monolith as a central mysterious element that appears at key moments in human evolution - from the dawn of man sequence with early hominids to the journey to Jupiter. The black rectangular structure serves as a catalyst for evolutionary advancement and is one of cinema's most iconic science fiction objects, representing alien intelligence guiding human development.",
    "citationUrl": "https://en.wikipedia.org/wiki/2001:_A_Space_Odyssey_(film)",
    "citationTitle": "Wikipedia: 2001: A Space Odyssey (film)"
  },
  {
    "id": "d62bb430-9e33-4819-b5be-b37a47526ff7",
    "text": "Which 1984 science fiction film features a character who can see brief glimpses of the future and is based on a Philip K. Dick short story?",
    "options": [
      "Total Recall",
      "Minority Report",
      "The Running Man",
      "Strange Days"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Minority Report, though filmed in 2002, is based on Dick's 1956 story about precognitive abilities.",
    "detailedExplanation": "While the film adaptation was released in 2002 and directed by Steven Spielberg, 'Minority Report' is based on Philip K. Dick's 1956 short story of the same name. The story explores the concept of 'precogs' - individuals with precognitive abilities who can see future crimes before they happen, allowing for a pre-crime police unit. The film stars Tom Cruise as a pre-crime officer who becomes accused of a future murder he has yet to commit.",
    "citationUrl": "https://en.wikipedia.org/wiki/Minority_Report_(film)",
    "citationTitle": "Wikipedia: Minority Report (film)"
  },
  {
    "id": "b2c6ea51-ab04-4e68-a5af-42e81980d140",
    "text": "What is the name of the spaceship in the 1979 film 'Alien' where the crew first encounters the deadly xenomorph?",
    "options": [
      "Nostromo",
      "Sulaco",
      "Prometheus",
      "Covenant"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Nostromo is the commercial towing vehicle where the original Alien story takes place.",
    "detailedExplanation": "In Ridley Scott's 1979 'Alien', the USCSS Nostromo is a commercial towing vehicle returning to Earth with a cargo of mineral ore when the crew receives a mysterious transmission and is forced to investigate. The ship becomes the claustrophobic setting for the deadly cat-and-mouse game between the crew and the alien creature. The Nostromo's industrial, lived-in design helped establish the film's realistic, blue-collar space aesthetic that influenced countless science fiction films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alien_(film)",
    "citationTitle": "Wikipedia: Alien (film)"
  },
  {
    "id": "de3bb9e6-62a1-47a8-af42-9ca2bf092c97",
    "text": "In the 1985 film 'Brazil', what is the protagonist Sam Lowry's job in the dystopian bureaucratic society?",
    "options": [
      "Information Retrieval",
      "Records Department",
      "Ministry of Love",
      "Thought Police"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sam Lowry works in Information Retrieval, which is essentially a government torture department.",
    "detailedExplanation": "In Terry Gilliam's dystopian masterpiece 'Brazil', Sam Lowry works for the Department of Information Retrieval, which is revealed to be the government's torture and interrogation division. The film presents a nightmarish bureaucratic society where even torture has become mundane paperwork. Lowry's job involves extracting information from prisoners, but he becomes increasingly disillusioned with the system while pursuing his dream girl and becoming entangled in the very machinery of oppression he serves.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brazil_(1985_film)",
    "citationTitle": "Wikipedia: Brazil (1985 film)"
  },
  {
    "id": "73cf3ff9-0806-434a-8899-26ba200e3ae0",
    "text": "Which 1956 science fiction film is considered a classic allegory for McCarthyism and Communist paranoia of the 1950s?",
    "options": [
      "The Day the Earth Stood Still",
      "Forbidden Planet",
      "Invasion of the Body Snatchers",
      "The War of the Worlds"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Invasion of the Body Snatchers is widely interpreted as an allegory for McCarthyism and 1950s paranoia.",
    "detailedExplanation": "Don Siegel's 'Invasion of the Body Snatchers' tells the story of alien pods that replace humans with emotionless duplicates, creating a powerful metaphor for the conformity and paranoia of 1950s America. The film can be read both as a critique of Communist infiltration fears and as a warning against McCarthyist conformity pressures. Its themes of losing individual identity and the difficulty of distinguishing friend from foe perfectly captured the anxieties of Cold War America, making it one of the most politically resonant science fiction films ever made.",
    "citationUrl": "https://en.wikipedia.org/wiki/Invasion_of_the_Body_Snatchers_(1956_film)",
    "citationTitle": "Wikipedia: Invasion of the Body Snatchers (1956 film)"
  },
  {
    "id": "add43f3a-7ed6-46ca-98e6-3a90d87963a0",
    "text": "In the 1997 film 'The Fifth Element', what are the four classical elements that must be combined with the Fifth Element to save Earth?",
    "options": [
      "Fire, Water, Earth, Air",
      "Light, Dark, Matter, Energy",
      "North, South, East, West",
      "Past, Present, Future, Infinity"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The classical elements Fire, Water, Earth, and Air must be combined with the Fifth Element (Love).",
    "detailedExplanation": "In Luc Besson's colorful space opera 'The Fifth Element', the plot centers around four stones representing the classical elements - Fire, Water, Earth, and Air - which must be combined with the Fifth Element to create a weapon capable of stopping the Great Evil. The Fifth Element is revealed to be Leeloo, a perfect being, and ultimately love itself. The film combines these ancient mystical concepts with futuristic science fiction elements, creating a unique blend of mythology and space adventure starring Bruce Willis and Milla Jovovich.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fifth_Element",
    "citationTitle": "Wikipedia: The Fifth Element"
  },
  {
    "id": "19719651-9584-4a87-91a6-51141a1d352a",
    "text": "Which 1988 David Cronenberg film explores themes of body horror through a scientist who gradually transforms after a teleportation experiment goes wrong?",
    "options": [
      "Scanners",
      "Videodrome",
      "The Fly",
      "eXistenZ"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Fly features Jeff Goldblum as a scientist who slowly transforms into a fly-human hybrid after a teleportation accident.",
    "detailedExplanation": "David Cronenberg's 'The Fly' is a remake of the 1958 film, starring Jeff Goldblum as scientist Seth Brundle who accidentally fuses his DNA with that of a housefly during a teleportation experiment. The film is considered one of the greatest body horror films ever made, as it depicts Brundle's gradual and grotesque transformation into a fly-human hybrid. Cronenberg used the transformation as a metaphor for disease, aging, and death, creating both visceral horror and genuine pathos as the protagonist loses his humanity piece by piece.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fly_(1986_film)",
    "citationTitle": "Wikipedia: The Fly (1986 film)"
  }
]