[
  {
    "id": "b6a63f79-80de-4837-be84-c4462314eb0c",
    "text": "What event is widely considered to have sparked the beginning of World War I?",
    "options": [
      "The sinking of the Lusitania",
      "The assassination of Archduke Franz Ferdinand",
      "Germany's invasion of Belgium",
      "The Zimmermann Telegram"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The assassination of Archduke Franz Ferdinand of Austria-Hungary in Sarajevo on June 28, 1914, triggered the chain of events that led to World War I.",
    "detailedExplanation": "On June 28, 1914, Archduke Franz Ferdinand, heir to the Austro-Hungarian throne, was assassinated by Gavrilo Princip, a Bosnian Serb nationalist, while visiting Sarajevo. This event triggered a diplomatic crisis that escalated due to the complex web of alliances between European powers, ultimately leading to the outbreak of World War I just one month later when Austria-Hungary declared war on Serbia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Assassination_of_Archduke_Franz_Ferdinand",
    "citationTitle": "Wikipedia: Assassination of Archduke Franz Ferdinand"
  },
  {
    "id": "612d83f6-2918-436f-9249-4d794ddce6ce",
    "text": "In which year did World War I end?",
    "options": [
      "1917",
      "1918",
      "1919",
      "1920"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "World War I ended on November 11, 1918, when the Armistice of Compiègne was signed, effectively ending hostilities.",
    "detailedExplanation": "World War I officially ended on November 11, 1918, at 11:00 AM when the Armistice of Compiègne took effect. This agreement between the Allies and Germany called for a ceasefire and the cessation of hostilities on the Western Front. While the formal peace treaty (Treaty of Versailles) wasn't signed until 1919, the fighting stopped in 1918, marking the end of the Great War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Armistice_of_11_November_1918",
    "citationTitle": "Wikipedia: Armistice of 11 November 1918"
  },
  {
    "id": "46e1a44a-7256-490a-bc5d-bcdc32055492",
    "text": "Which famous British ocean liner was sunk by a German U-boat in 1915?",
    "options": [
      "RMS Titanic",
      "RMS Lusitania",
      "HMS Britannic",
      "RMS Mauretania"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The RMS Lusitania was torpedoed and sunk by German submarine U-20 on May 7, 1915, killing 1,198 passengers and crew.",
    "detailedExplanation": "The RMS Lusitania was sunk by German submarine U-20 on May 7, 1915, off the coast of Ireland while traveling from New York to Liverpool. The attack killed 1,198 people, including 128 Americans, and occurred during Germany's unrestricted submarine warfare campaign. The sinking caused international outrage and was used as propaganda to encourage American entry into the war, though the US didn't join until 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sinking_of_the_RMS_Lusitania",
    "citationTitle": "Wikipedia: Sinking of the RMS Lusitania"
  },
  {
    "id": "01eae3a8-3101-4708-bef0-b9418e43dff4",
    "text": "What was the name of the major German offensive launched in spring 1918?",
    "options": [
      "Operation Barbarossa",
      "The Spring Offensive",
      "The Hindenburg Line",
      "Operation Michael"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Spring Offensive (also called the Kaiserschlacht) was Germany's last major offensive of World War I, launched in March 1918.",
    "detailedExplanation": "The German Spring Offensive, also known as the Kaiserschlacht or 'Kaiser's Battle,' was launched on March 21, 1918. It was Germany's final attempt to win the war before American forces could fully arrive in Europe. The offensive initially achieved significant gains but ultimately failed to break through Allied lines decisively, and Germany's resources were exhausted in the effort, contributing to their eventual defeat later that year.",
    "citationUrl": "https://en.wikipedia.org/wiki/German_spring_offensive",
    "citationTitle": "Wikipedia: German spring offensive"
  },
  {
    "id": "f5ce3118-c41a-4c13-910d-7297bf182c89",
    "text": "Which battle is known as one of the bloodiest in World War I, lasting from July to November 1916?",
    "options": [
      "Battle of Verdun",
      "Battle of the Somme",
      "Battle of Passchendaele",
      "Battle of Ypres"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Battle of the Somme (July-November 1916) resulted in over one million casualties, making it one of the bloodiest battles in human history.",
    "detailedExplanation": "The Battle of the Somme was fought between July 1 and November 18, 1916, primarily between British and French forces against the German Empire. The battle is infamous for the enormous casualties on the first day alone - nearly 60,000 British casualties, with over 19,000 deaths. By the end of the battle, there were more than one million casualties on all sides combined, with relatively little territorial gain, exemplifying the brutal nature of trench warfare.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_the_Somme",
    "citationTitle": "Wikipedia: Battle of the Somme"
  },
  {
    "id": "24e3413b-b01d-4b69-9476-34de6176268e",
    "text": "When did the United States enter World War I?",
    "options": [
      "1914",
      "1915",
      "1916",
      "1917"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The United States declared war on Germany and entered World War I on April 6, 1917.",
    "detailedExplanation": "The United States maintained neutrality for the first three years of World War I, despite provocations such as the sinking of the Lusitania and German submarine attacks on American ships. However, factors including Germany's resumption of unrestricted submarine warfare and the infamous Zimmermann Telegram (proposing a German-Mexican alliance) led President Woodrow Wilson to ask Congress for a declaration of war, which was granted on April 6, 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_States_declaration_of_war_on_Germany_(1917)",
    "citationTitle": "Wikipedia: United States declaration of war on Germany (1917)"
  },
  {
    "id": "37252e8b-9494-4870-9777-d26dbc7fa82b",
    "text": "What was the nickname commonly given to World War I?",
    "options": [
      "The Great War",
      "The War of Nations",
      "The European War",
      "The World War"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "easy",
    "explanation": "World War I was commonly called 'The Great War' because of its unprecedented scale and impact on global civilization.",
    "detailedExplanation": "World War I was widely known as 'The Great War' during and immediately after the conflict, reflecting its massive scale and devastating impact that was unlike any previous war in human history. The term emphasized the war's global reach, involving multiple continents and millions of soldiers and civilians. It was only after World War II began that the earlier conflict became commonly known as 'World War I' or 'the First World War' to distinguish it from the later global conflict.",
    "citationUrl": "https://en.wikipedia.org/wiki/World_War_I",
    "citationTitle": "Wikipedia: World War I"
  },
  {
    "id": "1cd22ae4-ca3e-43bc-b6b4-0d20eaeabf95",
    "text": "Which new weapon was first used extensively in World War I and became known as 'poison gas'?",
    "options": [
      "Mustard gas",
      "Chlorine gas",
      "Tear gas",
      "Nerve gas"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Chlorine gas was the first poison gas used extensively in World War I, first deployed by Germany at the Second Battle of Ypres in 1915.",
    "detailedExplanation": "Chemical warfare made its debut on a large scale during World War I, with chlorine gas being the first poison gas used extensively in combat. Germany first used chlorine gas on April 22, 1915, during the Second Battle of Ypres against French and Canadian troops. The yellowish-green gas caused panic and created gaps in the Allied lines, though the Germans were unprepared to exploit the breakthrough. This marked the beginning of chemical warfare in modern conflict, leading to the development of gas masks and eventually international treaties banning such weapons.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chemical_weapons_in_World_War_I",
    "citationTitle": "Wikipedia: Chemical weapons in World War I"
  },
  {
    "id": "61c6373b-c2cc-4ab4-a85f-640022e45d4d",
    "text": "What event is widely considered to have triggered the start of World War I?",
    "options": [
      "The sinking of the Lusitania",
      "The assassination of Archduke Franz Ferdinand",
      "Germany's invasion of Belgium",
      "The Zimmermann Telegram"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The assassination of Archduke Franz Ferdinand of Austria-Hungary in Sarajevo on June 28, 1914, triggered the chain of events that led to World War I.",
    "detailedExplanation": "On June 28, 1914, Archduke Franz Ferdinand, heir to the Austro-Hungarian throne, was assassinated by Gavrilo Princip, a Bosnian Serb nationalist, while visiting Sarajevo. This event set off a chain reaction of alliance obligations and declarations of war that ultimately led to the Great War, as Austria-Hungary declared war on Serbia, Russia mobilized to support Serbia, Germany declared war on Russia, and other nations were drawn into the conflict.",
    "citationUrl": "https://en.wikipedia.org/wiki/Assassination_of_Archduke_Franz_Ferdinand",
    "citationTitle": "Wikipedia: Assassination of Archduke Franz Ferdinand"
  },
  {
    "id": "6a11285d-bef7-4779-93f2-25ccf08bb67f",
    "text": "Which battle is famous for its horrific casualties and is often called the bloodiest battle of WWI?",
    "options": [
      "Battle of Verdun",
      "Battle of the Somme",
      "Battle of Passchendaele",
      "Battle of Gallipoli"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Battle of the Somme (1916) resulted in over one million casualties and is considered the bloodiest battle of World War I.",
    "detailedExplanation": "The Battle of the Somme, fought from July 1 to November 18, 1916, was one of the largest and bloodiest battles of World War I. On the first day alone, the British Army suffered nearly 60,000 casualties, with about 20,000 killed. By the end of the battle, there were over one million casualties on all sides combined, making it synonymous with the futility and horror of trench warfare.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_the_Somme",
    "citationTitle": "Wikipedia: Battle of the Somme"
  },
  {
    "id": "289ca609-15e1-49de-ae66-fd5e7aa723e7",
    "text": "Which passenger ship was sunk by a German U-boat in 1915, killing nearly 1,200 people?",
    "options": [
      "RMS Titanic",
      "RMS Lusitania",
      "HMS Britannic",
      "SS Sussex"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The RMS Lusitania was torpedoed by German U-boat U-20 off the coast of Ireland on May 7, 1915, killing 1,198 people.",
    "detailedExplanation": "The RMS Lusitania, a British passenger liner, was sunk by German submarine U-20 on May 7, 1915, off the coast of Ireland. The ship sank in just 18 minutes, killing 1,198 of the 1,959 people aboard, including 128 Americans. This incident significantly turned American public opinion against Germany and was later used as propaganda to justify America's entry into the war, though the US didn't actually enter until 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sinking_of_the_RMS_Lusitania",
    "citationTitle": "Wikipedia: Sinking of the RMS Lusitania"
  },
  {
    "id": "9a520b49-178e-49ed-9061-47ad57b4efeb",
    "text": "What new weapon was first used extensively during World War I and caused widespread fear?",
    "options": [
      "Machine guns",
      "Poison gas",
      "Artillery",
      "Rifles"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "Poison gas was first used extensively in WWI, beginning with chlorine gas at the Second Battle of Ypres in 1915.",
    "detailedExplanation": "Chemical weapons, particularly poison gas, were first used on a large scale during World War I. The Germans first used chlorine gas against Allied troops at the Second Battle of Ypres in April 1915. This marked the beginning of chemical warfare in modern conflict, with various gases like phosgene and mustard gas being developed and deployed by both sides. The use of these weapons caused not only physical casualties but also psychological terror among troops.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chemical_weapons_in_World_War_I",
    "citationTitle": "Wikipedia: Chemical weapons in World War I"
  },
  {
    "id": "e96e8d39-cded-4778-b37f-61fb5aef19ff",
    "text": "When did the United States officially enter World War I?",
    "options": [
      "1915",
      "1916",
      "1917",
      "1918"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The United States declared war on Germany and entered World War I on April 6, 1917.",
    "detailedExplanation": "The United States maintained neutrality for most of World War I until April 6, 1917, when Congress declared war on Germany. Several factors contributed to this decision, including Germany's resumption of unrestricted submarine warfare, the sinking of American ships, and the infamous Zimmermann Telegram, which revealed Germany's attempt to form an alliance with Mexico against the United States. President Woodrow Wilson asked Congress to declare war, stating the world must be made 'safe for democracy.'",
    "citationUrl": "https://en.wikipedia.org/wiki/United_States_declaration_of_war_on_Germany_(1917)",
    "citationTitle": "Wikipedia: United States declaration of war on Germany (1917)"
  },
  {
    "id": "6f181423-ccbd-4a5c-9318-a433ae5752a0",
    "text": "Which empire collapsed at the end of World War I, leading to the creation of several new countries?",
    "options": [
      "British Empire",
      "Russian Empire",
      "Ottoman Empire",
      "German Empire"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Ottoman Empire collapsed after WWI, leading to the creation of modern Turkey and several Middle Eastern nations.",
    "detailedExplanation": "The Ottoman Empire, which had been in decline for decades and was known as 'the sick man of Europe,' finally collapsed following its defeat in World War I. The empire was partitioned under various post-war treaties, most notably the Treaty of Sèvres (1920). This led to the creation of modern Turkey under Mustafa Kemal Atatürk, while former Ottoman territories in the Middle East became League of Nations mandates administered by Britain and France, eventually becoming countries like Iraq, Syria, Lebanon, and others.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dissolution_of_the_Ottoman_Empire",
    "citationTitle": "Wikipedia: Dissolution of the Ottoman Empire"
  },
  {
    "id": "8fccba9b-6c70-424b-9487-7dedf7d0a3a7",
    "text": "What was the name of the famous Christmas event that occurred in 1914 between opposing troops?",
    "options": [
      "Christmas Armistice",
      "Christmas Truce",
      "Christmas Ceasefire",
      "Christmas Peace"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Christmas Truce of 1914 saw soldiers from both sides spontaneously cease fighting and even play football together.",
    "detailedExplanation": "The Christmas Truce of 1914 was a series of widespread unofficial ceasefires along the Western Front during Christmas. On Christmas Eve and Christmas Day, soldiers from British, French, and German forces crossed trenches to exchange seasonal greetings, gifts, and even played football (soccer) together in no man's land. This remarkable event demonstrated the humanity that persisted despite the brutal conditions of war, though such truces became much rarer in subsequent years as the war intensified.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christmas_truce",
    "citationTitle": "Wikipedia: Christmas truce"
  },
  {
    "id": "d02d8b71-a5fe-41cf-ac84-7ab4d12fcefa",
    "text": "Which major naval disaster involving a passenger liner helped turn American public opinion against Germany?",
    "options": [
      "The sinking of the Titanic",
      "The sinking of the Lusitania",
      "The sinking of the Britannic",
      "The sinking of the Olympic"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The RMS Lusitania was torpedoed by a German U-boat in 1915, killing 1,198 people including 128 Americans, which outraged American public opinion.",
    "detailedExplanation": "On May 7, 1915, the RMS Lusitania, a British passenger liner, was torpedoed by the German submarine U-20 off the coast of Ireland. The ship sank in just 18 minutes, killing 1,198 of the 1,959 people aboard, including 128 American citizens. This event significantly shifted American public opinion against Germany and was later used as justification when the United States entered the war in 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sinking_of_the_RMS_Lusitania",
    "citationTitle": "Wikipedia: Sinking of the RMS Lusitania"
  },
  {
    "id": "bd1a0da7-1ad7-49e3-aaa7-c9298f7df122",
    "text": "On which date did World War I officially end with the signing of the Armistice?",
    "options": [
      "November 11, 1918",
      "December 25, 1918",
      "January 1, 1919",
      "October 31, 1918"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Armistice of Compiègne was signed on November 11, 1918, at 11:00 AM, effectively ending World War I.",
    "detailedExplanation": "The Armistice of Compiègne was signed on November 11, 1918, at 11:00 AM (the 11th hour of the 11th day of the 11th month), in Marshal Ferdinand Foch's railway carriage in the Forest of Compiègne, France. This agreement between the Allies and Germany effectively ended the fighting on the Western Front and marked the end of World War I. November 11th is still commemorated today as Armistice Day or Veterans Day.",
    "citationUrl": "https://en.wikipedia.org/wiki/Armistice_of_11_November_1918",
    "citationTitle": "Wikipedia: Armistice of 11 November 1918"
  },
  {
    "id": "2257b6e6-17b3-4352-967a-83bbaa624daa",
    "text": "Which battle is considered one of the bloodiest and longest battles of World War I, lasting from February to December 1916?",
    "options": [
      "Battle of the Somme",
      "Battle of Verdun",
      "Battle of Passchendaele",
      "Battle of Ypres"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Battle of Verdun lasted from February 21 to December 18, 1916, and became a symbol of French determination and the horrors of trench warfare.",
    "detailedExplanation": "The Battle of Verdun was fought from February 21 to December 18, 1916, between German and French forces. It was one of the longest and most devastating battles of World War I, with an estimated 700,000 to 800,000 casualties. The Germans aimed to 'bleed France white' by attacking the symbolically important fortress city of Verdun, but the French successfully defended it under the rallying cry 'They shall not pass!' The battle became a symbol of French resilience and the futility of trench warfare.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_Verdun",
    "citationTitle": "Wikipedia: Battle of Verdun"
  },
  {
    "id": "590129c1-62c5-491f-a745-a8182ff3df21",
    "text": "What was the name of the alliance between Germany, Austria-Hungary, and the Ottoman Empire during World War I?",
    "options": [
      "The Triple Alliance",
      "The Central Powers",
      "The Axis Powers",
      "The Eastern Alliance"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The Central Powers was the name given to the alliance of Germany, Austria-Hungary, the Ottoman Empire, and later Bulgaria during World War I.",
    "detailedExplanation": "The Central Powers were the main opponents of the Allied Powers during World War I. The alliance originally consisted of Germany and Austria-Hungary, but was later joined by the Ottoman Empire in October 1914 and Bulgaria in October 1915. They were called the 'Central Powers' because of their central location in Europe. This alliance fought against the Triple Entente (later known as the Allied Powers), which included Britain, France, and Russia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Central_Powers",
    "citationTitle": "Wikipedia: Central Powers"
  },
  {
    "id": "838f757b-e4ec-46a4-bb2d-776f8d5740a4",
    "text": "Which event is commonly considered to have triggered the start of World War I?",
    "options": [
      "The sinking of the Lusitania",
      "The assassination of Archduke Franz Ferdinand",
      "The German invasion of Belgium",
      "The Battle of the Somme"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "easy",
    "explanation": "The assassination of Archduke Franz Ferdinand of Austria-Hungary in Sarajevo on June 28, 1914, triggered the chain of events that led to World War I.",
    "detailedExplanation": "The assassination of Archduke Franz Ferdinand, heir to the Austro-Hungarian throne, by Serbian nationalist Gavrilo Princip in Sarajevo on June 28, 1914, is widely regarded as the immediate cause of World War I. This event triggered a cascade of declarations of war due to the complex system of alliances in Europe. Austria-Hungary declared war on Serbia, Russia mobilized to support Serbia, Germany declared war on Russia, and France and Britain were subsequently drawn into the conflict.",
    "citationUrl": "https://en.wikipedia.org/wiki/Assassination_of_Archduke_Franz_Ferdinand",
    "citationTitle": "Wikipedia: Assassination of Archduke Franz Ferdinand"
  }
]