[
  {
    "id": "0af33ec7-a59a-4d86-a095-bb1f30c63f14",
    "text": "Which German general's spring offensive in 1918 was initially codenamed 'Operation Michael'?",
    "options": [
      "Erich von Falkenhayn",
      "Erich Ludendorff",
      "Paul von Hindenburg",
      "Helmuth von Moltke the Younger"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Erich Ludendorff planned and executed Operation Michael, the first phase of Germany's 1918 Spring Offensive.",
    "detailedExplanation": "Operation Michael was the first phase of the German Spring Offensive launched on March 21, 1918, planned by First Quartermaster General Erich Ludendorff. This massive offensive aimed to break through Allied lines on the Western Front before American forces could arrive in significant numbers. The operation initially achieved considerable success, advancing up to 40 miles in some sectors, but ultimately failed to achieve its strategic objectives and marked Germany's last major offensive of the war.",
    "citationUrl": "https://en.wikipedia.org/wiki/Operation_Michael",
    "citationTitle": "Wikipedia: Operation Michael"
  },
  {
    "id": "99a47916-2798-4786-9ff6-63321098d34c",
    "text": "The Treaty of Brest-Litovsk was signed on which date, effectively ending Russian participation in World War I?",
    "options": [
      "February 9, 1918",
      "March 3, 1918",
      "April 14, 1918",
      "January 28, 1918"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Treaty of Brest-Litovsk was signed on March 3, 1918, between Soviet Russia and the Central Powers.",
    "detailedExplanation": "The Treaty of Brest-Litovsk was signed on March 3, 1918, between the new Bolshevik government of Soviet Russia and the Central Powers (Germany, Austria-Hungary, Bulgaria, and the Ottoman Empire). This separate peace treaty officially ended Russian participation in World War I and allowed Germany to transfer significant military resources from the Eastern Front to the Western Front for their final offensive. The treaty was extremely harsh on Russia, forcing them to give up vast territories including Ukraine, Finland, and the Baltic provinces.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Brest-Litovsk",
    "citationTitle": "Wikipedia: Treaty of Brest-Litovsk"
  },
  {
    "id": "8def9872-8786-4996-9532-437041aa9f40",
    "text": "Which Ottoman fortress controlling the Dardanelles was the primary objective of the Gallipoli Campaign?",
    "options": [
      "Kilitbahir",
      "Çanakkale",
      "Sedd el Bahr",
      "Krithia"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Çanakkale (also known as Chanak) was the key Ottoman fortress controlling the narrow strait of the Dardanelles.",
    "detailedExplanation": "The Gallipoli Campaign (1915-1916) was primarily aimed at capturing the Dardanelles strait to establish a sea route to Russia and potentially knock the Ottoman Empire out of the war. Çanakkale, the principal Ottoman fortress on the Asian side of the Dardanelles, was heavily fortified and controlled the narrowest point of the strait. The fortress, along with its mobile howitzer batteries and mine fields, proved instrumental in repelling the Allied naval attack in March 1915, which led to the subsequent failed amphibious landings on the Gallipoli Peninsula.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gallipoli_campaign",
    "citationTitle": "Wikipedia: Gallipoli campaign"
  },
  {
    "id": "2ee746e5-b30f-494d-91ae-e6b6e4b10114",
    "text": "The Brusilov Offensive of 1916 was notable for being the first major military operation to successfully employ which tactical innovation?",
    "options": [
      "Creeping barrage",
      "Infiltration tactics",
      "Multiple simultaneous breakthrough attempts",
      "Poison gas attacks"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "General Brusilov pioneered attacking along a broad front with multiple simultaneous breakthrough attempts rather than concentrating forces at a single point.",
    "detailedExplanation": "The Brusilov Offensive, launched on June 4, 1916, revolutionized military tactics by abandoning the traditional strategy of massing forces for a single breakthrough point. Instead, Russian General Aleksei Brusilov ordered simultaneous attacks along a 300-mile front with multiple armies, making it impossible for Austro-Hungarian forces to predict where the main assault would come. This innovation, combined with improved artillery coordination and surprise attacks, made the offensive one of the most successful Russian operations of the war, nearly knocking Austria-Hungary out of the conflict and forcing Germany to divert resources from Verdun.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brusilov_offensive",
    "citationTitle": "Wikipedia: Brusilov offensive"
  },
  {
    "id": "89ded6b0-4b85-4c78-b772-cc0cd77c068f",
    "text": "Which German U-boat commander was known as the 'Terror of the Mediterranean' and sank over 400,000 tons of Allied shipping?",
    "options": [
      "Lothar von Arnauld de la Perière",
      "Otto Weddigen",
      "Walther Schwieger",
      "Max Valentiner"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Lothar von Arnauld de la Perière was the most successful U-boat commander of WWI, sinking 194 ships totaling over 400,000 tons.",
    "detailedExplanation": "Korvettenkapitän Lothar von Arnauld de la Perière commanded U-35 and later U-139, becoming the most successful submarine commander in naval history. Operating primarily in the Mediterranean Sea from 1915-1918, he sank 194 ships totaling 453,716 tons, earning him the nickname 'Terror of the Mediterranean.' His success was partly due to his adherence to prize rules when possible, surfacing to warn merchant vessels before attacking, which ironically made him more effective as crews would abandon ship quickly. His remarkable record has never been surpassed by any submarine commander in any navy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lothar_von_Arnauld_de_la_Peri%C3%A8re",
    "citationTitle": "Wikipedia: Lothar von Arnauld de la Perière"
  },
  {
    "id": "f93fa9fd-9194-48e4-93c2-4cd2a49a6e75",
    "text": "The Battle of Caporetto in 1917 saw Italian forces retreat how many miles in just two weeks?",
    "options": [
      "60 miles",
      "80 miles",
      "100 miles",
      "150 miles"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Italian army retreated approximately 100 miles from the Isonzo River to the Piave River line during the Caporetto disaster.",
    "detailedExplanation": "The Battle of Caporetto (October 24 - November 19, 1917) was one of the most devastating defeats in Italian military history. The Austro-Hungarian and German forces, using new infiltration tactics and poison gas, broke through Italian lines and forced a catastrophic retreat of approximately 100 miles from the Isonzo River to the Piave River. The Italian Second Army virtually disintegrated, with 300,000 prisoners taken and 400,000 deserters fleeing southward. The disaster nearly knocked Italy out of the war and required immediate British and French reinforcements to stabilize the front.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_Caporetto",
    "citationTitle": "Wikipedia: Battle of Caporetto"
  },
  {
    "id": "c273783e-9f53-4ed6-927f-5ff65371ce6a",
    "text": "Which German cruiser's raid in the Indian Ocean in 1914-1915 resulted in the sinking of 37 Allied vessels before being destroyed?",
    "options": [
      "SMS Königsberg",
      "SMS Karlsruhe",
      "SMS Emden",
      "SMS Dresden"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "SMS Emden conducted a highly successful commerce raiding campaign in the Indian Ocean, sinking 37 vessels before being destroyed by HMAS Sydney.",
    "detailedExplanation": "SMS Emden, under the command of Captain Karl von Müller, became the most successful German commerce raider of the early war period. Operating in the Indian Ocean from August to November 1914, the light cruiser sank or captured 37 Allied merchant vessels and warships, including the Russian cruiser Zhemchug and French destroyer Mousquet. The Emden's gentlemanly conduct toward prisoners and non-combatants earned von Müller considerable respect even from his enemies. The raider's career ended on November 9, 1914, when it was destroyed by the Australian cruiser HMAS Sydney during the Battle of Cocos.",
    "citationUrl": "https://en.wikipedia.org/wiki/SMS_Emden",
    "citationTitle": "Wikipedia: SMS Emden"
  },
  {
    "id": "223b35c2-f10a-43dd-b77e-4841643af0a7",
    "text": "The Zimmermann Telegram promised which Mexican territories would be returned to Mexico if they joined the Central Powers?",
    "options": [
      "California and Nevada",
      "Texas, New Mexico, and Arizona",
      "Texas and California only",
      "Arizona and New Mexico only"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Zimmermann Telegram promised Mexico the return of Texas, New Mexico, and Arizona in exchange for entering the war against the United States.",
    "detailedExplanation": "The Zimmermann Telegram, sent by German Foreign Secretary Arthur Zimmermann to the German ambassador in Mexico on January 17, 1917, proposed a military alliance between Germany and Mexico. The telegram promised that if Mexico joined the Central Powers and the United States entered the war against Germany, Mexico would receive financial support and recover the territories of Texas, New Mexico, and Arizona—lands lost to the United States following the Mexican-American War (1846-1848). The telegram was intercepted and decoded by British intelligence, and its publication in American newspapers on March 1, 1917, significantly influenced American public opinion toward entering World War I.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zimmermann_Telegram",
    "citationTitle": "Wikipedia: Zimmermann Telegram"
  },
  {
    "id": "52551b8e-e25e-4c22-87d7-52e4c81bf3ce",
    "text": "Which German general was known as the 'Architect of Victory' for his role in the Spring Offensive of 1918?",
    "options": [
      "Erich von Falkenhayn",
      "Erich Ludendorff",
      "Helmuth von Moltke the Younger",
      "Paul von Hindenburg"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Erich Ludendorff masterminded the Spring Offensive of 1918, Germany's final major offensive push.",
    "detailedExplanation": "General Erich Ludendorff, as First Quartermaster General, effectively controlled German military strategy in the final years of WWI. He conceived and executed the Spring Offensive (Kaiserschlacht) beginning in March 1918, which initially achieved spectacular success by breaking through Allied lines using new infiltration tactics. Though ultimately unsuccessful, this offensive represented Germany's last hope for victory and earned Ludendorff recognition as a military strategist, though it also led to Germany's final collapse.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spring_Offensive",
    "citationTitle": "Wikipedia: Spring Offensive"
  },
  {
    "id": "f183f824-3445-4851-9a93-0a86a5de7ab8",
    "text": "The Battle of Tannenberg in 1914 resulted in the destruction of which Russian army?",
    "options": [
      "First Army under Rennenkampf",
      "Second Army under Samsonov",
      "Third Army under Ruzsky",
      "Fourth Army under Evert"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Russian Second Army under General Samsonov was encircled and destroyed at Tannenberg in August 1914.",
    "detailedExplanation": "The Battle of Tannenberg (August 26-30, 1914) was a devastating defeat for Russia's Second Army commanded by General Alexander Samsonov. German forces under Hindenburg and Ludendorff used superior coordination and communication to encircle the Russian army, resulting in approximately 50,000 casualties and 95,000 prisoners. Samsonov himself committed suicide rather than face the shame of defeat. This victory made Hindenburg and Ludendorff national heroes in Germany and demonstrated the importance of modern communications in warfare.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_Tannenberg",
    "citationTitle": "Wikipedia: Battle of Tannenberg"
  },
  {
    "id": "be18b3b0-dd52-459c-aca7-dcec674fd79c",
    "text": "Which poison gas was first used by German forces at the Second Battle of Ypres in April 1915?",
    "options": [
      "Mustard gas",
      "Phosgene",
      "Chlorine",
      "Hydrogen cyanide"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Chlorine gas was the first poison gas used on a large scale, deployed by Germans at Ypres in April 1915.",
    "detailedExplanation": "On April 22, 1915, German forces released chlorine gas from cylinders along a four-mile front at the Second Battle of Ypres, marking the first large-scale use of chemical weapons in World War I. The yellowish-green cloud drifted toward French colonial troops, causing panic and creating a gap in the Allied lines. However, the Germans failed to fully exploit this breakthrough. This marked a significant escalation in warfare tactics and led to the development of gas masks and retaliatory chemical attacks by the Allies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Second_Battle_of_Ypres",
    "citationTitle": "Wikipedia: Second Battle of Ypres"
  },
  {
    "id": "507a28d9-0c01-4a7a-98b1-b1a656602967",
    "text": "The Zimmermann Telegram proposed a German alliance with which country against the United States?",
    "options": [
      "Argentina",
      "Brazil",
      "Chile",
      "Mexico"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Zimmermann Telegram proposed a German-Mexican alliance, offering Mexico recovery of Texas, Arizona, and New Mexico.",
    "detailedExplanation": "In January 1917, German Foreign Secretary Arthur Zimmermann sent a coded telegram to Mexico proposing a military alliance if the United States entered the war against Germany. The telegram promised German support for Mexico to reclaim the territories of Texas, New Mexico, and Arizona lost in the Mexican-American War. British intelligence intercepted and decoded the message, and its publication in American newspapers in March 1917 caused outrage and significantly influenced American public opinion toward entering the war against Germany.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zimmermann_Telegram",
    "citationTitle": "Wikipedia: Zimmermann Telegram"
  },
  {
    "id": "ba729abe-b382-49b8-9fe7-91541d1162d0",
    "text": "Which Ottoman fort controlled the entrance to the Dardanelles during the Gallipoli Campaign?",
    "options": [
      "Kumkale",
      "Sedd el Bahr",
      "Chunuk Bair",
      "Kilitbahir"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "hard",
    "explanation": "Kilitbahir fortress was the key Ottoman stronghold controlling the narrowest point of the Dardanelles strait.",
    "detailedExplanation": "Kilitbahir fortress, whose name means 'Lock of the Sea' in Turkish, was strategically positioned at the narrowest point of the Dardanelles strait, directly opposite the town of Çanakkale. This medieval fortress, originally built in the 15th century and modernized with German assistance before WWI, commanded the entrance to the strait with its heavy artillery. The fortress's guns, along with those at Çanakkale, created a deadly crossfire that proved instrumental in repelling the Allied naval attack of March 18, 1915, ultimately forcing the Allies to attempt the costly land invasion at Gallipoli.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gallipoli_campaign",
    "citationTitle": "Wikipedia: Gallipoli campaign"
  },
  {
    "id": "afc26918-9099-4920-a2cf-48c70509f79e",
    "text": "Which German cruiser's Pacific raiding campaign ended at the Battle of the Falkland Islands in December 1914?",
    "options": [
      "SMS Dresden",
      "SMS Karlsruhe",
      "SMS Emden",
      "SMS Scharnhorst"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "hard",
    "explanation": "SMS Scharnhorst, flagship of Admiral von Spee's East Asia Squadron, was sunk at the Falklands after raiding across the Pacific.",
    "detailedExplanation": "SMS Scharnhorst served as the flagship of Admiral Maximilian von Spee's East Asia Squadron, which conducted a remarkable 14,000-mile voyage across the Pacific, raiding Allied shipping and defeating a British squadron at the Battle of Coronel in November 1914. However, the German success was short-lived. At the Battle of the Falkland Islands on December 8, 1914, the British Royal Navy had positioned a superior force including the battlecruisers HMS Invincible and HMS Inflexible. The Scharnhorst was sunk with all hands, including Admiral von Spee and his two sons, effectively ending German naval operations in the Pacific.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_the_Falkland_Islands",
    "citationTitle": "Wikipedia: Battle of the Falkland Islands"
  },
  {
    "id": "016f3f50-ca00-45a8-bd57-b98498e2be76",
    "text": "The Nivelle Offensive of April 1917 was intended to break German lines at which location?",
    "options": [
      "Vimy Ridge",
      "Messines Ridge",
      "Chemin des Dames",
      "Passchendaele"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Nivelle Offensive targeted the Chemin des Dames ridge, but failed catastrophically and led to French army mutinies.",
    "detailedExplanation": "The Nivelle Offensive, launched on April 16, 1917, was French General Robert Nivelle's ambitious plan to break through German lines along the Chemin des Dames ridge in just 48 hours. Nivelle promised a decisive victory that would end the war, but the offensive was a catastrophic failure. The Germans had learned of the planned attack and prepared strong defenses. French forces suffered enormous casualties with minimal territorial gains, leading to widespread mutinies in the French army. The failure led to Nivelle's dismissal and his replacement by Philippe Pétain, who focused on restoring army morale rather than launching costly offensives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nivelle_Offensive",
    "citationTitle": "Wikipedia: Nivelle Offensive"
  },
  {
    "id": "bf8a3ee6-a36c-448f-b727-5ff61fe6fad3",
    "text": "Which WWI battle was the first to use poison gas on a large scale, marking a horrific milestone in chemical warfare?",
    "options": [
      "Battle of Verdun",
      "Second Battle of Ypres",
      "Battle of the Somme",
      "Battle of Passchendaele"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Second Battle of Ypres in 1915 saw the first large-scale use of chlorine gas by German forces.",
    "detailedExplanation": "The Second Battle of Ypres (April-May 1915) marked a turning point in warfare when German forces released 168 tons of chlorine gas against French colonial troops on April 22, 1915. This was the first time poison gas was used effectively on a large scale in WWI, creating a 4-mile gap in the Allied lines. The attack violated the Hague Convention of 1899, which prohibited the use of poison projectiles, though it didn't specifically ban gas released from cylinders.",
    "citationUrl": "https://en.wikipedia.org/wiki/Second_Battle_of_Ypres",
    "citationTitle": "Wikipedia: Second Battle of Ypres"
  },
  {
    "id": "45324af7-ad81-4b5e-aa02-ff408e4e12b7",
    "text": "The Zimmermann Telegram, which helped bring the US into WWI, proposed an alliance between Germany and which country to attack American territory?",
    "options": [
      "Japan",
      "Mexico",
      "Argentina",
      "Canada"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Zimmermann Telegram proposed a German-Mexican alliance against the United States, promising Mexico the return of Texas, New Mexico, and Arizona.",
    "detailedExplanation": "The Zimmermann Telegram was a secret diplomatic communication sent by German Foreign Secretary Arthur Zimmermann in January 1917. It proposed that if the United States entered the war against Germany, Mexico should join as Germany's ally and attack the US. In return, Germany promised to help Mexico recover the territories of Texas, New Mexico, and Arizona that it had lost in the Mexican-American War. British intelligence intercepted and decoded the telegram, and its publication in American newspapers on March 1, 1917, outraged the American public and significantly contributed to the US declaration of war on Germany in April 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zimmermann_Telegram",
    "citationTitle": "Wikipedia: Zimmermann Telegram"
  },
  {
    "id": "3495da03-622d-48d3-ab5e-a31077075763",
    "text": "Which WWI naval battle was the largest clash between battleships in history, despite being considered tactically inconclusive?",
    "options": [
      "Battle of Coronel",
      "Battle of Jutland",
      "Battle of the Falkland Islands",
      "Battle of Dogger Bank"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Battle of Jutland (1916) was the largest naval battle of WWI and the biggest clash of battleships in naval history.",
    "detailedExplanation": "The Battle of Jutland, fought on May 31-June 1, 1916, was the largest naval engagement of World War I and the last major battle fought primarily by battleships in naval history. The British Grand Fleet under Admiral John Jellicoe faced the German High Seas Fleet under Admiral Reinhard Scheer in the North Sea. Despite the British losing more ships and men, the battle was strategically inconclusive. The German fleet retreated and never again ventured out in full force, effectively maintaining British naval supremacy for the remainder of the war.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_Jutland",
    "citationTitle": "Wikipedia: Battle of Jutland"
  },
  {
    "id": "8902056d-2bcc-4b1f-b4a3-fe922a3ed20c",
    "text": "The Treaty of Brest-Litovsk, which ended Russia's involvement in WWI, resulted in Russia losing approximately what percentage of its European territory?",
    "options": [
      "15%",
      "25%",
      "34%",
      "42%"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Treaty of Brest-Litovsk cost Russia about 34% of its European territory, including Ukraine, Belarus, and the Baltic states.",
    "detailedExplanation": "The Treaty of Brest-Litovsk, signed on March 3, 1918, between Soviet Russia and the Central Powers, officially ended Russia's participation in World War I. The harsh terms imposed by Germany resulted in Russia losing approximately 34% of its European territory, 32% of its agricultural land, 54% of its industrial enterprises, and 89% of its coal mines. The lost territories included Ukraine, Belarus, Finland, Estonia, Latvia, Lithuania, and parts of Poland. This massive territorial loss was one of the most significant geopolitical changes of the war, though many of these territories were later reclaimed by the Soviet Union.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Brest-Litovsk",
    "citationTitle": "Wikipedia: Treaty of Brest-Litovsk"
  },
  {
    "id": "914eb6fc-2fd5-4819-b93b-d742325962e0",
    "text": "Which specific German diplomatic proposal, intercepted and decoded by British intelligence in January 1917, suggested that Mexico should attack the United States to reclaim Texas, New Mexico, and Arizona?",
    "options": [
      "The Willy-Nicky Telegrams",
      "The Zimmermann Telegram",
      "The Schlieffen Correspondence",
      "The Bethmann-Hollweg Note"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "hard",
    "explanation": "The Zimmermann Telegram was a secret diplomatic communication from German Foreign Secretary Arthur Zimmermann proposing a military alliance with Mexico against the United States.",
    "detailedExplanation": "The Zimmermann Telegram was a coded message sent in January 1917 from German Foreign Secretary Arthur Zimmermann to the German ambassador in Mexico. It proposed that if the United States entered World War I against Germany, Mexico should join as Germany's ally and attack the U.S. to reclaim the territories of Texas, New Mexico, and Arizona. British cryptographers in Room 40 intercepted and decoded the telegram, and its publication in American newspapers in March 1917 caused public outrage and significantly contributed to the U.S. decision to enter the war against Germany in April 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zimmermann_Telegram",
    "citationTitle": "Wikipedia: Zimmermann Telegram"
  }
]