[
  {
    "id": "c1d6bbe4-0c46-4f7f-8726-34eb5e0fb8a3",
    "text": "Which ship's sinking in 1915 helped turn American public opinion against Germany?",
    "options": [
      "RMS Titanic",
      "RMS Lusitania",
      "HMS Britannic",
      "SS Andrea Doria"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The RMS Lusitania was torpedoed by a German U-boat in May 1915, killing 1,198 passengers including 128 Americans.",
    "detailedExplanation": "The sinking of the RMS Lusitania on May 7, 1915, by German submarine U-20 off the coast of Ireland was a pivotal moment in World War I. The passenger liner was traveling from New York to Liverpool when it was struck by a single torpedo. The ship sank in just 18 minutes, killing 1,198 of the 1,959 people aboard, including 128 American citizens. This event significantly shifted American public opinion against Germany and contributed to the eventual U.S. entry into the war in 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sinking_of_the_RMS_Lusitania",
    "citationTitle": "Wikipedia: Sinking of the RMS Lusitania"
  },
  {
    "id": "a99838a3-9470-4f82-895a-3c9b68aad5fc",
    "text": "What was the name of the failed Allied campaign to open a new front in the Ottoman Empire?",
    "options": [
      "Operation Barbarossa",
      "Gallipoli Campaign",
      "Battle of Jutland",
      "Siege of Kut"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Gallipoli Campaign (1915-1916) was an unsuccessful Allied attempt to capture the Dardanelles strait and Constantinople.",
    "detailedExplanation": "The Gallipoli Campaign, also known as the Dardanelles Campaign, was a joint British and French operation launched in 1915 to capture the Ottoman capital of Constantinople and secure a sea route to Russia. The campaign began with a naval assault in February 1915, followed by amphibious landings on the Gallipoli Peninsula in April. Despite months of fighting and heavy casualties on both sides, the Allied forces were unable to break through Ottoman defenses and were eventually evacuated in January 1916. The campaign is particularly remembered in Australia and New Zealand as a defining moment in their national identities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gallipoli_campaign",
    "citationTitle": "Wikipedia: Gallipoli Campaign"
  },
  {
    "id": "d11995c8-53f2-4cf6-b7e5-980041c8c7ef",
    "text": "Which battle is considered the bloodiest single day in British military history?",
    "options": [
      "Battle of Verdun",
      "Battle of the Somme",
      "Battle of Passchendaele",
      "Battle of Tannenberg"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The first day of the Battle of the Somme (July 1, 1916) saw nearly 60,000 British casualties, including over 19,000 deaths.",
    "detailedExplanation": "The Battle of the Somme began on July 1, 1916, with a massive British offensive intended to break through German lines on the Western Front. The first day became a catastrophe for the British forces, with nearly 60,000 casualties, including 19,240 deaths and 35,493 wounded. Many of the soldiers were volunteers from the 'Pals Battalions' - units composed of men from the same towns or professions who had enlisted together. The battle continued until November 1916, ultimately resulting in over one million casualties from all sides combined, while achieving only limited territorial gains.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_the_Somme",
    "citationTitle": "Wikipedia: Battle of the Somme"
  },
  {
    "id": "e42be017-8fc6-443b-9a08-9440f793a396",
    "text": "What was the name of Germany's strategy to quickly defeat France before turning to fight Russia?",
    "options": [
      "Blitzkrieg",
      "Schlieffen Plan",
      "Operation Sea Lion",
      "Barbarossa Plan"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Schlieffen Plan was Germany's pre-war strategy to avoid fighting on two fronts by quickly defeating France through Belgium.",
    "detailedExplanation": "The Schlieffen Plan was developed by German General Alfred von Schlieffen in the early 1900s as a solution to Germany's potential two-front war problem. The plan called for a rapid invasion of France through Belgium, capturing Paris within six weeks, before Russia could fully mobilize its forces in the east. However, the plan failed due to stronger than expected Belgian and French resistance, the rapid mobilization of British forces, and logistical challenges. The failure of the Schlieffen Plan led to the stalemate of trench warfare on the Western Front and the prolonged conflict that Germany had hoped to avoid.",
    "citationUrl": "https://en.wikipedia.org/wiki/Schlieffen_Plan",
    "citationTitle": "Wikipedia: Schlieffen Plan"
  },
  {
    "id": "cc363808-25a1-4dbe-9953-fda8d8e13a9d",
    "text": "Which event directly triggered the United States' entry into World War I?",
    "options": [
      "Sinking of the Lusitania",
      "Zimmermann Telegram",
      "Russian Revolution",
      "German invasion of Belgium"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Zimmermann Telegram, intercepted in 1917, revealed Germany's attempt to form an alliance with Mexico against the United States.",
    "detailedExplanation": "The Zimmermann Telegram was a secret diplomatic communication sent by German Foreign Secretary Arthur Zimmermann to Mexico in January 1917. The telegram proposed a military alliance between Germany and Mexico in the event that the United States entered World War I against Germany. In return, Germany promised to help Mexico recover the territories of Texas, New Mexico, and Arizona. British intelligence intercepted and decoded the telegram, then shared it with the United States. When the telegram was published in American newspapers in March 1917, it caused public outrage and helped convince Congress to declare war on Germany on April 6, 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zimmermann_Telegram",
    "citationTitle": "Wikipedia: Zimmermann Telegram"
  },
  {
    "id": "59536b4e-35ac-43ab-a41b-9181b319cf80",
    "text": "In which year did Russia sign a separate peace treaty with Germany, leaving the war?",
    "options": [
      "1916",
      "1917",
      "1918",
      "1919"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Russia signed the Treaty of Brest-Litovsk with Germany in March 1918, following the Bolshevik Revolution.",
    "detailedExplanation": "Following the October Revolution of 1917, the new Bolshevik government under Vladimir Lenin sought to withdraw Russia from World War I to focus on internal affairs and the ongoing civil war. After months of negotiations, Russia signed the Treaty of Brest-Litovsk with Germany and its allies on March 3, 1918. The treaty was extremely harsh for Russia, requiring them to give up significant territories including Poland, Finland, the Baltic states, and parts of Belarus and Ukraine. This separate peace allowed Germany to transfer troops from the Eastern Front to launch their final offensive on the Western Front, though it ultimately came too late to change the war's outcome.",
    "citationUrl": "https://en.wikipedia.org/wiki/Treaty_of_Brest-Litovsk",
    "citationTitle": "Wikipedia: Treaty of Brest-Litovsk"
  },
  {
    "id": "c8d0e539-28d0-4538-8741-5474f3684692",
    "text": "What was the name of the final German offensive on the Western Front in 1918?",
    "options": [
      "Operation Michael",
      "Spring Offensive",
      "Kaiserschlacht",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The 1918 German offensive was known by all these names - Operation Michael was the first phase, Spring Offensive described the timing, and Kaiserschlacht means 'Kaiser's Battle.'",
    "detailedExplanation": "Germany's final major offensive of World War I began on March 21, 1918, and was known by several names. 'Operation Michael' was the codename for the first and largest phase of the offensive, 'Spring Offensive' described its timing, and 'Kaiserschlacht' (meaning 'Kaiser's Battle') reflected its importance as Germany's last chance for victory. The offensive was launched after Russia's exit from the war allowed Germany to transfer 500,000 troops from the Eastern Front. Despite initial successes and territorial gains, the offensive ultimately failed due to overextended supply lines, exhausted troops, and strong Allied resistance. The failure of this offensive marked the beginning of Germany's final collapse.",
    "citationUrl": "https://en.wikipedia.org/wiki/German_spring_offensive",
    "citationTitle": "Wikipedia: German Spring Offensive"
  },
  {
    "id": "f57248ed-304d-4faf-9cad-a56c5e215189",
    "text": "At what time on what date did the armistice ending World War I take effect?",
    "options": [
      "11 AM on November 11, 1918",
      "12 PM on November 10, 1918",
      "6 AM on November 12, 1918",
      "9 AM on December 11, 1918"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The armistice took effect at 11 AM on November 11, 1918 - the 11th hour of the 11th day of the 11th month.",
    "detailedExplanation": "The Armistice of Compiègne was signed in a railway carriage in the Forest of Compiègne, France, at 5:45 AM on November 11, 1918, but it didn't take effect until 11:00 AM the same day. This created the famous phrase 'the 11th hour of the 11th day of the 11th month.' The six-hour delay was intended to allow time for the news to reach all front-line units. Tragically, fighting continued right up until 11 AM, with approximately 11,000 casualties occurring on the final day. This date became known as Armistice Day and is still commemorated as Veterans Day in the United States and Remembrance Day in Commonwealth countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Armistice_of_11_November_1918",
    "citationTitle": "Wikipedia: Armistice of 11 November 1918"
  },
  {
    "id": "bafc5fe3-32a0-42ed-af35-95eab84bb9d4",
    "text": "Which event is widely considered to have triggered the start of World War I?",
    "options": [
      "The sinking of the Lusitania",
      "The assassination of Archduke Franz Ferdinand",
      "Germany's invasion of Belgium",
      "The Zimmermann Telegram"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The assassination of Archduke Franz Ferdinand of Austria-Hungary in Sarajevo on June 28, 1914, triggered the chain of events that led to World War I.",
    "detailedExplanation": "On June 28, 1914, Archduke Franz Ferdinand, heir to the Austro-Hungarian throne, was assassinated in Sarajevo by Gavrilo Princip, a Bosnian Serb nationalist. This event triggered a chain reaction of alliances and declarations of war that escalated into a global conflict. Austria-Hungary declared war on Serbia, Russia mobilized to support Serbia, Germany declared war on Russia, and the complex web of European alliances drew most major powers into the war.",
    "citationUrl": "https://en.wikipedia.org/wiki/Assassination_of_Archduke_Franz_Ferdinand",
    "citationTitle": "Wikipedia: Assassination of Archduke Franz Ferdinand"
  },
  {
    "id": "1b20be84-cc69-493a-8d31-37ff4f49c3ea",
    "text": "In which year did the United States officially enter World War I?",
    "options": [
      "1915",
      "1916",
      "1917",
      "1918"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The United States declared war on Germany on April 6, 1917, officially entering World War I.",
    "detailedExplanation": "The United States maintained neutrality for the first three years of World War I, but several factors led to their entry in 1917. These included Germany's resumption of unrestricted submarine warfare, the infamous Zimmermann Telegram proposing a German-Mexican alliance against the US, and the sinking of American merchant ships. President Woodrow Wilson asked Congress for a declaration of war, which was approved on April 6, 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_entry_into_World_War_I",
    "citationTitle": "Wikipedia: American entry into World War I"
  },
  {
    "id": "570efaec-4b19-4341-8161-2a4b3493ce47",
    "text": "Which battle, fought in 1916, is known as one of the bloodiest battles in human history?",
    "options": [
      "Battle of Verdun",
      "Battle of the Somme",
      "Battle of Passchendaele",
      "Battle of Tannenberg"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Battle of the Somme (July-November 1916) resulted in over one million casualties, making it one of the bloodiest battles in history.",
    "detailedExplanation": "The Battle of the Somme was fought between July 1 and November 18, 1916, near the Somme River in France. It was intended to relieve pressure on French forces at Verdun and break through German lines. The first day alone saw nearly 60,000 British casualties, the worst single day in British military history. By the battle's end, there were over one million casualties on all sides, with minimal territorial gains, exemplifying the brutal nature of trench warfare.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_the_Somme",
    "citationTitle": "Wikipedia: Battle of the Somme"
  },
  {
    "id": "ff9adf8d-0b91-4292-860d-4efea2250309",
    "text": "What was the name of the German submarine warfare policy that contributed to bringing the US into the war?",
    "options": [
      "Total submarine warfare",
      "Unrestricted submarine warfare",
      "Strategic submarine warfare",
      "Unlimited submarine warfare"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Germany's policy of 'unrestricted submarine warfare' meant attacking any ship, including neutral vessels, without warning.",
    "detailedExplanation": "Unrestricted submarine warfare was a naval warfare policy where submarines would attack merchant and passenger ships without warning, regardless of nationality. Germany first implemented this policy in 1915, suspended it after international outcry (particularly after the Lusitania sinking), but resumed it in early 1917. This policy threatened American lives and commerce, and was a major factor in the US decision to enter the war alongside the Zimmermann Telegram incident.",
    "citationUrl": "https://en.wikipedia.org/wiki/Unrestricted_submarine_warfare",
    "citationTitle": "Wikipedia: Unrestricted submarine warfare"
  },
  {
    "id": "720da992-0f88-40b1-b956-e7802ec0064e",
    "text": "Which revolution in 1917 led to Russia's eventual withdrawal from World War I?",
    "options": [
      "The February Revolution",
      "The October Revolution",
      "The December Revolution",
      "The Bolshevik Revolution"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The October Revolution (also known as the Bolshevik Revolution) brought Lenin and the Bolsheviks to power, leading to Russia's withdrawal from the war.",
    "detailedExplanation": "The October Revolution of 1917 saw Vladimir Lenin and the Bolshevik Party seize power from the Provisional Government that had been established after the February Revolution earlier that year. The Bolsheviks, who had promised 'peace, land, and bread,' were determined to end Russia's costly involvement in World War I. This led to the Treaty of Brest-Litovsk in March 1918, which formally ended Russia's participation in the war and allowed Germany to transfer troops to the Western Front.",
    "citationUrl": "https://en.wikipedia.org/wiki/October_Revolution",
    "citationTitle": "Wikipedia: October Revolution"
  },
  {
    "id": "7abcdf0b-7b4c-48f2-8080-891ecbd4e30e",
    "text": "What was the name of the famous Christmas truce that occurred during the first year of the war?",
    "options": [
      "Christmas Peace of 1914",
      "The Great Truce",
      "Christmas Truce of 1914",
      "The Silent Night Ceasefire"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Christmas Truce of 1914 was an unofficial ceasefire where soldiers from opposing sides met in no man's land to exchange gifts and play football.",
    "detailedExplanation": "The Christmas Truce of 1914 occurred along various parts of the Western Front during Christmas Eve and Christmas Day. British and German soldiers, and in some areas French soldiers, spontaneously ceased fighting and emerged from their trenches to meet in no man's land. They exchanged gifts, sang carols together, and famously played football matches. This remarkable event demonstrated the humanity that persisted even in the brutal conditions of trench warfare, though such widespread fraternization never occurred again during the war.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christmas_truce",
    "citationTitle": "Wikipedia: Christmas truce"
  },
  {
    "id": "b5d929bd-aabf-4668-8191-7328f566a6df",
    "text": "Which military innovation was first used effectively in large numbers during World War I?",
    "options": [
      "Aircraft carriers",
      "Poison gas",
      "Machine guns",
      "Artillery"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Poison gas was first used effectively on a large scale during WWI, beginning with the Germans at the Second Battle of Ypres in 1915.",
    "detailedExplanation": "While chemical weapons had been used sporadically before, World War I saw the first large-scale, systematic use of poison gas as a weapon of war. The Germans first used chlorine gas effectively at the Second Battle of Ypres in April 1915, creating a gap in Allied lines. This led to an escalating chemical arms race, with both sides developing increasingly deadly gases like phosgene and mustard gas, as well as protective equipment like gas masks. The horrific effects of chemical weapons led to international efforts to ban their use after the war.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chemical_weapons_in_World_War_I",
    "citationTitle": "Wikipedia: Chemical weapons in World War I"
  },
  {
    "id": "95c8b411-dc40-4cdd-bc2c-56fc882b9530",
    "text": "At what time did the Armistice ending World War I officially take effect?",
    "options": [
      "11 AM on November 11, 1918",
      "12 PM on November 11, 1918",
      "11 PM on November 10, 1918",
      "6 AM on November 11, 1918"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Armistice took effect at 11 AM on November 11, 1918 - the 11th hour of the 11th day of the 11th month.",
    "detailedExplanation": "The Armistice of Compiègne was signed at 5 AM on November 11, 1918, in a railway carriage in the Forest of Compiègne, France, but it was agreed that hostilities would cease at 11 AM the same day. This created the famous symbolism of the 11th hour of the 11th day of the 11th month. The timing was chosen to allow for the news to spread to all fronts and for commanders to inform their troops. This moment is still commemorated annually as Armistice Day or Veterans Day in many countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Armistice_of_11_November_1918",
    "citationTitle": "Wikipedia: Armistice of 11 November 1918"
  },
  {
    "id": "e0399942-d3a1-43a3-a992-b6ebf9b20e59",
    "text": "Which assassination in June 1914 is widely considered the immediate trigger that sparked World War I?",
    "options": [
      "Archduke Franz Ferdinand of Austria-Hungary",
      "Tsar Nicholas II of Russia",
      "Kaiser Wilhelm II of Germany",
      "King George V of Britain"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The assassination of Archduke Franz Ferdinand by Gavrilo Princip in Sarajevo on June 28, 1914, triggered the chain of events leading to WWI.",
    "detailedExplanation": "Archduke Franz Ferdinand, heir to the Austro-Hungarian throne, was assassinated by Bosnian Serb nationalist Gavrilo Princip in Sarajevo on June 28, 1914. This event set off a chain reaction of alliances and declarations of war that ultimately led to World War I. Austria-Hungary declared war on Serbia, Russia mobilized to support Serbia, Germany declared war on Russia, and the alliance system pulled most of Europe into the conflict within weeks.",
    "citationUrl": "https://en.wikipedia.org/wiki/Assassination_of_Archduke_Franz_Ferdinand",
    "citationTitle": "Wikipedia: Assassination of Archduke Franz Ferdinand"
  },
  {
    "id": "4cb6ddf6-8881-4ec6-b303-1896520a0709",
    "text": "The Battle of the Somme (1916) was notable for which grim military milestone?",
    "options": [
      "First use of poison gas in warfare",
      "Heaviest single-day casualties in British military history",
      "First aerial dogfight between fighter planes",
      "Longest continuous artillery bombardment of the war"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "On July 1, 1916, the first day of the Battle of the Somme, the British Army suffered nearly 60,000 casualties, including about 20,000 deaths.",
    "detailedExplanation": "The Battle of the Somme began on July 1, 1916, and became infamous for the catastrophic losses suffered by British forces on the first day. Despite a week-long artillery bombardment intended to destroy German defenses, the attack failed disastrously. The British Army suffered nearly 60,000 casualties on that single day, with approximately 20,000 soldiers killed, making it the bloodiest day in British military history. The battle continued for months, ultimately resulting in over one million casualties for minimal territorial gain.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_the_Somme",
    "citationTitle": "Wikipedia: Battle of the Somme"
  },
  {
    "id": "9c069f09-3b1d-42f0-bd3f-8e25b3475ea5",
    "text": "What was the name of the German military strategy that aimed to quickly defeat France before turning to fight Russia?",
    "options": [
      "Operation Barbarossa",
      "The Schlieffen Plan",
      "Plan XVII",
      "The Hindenburg Line"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Schlieffen Plan was Germany's pre-war strategy to avoid fighting on two fronts by quickly defeating France through Belgium before Russia could fully mobilize.",
    "detailedExplanation": "Named after German Field Marshal Alfred von Schlieffen, the Schlieffen Plan was Germany's strategic blueprint for fighting a two-front war. The plan called for a rapid offensive through Belgium to encircle and defeat French forces within six weeks, before Russia could fully mobilize its larger but slower army. However, the plan failed due to stronger than expected resistance from Belgium and France, faster Russian mobilization, and logistical difficulties. The failure of this plan led to the prolonged trench warfare that characterized much of World War I on the Western Front.",
    "citationUrl": "https://en.wikipedia.org/wiki/Schlieffen_Plan",
    "citationTitle": "Wikipedia: Schlieffen Plan"
  },
  {
    "id": "f3f43ff7-3426-4aa0-8e7b-73724bc30799",
    "text": "The Zimmermann Telegram, intercepted by British intelligence in 1917, proposed an alliance between Germany and which country?",
    "options": [
      "Japan",
      "Mexico",
      "Turkey",
      "Argentina"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Zimmermann Telegram proposed a German-Mexican alliance, promising Mexico the return of Texas, New Mexico, and Arizona if they joined Germany against the United States.",
    "detailedExplanation": "The Zimmermann Telegram was a secret diplomatic communication sent by German Foreign Minister Arthur Zimmermann in January 1917. The telegram proposed that if the United States entered the war against Germany, Mexico should ally with Germany, and in return, Germany would help Mexico recover the territories of Texas, New Mexico, and Arizona that it had lost to the United States. British intelligence intercepted and decoded the telegram, then shared it with the Americans. The revelation of this telegram significantly influenced American public opinion and contributed to the U.S. decision to enter World War I in April 1917.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zimmermann_Telegram",
    "citationTitle": "Wikipedia: Zimmermann Telegram"
  }
]