[
  {
    "id": "20428df3-3f92-4cf1-8266-f160fb921b93",
    "text": "What is the name of the young lion who is the main character in Disney's 'The Lion King'?",
    "options": [
      "Mufasa",
      "Simba",
      "Scar",
      "Timon"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Simba is the young lion cub who becomes king in The Lion King.",
    "detailedExplanation": "Simba is the protagonist of Disney's 1994 animated film The Lion King. He is the son of Mufasa, the king of the Pride Lands, and goes on a journey of self-discovery after his father's death. The name 'Simba' means 'lion' in Swahili, reflecting the film's African setting and themes.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Lion_King",
    "citationTitle": "Wikipedia: The Lion King"
  },
  {
    "id": "cc47f638-7f5f-4eb4-a671-4be611c7cd19",
    "text": "In Disney's 'Snow White and the Seven Dwarfs', what does the Evil Queen ask her magic mirror?",
    "options": [
      "Who is the fairest of them all?",
      "Who is the strongest of them all?",
      "Who is the wisest of them all?",
      "Who is the richest of them all?"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Evil Queen famously asks 'Mirror, mirror on the wall, who's the fairest of them all?'",
    "detailedExplanation": "Snow White and the Seven Dwarfs, released in 1937, was Disney's first full-length animated feature film. The Evil Queen's iconic question to her magic mirror - 'Mirror, mirror on the wall, who's the fairest of them all?' - is one of the most recognizable lines in Disney history and drives the main plot of the story when the mirror reveals that Snow White has become the fairest.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_film)",
    "citationTitle": "Wikipedia: Snow White and the Seven Dwarfs"
  },
  {
    "id": "94ad091d-3fd7-4ddb-a584-23e3f42ea0b2",
    "text": "What type of animal is Sebastian in Disney's 'The Little Mermaid'?",
    "options": [
      "Fish",
      "Octopus",
      "Crab",
      "Seahorse"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sebastian is a red crab who serves as King Triton's advisor and Ariel's reluctant guardian.",
    "detailedExplanation": "Sebastian is a red Jamaican crab in Disney's 1989 animated film The Little Mermaid. Voiced by Samuel E. Wright, Sebastian serves as the court composer for King Triton and is tasked with watching over Ariel. He is known for his memorable musical numbers including 'Under the Sea' and 'Kiss the Girl', and his Caribbean accent adds humor and charm to the character.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Little_Mermaid_(1989_film)",
    "citationTitle": "Wikipedia: The Little Mermaid"
  },
  {
    "id": "80698904-d074-44c0-a6dc-4c96f92f006f",
    "text": "In Disney's 'Beauty and the Beast', what is the name of Belle's father?",
    "options": [
      "Maurice",
      "Gaston",
      "Lumiere",
      "Cogsworth"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Maurice is Belle's eccentric inventor father who gets lost in the forest and captured by the Beast.",
    "detailedExplanation": "Maurice is Belle's father in Disney's 1991 animated film Beauty and the Beast. He is portrayed as an absent-minded but loving inventor who becomes lost in the forest while traveling to a fair to present his latest invention. His capture by the Beast sets the main plot in motion when Belle sacrifices herself to free her father, ultimately leading to the breaking of the Beast's curse.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beauty_and_the_Beast_(1991_film)",
    "citationTitle": "Wikipedia: Beauty and the Beast"
  },
  {
    "id": "0b500419-3b74-4d43-9163-1059dc0f3c2a",
    "text": "What is the name of the toy cowboy in Disney-Pixar's 'Toy Story'?",
    "options": [
      "Buzz Lightyear",
      "Woody",
      "Rex",
      "Mr. Potato Head"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Woody is the toy cowboy and Andy's favorite toy before Buzz Lightyear arrives.",
    "detailedExplanation": "Woody is the main protagonist of Disney-Pixar's Toy Story franchise, first appearing in the 1995 film. Voiced by Tom Hanks, Woody is a pull-string cowboy doll who is Andy's favorite toy until the space ranger Buzz Lightyear arrives. The character is based on the classic Western TV show 'Woody's Roundup' and represents themes of loyalty, friendship, and accepting change throughout the series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toy_Story",
    "citationTitle": "Wikipedia: Toy Story"
  },
  {
    "id": "76d5eaa3-969f-44b2-954d-c4d9ca837a86",
    "text": "In Disney's 'Frozen', what is the name of Elsa's younger sister?",
    "options": [
      "Anna",
      "Ariel",
      "Aurora",
      "Alice"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Anna is Elsa's optimistic younger sister and the other main protagonist of Frozen.",
    "detailedExplanation": "Princess Anna is one of the two main protagonists in Disney's 2013 animated film Frozen, alongside her older sister Queen Elsa. Voiced by Kristen Bell, Anna is characterized as fearless, optimistic, and determined to reconnect with her sister after years of separation. Her journey to find Elsa and save their kingdom of Arendelle forms the central plot of the movie, ultimately teaching audiences about the power of true love between siblings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frozen_(2013_film)",
    "citationTitle": "Wikipedia: Frozen"
  },
  {
    "id": "fa7560a7-2119-4bf7-abe4-65e0fc638499",
    "text": "What does Pinocchio's nose do when he tells a lie?",
    "options": [
      "It turns red",
      "It grows longer",
      "It falls off",
      "It starts glowing"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Pinocchio's nose grows longer every time he tells a lie, serving as a visual representation of dishonesty.",
    "detailedExplanation": "In Disney's 1940 animated film Pinocchio, the wooden puppet's nose grows longer whenever he tells a lie, making his dishonesty immediately apparent. This iconic feature, adapted from Carlo Collodi's original 1883 Italian story, serves as both a comedic element and a moral lesson about the consequences of lying. The growing nose has become one of the most recognizable symbols in popular culture for detecting lies or dishonesty.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pinocchio_(1940_film)",
    "citationTitle": "Wikipedia: Pinocchio"
  },
  {
    "id": "32416066-f0b8-4ef9-a477-3cd20c93d374",
    "text": "In Disney's 'Aladdin', what is the name of Aladdin's pet monkey?",
    "options": [
      "Iago",
      "Rajah",
      "Abu",
      "Jafar"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Abu is Aladdin's loyal pet monkey who accompanies him on his adventures.",
    "detailedExplanation": "Abu is Aladdin's kleptomaniac pet monkey in Disney's 1992 animated film Aladdin. Voiced by Frank Welker, Abu serves as Aladdin's partner in crime during their street thief days and remains his loyal companion throughout their magical adventures. The character provides comic relief and demonstrates unwavering friendship, though his mischievous nature and love of shiny objects often gets the duo into trouble.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aladdin_(1992_Disney_film)",
    "citationTitle": "Wikipedia: Aladdin"
  },
  {
    "id": "5f7023a0-4521-431f-b8b4-00c9482e4985",
    "text": "What is the name of the young lion who becomes king in Disney's 'The Lion King'?",
    "options": [
      "Simba",
      "Mufasa",
      "Scar",
      "Timon"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Simba is the main protagonist who grows from a cub to become king.",
    "detailedExplanation": "Simba is the central character of Disney's 1994 animated classic 'The Lion King'. He begins as a young lion cub who is heir to the Pride Rock throne, but flees after his father Mufasa's death. Throughout the film, Simba grows up in exile before eventually returning to reclaim his rightful place as king of the Pride Lands.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Lion_King",
    "citationTitle": "Wikipedia: The Lion King"
  },
  {
    "id": "49ed284d-e335-462d-9de1-a184df15757e",
    "text": "In 'Snow White and the Seven Dwarfs', which dwarf is always sleepy?",
    "options": [
      "Grumpy",
      "Sleepy",
      "Happy",
      "Dopey"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sleepy is the dwarf characterized by his constant drowsiness.",
    "detailedExplanation": "In Disney's first full-length animated feature film 'Snow White and the Seven Dwarfs' (1937), each of the seven dwarfs has a distinct personality reflected in their names. Sleepy is perpetually drowsy and often seen yawning or nodding off. The other dwarfs are Doc, Grumpy, Happy, Sneezy, Bashful, and Dopey, each with their own defining characteristics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_film)",
    "citationTitle": "Wikipedia: Snow White and the Seven Dwarfs"
  },
  {
    "id": "827b7120-c045-4f95-a1b2-e728462a6953",
    "text": "What type of animal is Sebastian in 'The Little Mermaid'?",
    "options": [
      "Fish",
      "Octopus",
      "Crab",
      "Seahorse"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sebastian is a red crab who serves as King Triton's court composer.",
    "detailedExplanation": "Sebastian is a Caribbean crab in Disney's 1989 animated film 'The Little Mermaid'. He serves as the court composer for King Triton and is tasked with watching over Princess Ariel. Sebastian is known for his distinctive Jamaican accent and performs memorable musical numbers including 'Under the Sea' and 'Kiss the Girl'. He often finds himself reluctantly helping Ariel in her adventures.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Little_Mermaid_(1989_film)",
    "citationTitle": "Wikipedia: The Little Mermaid (1989 film)"
  },
  {
    "id": "7484a67d-ca28-47b1-8fe5-a17804387957",
    "text": "In 'Beauty and the Beast', what is the name of Belle's father?",
    "options": [
      "Maurice",
      "Gaston",
      "Lumiere",
      "Cogsworth"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Maurice is Belle's eccentric inventor father who gets lost in the forest.",
    "detailedExplanation": "Maurice is Belle's father in Disney's 1991 animated film 'Beauty and the Beast'. He is portrayed as an eccentric but loving inventor who cares deeply for his daughter. Maurice becomes lost in the woods while traveling to a fair and seeks shelter in the Beast's castle, where he is imprisoned. This event sets the main plot in motion when Belle arrives to rescue her father and takes his place as the Beast's prisoner.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beauty_and_the_Beast_(1991_film)",
    "citationTitle": "Wikipedia: Beauty and the Beast (1991 film)"
  },
  {
    "id": "3c4b5315-d755-416d-ae78-0c36293c3f53",
    "text": "What does Cinderella's fairy godmother turn into a carriage?",
    "options": [
      "Apple",
      "Pumpkin",
      "Watermelon",
      "Cabbage"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Fairy Godmother transforms a pumpkin into Cinderella's magical carriage.",
    "detailedExplanation": "In Disney's 1950 animated film 'Cinderella', the Fairy Godmother uses her magic wand to transform a pumpkin from Cinderella's garden into an elegant carriage so she can attend the royal ball. This transformation is one of the most iconic scenes in Disney animation, accompanied by the famous phrase 'Bibbidi-Bobbidi-Boo'. The magic is temporary and the carriage turns back into a pumpkin at midnight.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cinderella_(1950_film)",
    "citationTitle": "Wikipedia: Cinderella (1950 film)"
  },
  {
    "id": "0a187292-2092-4a0e-a412-444158163e6a",
    "text": "In 'Aladdin', what is the name of Jasmine's pet tiger?",
    "options": [
      "Abu",
      "Iago",
      "Rajah",
      "Jafar"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Rajah is Princess Jasmine's loyal pet tiger and companion.",
    "detailedExplanation": "Rajah is Princess Jasmine's pet tiger in Disney's 1992 animated film 'Aladdin'. He serves as both her companion and protector within the palace walls. Rajah is initially suspicious of Aladdin when he first meets Jasmine, showing his protective nature. The tiger is portrayed as intelligent and loyal, often acting as Jasmine's confidant and helping her in various situations throughout the film.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aladdin_(1992_Disney_film)",
    "citationTitle": "Wikipedia: Aladdin (1992 Disney film)"
  },
  {
    "id": "3d92a117-98b6-4603-aa45-ac15ff93b871",
    "text": "What is the name of Bambi's rabbit friend?",
    "options": [
      "Flower",
      "Thumper",
      "Friend Owl",
      "Faline"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Thumper is the young rabbit who becomes one of Bambi's best friends.",
    "detailedExplanation": "Thumper is a young rabbit in Disney's 1942 animated film 'Bambi'. He becomes one of Bambi's closest friends along with Flower the skunk. Thumper gets his name from his habit of thumping his hind foot, and he's known for teaching Bambi important lessons about forest life. He's characterized as energetic, friendly, and sometimes mischievous, often repeating his father's wisdom such as 'If you can't say something nice, don't say nothing at all.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Bambi",
    "citationTitle": "Wikipedia: Bambi"
  },
  {
    "id": "c3a1340a-c39e-4b80-a6eb-75d12998ea9b",
    "text": "In 'The Jungle Book', what kind of animal is Baloo?",
    "options": [
      "Tiger",
      "Panther",
      "Bear",
      "Elephant"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Baloo is a laid-back brown bear who teaches Mowgli about the 'bare necessities' of life.",
    "detailedExplanation": "Baloo is a brown bear in Disney's 1967 animated film 'The Jungle Book'. He serves as a father figure and teacher to the man-cub Mowgli, introducing him to a carefree philosophy of life through the famous song 'The Bare Necessities'. Baloo is portrayed as fun-loving, easy-going, and protective of Mowgli, often clashing with the more serious panther Bagheera about what's best for the young boy's future.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Jungle_Book_(1967_film)",
    "citationTitle": "Wikipedia: The Jungle Book (1967 film)"
  },
  {
    "id": "c648ea34-fd9d-4e7f-8bd4-e7d37ec9a777",
    "text": "What is the name of the young lion who becomes king in Disney's 'The Lion King' (1994)?",
    "options": [
      "Mufasa",
      "Simba",
      "Scar",
      "Timon"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Simba is the main character who grows from a young cub to become the rightful king.",
    "detailedExplanation": "Simba is the protagonist of Disney's The Lion King, released in 1994. The story follows his journey from a carefree cub who flees his kingdom after his father Mufasa's death, to his eventual return as an adult to reclaim his rightful place as king of the Pride Lands. The character was voiced by Jonathan Taylor Thomas as a cub and Matthew Broderick as an adult.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Lion_King",
    "citationTitle": "Wikipedia: The Lion King"
  },
  {
    "id": "5f8a04d3-8347-473e-afb4-6272931c50e5",
    "text": "In Disney's 'Snow White and the Seven Dwarfs' (1937), which dwarf is known for being constantly tired?",
    "options": [
      "Grumpy",
      "Sleepy",
      "Dopey",
      "Sneezy"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sleepy is the dwarf characterized by his constant drowsiness and tired demeanor.",
    "detailedExplanation": "Sleepy is one of the seven dwarfs in Disney's first full-length animated feature film, Snow White and the Seven Dwarfs, released in 1937. True to his name, Sleepy is always drowsy and often seen yawning or nodding off. Each of the seven dwarfs was given a distinct personality trait reflected in their names, and Sleepy's defining characteristic is his perpetual tiredness and laid-back nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_film)",
    "citationTitle": "Wikipedia: Snow White and the Seven Dwarfs"
  },
  {
    "id": "7f152851-1494-44fd-b194-0d66fc8d7a02",
    "text": "What does Cinderella's fairy godmother turn into a carriage to help her get to the ball?",
    "options": [
      "A watermelon",
      "A pumpkin",
      "A coconut",
      "An apple"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The fairy godmother magically transforms a pumpkin into an elegant carriage for Cinderella.",
    "detailedExplanation": "In Disney's Cinderella (1950), the fairy godmother performs her famous magical transformation scene where she turns a pumpkin from Cinderella's garden into a beautiful golden carriage. This iconic scene is accompanied by the song 'Bibbidi-Bobbidi-Boo' and includes other transformations such as mice into horses and a dog into a footman. The pumpkin carriage has become one of the most recognizable symbols associated with the Cinderella story.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cinderella_(1950_film)",
    "citationTitle": "Wikipedia: Cinderella (1950 film)"
  },
  {
    "id": "8fbe24f6-16d9-4b56-b2c5-ceb24eea9a06",
    "text": "In Disney's 'The Little Mermaid' (1989), what is the name of Ariel's best friend who is a fish?",
    "options": [
      "Sebastian",
      "Scuttle",
      "Flounder",
      "Ursula"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Flounder is Ariel's loyal best friend, a tropical fish who accompanies her on adventures.",
    "detailedExplanation": "Flounder is Ariel's closest friend in Disney's The Little Mermaid, released in 1989. Despite his name suggesting he's a flounder, he's actually designed as a tropical angelfish with yellow and blue coloring. Flounder is characterized as loyal but timid, often reluctantly following Ariel on her adventures to the surface world. He serves as Ariel's confidant and moral support throughout the film, though he's often nervous about her risky escapades.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Little_Mermaid_(1989_film)",
    "citationTitle": "Wikipedia: The Little Mermaid (1989 film)"
  }
]