[
  {
    "id": "3abd8bef-e454-495e-9455-353e9c7cb3bc",
    "text": "Which Disney animated film was the first to be nominated for the Academy Award for Best Picture?",
    "options": [
      "The Lion King",
      "Beauty and the Beast",
      "The Little Mermaid",
      "Aladdin"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Beauty and the Beast (1991) was the first animated film ever nominated for Best Picture.",
    "detailedExplanation": "Beauty and the Beast made history in 1992 when it became the first animated film to receive a nomination for the Academy Award for Best Picture. This groundbreaking nomination helped establish animated films as serious cinematic art and paved the way for the creation of the Best Animated Feature category in 2001.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beauty_and_the_Beast_(1991_film)",
    "citationTitle": "Wikipedia: Beauty and the Beast (1991 film)"
  },
  {
    "id": "ba2bd01f-b934-4c2f-9b51-029c5f039460",
    "text": "In which Disney film would you hear the song 'I Wanna Be Like You'?",
    "options": [
      "Tarzan",
      "The Jungle Book",
      "The Lion King",
      "Moana"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'I Wanna Be Like You' is sung by King Louie in The Jungle Book (1967).",
    "detailedExplanation": "The song 'I Wanna Be Like You' is performed by King Louie, the orangutan king, in Disney's 1967 animated classic The Jungle Book. The character was originally voiced by Louis Prima, and the song became one of the film's most memorable musical numbers, expressing King Louie's desire to become human like Mowgli.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Jungle_Book_(1967_film)",
    "citationTitle": "Wikipedia: The Jungle Book (1967 film)"
  },
  {
    "id": "c1ad2355-394d-49b0-ac31-18052c4d60af",
    "text": "What type of animal is Bambi's friend Flower?",
    "options": [
      "Rabbit",
      "Squirrel",
      "Skunk",
      "Raccoon"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Flower is a skunk who becomes one of Bambi's best friends in the forest.",
    "detailedExplanation": "In Disney's 1942 animated film Bambi, Flower is a young skunk who befriends Bambi and Thumper. The character gets his name when young Bambi mistakes him for a flower while he's hiding among actual flowers. Flower is known for his gentle, shy personality and becomes part of the core trio of friends in the film.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bambi",
    "citationTitle": "Wikipedia: Bambi"
  },
  {
    "id": "4aff418b-dd84-44b6-9ea7-056b58f1cc86",
    "text": "Which Disney princess has a pet tiger named Rajah?",
    "options": [
      "Belle",
      "Ariel",
      "Jasmine",
      "Pocahontas"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Princess Jasmine from Aladdin has a pet tiger named Rajah.",
    "detailedExplanation": "In Disney's 1992 animated film Aladdin, Princess Jasmine is accompanied by her loyal pet tiger, Rajah. The tiger serves as both her companion and protector in the palace, often acting as a guardian when unwanted suitors visit. Rajah is fiercely protective of Jasmine and shows intelligence and emotional connection throughout the film.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aladdin_(1992_Disney_film)",
    "citationTitle": "Wikipedia: Aladdin (1992 Disney film)"
  },
  {
    "id": "b64980e4-b1c6-4622-8835-2acf9da1a852",
    "text": "In Sleeping Beauty, what are the names of the three good fairies?",
    "options": [
      "Faith, Hope, and Charity",
      "Flora, Fauna, and Merryweather",
      "Rose, Lily, and Daisy",
      "Dawn, Noon, and Dusk"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The three good fairies are Flora (red), Fauna (green), and Merryweather (blue).",
    "detailedExplanation": "In Disney's 1959 animated film Sleeping Beauty, Princess Aurora is protected by three good fairies: Flora, who wears red and has leadership qualities; Fauna, who wears green and is gentle and motherly; and Merryweather, who wears blue and is the smallest but most outspoken of the three. They raise Aurora in hiding and each bestow magical gifts upon her.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sleeping_Beauty_(1959_film)",
    "citationTitle": "Wikipedia: Sleeping Beauty (1959 film)"
  },
  {
    "id": "23a3049e-30ed-4ff3-b4b8-32a2efcdbcc2",
    "text": "Which Disney animated film features the villain Scar?",
    "options": [
      "The Jungle Book",
      "The Lion King",
      "Tarzan",
      "Brother Bear"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Scar is the main antagonist in The Lion King, Simba's uncle who kills Mufasa.",
    "detailedExplanation": "Scar is the primary villain in Disney's 1994 animated film The Lion King. He is Simba's uncle and Mufasa's younger brother, who orchestrates Mufasa's death to claim the throne of Pride Rock. Voiced by Jeremy Irons, Scar is known for his manipulative nature, distinctive black mane, and scar over his left eye, which gives him his name.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Lion_King",
    "citationTitle": "Wikipedia: The Lion King"
  },
  {
    "id": "e259edb3-a385-4c9b-9865-a6bc7fb2eb75",
    "text": "What is the name of Ariel's crab companion in The Little Mermaid?",
    "options": [
      "Flounder",
      "Sebastian",
      "Scuttle",
      "Max"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sebastian is the red crab who serves as Ariel's reluctant guardian and advisor.",
    "detailedExplanation": "Sebastian is a red Jamaican crab in Disney's 1989 animated film The Little Mermaid, voiced by Samuel E. Wright. He serves as King Triton's court composer and is tasked with watching over Princess Ariel. Despite his initial reluctance, Sebastian becomes Ariel's loyal friend and helper, and performs the famous songs 'Under the Sea' and 'Kiss the Girl' in the film.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Little_Mermaid_(1989_film)",
    "citationTitle": "Wikipedia: The Little Mermaid (1989 film)"
  },
  {
    "id": "8fe7d793-f880-439b-8412-e381bb102a02",
    "text": "In which Disney film does the character Kronk appear?",
    "options": [
      "Hercules",
      "The Emperor's New Groove",
      "Atlantis: The Lost Empire",
      "Treasure Planet"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Kronk is Yzma's dim-witted but lovable henchman in The Emperor's New Groove.",
    "detailedExplanation": "Kronk appears in Disney's 2000 animated film The Emperor's New Groove, where he serves as the secondary antagonist and comic relief. Voiced by Patrick Warburton, Kronk is Yzma's henchman who is portrayed as physically strong but not very bright. Despite working for the villain, Kronk has a good heart and often shows more common sense than his evil boss, making him a fan-favorite character.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Emperor%27s_New_Groove",
    "citationTitle": "Wikipedia: The Emperor's New Groove"
  },
  {
    "id": "098db460-85ca-436e-a3d2-dc52839bd5b6",
    "text": "In Disney's 'The Lion King' (1994), what is the name of Simba's uncle who becomes king after Mufasa's death?",
    "options": [
      "Scar",
      "Jafar",
      "Hades",
      "Maleficent"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Scar is Mufasa's brother and Simba's uncle who orchestrates Mufasa's death to become king.",
    "detailedExplanation": "Scar, voiced by Jeremy Irons, serves as the main antagonist in Disney's The Lion King. He is Mufasa's jealous younger brother who conspires with the hyenas to kill Mufasa and exile Simba, allowing him to claim the throne of Pride Rock. His character is inspired by Claudius from Shakespeare's Hamlet, as The Lion King draws heavily from that play's themes and plot structure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Scar_(The_Lion_King)",
    "citationTitle": "Wikipedia: Scar (The Lion King)"
  },
  {
    "id": "427b85f3-67bb-408c-bca1-05c50f3872be",
    "text": "In 'Moana' (2016), what is the name of the demigod who helps Moana on her journey?",
    "options": [
      "Maui",
      "Kauai",
      "Lanai",
      "Oahu"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Maui is the shapeshifting demigod character voiced by Dwayne Johnson who accompanies Moana.",
    "detailedExplanation": "Maui is a legendary figure in Polynesian mythology who appears as a major character in Disney's Moana. Voiced by Dwayne 'The Rock' Johnson, Maui is portrayed as a shapeshifting demigod who stole the heart of Te Fiti, causing ecological disaster across the Pacific islands. He reluctantly helps Moana restore the heart, using his magical fishhook to transform into various animals and aid in their quest.",
    "citationUrl": "https://en.wikipedia.org/wiki/Moana_(2016_film)",
    "citationTitle": "Wikipedia: Moana (2016 film)"
  },
  {
    "id": "028b253d-9e89-4a2f-97ee-7022b75ea793",
    "text": "Which Disney film features the song 'Be Our Guest'?",
    "options": [
      "The Little Mermaid",
      "Beauty and the Beast",
      "Aladdin",
      "The Princess and the Frog"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Be Our Guest' is the elaborate dining scene song from Beauty and the Beast, performed by Lumière.",
    "detailedExplanation": "'Be Our Guest' is one of the most memorable musical numbers from Disney's Beauty and the Beast, performed primarily by Lumière (voiced by Jerry Orbach) along with the other enchanted objects in the Beast's castle. The song occurs when Belle is invited to dinner and the castle's staff puts on an elaborate musical performance to welcome her. The sequence is known for its spectacular animation and choreography, showcasing the enchanted dinnerware and furniture coming to life.",
    "citationUrl": "https://en.wikipedia.org/wiki/Be_Our_Guest",
    "citationTitle": "Wikipedia: Be Our Guest"
  },
  {
    "id": "fab29b62-3711-4c90-b380-876dc5d9e609",
    "text": "In 'Frozen' (2013), what is the name of Elsa and Anna's kingdom?",
    "options": [
      "Arendelle",
      "Corona",
      "DunBroch",
      "Motunui"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Arendelle is the fictional Scandinavian kingdom ruled by Elsa and Anna's family in Frozen.",
    "detailedExplanation": "Arendelle is the fictional Nordic kingdom that serves as the primary setting for Disney's Frozen. The kingdom is inspired by Norwegian culture and architecture, reflecting the film's Scandinavian influences. Arendelle is ruled by Elsa and Anna's parents, the King and Queen, until their death at sea, after which Elsa is crowned queen. The kingdom's name and design draw heavily from Norwegian towns and landscapes, particularly the architecture of Bergen and other coastal Norwegian cities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frozen_(2013_film)",
    "citationTitle": "Wikipedia: Frozen (2013 film)"
  },
  {
    "id": "7550e241-3daa-4f92-bfd2-2aecc274db97",
    "text": "Which Disney animated film was the studio's first to use computer-generated imagery (CGI) for an entire feature?",
    "options": [
      "Toy Story",
      "A Bug's Life",
      "Monsters, Inc.",
      "Finding Nemo"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Toy Story (1995) was Disney's first fully computer-animated feature film, produced in partnership with Pixar.",
    "detailedExplanation": "Toy Story, released in 1995, marked a revolutionary moment in animation history as Disney's first fully computer-generated animated feature film. Created through Disney's partnership with Pixar Animation Studios, the film broke new ground by abandoning traditional hand-drawn animation in favor of cutting-edge CGI technology. The movie's success not only launched the Toy Story franchise but also established computer animation as a viable and eventually dominant form of animated filmmaking, leading to Disney's eventual acquisition of Pixar in 2006.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toy_Story",
    "citationTitle": "Wikipedia: Toy Story"
  },
  {
    "id": "00d06abe-fdb0-4d13-b690-d36414e96b50",
    "text": "In 'The Jungle Book' (1967), what type of animal is King Louie?",
    "options": [
      "Gorilla",
      "Orangutan",
      "Chimpanzee",
      "Baboon"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "King Louie is an orangutan who rules the ancient ruins and wants to learn the secret of fire from Mowgli.",
    "detailedExplanation": "King Louie is portrayed as a gigantic orangutan in Disney's 1967 animated version of The Jungle Book, though this was actually a geographical impossibility since orangutans are not native to India where the story takes place. Voiced by jazz musician Louis Prima, King Louie is the self-proclaimed 'King of the Swingers' who rules over the ancient ruins. His memorable musical number 'I Wan'na Be Like You' expresses his desire to become human and learn the secret of making fire from Mowgli.",
    "citationUrl": "https://en.wikipedia.org/wiki/King_Louie",
    "citationTitle": "Wikipedia: King Louie"
  },
  {
    "id": "297dee61-c5e9-4ac8-bec0-65c159d0f2a1",
    "text": "Which Disney princess is the only one based on a real historical figure?",
    "options": [
      "Mulan",
      "Pocahontas",
      "Moana",
      "Merida"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Pocahontas is based on the real Native American woman who lived in the early 1600s in Virginia.",
    "detailedExplanation": "Pocahontas is unique among Disney princesses as she is the only one based on a documented historical figure. The real Pocahontas (born Amonute, later known as Rebecca Rolfe) was a Native American woman born around 1596, daughter of Powhatan, the paramount chief of a network of tributary tribes in the Tsenacommacah area of Virginia. While Disney's 1995 animated film takes considerable creative liberties with her story, particularly regarding her relationship with John Smith and the historical timeline, the character is ultimately rooted in actual historical records rather than folklore or literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pocahontas_(1995_film)",
    "citationTitle": "Wikipedia: Pocahontas (1995 film)"
  },
  {
    "id": "54189fdb-703e-4612-a1e9-d9e01498f6c6",
    "text": "In Disney's 'The Lion King' (1994), what is the name of Simba's uncle who serves as the main antagonist?",
    "options": [
      "Mufasa",
      "Scar",
      "Zazu",
      "Rafiki"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Scar is Simba's uncle and the main villain who kills Mufasa to become king.",
    "detailedExplanation": "Scar, voiced by Jeremy Irons, is Mufasa's younger brother and Simba's uncle in Disney's The Lion King. He serves as the primary antagonist who orchestrates Mufasa's death in a wildebeest stampede and convinces young Simba to flee the Pride Lands so he can claim the throne. His character is known for his distinctive black mane and the scar over his left eye that gives him his name.",
    "citationUrl": "https://en.wikipedia.org/wiki/Scar_(The_Lion_King)",
    "citationTitle": "Wikipedia: Scar (The Lion King)"
  },
  {
    "id": "a00f22ed-4ab1-47c6-a82d-9a73fd339e71",
    "text": "Which Disney animated film was the first to be completely created using computer animation?",
    "options": [
      "Toy Story",
      "A Bug's Life",
      "Monsters, Inc.",
      "Finding Nemo"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Toy Story (1995) was Disney-Pixar's first fully computer-animated feature film.",
    "detailedExplanation": "Toy Story, released in 1995, was a groundbreaking collaboration between Disney and Pixar that marked the first feature-length film to be entirely created using computer animation. Directed by John Lasseter, the film revolutionized animation technology and storytelling, paving the way for the modern era of CGI animation. While other options are also computer-animated Disney-Pixar films, Toy Story holds the distinction of being the pioneering first.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toy_Story",
    "citationTitle": "Wikipedia: Toy Story"
  },
  {
    "id": "843d4501-23e3-49a8-9c2f-c1eace8005d3",
    "text": "In 'Beauty and the Beast' (1991), what is the name of Belle's inventor father?",
    "options": [
      "Maurice",
      "Philippe",
      "Gaston",
      "Cogsworth"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Maurice is Belle's eccentric inventor father who gets lost in the forest and imprisoned by the Beast.",
    "detailedExplanation": "Maurice, voiced by Rex Everhart, is Belle's loving father in Disney's Beauty and the Beast. He is portrayed as an eccentric inventor who creates various contraptions, though they often malfunction. His character serves as a catalyst for the main story when he becomes lost in the forest while traveling to a fair and is subsequently imprisoned by the Beast in his castle, leading Belle to take his place as the Beast's prisoner.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beauty_and_the_Beast_(1991_film)",
    "citationTitle": "Wikipedia: Beauty and the Beast (1991 film)"
  },
  {
    "id": "b2228430-ba75-4dae-8f59-79cc03a01390",
    "text": "Which Disney animated film features the song 'When You Wish Upon a Star'?",
    "options": [
      "Snow White and the Seven Dwarfs",
      "Pinocchio",
      "Fantasia",
      "Dumbo"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'When You Wish Upon a Star' is the iconic opening song from Pinocchio (1940).",
    "detailedExplanation": "'When You Wish Upon a Star' is the Academy Award-winning song from Disney's Pinocchio (1940), composed by Leigh Harline with lyrics by Ned Washington. Performed by Cliff Edwards as the voice of Jiminy Cricket, the song has become one of Disney's most iconic and enduring pieces of music. It later became the official theme song of The Walt Disney Company and is often associated with Disney's brand identity, representing the magic and wonder of Disney storytelling.",
    "citationUrl": "https://en.wikipedia.org/wiki/When_You_Wish_Upon_a_Star",
    "citationTitle": "Wikipedia: When You Wish Upon a Star"
  },
  {
    "id": "be3a7b23-3d12-4258-bd4b-85d53abb731a",
    "text": "In 'Frozen' (2013), what is the name of the kingdom where Anna and Elsa live?",
    "options": [
      "Arendelle",
      "Corona",
      "Asgard",
      "Atlantica"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Arendelle is the fictional Scandinavian kingdom ruled by Anna and Elsa in Frozen.",
    "detailedExplanation": "Arendelle is the fictional Nordic kingdom in Disney's Frozen, inspired by Norwegian culture and architecture. The kingdom serves as the primary setting for the film, where Princess Anna and Queen Elsa live. The design of Arendelle draws heavily from Norwegian stave churches, traditional wooden architecture, and the general aesthetic of Scandinavian countries. The kingdom becomes isolated when Elsa accidentally reveals her ice powers and flees, leaving it in eternal winter until the sisters reconcile.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frozen_(2013_film)",
    "citationTitle": "Wikipedia: Frozen (2013 film)"
  }
]