[
  {
    "id": "749d1477-dbdf-4d69-b339-68ec47ac4642",
    "text": "Which fast food chain is famous for its slogan 'I'm Lovin' It'?",
    "options": [
      "Burger King",
      "McDonald's",
      "Wendy's",
      "KFC"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "McDonald's has used 'I'm Lovin' It' as their global marketing slogan since 2003.",
    "detailedExplanation": "McDonald's launched the 'I'm Lovin' It' campaign in 2003, making it one of the longest-running advertising slogans in the company's history. The campaign was created by DDB Worldwide and has been translated into multiple languages for McDonald's global operations. It replaced the previous slogan 'We Love to See You Smile' and has become synonymous with the brand worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/McDonald%27s",
    "citationTitle": "Wikipedia: McDonald's"
  },
  {
    "id": "a52e0f8e-3778-4b2b-8c6c-81afd77b692a",
    "text": "What is the signature burger at Burger King called?",
    "options": [
      "Big Mac",
      "Whopper",
      "Baconator",
      "Big King"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Whopper is Burger King's flagship hamburger product, introduced in 1957.",
    "detailedExplanation": "The Whopper was introduced by Burger King in 1957 and has remained their signature menu item ever since. It features a flame-grilled beef patty, lettuce, tomato, mayonnaise, ketchup, pickles, and onions on a sesame seed bun. The burger was created to compete with other large hamburgers on the market and has become central to Burger King's brand identity and marketing campaigns.",
    "citationUrl": "https://en.wikipedia.org/wiki/Whopper",
    "citationTitle": "Wikipedia: Whopper"
  },
  {
    "id": "ffa2b6df-889b-4f5e-9e69-882c36c113e6",
    "text": "Which fast food chain was founded by Colonel Harland Sanders?",
    "options": [
      "Popeyes",
      "Church's Chicken",
      "KFC",
      "Chick-fil-A"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Colonel Harland Sanders founded KFC (Kentucky Fried Chicken) and developed the secret recipe of 11 herbs and spices.",
    "detailedExplanation": "Kentucky Fried Chicken was founded by Colonel Harland Sanders in 1952, though he had been serving his fried chicken recipe since the 1930s. Sanders developed his famous secret recipe of 11 herbs and spices and the pressure frying technique that made KFC famous. He franchised his chicken business across the United States and eventually sold the company, but remained as a brand ambassador until his death in 1980.",
    "citationUrl": "https://en.wikipedia.org/wiki/KFC",
    "citationTitle": "Wikipedia: KFC"
  },
  {
    "id": "25039239-b523-4cbb-93b6-16a920845779",
    "text": "What type of food is Subway primarily known for?",
    "options": [
      "Hamburgers",
      "Sandwiches",
      "Pizza",
      "Tacos"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Subway is famous for its submarine sandwiches (subs) and salads, made with fresh ingredients.",
    "detailedExplanation": "Subway, founded in 1965, is the world's largest submarine sandwich chain. The restaurant is known for its customizable submarine sandwiches and salads, where customers can choose from various breads, meats, cheeses, vegetables, and condiments. Subway's marketing has long emphasized fresh ingredients and healthier fast food options, with their tagline 'Eat Fresh' becoming well-known worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Subway_(restaurant)",
    "citationTitle": "Wikipedia: Subway (restaurant)"
  },
  {
    "id": "2dc96b5a-61ba-4056-8243-3b0847a961d4",
    "text": "Which pizza chain uses the slogan 'Better Ingredients, Better Pizza'?",
    "options": [
      "Domino's",
      "Pizza Hut",
      "Papa John's",
      "Little Caesars"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Papa John's has used 'Better Ingredients, Better Pizza' as their main advertising slogan for decades.",
    "detailedExplanation": "Papa John's has built their brand identity around the slogan 'Better Ingredients, Better Pizza' since the company's early days in the 1980s. Founded by John Schnatter in 1984, the company has consistently marketed itself as offering higher quality ingredients compared to competitors, including fresh dough made daily, fresh vegetables, and premium meats. This slogan has been central to their advertising campaigns and brand positioning in the competitive pizza market.",
    "citationUrl": "https://en.wikipedia.org/wiki/Papa_John%27s_Pizza",
    "citationTitle": "Wikipedia: Papa John's Pizza"
  },
  {
    "id": "476b3ee2-787e-4f0e-b4b0-1d769ac73154",
    "text": "What is the name of McDonald's clown mascot?",
    "options": [
      "Ronald McDonald",
      "Grimace",
      "Hamburglar",
      "Mayor McCheese"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Ronald McDonald is the primary mascot of McDonald's restaurants, introduced in 1963.",
    "detailedExplanation": "Ronald McDonald was created in 1963 and has served as the chief happiness officer and primary mascot for McDonald's for over 60 years. The character was originally portrayed by Willard Scott and was designed to appeal to children and families. Ronald McDonald became the central figure in McDonald's advertising campaigns and was often featured alongside other characters from McDonaldland, including Grimace, the Hamburglar, and Mayor McCheese.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ronald_McDonald",
    "citationTitle": "Wikipedia: Ronald McDonald"
  },
  {
    "id": "a01c4fdb-6855-4cb3-92a8-4b8ed7aece38",
    "text": "Which fast food chain is known for its square-shaped hamburger patties?",
    "options": [
      "McDonald's",
      "Burger King",
      "Wendy's",
      "White Castle"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Wendy's is famous for its square hamburger patties, which the company says don't cut corners.",
    "detailedExplanation": "Wendy's has used square hamburger patties as a distinctive feature since the chain was founded by Dave Thomas in 1969. The square shape was chosen to differentiate Wendy's from competitors and became part of their marketing message that they 'don't cut corners' on quality. The square patties also allow the meat to extend beyond the edges of the round bun, making the burgers appear larger and providing a unique visual identity for the brand.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wendy%27s",
    "citationTitle": "Wikipedia: Wendy's"
  },
  {
    "id": "4fb672ff-8648-47c1-bca6-d225f080432c",
    "text": "Which Mexican fast food chain is known for its 'Fourth Meal' advertising campaign?",
    "options": [
      "Chipotle",
      "Qdoba",
      "Taco Bell",
      "Del Taco"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Taco Bell promoted 'Fourth Meal' as late-night dining, targeting customers who wanted food after traditional meal times.",
    "detailedExplanation": "Taco Bell launched the 'Fourth Meal' advertising campaign in 2006 to promote late-night dining and position themselves as the go-to option for food beyond the traditional three meals of the day. The campaign targeted young adults and night owls who might be hungry late at night or in the early morning hours. This marketing strategy helped Taco Bell capture a significant share of the late-night fast food market and reinforced their brand as being available when other options might be closed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Taco_Bell",
    "citationTitle": "Wikipedia: Taco Bell"
  },
  {
    "id": "c34e8c91-515c-479b-8d57-0ec6bc91c24e",
    "text": "In what year was the first McDonald's restaurant opened by the McDonald brothers?",
    "options": [
      "1940",
      "1955",
      "1948",
      "1962"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The McDonald brothers opened their first restaurant in 1940 in San Bernardino, California.",
    "detailedExplanation": "Richard and Maurice McDonald opened the first McDonald's restaurant in 1940 in San Bernardino, California. Initially, it was a barbecue restaurant before they revolutionized it in 1948 with their 'Speedee Service System,' which became the foundation of modern fast food. Ray Kroc later franchised the concept starting in 1955, but the original restaurant dates back to 1940.",
    "citationUrl": "https://en.wikipedia.org/wiki/McDonald%27s",
    "citationTitle": "Wikipedia: McDonald's"
  },
  {
    "id": "9d90049a-234b-4c34-9dea-59238572c2a8",
    "text": "Which fast food chain is famous for serving food in red and white checkered paper containers?",
    "options": [
      "Arby's",
      "Five Guys",
      "In-N-Out Burger",
      "White Castle"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Five Guys is known for serving their burgers and fries in distinctive red and white checkered paper containers.",
    "detailedExplanation": "Five Guys uses distinctive red and white checkered paper containers and bags as part of their brand identity. This classic diner-style packaging complements their simple, no-frills approach to burgers and fries. The red and white checkered pattern has become synonymous with the Five Guys brand since the chain's expansion in the 2000s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Five_Guys",
    "citationTitle": "Wikipedia: Five Guys"
  },
  {
    "id": "991e3bb4-82f3-4750-a179-9fd2900e1696",
    "text": "What is the main ingredient in Chipotle's guacamole that they advertise as being made fresh daily?",
    "options": [
      "Avocados",
      "Lime juice",
      "Cilantro",
      "Onions"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Avocados are the main ingredient in Chipotle's guacamole, which they prepare fresh in-store daily.",
    "detailedExplanation": "Chipotle Mexican Grill is famous for making their guacamole fresh daily in each restaurant using ripe avocados as the primary ingredient. The company has built much of their marketing around the freshness of their ingredients, particularly highlighting how their guacamole is made from scratch each day rather than from pre-made mixtures or preservatives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chipotle_Mexican_Grill",
    "citationTitle": "Wikipedia: Chipotle Mexican Grill"
  },
  {
    "id": "ba02b63c-4036-44ae-9720-72c8bb7edbcf",
    "text": "Which fast food chain originated in Canada and is famous for its coffee and donuts?",
    "options": [
      "Dunkin'",
      "Tim Hortons",
      "Krispy Kreme",
      "Second Cup"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Tim Hortons was founded in Canada in 1964 and became famous for its coffee and donuts.",
    "detailedExplanation": "Tim Hortons was founded in Hamilton, Ontario, Canada in 1964 by former hockey player Tim Horton. The chain became a Canadian cultural icon, known primarily for its coffee and donuts, though it has expanded its menu significantly over the years. Tim Hortons is often considered as synonymous with Canadian culture as hockey or maple syrup, with locations found throughout Canada and expanding internationally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tim_Hortons",
    "citationTitle": "Wikipedia: Tim Hortons"
  },
  {
    "id": "683c729e-cc4c-4c72-806a-6f81bac7748d",
    "text": "What does the 'A&W' in the A&W root beer restaurant chain stand for?",
    "options": [
      "Allen & Wright",
      "American & Western",
      "Armstrong & Wade",
      "Allen & Wright"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "A&W stands for Allen & Wright, named after founders Roy W. Allen and Frank Wright.",
    "detailedExplanation": "A&W Root Beer was founded in 1919 by Roy W. Allen, and the name originally stood for just 'Allen.' When Frank Wright became a partner in 1922, the name was changed to A&W to represent both Allen and Wright. The company became famous for its root beer served in frosted mugs and eventually expanded into a full fast food restaurant chain known for root beer floats and burgers.",
    "citationUrl": "https://en.wikipedia.org/wiki/A%26W_Restaurants",
    "citationTitle": "Wikipedia: A&W Restaurants"
  },
  {
    "id": "b06ed5b3-f74d-4daf-8742-b4699d20ab51",
    "text": "Which fast food chain is known for never freezing their beef patties?",
    "options": [
      "McDonald's",
      "Burger King",
      "Wendy's",
      "Carl's Jr."
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Wendy's has long advertised that they use fresh, never frozen beef patties for their hamburgers.",
    "detailedExplanation": "Wendy's has made 'fresh, never frozen beef' a cornerstone of their marketing and brand identity for decades. The company has consistently promoted this as a key differentiator from competitors, emphasizing that their beef patties are delivered fresh to restaurants and never frozen, which they claim results in better taste and quality compared to frozen patties used by many other fast food chains.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wendy%27s",
    "citationTitle": "Wikipedia: Wendy's"
  },
  {
    "id": "9b22783b-1426-4f70-a8b0-6cd16d1b7182",
    "text": "Which fast food chain is famous for its 'Secret Menu' that includes items like 'Animal Style' burgers?",
    "options": [
      "In-N-Out Burger",
      "Whataburger",
      "Shake Shack",
      "Culver's"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "In-N-Out Burger is famous for its 'Secret Menu' which includes the popular 'Animal Style' preparation.",
    "detailedExplanation": "In-N-Out Burger has cultivated a cult following partly due to its famous 'Secret Menu' or 'Not So Secret Menu.' The most popular item is the 'Animal Style' burger, which includes mustard-cooked beef patty, pickles, extra spread, and grilled onions. Other secret menu items include 'Protein Style' (lettuce wrap), '3x3' or '4x4' (multiple patties and cheese), and 'Animal Style' fries. This secret menu has become a significant part of the chain's culture and appeal.",
    "citationUrl": "https://en.wikipedia.org/wiki/In-N-Out_Burger",
    "citationTitle": "Wikipedia: In-N-Out Burger"
  },
  {
    "id": "65620412-ed79-4548-8a75-fbc928264bfc",
    "text": "Which fried chicken chain was originally called 'Pete's Super Submarines' before changing its name?",
    "options": [
      "Popeyes",
      "Church's Chicken",
      "Bojangles",
      "Raising Cane's"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Popeyes was originally called 'Pete's Super Submarines' when it first opened in 1972.",
    "detailedExplanation": "Popeyes Louisiana Kitchen was originally opened as 'Pete's Super Submarines' in Arabi, Louisiana in 1972 by Al Copeland. The restaurant initially focused on submarine sandwiches but wasn't successful. Copeland then switched to fried chicken and changed the name to 'Chicken on the Run' in 1976, and later to 'Popeyes' (named after the character Popeye Doyle from The French Connection, not the cartoon sailor). The chain became famous for its spicy Louisiana-style fried chicken.",
    "citationUrl": "https://en.wikipedia.org/wiki/Popeyes",
    "citationTitle": "Wikipedia: Popeyes"
  },
  {
    "id": "c7ce7aab-ca16-4960-8aa9-fce6de6cbb90",
    "text": "Which fast food chain is known for its signature orange and pink color scheme and was originally called 'Dunkin' Donuts'?",
    "options": [
      "Krispy Kreme",
      "Dunkin'",
      "Baskin-Robbins",
      "Dairy Queen"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Dunkin' dropped 'Donuts' from its name in 2019 and is known for its orange and pink branding.",
    "detailedExplanation": "Dunkin', formerly known as Dunkin' Donuts, officially shortened its name in 2019 as part of a rebranding effort to emphasize its beverage offerings alongside donuts. The chain has maintained its distinctive orange and pink color scheme since its founding in 1950, making it one of the most recognizable color combinations in the fast food industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dunkin%27",
    "citationTitle": "Wikipedia: Dunkin'"
  },
  {
    "id": "8e67494f-49db-4403-a106-fbe165841baa",
    "text": "What is the name of the bell that serves as the logo and inspiration for Taco Bell's name?",
    "options": [
      "Liberty Bell",
      "Mission Bell",
      "Taco Bell",
      "Freedom Bell"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Taco Bell's logo is inspired by mission bells found at California's Spanish missions.",
    "detailedExplanation": "The Taco Bell logo features a stylized mission bell, which draws inspiration from the bells found at Spanish colonial missions throughout California. Founder Glen Bell chose this imagery to reflect the Mexican-inspired cuisine and the California heritage where the chain originated in 1962. The bell symbol has remained a central element of the brand's visual identity throughout its history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Taco_Bell",
    "citationTitle": "Wikipedia: Taco Bell"
  },
  {
    "id": "2e1799f1-d047-403f-bcae-2dbdaa3a51f9",
    "text": "Which fast food chain introduced the first drive-thru window in 1975?",
    "options": [
      "McDonald's",
      "Burger King",
      "Wendy's",
      "Jack in the Box"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Wendy's was the first major fast food chain to introduce a drive-thru window in 1975.",
    "detailedExplanation": "Wendy's revolutionized the fast food industry by introducing the first drive-thru window in 1975, though the concept had been experimented with earlier by smaller chains. This innovation allowed customers to order and receive their food without leaving their cars, fundamentally changing how fast food was served and consumed. The drive-thru quickly became a standard feature across the industry and proved especially valuable during later events like the COVID-19 pandemic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wendy%27s",
    "citationTitle": "Wikipedia: Wendy's"
  },
  {
    "id": "320754e0-8766-4525-89e6-8cb95682bb68",
    "text": "Which fast food chain's original mascot was a chef named 'Speedee' before being replaced by their current clown mascot?",
    "options": [
      "Burger King",
      "McDonald's",
      "White Castle",
      "Carl's Jr."
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "McDonald's first used Speedee as their mascot in the 1950s before introducing Ronald McDonald.",
    "detailedExplanation": "Before Ronald McDonald became the iconic face of the brand, McDonald's used a chef character named Speedee as their mascot in the 1950s. Speedee was designed to emphasize the restaurant's focus on quick service and efficiency, which was revolutionary at the time with their 'Speedee Service System.' The transition to Ronald McDonald occurred in the early 1960s as the company sought a more family-friendly and memorable character to represent their growing brand.",
    "citationUrl": "https://en.wikipedia.org/wiki/McDonald%27s",
    "citationTitle": "Wikipedia: McDonald's"
  }
]