[
  {
    "id": "cca573e5-41e0-44a5-9984-5bf3efecf32a",
    "text": "Which fast food chain was founded by a former KFC franchisee and originally called 'Pete's Super Submarines'?",
    "options": [
      "Subway",
      "Quiznos",
      "Jimmy John's",
      "Blimpie"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Subway was originally called 'Pete's Super Submarines' when founded by Fred DeLuca in 1965.",
    "detailedExplanation": "Subway was founded in 1965 by 17-year-old Fred DeLuca and Dr. Peter Buck in Bridgeport, Connecticut. The original name was 'Pete's Super Submarines,' named after Dr. Buck. DeLuca had previously worked as a franchisee for Kentucky Fried Chicken before starting his own submarine sandwich business. The name was later changed to 'Pete's Subway' in 1966 and eventually shortened to just 'Subway' in 1972 as the chain began to expand.",
    "citationUrl": "https://en.wikipedia.org/wiki/Subway_(restaurant)",
    "citationTitle": "Wikipedia: Subway (restaurant)"
  },
  {
    "id": "8653793a-fcdd-4961-8759-fbe0d6afdb29",
    "text": "What year did Taco Bell first introduce the Crunchwrap Supreme to their menu?",
    "options": [
      "2003",
      "2005",
      "2007",
      "2009"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Crunchwrap Supreme was first introduced by Taco Bell in 2005.",
    "detailedExplanation": "Taco Bell launched the Crunchwrap Supreme in 2005 as part of their strategy to create innovative menu items that combined multiple textures and flavors. The item features a large flour tortilla wrapped around a hard tostada shell filled with seasoned beef, nacho cheese sauce, lettuce, tomatoes, and sour cream. It became one of Taco Bell's most successful menu innovations and helped establish the brand's reputation for creative Mexican-inspired fast food items.",
    "citationUrl": "https://en.wikipedia.org/wiki/Taco_Bell",
    "citationTitle": "Wikipedia: Taco Bell"
  },
  {
    "id": "2bb42fe1-bcd5-4855-a0c3-06a95b7e2aa3",
    "text": "Which fast food chain's original mascot was a chef named 'Speedee' before being replaced by their current iconic mascot?",
    "options": [
      "Burger King",
      "McDonald's",
      "Wendy's",
      "Jack in the Box"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "McDonald's original mascot was Speedee, a chef character, before Ronald McDonald was introduced in 1963.",
    "detailedExplanation": "McDonald's first mascot was Speedee, a small chef character with a hamburger for a head, who appeared in the 1950s and early 1960s. Speedee was designed to represent the restaurant's 'Speedee Service System' that emphasized fast food preparation. However, in 1963, McDonald's introduced Ronald McDonald, who was originally portrayed by Willard Scott. Ronald McDonald became the face of the brand and one of the most recognizable corporate mascots in the world, eventually replacing Speedee entirely in McDonald's marketing campaigns.",
    "citationUrl": "https://en.wikipedia.org/wiki/McDonald%27s_characters",
    "citationTitle": "Wikipedia: McDonald's characters"
  },
  {
    "id": "0e5ac4a5-f96d-4e9b-96c8-7a23eb650554",
    "text": "In which country did Pizza Hut open its first international location outside the United States?",
    "options": [
      "Canada",
      "United Kingdom",
      "Australia",
      "Mexico"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Pizza Hut opened its first international location in Canada in 1968.",
    "detailedExplanation": "Pizza Hut, founded in 1958 in Wichita, Kansas, expanded internationally for the first time in 1968 when it opened a location in Canada. This marked the beginning of Pizza Hut's global expansion strategy that would eventually make it one of the world's largest pizza chains. The Canadian expansion was followed by locations in other countries throughout the 1970s and 1980s. Today, Pizza Hut operates in over 100 countries worldwide, making it one of the most internationally distributed fast food chains.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pizza_Hut",
    "citationTitle": "Wikipedia: Pizza Hut"
  },
  {
    "id": "8534e9d7-b334-495f-ae2c-0a6c20b20809",
    "text": "What was the original name of the restaurant that would eventually become Domino's Pizza?",
    "options": [
      "Tom's Pizza",
      "DomiNick's",
      "Pizza Express",
      "Quick Pizza"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Domino's Pizza was originally called 'DomiNick's' when it was founded in 1960.",
    "detailedExplanation": "Domino's Pizza began as 'DomiNick's' in 1960 when brothers Tom and James Monaghan purchased a small pizza store called DomiNick's in Ypsilanti, Michigan. James sold his share back to Tom in 1961, and Tom continued to run the business. In 1965, Tom Monaghan renamed the business 'Domino's Pizza' after being unable to acquire the rights to the DomiNick's name for expansion. The name 'Domino's' was chosen because it was short, memorable, and the domino game piece with three dots represented the original three planned locations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Domino%27s",
    "citationTitle": "Wikipedia: Domino's"
  },
  {
    "id": "b64b48e4-1503-4524-a7d1-49bbe88b4ca4",
    "text": "Which fast food chain holds the Guinness World Record for the most expensive hamburger ever sold commercially?",
    "options": [
      "Five Guys",
      "The Burger's Priest",
      "Serendipity 3",
      "Umami Burger"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Serendipity 3 holds the record with their $295 'Le Burger Extravagant' featuring wagyu beef and truffle.",
    "detailedExplanation": "Serendipity 3, a restaurant in New York City, holds the Guinness World Record for the most expensive hamburger with their 'Le Burger Extravagant,' which costs $295. This luxury burger features wagyu beef, white truffle butter, Ossetra caviar, foie gras, gold leaf, and other premium ingredients. The burger was officially recognized by Guinness World Records in 2012. Serendipity 3 is known for creating extravagant and expensive versions of common foods, including the world's most expensive sundae and hot dog.",
    "citationUrl": "https://en.wikipedia.org/wiki/Serendipity_3",
    "citationTitle": "Wikipedia: Serendipity 3"
  },
  {
    "id": "260d5bd8-42a3-4420-99d4-c96e5cebcd79",
    "text": "What is the name of the proprietary beef seasoning blend that Five Guys uses on their burgers?",
    "options": [
      "Five Spice",
      "Boardwalk Salt",
      "They don't use seasoning",
      "Secret Blend 5"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Five Guys famously does not use any seasoning on their beef patties, only salt and pepper.",
    "detailedExplanation": "Five Guys is known for their philosophy of using fresh, high-quality ingredients without artificial additives or complex seasonings. Their beef patties are made from fresh, never-frozen ground beef and are seasoned only with salt and pepper during cooking. The chain prides itself on the natural flavor of their beef and believes that additional seasonings would mask the quality of their meat. This approach is part of Five Guys' overall commitment to simplicity and quality, which has helped differentiate them in the competitive fast-casual burger market.",
    "citationUrl": "https://en.wikipedia.org/wiki/Five_Guys",
    "citationTitle": "Wikipedia: Five Guys"
  },
  {
    "id": "dc8fc953-eb1c-4bf8-a17c-d3ece3d7e924",
    "text": "Which fast food chain was the first to introduce the concept of a drive-through window?",
    "options": [
      "McDonald's",
      "White Castle",
      "In-N-Out Burger",
      "Red's Giant Hamburg"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Red's Giant Hamburg in Missouri is credited with creating the first drive-through window in 1947.",
    "detailedExplanation": "Red's Giant Hamburg in Springfield, Missouri, is widely credited with introducing the first drive-through window in 1947. The restaurant was owned by Sheldon 'Red' Chaney, who came up with the idea to serve customers without them having to leave their cars. The concept was revolutionary at the time and perfectly captured the post-World War II American culture of automobile convenience. While other restaurants had offered carhop services where waiters brought food to parked cars, Red's was the first to implement the window system that became the standard drive-through model adopted by fast food chains worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Drive-through",
    "citationTitle": "Wikipedia: Drive-through"
  },
  {
    "id": "ba4b7e77-ff43-4673-93ff-e3542fb8eab1",
    "text": "Which fast food chain was originally founded as 'Insta-Burger King' in 1953 before being purchased and renamed by its Miami-based franchisees?",
    "options": [
      "Burger King",
      "Whataburger",
      "Carl's Jr.",
      "Hardee's"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Burger King was originally founded as Insta-Burger King in Jacksonville, Florida, before being purchased by Miami franchisees James McLamore and David Edgerton.",
    "detailedExplanation": "Insta-Burger King was founded in 1953 in Jacksonville, Florida, by Keith Kramer and Matthew Burns. However, the company struggled financially and was purchased in 1954 by two Miami-based franchisees, James McLamore and David Edgerton, who renamed it Burger King and moved the headquarters to Miami. They also improved the cooking process by replacing the Insta-Broiler with a flame broiler, which became central to Burger King's identity and their 'flame-grilled' marketing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burger_King",
    "citationTitle": "Wikipedia: Burger King"
  },
  {
    "id": "291b8e95-fd31-446d-9243-c88bd0d2eab8",
    "text": "What is the secret menu item at In-N-Out Burger that consists of a burger with mustard grilled directly onto the patty instead of added as a condiment?",
    "options": [
      "Animal Style",
      "Protein Style",
      "Mustard Fried",
      "Flying Dutchman"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Mustard Fried (or Mustard Grilled) is when In-N-Out cooks the burger patty with mustard directly on the grill, creating a unique flavor profile.",
    "detailedExplanation": "In-N-Out Burger has an extensive secret menu that loyal customers have discovered over the years. 'Mustard Fried' or 'Mustard Grilled' is one of these secret options where the cook applies yellow mustard directly to the raw patty before placing it on the grill. This technique allows the mustard to cook into the meat, creating a different taste and texture compared to simply adding mustard as a condiment after cooking. This method intensifies the mustard flavor and creates a slight crust on the patty.",
    "citationUrl": "https://en.wikipedia.org/wiki/In-N-Out_Burger",
    "citationTitle": "Wikipedia: In-N-Out Burger"
  },
  {
    "id": "3ff78863-0d78-4825-a099-52f67fedcb8c",
    "text": "Which fast food chain's founder, Glen Bell, studied the operations of a Mexican restaurant called Mitla Cafe by eating there daily and watching through binoculars from across the street?",
    "options": [
      "Del Taco",
      "Taco Bell",
      "Chipotle",
      "Qdoba"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Glen Bell, founder of Taco Bell, famously studied Mitla Cafe's taco-making techniques by observing them as a customer and even using binoculars to watch their operations.",
    "detailedExplanation": "Before founding Taco Bell in 1962, Glen Bell was determined to learn how to make authentic Mexican food, particularly tacos. He became a regular customer at Mitla Cafe in San Bernardino, California, one of the first Mexican restaurants in the area. Bell would eat there frequently and even positioned himself across the street with binoculars to observe their cooking techniques and operations. The owners of Mitla Cafe eventually noticed his intense interest and taught him their methods directly. This knowledge became the foundation for Taco Bell's early menu and preparation techniques.",
    "citationUrl": "https://en.wikipedia.org/wiki/Taco_Bell",
    "citationTitle": "Wikipedia: Taco Bell"
  },
  {
    "id": "c9e9571c-90f1-4de9-82b1-3767e3315c90",
    "text": "What unique cooking method does White Castle use for their signature sliders that involves cooking the patties over a bed of rehydrated onions?",
    "options": [
      "Steam grilling",
      "Pressure cooking",
      "Smoking",
      "Sous vide"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "White Castle uses steam grilling, where beef patties are cooked over a bed of onions that create steam, cooking the burger from both sides simultaneously.",
    "detailedExplanation": "White Castle's distinctive cooking method, known as steam grilling, has been used since the company's founding in 1921. The small, thin beef patties are placed on a bed of rehydrated onions on the grill. The onions create steam that rises up through the holes in the patties (which are punched into the meat), cooking the burger from both the bottom via direct heat and from the top via steam. This method allows the burgers to cook very quickly and gives them their characteristic flavor and texture. The technique also ensures the onions become caramelized and infuse the meat with their flavor.",
    "citationUrl": "https://en.wikipedia.org/wiki/White_Castle_(restaurant)",
    "citationTitle": "Wikipedia: White Castle"
  },
  {
    "id": "6e207047-69bd-48db-887f-6dc3b28d95fc",
    "text": "Which fast food chain was the first to franchise internationally when it opened a location in Canada in 1967?",
    "options": [
      "McDonald's",
      "A&W",
      "KFC",
      "Dairy Queen"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "A&W was the first fast food chain to expand internationally, opening its first Canadian location in Winnipeg in 1956, not 1967 as stated in the question.",
    "detailedExplanation": "A&W Root Beer was actually the first American fast food chain to expand internationally when it opened its first location outside the United States in Winnipeg, Manitoba, Canada in 1956. The Canadian expansion was so successful that A&W Canada eventually became a separate entity from A&W in the United States. The Canadian locations developed their own menu items and corporate identity while maintaining the root beer focus. This international expansion preceded other major chains like McDonald's international growth by several years, making A&W a pioneer in global fast food franchising.",
    "citationUrl": "https://en.wikipedia.org/wiki/A%26W_Restaurants",
    "citationTitle": "Wikipedia: A&W Restaurants"
  },
  {
    "id": "8dd0e71a-e2ac-4468-af34-0a0c65ede6f8",
    "text": "What does the 'WaWa' in the convenience store chain Wawa's name actually mean?",
    "options": [
      "The sound of geese flying",
      "An Ojibwe word for wild goose",
      "The founder's childhood nickname",
      "An acronym for 'We Always Welcome All'"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Wawa is derived from the Ojibwe word for wild goose, and the company's logo features a goose in flight.",
    "detailedExplanation": "The name 'Wawa' comes from the Ojibwe Native American word for the Canada goose. The company was founded by the Wood family, whose original business was the Wawa Dairy Farm, located in a rural area of Pennsylvania called Wawa (named after the Ojibwe word). The area was named for the wild geese that were abundant in the region. When the family transitioned from dairy farming to convenience stores in 1964, they kept the Wawa name and incorporated the goose into their corporate logo and branding. The goose in flight remains a central part of Wawa's visual identity to this day.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wawa_(company)",
    "citationTitle": "Wikipedia: Wawa"
  },
  {
    "id": "faa386be-caeb-4f9c-bedf-f7c48266cd4d",
    "text": "Which fast food chain's original business model was based on selling only root beer floats before expanding into burgers and hot dogs?",
    "options": [
      "Sonic Drive-In",
      "A&W",
      "Dairy Queen",
      "Culver's"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "A&W originally focused exclusively on root beer and root beer floats when it was founded in 1919, before expanding into a full food menu.",
    "detailedExplanation": "A&W was founded in 1919 by Roy W. Allen in Lodi, California, initially as a roadside root beer stand. The business was built around Allen's recipe for root beer, which he served in frosty mugs, often as root beer floats with ice cream. The 'A&W' name came when Allen partnered with Frank Wright in 1922, combining their initials. For several years, the business focused almost exclusively on root beer and root beer floats, capitalizing on the popularity of the beverage during Prohibition when alcohol was banned. Only later did A&W expand into hamburgers, hot dogs, and other fast food items, eventually becoming one of the first fast food franchises in America.",
    "citationUrl": "https://en.wikipedia.org/wiki/A%26W_Restaurants",
    "citationTitle": "Wikipedia: A&W Restaurants"
  },
  {
    "id": "4daace40-2af8-4ed2-b2f3-09bff3ed9102",
    "text": "What was the original business that eventually became Subway before founders Fred DeLuca and Peter Buck decided to focus on submarine sandwiches?",
    "options": [
      "They started with submarine sandwiches",
      "A pizza delivery service",
      "A small grocery store",
      "A catering company"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Subway started as 'Pete's Super Submarines' in 1965, focusing on submarine sandwiches from the very beginning.",
    "detailedExplanation": "Subway was founded in 1965 when 17-year-old Fred DeLuca borrowed $1,000 from family friend Peter Buck to open a submarine sandwich shop in Bridgeport, Connecticut. They originally called it 'Pete's Super Submarines' (after Peter Buck). The concept was submarine sandwiches from day one - there was no previous business that evolved into Subway. The founders chose submarine sandwiches because they believed it would be a simple business model with low startup costs. In 1968, they changed the name to 'Pete's Subway' and eventually just 'Subway.' The business was always focused on submarine sandwiches, which became their signature product and the foundation of their global franchise empire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Subway_(restaurant)",
    "citationTitle": "Wikipedia: Subway"
  },
  {
    "id": "3b67da2f-4239-41af-a473-c5b3677497b2",
    "text": "Which fast food chain's founder worked as a door-to-door milkshake machine salesman before discovering a small California restaurant that would inspire his global empire?",
    "options": [
      "Ray Kroc - McDonald's",
      "Dave Thomas - Wendy's",
      "Harland Sanders - KFC",
      "Carl Karcher - Carl's Jr."
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Ray Kroc was selling Multimixer milkshake machines when he visited the McDonald brothers' restaurant in 1954.",
    "detailedExplanation": "Ray Kroc was working as a traveling milkshake machine salesman for Prince Castle when he became curious about a small restaurant in San Bernardino, California that had ordered eight of his Multimixer machines. When he visited the McDonald brothers' restaurant in 1954, he was so impressed by their efficient 'Speedee Service System' that he convinced them to let him franchise the concept nationally, eventually buying them out and building the McDonald's empire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ray_Kroc",
    "citationTitle": "Wikipedia: Ray Kroc"
  },
  {
    "id": "9abf57ba-0bd2-4621-ba2d-005d16158a10",
    "text": "What unusual ingredient did Wendy's add to their Frosty dessert recipe to achieve its distinctive flavor that's neither purely chocolate nor vanilla?",
    "options": [
      "Malt powder",
      "Coffee extract",
      "Vanilla extract in chocolate base",
      "Caramel syrup"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Wendy's Frosty contains vanilla flavoring mixed into a chocolate base, creating its unique taste.",
    "detailedExplanation": "Dave Thomas specifically designed the Wendy's Frosty to have a unique flavor profile by adding vanilla extract to a chocolate ice cream base. This combination creates the distinctive taste that sets it apart from traditional chocolate or vanilla soft-serve. Thomas wanted the Frosty to be thick enough to eat with a spoon but smooth enough to drink through a straw, and the vanilla-chocolate blend was part of achieving that perfect consistency and flavor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wendy%27s_Frosty",
    "citationTitle": "Wikipedia: Wendy's Frosty"
  },
  {
    "id": "01ad96e1-8f36-4a46-8ade-c289a56ba2bb",
    "text": "Which major fast food chain was forced to temporarily close all 8,500 of its U.S. locations for racial bias training in 2018 following a controversial incident?",
    "options": [
      "Dunkin'",
      "Starbucks",
      "Chipotle",
      "Panera Bread"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Starbucks closed all company-owned U.S. stores on May 29, 2018, for racial bias training after an incident in Philadelphia.",
    "detailedExplanation": "In May 2018, Starbucks closed approximately 8,500 company-owned stores across the United States for an afternoon of racial bias training. This unprecedented move came after a highly publicized incident at a Philadelphia Starbucks where two Black men were arrested while waiting for a business meeting. The incident sparked nationwide protests and calls for boycotts, prompting Starbucks CEO Kevin Johnson to personally apologize and implement the company-wide training program.",
    "citationUrl": "https://en.wikipedia.org/wiki/2018_Philadelphia_Starbucks_arrests",
    "citationTitle": "Wikipedia: 2018 Philadelphia Starbucks arrests"
  },
  {
    "id": "92be5010-4cb4-4935-aae2-4cce46ee8704",
    "text": "Which fast food chain's secret recipe is famously stored in a high-security vault and is known by only a handful of people at any given time?",
    "options": [
      "KFC's Original Recipe",
      "Coca-Cola's formula",
      "Big Mac Special Sauce",
      "Chick-fil-A's marinade"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "KFC's Original Recipe of 11 herbs and spices is kept in a high-security vault with access limited to very few executives.",
    "detailedExplanation": "Colonel Sanders' Original Recipe of 11 herbs and spices is one of the most closely guarded trade secrets in the food industry. The complete recipe is stored in a high-security vault at KFC's headquarters in Louisville, Kentucky, with access restricted to only a handful of top executives at any time. The recipe is handwritten and signed by Colonel Sanders himself, and different parts of the recipe are prepared at different facilities to maintain security, ensuring no single location has access to the complete formula.",
    "citationUrl": "https://en.wikipedia.org/wiki/KFC_Original_Recipe",
    "citationTitle": "Wikipedia: KFC Original Recipe"
  }
]