[
  {
    "id": "d75f0fc7-180c-458c-bf28-96c53f393b48",
    "text": "The first commercially successful personal computer, the Apple II, was released in which decade?",
    "options": [
      "1960s",
      "1970s",
      "1980s",
      "1990s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The Apple II was released in 1977, making it a 1970s innovation.",
    "detailedExplanation": "The Apple II, launched by Apple Computer in 1977, was one of the first successful mass-produced microcomputers. It featured color graphics, sound capabilities, and came in a sleek plastic case. The Apple II series became hugely popular in homes and schools throughout the late 1970s and 1980s, helping to establish the personal computer revolution and making Apple a household name.",
    "citationUrl": "https://en.wikipedia.org/wiki/Apple_II",
    "citationTitle": "Wikipedia: Apple II"
  },
  {
    "id": "0341b600-ee0f-45cb-85c0-5c8ff2497630",
    "text": "Which social media platform was founded in the 2000s and originally required a college email address to join?",
    "options": [
      "MySpace",
      "Facebook",
      "Twitter",
      "LinkedIn"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Facebook was founded in 2004 and initially required users to have a college email address.",
    "detailedExplanation": "Facebook was created by Mark Zuckerberg and his college roommates at Harvard University in February 2004. Originally called 'The Facebook,' it was exclusively for college students and required a valid .edu email address to register. The platform gradually expanded to other universities, then high schools, and finally opened to the general public in 2006. This exclusivity helped create its initial appeal and rapid growth among students.",
    "citationUrl": "https://en.wikipedia.org/wiki/Facebook",
    "citationTitle": "Wikipedia: Facebook"
  },
  {
    "id": "ce1d0ef9-f5d9-4549-ae21-705ae187cfec",
    "text": "The first mobile phone call was made in which decade?",
    "options": [
      "1960s",
      "1970s",
      "1980s",
      "1990s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The first mobile phone call was made in 1973 by Martin Cooper of Motorola.",
    "detailedExplanation": "On April 3, 1973, Martin Cooper, a Motorola executive, made the first public mobile phone call using the DynaTAC 8000X prototype. He called his rival at Bell Labs to announce the breakthrough. The phone weighed about 2.5 pounds and offered 30 minutes of talk time after a 10-hour charge. Commercial mobile phone service didn't become widely available until the 1980s, but this 1970s innovation laid the groundwork for our modern mobile communication.",
    "citationUrl": "https://en.wikipedia.org/wiki/History_of_mobile_phones",
    "citationTitle": "Wikipedia: History of mobile phones"
  },
  {
    "id": "e703097c-bf16-472b-aa2e-05dc4995a317",
    "text": "Which decade saw the introduction of the first iPhone?",
    "options": [
      "1990s",
      "2000s",
      "2010s",
      "2020s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The first iPhone was released by Apple in 2007, during the 2000s decade.",
    "detailedExplanation": "Steve Jobs unveiled the original iPhone at the Macworld Conference & Expo on January 9, 2007, and it went on sale on June 29, 2007. The iPhone revolutionized the smartphone industry by combining a phone, iPod, and internet browser into one device with an intuitive touchscreen interface. It eliminated the need for physical keyboards and styluses, setting the standard for modern smartphones and fundamentally changing how we interact with mobile technology.",
    "citationUrl": "https://en.wikipedia.org/wiki/IPhone_(1st_generation)",
    "citationTitle": "Wikipedia: iPhone (1st generation)"
  },
  {
    "id": "2a0d2268-e9f8-4a94-8c80-1f1693e008eb",
    "text": "The compact disc (CD) was first commercially released in which decade?",
    "options": [
      "1970s",
      "1980s",
      "1990s",
      "2000s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The compact disc was first released commercially in 1982, making it an 1980s innovation.",
    "detailedExplanation": "The compact disc was jointly developed by Sony and Philips and first launched in Japan on October 1, 1982. The first CD pressed was ABBA's 'The Visitors.' CDs offered superior sound quality, durability, and convenience compared to vinyl records and cassette tapes. The technology revolutionized the music industry and later evolved into CD-ROMs for computer data storage, becoming one of the most successful consumer electronics innovations of the 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Compact_disc",
    "citationTitle": "Wikipedia: Compact disc"
  },
  {
    "id": "63fde08a-c520-479f-8806-54d023933477",
    "text": "Which streaming service, launched in the 2000s, originally started as a DVD-by-mail service?",
    "options": [
      "Hulu",
      "Amazon Prime Video",
      "Netflix",
      "Disney+"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Netflix was founded in 1997 as a DVD-by-mail service and launched streaming in 2007.",
    "detailedExplanation": "Netflix was founded by Reed Hastings and Marc Randolph in 1997 as a DVD-by-mail rental service, competing with traditional video rental stores like Blockbuster. The company introduced its revolutionary streaming service in 2007, allowing subscribers to watch content instantly over the internet. This innovation fundamentally changed how people consume entertainment, leading to the decline of physical media rentals and paving the way for the modern streaming era that dominates today's entertainment landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/Netflix",
    "citationTitle": "Wikipedia: Netflix"
  },
  {
    "id": "2ea5a4a5-fda4-4086-9eb8-2d2be427700f",
    "text": "The first successful video game console for home use, the Magnavox Odyssey, was released in which decade?",
    "options": [
      "1960s",
      "1970s",
      "1980s",
      "1990s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The Magnavox Odyssey was released in 1972, making it a 1970s innovation.",
    "detailedExplanation": "The Magnavox Odyssey, designed by Ralph H. Baer, was released in September 1972 as the first commercial home video game console. It came with 12 built-in games and used simple graphics displayed on a television screen. Players used plastic overlays on their TV screens to create backgrounds for different games. While primitive by today's standards, the Odyssey laid the foundation for the entire home gaming industry and inspired the creation of Pong and other early arcade games.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magnavox_Odyssey",
    "citationTitle": "Wikipedia: Magnavox Odyssey"
  },
  {
    "id": "e4c4aa75-9683-42e5-8959-e120d0ddade6",
    "text": "The World Wide Web was invented by Tim Berners-Lee in which decade?",
    "options": [
      "1970s",
      "1980s",
      "1990s",
      "2000s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Tim Berners-Lee invented the World Wide Web in 1989 while working at CERN.",
    "detailedExplanation": "Tim Berners-Lee created the World Wide Web in 1989 while working as a software engineer at CERN, the European physics research laboratory in Switzerland. He wrote the first web browser, web server, and website, fundamentally changing how information is shared globally. The first website went live in 1991, but the foundational work happened in the late 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/World_Wide_Web",
    "citationTitle": "Wikipedia: World Wide Web"
  },
  {
    "id": "23fadb13-4401-47ba-9854-5404a1ff1419",
    "text": "Which decade saw the invention of the computer mouse?",
    "options": [
      "1950s",
      "1960s",
      "1970s",
      "1980s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Douglas Engelbart invented the computer mouse in 1964.",
    "detailedExplanation": "Douglas Engelbart invented the computer mouse in 1964 as part of his research into human-computer interaction at Stanford Research Institute. The first mouse was a wooden shell with two metal wheels, quite different from modern optical mice. It wasn't widely adopted until personal computers became popular in the 1980s, but the fundamental invention occurred in the mid-1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Computer_mouse",
    "citationTitle": "Wikipedia: Computer mouse"
  },
  {
    "id": "13a7ef0e-bf3f-43e4-91e6-f8179b04ebc3",
    "text": "GPS (Global Positioning System) became fully operational in which decade?",
    "options": [
      "1980s",
      "1990s",
      "2000s",
      "2010s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "GPS became fully operational in 1995 with a complete constellation of satellites.",
    "detailedExplanation": "The Global Positioning System was developed by the U.S. Department of Defense starting in the 1970s, but it didn't become fully operational until 1995 when a complete constellation of 24 satellites was achieved. Initially restricted for military use, GPS was made available for civilian use, revolutionizing navigation, mapping, and location-based services that we rely on today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Global_Positioning_System",
    "citationTitle": "Wikipedia: Global Positioning System"
  },
  {
    "id": "0dba2d97-c504-40ad-84e4-449352061ca7",
    "text": "The first electronic digital computer, ENIAC, was completed in which decade?",
    "options": [
      "1930s",
      "1940s",
      "1950s",
      "1960s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "ENIAC was completed in 1946 at the University of Pennsylvania.",
    "detailedExplanation": "The Electronic Numerical Integrator and Computer (ENIAC) was completed in 1946 at the University of Pennsylvania. It was one of the first general-purpose electronic digital computers, weighing 30 tons and occupying 1,800 square feet. ENIAC could perform calculations thousands of times faster than manual methods and laid the groundwork for modern computing.",
    "citationUrl": "https://en.wikipedia.org/wiki/ENIAC",
    "citationTitle": "Wikipedia: ENIAC"
  },
  {
    "id": "fb2f3a4e-7a64-4824-85d9-02eba12913e1",
    "text": "Which decade saw the launch of the first communications satellite?",
    "options": [
      "1950s",
      "1960s",
      "1970s",
      "1980s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Telstar 1, the first active communications satellite, was launched in 1962.",
    "detailedExplanation": "Telstar 1, launched on July 10, 1962, was the first active communications satellite capable of relaying television signals across the Atlantic Ocean. This breakthrough enabled live transatlantic television broadcasts and marked the beginning of the satellite communications era that would eventually lead to global telecommunications, satellite internet, and GPS technology.",
    "citationUrl": "https://en.wikipedia.org/wiki/Telstar_1",
    "citationTitle": "Wikipedia: Telstar 1"
  },
  {
    "id": "8324a382-27f8-4725-8c1c-867a1365a4c3",
    "text": "The first successful 3D printer was developed in which decade?",
    "options": [
      "1970s",
      "1980s",
      "1990s",
      "2000s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Chuck Hull invented stereolithography, the first 3D printing technology, in 1983.",
    "detailedExplanation": "Chuck Hull invented stereolithography in 1983 and patented the technology in 1986, creating the first successful 3D printing process. His company, 3D Systems, released the first commercial 3D printer, the SLA-1, in 1988. This revolutionary technology would eventually transform manufacturing, prototyping, and even medical applications decades later.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stereolithography",
    "citationTitle": "Wikipedia: Stereolithography"
  },
  {
    "id": "831d1585-5ad0-4fe9-a009-0644d299433d",
    "text": "The integrated circuit (microchip) was invented in which decade?",
    "options": [
      "1940s",
      "1950s",
      "1960s",
      "1970s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The integrated circuit was invented in 1958 by Jack Kilby at Texas Instruments.",
    "detailedExplanation": "Jack Kilby at Texas Instruments invented the integrated circuit in 1958, for which he later won the Nobel Prize in Physics. Around the same time, Robert Noyce at Fairchild Semiconductor developed a similar concept. The integrated circuit revolutionized electronics by allowing multiple transistors and other components to be manufactured on a single chip, making modern computers and electronics possible.",
    "citationUrl": "https://en.wikipedia.org/wiki/Integrated_circuit",
    "citationTitle": "Wikipedia: Integrated circuit"
  },
  {
    "id": "1449fd70-25ac-4031-96ff-505751e81723",
    "text": "Which decade saw the introduction of the first commercial virtual reality headset?",
    "options": [
      "1980s",
      "1990s",
      "2000s",
      "2010s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The first commercial VR headsets like the VPL EyePhone were released in the early 1990s.",
    "detailedExplanation": "The 1990s saw the first commercial virtual reality headsets, including the VPL EyePhone and later the Nintendo Virtual Boy in 1995. While VR concepts existed earlier, the 1990s marked when the technology became commercially available, though it was expensive and had limited success. Modern VR experienced a renaissance in the 2010s with devices like the Oculus Rift.",
    "citationUrl": "https://en.wikipedia.org/wiki/Virtual_reality",
    "citationTitle": "Wikipedia: Virtual reality"
  },
  {
    "id": "2c5a5dc2-a570-419e-b686-d1742d7e09d6",
    "text": "The first commercially available television remote control was introduced in which decade?",
    "options": [
      "1940s",
      "1950s",
      "1960s",
      "1970s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The first TV remote control, called 'Lazy Bones,' was introduced by Zenith in 1950.",
    "detailedExplanation": "Zenith Radio Corporation introduced the first television remote control in 1950, aptly named 'Lazy Bones.' This wired remote control connected to the television set via a cable and allowed viewers to change channels and adjust volume without leaving their seats. The wireless remote control followed later in the decade with Zenith's 'Space Command' in 1956, which used ultrasonic sound waves to control the television.",
    "citationUrl": "https://en.wikipedia.org/wiki/Remote_control",
    "citationTitle": "Wikipedia: Remote Control"
  },
  {
    "id": "e9b8ca71-5015-4996-b554-969126aedd28",
    "text": "The first successful electric car company to go public since Ford Motor Company was founded in which decade?",
    "options": [
      "1990s",
      "2000s",
      "2010s",
      "2020s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "Tesla Motors was founded in 2003 and went public in 2010, making it the first electric car company to go public since Ford.",
    "detailedExplanation": "Tesla Motors was founded in 2003 by Martin Eberhard and Marc Tarpenning, with Elon Musk joining as chairman and major investor in 2004. The company went public in June 2010, making it the first American car company to go public since Ford Motor Company in 1956, and specifically the first electric vehicle company to achieve this milestone. Tesla's IPO marked a significant moment in the automotive industry's shift toward sustainable transportation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tesla,_Inc.",
    "citationTitle": "Wikipedia: Tesla, Inc."
  },
  {
    "id": "271051e0-71cb-4a76-96a9-7ba99b16cb0e",
    "text": "The first successful commercial email system was developed in which decade?",
    "options": [
      "1960s",
      "1970s",
      "1980s",
      "1990s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The @ symbol for email addressing was introduced by Ray Tomlinson in 1971, establishing the foundation for modern email.",
    "detailedExplanation": "Ray Tomlinson, a computer engineer at Bolt Beranek and Newman (BBN), sent the first network email in 1971 using the ARPANET system. He chose the @ symbol to separate the user name from the computer name, creating the familiar email address format we still use today. This innovation in the 1970s laid the groundwork for all modern email systems and fundamentally changed how people communicate globally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Email",
    "citationTitle": "Wikipedia: Email"
  },
  {
    "id": "d7f3f180-e0fc-45d4-b3b3-8376f8a73f9e",
    "text": "The first successful digital camera for consumer use was released in which decade?",
    "options": [
      "1970s",
      "1980s",
      "1990s",
      "2000s"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The first consumer digital cameras, like the Apple QuickTake 100, were released in the mid-1990s.",
    "detailedExplanation": "While digital camera technology was developed in the 1970s at Kodak, the first practical consumer digital cameras didn't appear until the 1990s. The Apple QuickTake 100, released in 1994, was one of the first digital cameras marketed to consumers, though it was expensive and had limited capabilities. The Casio QV-11 and other models soon followed, establishing the 1990s as the decade when digital photography became accessible to ordinary consumers rather than just professionals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Digital_camera",
    "citationTitle": "Wikipedia: Digital Camera"
  },
  {
    "id": "c153d396-6efb-48d0-93cb-bc7aa41c4164",
    "text": "The first commercial text messaging service (SMS) was launched in which decade?",
    "options": [
      "1980s",
      "1990s",
      "2000s",
      "2010s"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "easy",
    "explanation": "The first SMS text message was sent in 1992, marking the beginning of commercial text messaging services.",
    "detailedExplanation": "The first Short Message Service (SMS) text message was sent on December 3, 1992, by Neil Papworth, a 22-year-old test engineer at Sema Group. He sent the message 'Merry Christmas' from his computer to a Vodafone employee's phone. Commercial SMS services began rolling out in the early 1990s, though widespread adoption didn't occur until later in the decade as mobile phone ownership increased. This technology revolutionized mobile communication and laid the foundation for modern messaging apps.",
    "citationUrl": "https://en.wikipedia.org/wiki/SMS",
    "citationTitle": "Wikipedia: SMS"
  }
]