[
  {
    "id": "29a4b793-47e6-4978-b72a-78e181100977",
    "text": "What is the only letter that does not appear in any element symbol on the periodic table?",
    "options": [
      "J",
      "Q",
      "X",
      "Z"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "The letter J is the only letter not used in any element symbol.",
    "detailedExplanation": "Among all 118 known elements, the letter J is completely absent from the periodic table symbols. While Q appears in no current element symbols, it's not definitively excluded from future discoveries. X appears in Xenon (Xe), and Z appears in Zinc (Zn). The letter J's absence is partly due to historical naming conventions and the Latin origins of many element names.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chemical_symbol",
    "citationTitle": "Wikipedia: Chemical symbol"
  },
  {
    "id": "b5a052c4-8eb3-4a69-82d3-208fd8b6fc3a",
    "text": "Which group of elements is known as the 'coinage metals'?",
    "options": [
      "Iron, Nickel, Cobalt",
      "Copper, Silver, Gold",
      "Platinum, Palladium, Rhodium",
      "Zinc, Tin, Lead"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Copper, Silver, and Gold are called coinage metals due to their historical use in making coins.",
    "detailedExplanation": "Copper (Cu), Silver (Ag), and Gold (Au) form Group 11 of the periodic table and are traditionally called the 'coinage metals' because of their extensive historical use in minting coins. These metals share similar properties: they are relatively unreactive, resistant to corrosion, malleable, and have attractive appearances. Their durability and intrinsic value made them ideal for currency throughout human civilization.",
    "citationUrl": "https://en.wikipedia.org/wiki/Group_11_element",
    "citationTitle": "Wikipedia: Group 11 element"
  },
  {
    "id": "71069b5a-8eac-4a51-b030-97f7a6b375c6",
    "text": "How many elements in the periodic table are named after people?",
    "options": [
      "12",
      "15",
      "18",
      "21"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Fifteen elements are named after people, including scientists and mythological figures.",
    "detailedExplanation": "Fifteen elements are named after people, mostly scientists who made significant contributions to chemistry, physics, or related fields. These include Curium (Marie and Pierre Curie), Einsteinium (Albert Einstein), Mendelevium (Dmitri Mendeleev), and Nobelium (Alfred Nobel), among others. Some are named after mythological figures like Promethium (Prometheus) and Tantalum (Tantalus). This tradition honors those who advanced our understanding of science.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_chemical_element_name_etymologies",
    "citationTitle": "Wikipedia: List of chemical element name etymologies"
  },
  {
    "id": "b88effe7-2259-413b-9d3a-d266aa3c3cd6",
    "text": "What percentage of the human body by mass consists of oxygen?",
    "options": [
      "45%",
      "55%",
      "65%",
      "75%"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Oxygen makes up approximately 65% of the human body by mass, mostly in water molecules.",
    "detailedExplanation": "Oxygen comprises about 65% of the human body by mass, making it the most abundant element in our bodies. This high percentage is primarily due to water (H₂O), which makes up 55-60% of adult body weight. Oxygen is also found in proteins, fats, carbohydrates, and DNA. Carbon follows as the second most abundant element at about 18%, then hydrogen at 10%, and nitrogen at 3%.",
    "citationUrl": "https://en.wikipedia.org/wiki/Composition_of_the_human_body",
    "citationTitle": "Wikipedia: Composition of the human body"
  },
  {
    "id": "f43773f4-5070-4147-a501-1b46af2e7df3",
    "text": "Which element has the most isotopes?",
    "options": [
      "Uranium",
      "Xenon",
      "Tin",
      "Cesium"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Tin has the most stable isotopes of any element, with 10 stable isotopes.",
    "detailedExplanation": "Tin (Sn) holds the record for having the most stable isotopes of any element, with 10 stable isotopes ranging from Tin-112 to Tin-124. This unusual stability is attributed to tin having the 'magic number' of 50 protons, which corresponds to a particularly stable nuclear configuration. When including unstable isotopes, xenon actually has more total isotopes, but tin leads in stable ones, making it unique among all elements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tin",
    "citationTitle": "Wikipedia: Tin"
  },
  {
    "id": "a96b9f07-3251-4041-8e34-b01d455ce407",
    "text": "Which two elements exist as liquids at room temperature?",
    "options": [
      "Mercury and Francium",
      "Mercury and Bromine",
      "Bromine and Cesium",
      "Mercury and Cesium"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Mercury and Bromine are the only two elements that are liquid at standard room temperature and pressure.",
    "detailedExplanation": "Only two elements exist as liquids at room temperature (20°C) and standard atmospheric pressure: Mercury (Hg), a metal, and Bromine (Br₂), a halogen. Mercury melts at -39°C and boils at 357°C, while bromine melts at -7°C and boils at 59°C. Francium and cesium have very low melting points but are still solid at room temperature, though they would melt at slightly elevated temperatures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Period_4_element",
    "citationTitle": "Wikipedia: Period 4 element"
  },
  {
    "id": "c28910ad-d103-4c96-a2fe-4fbf4217efbe",
    "text": "Which element is named after the planet Uranus?",
    "options": [
      "Plutonium",
      "Neptunium",
      "Uranium",
      "Helium"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Uranium was named after the planet Uranus, discovered just 8 years earlier.",
    "detailedExplanation": "Uranium was discovered in 1789 by German chemist Martin Heinrich Klaproth, who named it after the planet Uranus that had been discovered by William Herschel in 1781. This established a tradition of naming elements after celestial bodies, which continued with neptunium (named after Neptune) and plutonium (named after Pluto, though Pluto is now classified as a dwarf planet).",
    "citationUrl": "https://en.wikipedia.org/wiki/Uranium",
    "citationTitle": "Wikipedia: Uranium"
  },
  {
    "id": "a5f3e2d9-621c-428a-b50b-8b9144789838",
    "text": "Which element has the highest melting point of all elements?",
    "options": [
      "Tungsten",
      "Carbon",
      "Rhenium",
      "Osmium"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Carbon has the highest melting point at 4,027°C (7,280°F) in its diamond form.",
    "detailedExplanation": "Carbon, specifically in its diamond allotrope, has the highest melting point of all elements at approximately 4,027°C (7,280°F). While tungsten has the highest melting point among metals at 3,414°C (6,177°F), carbon's strong covalent bonding in diamond form requires even more energy to break. This extreme melting point is due to the tetrahedral crystal structure where each carbon atom is covalently bonded to four others.",
    "citationUrl": "https://en.wikipedia.org/wiki/Melting_points_of_the_elements",
    "citationTitle": "Wikipedia: Melting points of the elements"
  },
  {
    "id": "9a10018c-b9d1-4c4f-a6a0-3897abfbc071",
    "text": "How many elements on the periodic table are named after places on Earth?",
    "options": [
      "12",
      "15",
      "19",
      "23"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "19 elements are named after places on Earth, including countries, cities, and regions.",
    "detailedExplanation": "Nineteen elements derive their names from earthly locations: Scandium (Scandinavia), Yttrium (Ytterby, Sweden), Ruthenium (Russia), Palladium (asteroid Pallas), Europium (Europe), Terbium (Ytterby), Erbium (Ytterby), Thulium (Thule), Lutetium (Paris), Hafnium (Copenhagen), Rhenium (Rhine), Polonium (Poland), Francium (France), Americium (America), Berkelium (Berkeley), Californium (California), Darmstadtium (Darmstadt), Roentgenium (related to Roentgen), and others. The Swedish town of Ytterby holds the record with four elements named after it.",
    "citationUrl": "https://en.wikipedia.org/wiki/Systematic_element_name",
    "citationTitle": "Wikipedia: Systematic element name"
  },
  {
    "id": "13e515a0-231c-4af6-bf81-04138f054d17",
    "text": "What unique property makes mercury the only metal that is liquid at room temperature?",
    "options": [
      "Very weak metallic bonding",
      "Extremely high density",
      "Relativistic effects on electrons",
      "Large atomic radius"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Relativistic effects cause mercury's electrons to move so fast they contract, weakening metallic bonds.",
    "detailedExplanation": "Mercury is liquid at room temperature due to relativistic effects. Because mercury has 80 protons, its inner electrons move at about 58% the speed of light to maintain their orbitals. This causes the electron shells to contract and shield the outer electrons more effectively, weakening the metallic bonding between mercury atoms. Without these relativistic effects, mercury would behave more like its periodic table neighbors and be solid at room temperature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mercury_(element)",
    "citationTitle": "Wikipedia: Mercury (element)"
  },
  {
    "id": "80aeea21-dc72-4e95-96ca-c04162b21f59",
    "text": "Which period of the periodic table contains the most naturally occurring elements?",
    "options": [
      "Period 3",
      "Period 4",
      "Period 5",
      "Period 6"
    ],
    "correctIndex": 1,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Period 4 contains 18 naturally occurring elements, more than any other period.",
    "detailedExplanation": "Period 4 of the periodic table contains 18 naturally occurring elements, from potassium (19) to krypton (36). This period includes important transition metals like iron, copper, and zinc, as well as essential elements like calcium and bromine. While Period 6 has 32 total elements, many are synthetic or extremely rare, making Period 4 the champion for naturally occurring elements that we encounter in everyday life and industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Period_4_element",
    "citationTitle": "Wikipedia: Period 4 element"
  },
  {
    "id": "4ab0c8a1-7d89-4098-bd21-56e514c132d3",
    "text": "What percentage of the human body by mass is made up of just four elements (oxygen, carbon, hydrogen, nitrogen)?",
    "options": [
      "78%",
      "85%",
      "96%",
      "99%"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Oxygen, carbon, hydrogen, and nitrogen make up approximately 96% of human body mass.",
    "detailedExplanation": "The human body is remarkably simple in its elemental composition. Oxygen accounts for about 65% of body mass (mostly in water), carbon makes up 18%, hydrogen 10%, and nitrogen 3%, totaling approximately 96%. The remaining 4% consists of calcium (mostly in bones), phosphorus, potassium, sulfur, sodium, chlorine, and trace amounts of other elements. This demonstrates how biological systems have evolved to utilize the most abundant and chemically versatile elements available.",
    "citationUrl": "https://en.wikipedia.org/wiki/Composition_of_the_human_body",
    "citationTitle": "Wikipedia: Composition of the human body"
  },
  {
    "id": "9990a15a-99ec-4ac8-82ff-5218ef1f4f91",
    "text": "Which element has the symbol 'W' on the periodic table?",
    "options": [
      "Tungsten",
      "Titanium",
      "Tin",
      "Tellurium"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Tungsten has the symbol 'W' from its German name 'Wolfram'.",
    "detailedExplanation": "Tungsten, with atomic number 74, has the chemical symbol 'W' which comes from its alternative name 'wolfram', derived from the German words 'wolf' and 'ram' meaning 'wolf's foam'. This unusual symbol often confuses people as it doesn't match the English name. Tungsten is famous for having the highest melting point of all elements at 3,695°C (6,683°F) and is commonly used in light bulb filaments.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tungsten",
    "citationTitle": "Wikipedia: Tungsten"
  },
  {
    "id": "071c4892-3cc5-4d10-b482-3e11ad85aaee",
    "text": "How many elements in the periodic table are named after countries?",
    "options": [
      "4",
      "6",
      "8",
      "10"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Four elements are named after countries: Francium (France), Germanium (Germany), Polonium (Poland), and Americium (America).",
    "detailedExplanation": "Only four elements on the periodic table are directly named after countries. Francium (Fr) honors France, Germanium (Ge) was named after Germany by its German discoverer, Polonium (Po) was named by Marie Curie after her native Poland, and Americium (Am) was named after America where it was first synthesized. While other elements are named after places like cities or regions (such as Europium after Europe), these four specifically honor individual countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chemical_element",
    "citationTitle": "Wikipedia: Chemical element"
  },
  {
    "id": "04544eca-09d0-4ae3-bcea-aa23a5a0c040",
    "text": "Which element was the first to be artificially created in a laboratory?",
    "options": [
      "Technetium",
      "Plutonium",
      "Neptunium",
      "Promethium"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Technetium was the first element to be artificially produced, created in 1937.",
    "detailedExplanation": "Technetium (Tc) holds the distinction of being the first element to be artificially produced in a laboratory. It was created in 1937 by Italian scientists Emilio Segrè and Carlo Perrier by bombarding molybdenum with deuterons in a cyclotron. Interestingly, technetium's name comes from the Greek word 'technetos' meaning 'artificial.' Despite being artificially created first, technetium does occur naturally in trace amounts in uranium ore and is produced in red giant stars.",
    "citationUrl": "https://en.wikipedia.org/wiki/Technetium",
    "citationTitle": "Wikipedia: Technetium"
  },
  {
    "id": "9b3deb2c-132d-4c8d-aee9-9734d0cb66f5",
    "text": "What is the heaviest naturally occurring element on Earth?",
    "options": [
      "Uranium",
      "Thorium",
      "Radium",
      "Plutonium"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Uranium, with atomic number 92, is the heaviest element that occurs naturally on Earth.",
    "detailedExplanation": "Uranium (U) is the heaviest naturally occurring element on Earth, with an atomic number of 92. While trace amounts of heavier elements like neptunium and plutonium can be found in uranium ores due to natural nuclear reactions, uranium is the heaviest element that exists in significant natural quantities. All elements heavier than uranium (the transuranics) are primarily synthetic and have been created artificially in laboratories, though some may exist in extremely tiny amounts in nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Uranium",
    "citationTitle": "Wikipedia: Uranium"
  },
  {
    "id": "85f48f52-fa8c-45be-b0e5-0c5a21f246ec",
    "text": "Which period of the periodic table contains the most elements?",
    "options": [
      "Period 6",
      "Period 5",
      "Period 7",
      "Period 4"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Period 6 contains 32 elements, the most of any period, including the lanthanides.",
    "detailedExplanation": "Period 6 of the periodic table contains 32 elements, making it the longest period. This period includes elements from Cesium (Cs, atomic number 55) to Radon (Rn, atomic number 86). The reason Period 6 is so long is that it includes the lanthanide series (elements 57-71), which are usually shown separately at the bottom of the periodic table to save space. These f-block elements significantly expand the period length. Period 7 also has the potential to contain 32 elements but is not yet complete as scientists continue to synthesize new superheavy elements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Period_6_element",
    "citationTitle": "Wikipedia: Period 6 element"
  },
  {
    "id": "e93e20a2-d98a-42e1-aab1-c8ffa5c94a65",
    "text": "Which element on the periodic table has the highest electronegativity value?",
    "options": [
      "Oxygen",
      "Chlorine",
      "Fluorine",
      "Nitrogen"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Fluorine has the highest electronegativity at 4.0 on the Pauling scale.",
    "detailedExplanation": "Electronegativity measures an atom's ability to attract electrons in a chemical bond. Fluorine, located in the top right of the periodic table, has the highest electronegativity value of 4.0 on the Pauling scale. This is because it has a small atomic radius and a high nuclear charge, making it extremely effective at pulling electrons toward itself. As you move across a period from left to right, electronegativity generally increases, and as you move down a group, it decreases. While oxygen, nitrogen, and chlorine all have high electronegativity values, none exceed fluorine's maximum value.",
    "citationUrl": "https://en.wikipedia.org/wiki/Electronegativity",
    "citationTitle": "Wikipedia: Electronegativity"
  },
  {
    "id": "38000c92-9fe3-4a12-839c-9b6225e02a37",
    "text": "Which element has the highest melting point of all elements on the periodic table?",
    "options": [
      "Tungsten",
      "Carbon",
      "Rhenium",
      "Osmium"
    ],
    "correctIndex": 0,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Tungsten has the highest melting point at 3,695°C (6,683°F).",
    "detailedExplanation": "Tungsten (W) holds the record for the highest melting point of any element at 3,695°C (6,683°F). This exceptional property makes it invaluable for high-temperature applications like light bulb filaments and rocket nozzles. While carbon can exist in forms with higher melting points, tungsten is the pure element with this distinction. Rhenium and osmium, though also refractory metals, have significantly lower melting points.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tungsten",
    "citationTitle": "Wikipedia: Tungsten"
  },
  {
    "id": "f872276c-3394-4e37-acff-d5a7c4c47f80",
    "text": "How many elements in the periodic table are named after planets or celestial bodies?",
    "options": [
      "5",
      "7",
      "9",
      "11"
    ],
    "correctIndex": 2,
    "category": "science",
    "difficulty": "medium",
    "explanation": "Nine elements are named after celestial bodies: Mercury, Uranium, Neptune, Plutonium, Cerium, Palladium, Selenium, Tellurium, and Helium.",
    "detailedExplanation": "Nine elements derive their names from planets, moons, asteroids, or other celestial bodies. These include Mercury (planet), Uranium (planet Uranus), Neptunium (planet Neptune), Plutonium (dwarf planet Pluto), Cerium (asteroid Ceres), Palladium (asteroid Pallas), Selenium (Greek for moon), Tellurium (Latin for earth), and Helium (Greek for sun). This naming convention reflects humanity's fascination with the cosmos and often commemorates major astronomical discoveries of the time when these elements were identified.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chemical_element",
    "citationTitle": "Wikipedia: Chemical element"
  }
]