[
  {
    "id": "814105b7-a979-406d-bffb-ecf8707bc9e8",
    "text": "What is the name of the boy wizard created by J.K. Rowling?",
    "options": [
      "Harry Potter",
      "Ron Weasley",
      "Draco Malfoy",
      "Neville Longbottom"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Harry Potter is the main character in J.K. Rowling's famous series of seven books.",
    "detailedExplanation": "Harry Potter is the titular character of J.K. Rowling's bestselling fantasy series that began with 'Harry Potter and the Philosopher's Stone' in 1997. The series follows Harry, an orphaned wizard who discovers his magical heritage on his 11th birthday and attends Hogwarts School of Witchcraft and Wizardry. The seven-book series became a global phenomenon and has been translated into numerous languages.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter",
    "citationTitle": "Wikipedia: Harry Potter"
  },
  {
    "id": "f233da0d-ce70-44d3-9fa1-9e2f7ee57566",
    "text": "In 'The Cat in the Hat' by Dr. Seuss, what two companions does the Cat bring with him?",
    "options": [
      "Thing One and Thing Two",
      "Hop and Pop",
      "Sam and Ham",
      "Fox and Socks"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Thing One and Thing Two are the mischievous red-haired creatures that the Cat in the Hat brings out of his box.",
    "detailedExplanation": "Published in 1957, 'The Cat in the Hat' by Dr. Seuss features the iconic Cat who visits two children on a rainy day. When the children seem bored, the Cat brings out Thing One and Thing Two from a big red box. These wild, blue-haired creatures cause chaos in the house before being captured and taken away by the Cat, who then cleans up the mess before the children's mother returns home.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Cat_in_the_Hat",
    "citationTitle": "Wikipedia: The Cat in the Hat"
  },
  {
    "id": "cfbd5598-fe27-4293-ace7-27e3b8ee9ac0",
    "text": "Which author wrote the classic children's book 'Charlotte's Web'?",
    "options": [
      "Roald Dahl",
      "E.B. White",
      "Maurice Sendak",
      "Shel Silverstein"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "E.B. White wrote 'Charlotte's Web' in 1952, the beloved story about a pig named Wilbur and his friendship with Charlotte the spider.",
    "detailedExplanation": "E.B. White published 'Charlotte's Web' in 1952, creating one of the most beloved children's novels of all time. The story centers on the friendship between Wilbur, a pig, and Charlotte, a barn spider who saves Wilbur from slaughter by writing messages in her web. The book deals with themes of friendship, sacrifice, and the cycle of life, and has remained a staple of children's literature for over 70 years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Charlotte%27s_Web",
    "citationTitle": "Wikipedia: Charlotte's Web"
  },
  {
    "id": "87b494e2-c93e-4591-94a0-08be3bc3159b",
    "text": "What is the name of the rabbit in Beatrix Potter's famous children's stories?",
    "options": [
      "Benjamin Bunny",
      "Peter Rabbit",
      "Cottontail",
      "Flopsy"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Peter Rabbit is the main character in Beatrix Potter's series, first appearing in 'The Tale of Peter Rabbit' in 1902.",
    "detailedExplanation": "Peter Rabbit is the protagonist of Beatrix Potter's first and most famous children's book, 'The Tale of Peter Rabbit,' published in 1902. The mischievous rabbit gets into trouble when he ventures into Mr. McGregor's garden despite his mother's warnings. Potter wrote and illustrated 23 small-format books featuring Peter Rabbit and other animal characters, creating a beloved series that has remained popular for over a century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peter_Rabbit",
    "citationTitle": "Wikipedia: Peter Rabbit"
  },
  {
    "id": "aa1b4caa-81d7-48c1-bd77-1e83c255a93b",
    "text": "In 'Where the Wild Things Are' by Maurice Sendak, what is the name of the main character?",
    "options": [
      "Max",
      "Sam",
      "Ben",
      "Jack"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Max is the young boy who sails to where the wild things are after being sent to his room without supper.",
    "detailedExplanation": "Published in 1963, 'Where the Wild Things Are' tells the story of Max, a young boy who creates a fantasy world of wild creatures after being sent to his room for misbehaving. Max imagines sailing to an island inhabited by monsters called Wild Things, where he becomes their king. Maurice Sendak's book was initially controversial but became a classic, winning the Caldecott Medal in 1964 for its distinctive illustrations and exploration of childhood emotions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Where_the_Wild_Things_Are",
    "citationTitle": "Wikipedia: Where the Wild Things Are"
  },
  {
    "id": "ef0c1718-7cb1-4138-9699-6bd806c8c9de",
    "text": "Which author created the character Matilda, a girl with telekinetic powers?",
    "options": [
      "Enid Blyton",
      "Roald Dahl",
      "Judy Blume",
      "Beverly Cleary"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Roald Dahl wrote 'Matilda' in 1988, featuring the brilliant young girl who develops psychokinetic abilities.",
    "detailedExplanation": "Roald Dahl published 'Matilda' in 1988, creating one of his most beloved characters. The story follows Matilda Wormwood, an exceptionally intelligent girl with neglectful parents and a tyrannical headmistress named Miss Trunchbull. Matilda discovers she has telekinetic powers, which she uses to stand up to the adults who mistreat her and other children. The book was later adapted into a successful film and stage musical.",
    "citationUrl": "https://en.wikipedia.org/wiki/Matilda_(novel)",
    "citationTitle": "Wikipedia: Matilda (novel)"
  },
  {
    "id": "f4e9c1da-5448-4171-b47b-eafb1c87a7a3",
    "text": "What type of animal is Paddington, the character created by Michael Bond?",
    "options": [
      "A rabbit",
      "A mouse",
      "A bear",
      "A badger"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Paddington is a bear from Peru who loves marmalade sandwiches and lives with the Brown family in London.",
    "detailedExplanation": "Paddington Bear first appeared in Michael Bond's 1958 book 'A Bear Called Paddington.' The character is a polite bear from Peru who is found at Paddington Station in London by the Brown family, who take him home. Paddington is known for his love of marmalade, his distinctive duffle coat and hat, and his tendency to get into amusing mishaps. The character has appeared in numerous books, TV shows, and films, becoming an iconic figure in British children's literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paddington_Bear",
    "citationTitle": "Wikipedia: Paddington Bear"
  },
  {
    "id": "0fe7f388-d1b9-452d-bfe2-66c48b44a533",
    "text": "In the 'Diary of a Wimpy Kid' series, what is the main character's name?",
    "options": [
      "Greg Heffley",
      "Rodrick Heffley",
      "Rowley Jefferson",
      "Fregley"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Greg Heffley is the middle school student who narrates the 'Diary of a Wimpy Kid' series through his journal entries.",
    "detailedExplanation": "Jeff Kinney created the character Greg Heffley for his 'Diary of a Wimpy Kid' series, which began in 2007. The books are presented as Greg's diary entries, chronicling his experiences as a middle school student dealing with typical adolescent challenges like friendship, school, and family relationships. The series combines text with simple cartoon-style illustrations and has become enormously popular, spawning numerous sequels and film adaptations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diary_of_a_Wimpy_Kid",
    "citationTitle": "Wikipedia: Diary of a Wimpy Kid"
  },
  {
    "id": "51f2a43c-1166-4647-878d-9c5de8695156",
    "text": "What is the name of the magical land accessed through a wardrobe in C.S. Lewis's famous series?",
    "options": [
      "Narnia",
      "Wonderland",
      "Neverland",
      "Middle-earth"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Narnia is the magical world accessed through the wardrobe in 'The Lion, the Witch and the Wardrobe.'",
    "detailedExplanation": "Narnia is the fictional realm created by C.S. Lewis in 'The Chronicles of Narnia' series. The magical world is first accessed by the Pevensie children through an old wardrobe in the Professor's house. The land is ruled by the great lion Aslan and is filled with talking animals, mythical creatures, and magical adventures that have captivated readers since the first book was published in 1950.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Chronicles_of_Narnia",
    "citationTitle": "Wikipedia: The Chronicles of Narnia"
  },
  {
    "id": "b2966e51-cdfc-45a3-9771-1f365a913022",
    "text": "Which classic fairy tale features a girl with extremely long hair trapped in a tower?",
    "options": [
      "Cinderella",
      "Rapunzel",
      "Snow White",
      "Sleeping Beauty"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Rapunzel is the fairy tale about a girl with long hair who is imprisoned in a tower.",
    "detailedExplanation": "Rapunzel is a German fairy tale recorded by the Brothers Grimm. The story tells of a young woman with impossibly long hair who is imprisoned in a tower by a witch. A prince discovers her and climbs her hair to reach her. The tale has been adapted numerous times in children's literature and has become one of the most recognizable fairy tales worldwide, emphasizing themes of captivity, love, and eventual freedom.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rapunzel",
    "citationTitle": "Wikipedia: Rapunzel"
  },
  {
    "id": "61c18b31-8894-41b6-b4fa-ac2d6124f3b5",
    "text": "What type of creature is Winnie-the-Pooh?",
    "options": [
      "Rabbit",
      "Tiger",
      "Bear",
      "Pig"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Winnie-the-Pooh is a teddy bear created by A.A. Milne.",
    "detailedExplanation": "Winnie-the-Pooh is a fictional anthropomorphic teddy bear created by English author A.A. Milne. The character first appeared in 1926 and was inspired by a toy bear owned by Milne's son, Christopher Robin Milne. Pooh Bear lives in the Hundred Acre Wood with his friends and is known for his love of honey and his simple, philosophical outlook on life. The character has become one of the most beloved figures in children's literature worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Winnie-the-Pooh",
    "citationTitle": "Wikipedia: Winnie-the-Pooh"
  },
  {
    "id": "a1d3199a-4dd2-48ca-ad3a-a1863497b87c",
    "text": "In 'The Very Hungry Caterpillar' by Eric Carle, what does the caterpillar eventually become?",
    "options": [
      "A beetle",
      "A butterfly",
      "A moth",
      "A dragonfly"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The caterpillar transforms into a beautiful butterfly at the end of the story.",
    "detailedExplanation": "Eric Carle's 'The Very Hungry Caterpillar,' published in 1969, follows a small caterpillar as it eats its way through various foods before forming a cocoon and emerging as a beautiful butterfly. The book is celebrated not only for its simple yet engaging story but also for teaching children about metamorphosis, the days of the week, counting, and nutrition. It has become one of the best-selling children's books of all time with its distinctive collage-style illustrations.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Very_Hungry_Caterpillar",
    "citationTitle": "Wikipedia: The Very Hungry Caterpillar"
  },
  {
    "id": "201b5c41-bd42-46f1-a03b-76784bb67b17",
    "text": "What is the name of the lion in C.S. Lewis's 'The Lion, the Witch and the Wardrobe'?",
    "options": [
      "Simba",
      "Aslan",
      "Mufasa",
      "Leo"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Aslan is the great lion who serves as a Christ-like figure in the Narnia series.",
    "detailedExplanation": "Aslan is the great lion and the true king of Narnia in C.S. Lewis's Chronicles of Narnia series. He is portrayed as a wise, powerful, and benevolent ruler who represents good in the eternal struggle against evil. Lewis, a Christian theologian, created Aslan as an allegorical representation of Jesus Christ. The character embodies themes of sacrifice, resurrection, and redemption, making the Narnia books work on both adventure and spiritual levels for readers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aslan",
    "citationTitle": "Wikipedia: Aslan"
  },
  {
    "id": "9e07cbd3-72f1-4537-b666-ffd4f5977117",
    "text": "Which author wrote the 'Goosebumps' series of horror books for children?",
    "options": [
      "Stephen King",
      "R.L. Stine",
      "Christopher Pike",
      "Roald Dahl"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "R.L. Stine is known as the 'Stephen King of children's literature' for his Goosebumps series.",
    "detailedExplanation": "R.L. Stine created the hugely popular 'Goosebumps' series, which became a cultural phenomenon in the 1990s. The series features standalone horror stories aimed at middle-grade readers, typically involving supernatural elements, monsters, and plot twists. Stine has written over 400 books in various series, but Goosebumps remains his most famous work, with over 400 million copies sold worldwide. The books were praised for getting reluctant readers interested in reading through their accessible horror themes.",
    "citationUrl": "https://en.wikipedia.org/wiki/R._L._Stine",
    "citationTitle": "Wikipedia: R. L. Stine"
  },
  {
    "id": "df23348b-c8d6-41fd-81da-cebdc13ea02e",
    "text": "What is the first book in Suzanne Collins's popular trilogy about a dystopian future?",
    "options": [
      "Catching Fire",
      "The Hunger Games",
      "Mockingjay",
      "The Ballad of Songbirds"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'The Hunger Games' is the first book in the trilogy, followed by 'Catching Fire' and 'Mockingjay.'",
    "detailedExplanation": "'The Hunger Games,' published in 2008, is the first novel in Suzanne Collins's dystopian trilogy. Set in a post-apocalyptic North America, the story follows 16-year-old Katniss Everdeen who volunteers to take her sister's place in a televised fight to the death. The book became a massive success in young adult literature, spawning a successful film franchise and influencing numerous other dystopian novels. The series explores themes of survival, government oppression, media manipulation, and the cost of war.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Hunger_Games",
    "citationTitle": "Wikipedia: The Hunger Games"
  },
  {
    "id": "24ae8f53-b120-40ff-979d-96f51b2f8561",
    "text": "In Lewis Carroll's 'Alice's Adventures in Wonderland,' what does Alice follow down the rabbit hole?",
    "options": [
      "The Cheshire Cat",
      "The Mad Hatter",
      "The White Rabbit",
      "The Queen of Hearts"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Alice follows the White Rabbit down the rabbit hole, which begins her adventure in Wonderland.",
    "detailedExplanation": "In Lewis Carroll's 1865 classic 'Alice's Adventures in Wonderland,' Alice's journey begins when she spots a White Rabbit checking a pocket watch and exclaiming about being late. Curious, Alice follows the rabbit down its hole and falls into the fantastical world of Wonderland. The White Rabbit serves as the catalyst for Alice's adventure and appears throughout the story, often hurrying about the Queen of Hearts' business. This opening scene has become one of the most iconic moments in children's literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alice%27s_Adventures_in_Wonderland",
    "citationTitle": "Wikipedia: Alice's Adventures in Wonderland"
  },
  {
    "id": "da7d641e-f6e3-42dc-bdc6-aedb706f7bd1",
    "text": "In Roald Dahl's 'Charlie and the Chocolate Factory,' what is the name of the chocolate factory owner?",
    "options": [
      "Willy Wonka",
      "Augustus Gloop",
      "Grandpa Joe",
      "Mr. Bucket"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Willy Wonka is the eccentric owner of the chocolate factory in Roald Dahl's classic novel.",
    "detailedExplanation": "Willy Wonka is the mysterious and whimsical chocolate factory owner who invites five children, including Charlie Bucket, to tour his magical factory. Created by Roald Dahl in 1964, Wonka has become one of the most iconic characters in children's literature, known for his purple velvet coat, top hat, and inventive candy creations. The character has been portrayed in various adaptations, most notably by Gene Wilder in the 1971 film.",
    "citationUrl": "https://en.wikipedia.org/wiki/Charlie_and_the_Chocolate_Factory",
    "citationTitle": "Wikipedia: Charlie and the Chocolate Factory"
  },
  {
    "id": "85419afc-ff28-42f0-94a1-5f3d56ca6cd9",
    "text": "Which children's book series features a young detective named Encyclopedia Brown?",
    "options": [
      "The Hardy Boys",
      "Encyclopedia Brown",
      "Nancy Drew",
      "The Boxcar Children"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Encyclopedia Brown is the main character in his own series of detective books written by Donald J. Sobol.",
    "detailedExplanation": "The Encyclopedia Brown series, created by Donald J. Sobol, features ten-year-old Leroy 'Encyclopedia' Brown, who helps his police chief father solve crimes and runs his own detective agency. The series, which began in 1963, is known for its interactive format where readers can try to solve the mysteries alongside the young detective. Each book typically contains several short mystery stories that encourage critical thinking and deductive reasoning skills in young readers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Encyclopedia_Brown",
    "citationTitle": "Wikipedia: Encyclopedia Brown"
  },
  {
    "id": "6c2723f0-af06-4323-a962-a32981bc6d3f",
    "text": "What is the name of the island where the boys are stranded in William Golding's 'Lord of the Flies'?",
    "options": [
      "Treasure Island",
      "Skull Island",
      "The island is never named",
      "Paradise Island"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The island in 'Lord of the Flies' is never given a specific name in the novel.",
    "detailedExplanation": "In William Golding's 1954 novel 'Lord of the Flies,' the tropical island where a group of British boys become stranded is deliberately left unnamed. This anonymous setting serves Golding's allegorical purpose, making the island a universal symbol rather than a specific place. The novel, often studied in schools, explores themes of civilization versus savagery as the boys attempt to govern themselves while awaiting rescue, making it a significant work in young adult literature despite its mature themes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lord_of_the_Flies",
    "citationTitle": "Wikipedia: Lord of the Flies"
  },
  {
    "id": "f43c00b0-20e1-45f4-90d6-fed0e828c6ec",
    "text": "In the 'Captain Underpants' series by Dav Pilkey, what are the names of the two main characters who create the superhero?",
    "options": [
      "Tommy and Billy",
      "George and Harold",
      "Mike and Dave",
      "Ben and Jerry"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "George Beard and Harold Hutchins are the two fourth-grade friends who hypnotize their principal into becoming Captain Underpants.",
    "detailedExplanation": "George Beard and Harold Hutchins are the creative duo behind the Captain Underpants comic books within Dav Pilkey's popular series. These fourth-grade best friends are known for their pranks and their ability to hypnotize their principal, Mr. Krupp, transforming him into their underwear-clad superhero creation. The series, which began in 1997, combines comic book elements with traditional narrative and has been praised for encouraging reluctant readers, particularly boys, to develop a love for reading through its humor and engaging illustrations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Captain_Underpants",
    "citationTitle": "Wikipedia: Captain Underpants"
  }
]