[
  {
    "id": "87d95d27-d5f9-43b8-be4d-0cfe4c4fa9ca",
    "text": "Which country was the first to establish diplomatic relations with the Vatican after the signing of the Lateran Treaty in 1929?",
    "options": [
      "Italy",
      "France",
      "Spain",
      "Poland"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Italy was the first country to establish diplomatic relations with the Vatican following the Lateran Treaty.",
    "detailedExplanation": "The Lateran Treaty of 1929, signed between Pope Pius XI and Benito Mussolini, established Vatican City as a sovereign state and resolved the 'Roman Question' that had persisted since 1870. As part of this agreement, Italy became the first nation to formally establish diplomatic relations with the newly recognized Vatican state, ending nearly 60 years of diplomatic isolation for the Holy See.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lateran_Treaty",
    "citationTitle": "Wikipedia: Lateran Treaty"
  },
  {
    "id": "2fd04595-1f31-48de-8396-c9199f4ee2bf",
    "text": "The 1961 Vienna Convention on Diplomatic Relations established four classes of diplomatic heads of mission. Which is NOT one of them?",
    "options": [
      "Ambassadors extraordinary and plenipotentiary",
      "Envoys extraordinary and ministers plenipotentiary",
      "Chargés d'affaires ad interim",
      "High commissioners"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "High commissioners are not one of the four classes defined in the Vienna Convention; they are used specifically within the Commonwealth.",
    "detailedExplanation": "The Vienna Convention on Diplomatic Relations of 1961 established three main classes of diplomatic heads of mission: ambassadors extraordinary and plenipotentiary, envoys extraordinary and ministers plenipotentiary, and chargés d'affaires accredited to ministers for foreign affairs. Chargés d'affaires ad interim serve temporarily when the head of mission is absent. High commissioners, while equivalent to ambassadors, are specifically used between Commonwealth countries and were not part of the Vienna Convention's classification system.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vienna_Convention_on_Diplomatic_Relations",
    "citationTitle": "Wikipedia: Vienna Convention on Diplomatic Relations"
  },
  {
    "id": "62c65c5c-6278-4ff8-8833-828dcb3ac1b5",
    "text": "Which two countries famously conducted 'ping-pong diplomacy' that helped thaw relations in the early 1970s?",
    "options": [
      "USA and Soviet Union",
      "USA and China",
      "China and Japan",
      "Soviet Union and China"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Ping-pong diplomacy occurred between the USA and China in 1971, leading to Nixon's historic visit.",
    "detailedExplanation": "Ping-pong diplomacy began in April 1971 when the Chinese table tennis team invited the U.S. team to visit China during the World Table Tennis Championships in Japan. This sporting exchange became the first step in thawing Sino-American relations after more than 20 years of diplomatic isolation. The initiative paved the way for Henry Kissinger's secret visit to Beijing and ultimately President Nixon's groundbreaking trip to China in February 1972, fundamentally reshaping global geopolitics during the Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ping-pong_diplomacy",
    "citationTitle": "Wikipedia: Ping-pong diplomacy"
  },
  {
    "id": "e72c0266-297e-4e61-8bc6-399b2b2c3f59",
    "text": "The Westphalian system of sovereignty, fundamental to modern diplomacy, originated from which 1648 treaty?",
    "options": [
      "Treaty of Münster",
      "Peace of Westphalia",
      "Treaty of Osnabrück",
      "Treaty of Pyrenees"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Peace of Westphalia established the modern concept of state sovereignty in international relations.",
    "detailedExplanation": "The Peace of Westphalia in 1648 ended the Thirty Years' War and established the fundamental principle of state sovereignty that still underpins modern international law and diplomacy. This treaty system introduced the concept that sovereign states should not interfere in each other's internal affairs and established the principle of legal equality between states regardless of size or power. The Westphalian system became the foundation for modern diplomatic practice and international relations theory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_of_Westphalia",
    "citationTitle": "Wikipedia: Peace of Westphalia"
  },
  {
    "id": "d2f55e64-e959-49dd-a386-08ab86b805a0",
    "text": "Which country maintains the most diplomatic missions (embassies and consulates) worldwide?",
    "options": [
      "United States",
      "China",
      "France",
      "United Kingdom"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "France maintains the largest diplomatic network globally with over 160 countries having French diplomatic missions.",
    "detailedExplanation": "France operates the world's most extensive diplomatic network, with diplomatic missions in more countries than any other nation. This vast network reflects France's historical colonial ties, its role as a permanent member of the UN Security Council, and its commitment to maintaining global influence through 'soft power' diplomacy. The French diplomatic service includes embassies, consulates, and cultural centers across all inhabited continents, often maintaining representation in countries where other major powers have limited presence.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_diplomatic_missions_of_France",
    "citationTitle": "Wikipedia: List of diplomatic missions of France"
  },
  {
    "id": "81ea7d46-1a20-4d34-ace4-5f4b197a8b19",
    "text": "The concept of 'extraterritoriality' in diplomacy was most notably imposed on China through which series of treaties?",
    "options": [
      "Unequal Treaties",
      "Boxer Protocol",
      "Twenty-One Demands",
      "Washington Naval Treaties"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Unequal Treaties imposed extraterritoriality on China, exempting foreign nationals from Chinese law.",
    "detailedExplanation": "The Unequal Treaties, beginning with the Treaty of Nanjing in 1842, imposed extraterritoriality on China, meaning foreign nationals were subject to their own country's laws rather than Chinese jurisdiction. This system allowed Western powers and Japan to establish concessions and settlements where their citizens lived under their own legal systems. Extraterritoriality became a symbol of China's 'century of humiliation' and was only fully abolished after World War II, representing one of the most controversial aspects of 19th and early 20th-century diplomacy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Unequal_treaty",
    "citationTitle": "Wikipedia: Unequal treaty"
  },
  {
    "id": "bd11afea-52e4-46e0-8af8-3178146c93e1",
    "text": "Which diplomatic protocol principle states that the longest-serving ambassador automatically becomes the senior diplomatic representative?",
    "options": [
      "Droit de préséance",
      "Doyen system",
      "Vienna precedence",
      "Dean of diplomatic corps"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Doyen system makes the longest-serving ambassador the senior diplomatic representative or Dean of the diplomatic corps.",
    "detailedExplanation": "The Doyen system is a diplomatic protocol whereby the ambassador who has been accredited the longest in a particular country automatically becomes the Dean (or Doyen) of the diplomatic corps. This system ensures orderly precedence among diplomatic representatives and provides a senior figure to speak collectively for the diplomatic community when needed. In some countries, particularly those with strong Catholic traditions, the Papal Nuncio automatically serves as Dean regardless of length of service, but the Doyen system based on seniority is more widely used globally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dean_of_the_diplomatic_corps",
    "citationTitle": "Wikipedia: Dean of the diplomatic corps"
  },
  {
    "id": "20bdad56-42d7-47a6-8406-4e287ebeffda",
    "text": "The 'Two Chinas' problem in international diplomacy primarily revolves around recognition disputes between which entities?",
    "options": [
      "People's Republic of China and Hong Kong",
      "People's Republic of China and Taiwan",
      "Taiwan and Macau",
      "Mainland China and Tibet"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The 'Two Chinas' problem involves diplomatic recognition disputes between the People's Republic of China and Taiwan (Republic of China).",
    "detailedExplanation": "The 'Two Chinas' problem arose after the Chinese Civil War when the defeated Republic of China government retreated to Taiwan in 1949, while the victorious Communists established the People's Republic of China on the mainland. Both governments claimed to be the legitimate ruler of all China, creating a diplomatic dilemma for other nations who had to choose which government to recognize. This situation has dominated East Asian diplomacy for decades, with most countries eventually switching recognition from Taiwan to the PRC, especially after the PRC joined the United Nations in 1971.",
    "citationUrl": "https://en.wikipedia.org/wiki/Two_Chinas",
    "citationTitle": "Wikipedia: Two Chinas"
  },
  {
    "id": "dca69d37-916e-4869-bf82-d19cfe680eb9",
    "text": "Which diplomatic immunity principle was established by the 1961 Vienna Convention that prevents diplomats from being prosecuted under the host country's criminal law?",
    "options": [
      "Diplomatic inviolability",
      "Diplomatic immunity",
      "Consular protection",
      "Extraterritorial jurisdiction"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Diplomatic immunity grants diplomats exemption from the host country's criminal jurisdiction.",
    "detailedExplanation": "The Vienna Convention on Diplomatic Relations of 1961 codified the principle of diplomatic immunity, which provides diplomats with immunity from criminal prosecution in their host country. This principle ensures that diplomatic personnel can perform their duties without fear of legal harassment, though serious crimes can still result in the diplomat being declared persona non grata and expelled. The immunity extends to the diplomat's family and official residence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diplomatic_immunity",
    "citationTitle": "Wikipedia: Diplomatic immunity"
  },
  {
    "id": "5e79bfb9-f326-4b8c-a23c-9fd85fb9b78c",
    "text": "The Camp David Accords of 1978, which led to the Egypt-Israel Peace Treaty, were mediated by which U.S. President?",
    "options": [
      "Gerald Ford",
      "Jimmy Carter",
      "Ronald Reagan",
      "Richard Nixon"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "President Jimmy Carter mediated the historic Camp David Accords between Egypt's Sadat and Israel's Begin.",
    "detailedExplanation": "President Jimmy Carter hosted Egyptian President Anwar Sadat and Israeli Prime Minister Menachem Begin at Camp David for thirteen days in September 1978. Carter's persistent mediation efforts resulted in the Camp David Accords, which established a framework for peace between Egypt and Israel. This diplomatic breakthrough led to the Egypt-Israel Peace Treaty in 1979, making Egypt the first Arab country to officially recognize Israel, though it resulted in Egypt's temporary suspension from the Arab League.",
    "citationUrl": "https://en.wikipedia.org/wiki/Camp_David_Accords",
    "citationTitle": "Wikipedia: Camp David Accords"
  },
  {
    "id": "08721ef8-6083-4c21-af9b-53cba15cf3d4",
    "text": "Which country's diplomatic strategy of 'shuttle diplomacy' was pioneered by Henry Kissinger during the 1973 Yom Kippur War aftermath?",
    "options": [
      "Soviet Union",
      "United Kingdom",
      "France",
      "United States"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Henry Kissinger, as U.S. Secretary of State, pioneered shuttle diplomacy by traveling between Middle Eastern capitals.",
    "detailedExplanation": "Henry Kissinger, serving as U.S. Secretary of State under President Nixon, developed the diplomatic technique known as 'shuttle diplomacy' following the 1973 Yom Kippur War. This involved Kissinger personally traveling back and forth between Israel, Egypt, and Syria to negotiate ceasefire agreements and prisoner exchanges. His intensive personal diplomacy helped establish the framework for later peace negotiations and demonstrated the effectiveness of high-level, face-to-face diplomatic engagement in resolving complex international conflicts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shuttle_diplomacy",
    "citationTitle": "Wikipedia: Shuttle diplomacy"
  },
  {
    "id": "cda6760a-d6a5-4580-8178-0cf32033aa82",
    "text": "The doctrine of 'persona non grata' allows host countries to expel diplomats without explanation, but which country holds the record for the largest single mass expulsion of diplomats?",
    "options": [
      "United Kingdom",
      "United States",
      "Russia",
      "China"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The UK expelled 105 Soviet diplomats in 1971 following espionage revelations, the largest single mass expulsion in history.",
    "detailedExplanation": "In September 1971, the United Kingdom expelled 105 Soviet diplomats and officials in what became known as 'Operation Foot.' This mass expulsion followed the defection of Oleg Lyalin, a KGB operative who revealed extensive Soviet espionage operations in Britain. The UK government declared the expelled individuals persona non grata, effectively cutting the Soviet embassy staff in London by half. This remains the largest single mass expulsion of diplomats in history and significantly damaged Soviet intelligence capabilities in Western Europe during the Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Operation_Foot",
    "citationTitle": "Wikipedia: Operation Foot"
  },
  {
    "id": "9b24f87a-a0a5-4bab-a9b1-9c67e56c63d4",
    "text": "Which multilateral diplomatic forum, established in 1975, brought together European countries, the US, Canada, and Soviet Union to discuss security and cooperation?",
    "options": [
      "Warsaw Pact",
      "Conference on Security and Cooperation in Europe",
      "North Atlantic Treaty Organization",
      "European Economic Community"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The CSCE (later OSCE) was established by the Helsinki Accords in 1975 to promote East-West dialogue during the Cold War.",
    "detailedExplanation": "The Conference on Security and Cooperation in Europe (CSCE) was established through the Helsinki Accords signed in 1975 by 35 nations including all European countries, the United States, Canada, and the Soviet Union. The conference created a unique diplomatic platform for East-West dialogue during the Cold War, addressing security issues, economic cooperation, and human rights. The CSCE was later institutionalized as the Organization for Security and Cooperation in Europe (OSCE) in 1995 and continues to serve as a forum for conflict prevention and democratization.",
    "citationUrl": "https://en.wikipedia.org/wiki/Conference_on_Security_and_Cooperation_in_Europe",
    "citationTitle": "Wikipedia: Conference on Security and Cooperation in Europe"
  },
  {
    "id": "769af10d-77b9-4a7a-91bc-2c2735e4b499",
    "text": "The 'Ostpolitik' diplomatic strategy of the 1970s, aimed at improving relations with Eastern Europe, was primarily pursued by which country?",
    "options": [
      "France",
      "West Germany",
      "United Kingdom",
      "Italy"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "West Germany's Ostpolitik under Willy Brandt sought to normalize relations with East Germany and Eastern Europe.",
    "detailedExplanation": "Ostpolitik (Eastern Policy) was West Germany's diplomatic strategy initiated by Chancellor Willy Brandt in the late 1960s and early 1970s to improve relations with East Germany, Poland, and the Soviet Union. This policy marked a significant shift from the previous Hallstein Doctrine, which sought to isolate East Germany diplomatically. Key achievements included the Treaty of Moscow with the Soviet Union (1970), the Treaty of Warsaw with Poland (1970), and the Basic Treaty with East Germany (1972). This diplomatic opening helped reduce tensions in Central Europe and eventually contributed to German reunification.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ostpolitik",
    "citationTitle": "Wikipedia: Ostpolitik"
  },
  {
    "id": "94462e9f-c97b-49e8-97ca-0c9b8a95ac5b",
    "text": "Which international diplomatic principle, established in the UN Charter, prohibits countries from interfering in the domestic affairs of other sovereign states?",
    "options": [
      "Right of self-determination",
      "Non-intervention",
      "Territorial integrity",
      "Sovereign equality"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The principle of non-intervention prohibits states from interfering in each other's internal affairs.",
    "detailedExplanation": "The principle of non-intervention, codified in Article 2(7) of the UN Charter, prohibits member states from intervening in matters that are essentially within the domestic jurisdiction of other states. This fundamental principle of international law aims to protect state sovereignty and prevent external interference in internal affairs such as political systems, elections, or domestic policies. However, this principle can sometimes conflict with other international obligations, such as humanitarian intervention or the responsibility to protect populations from genocide and crimes against humanity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Non-intervention_principle",
    "citationTitle": "Wikipedia: Non-intervention principle"
  },
  {
    "id": "40521a49-2c57-43e1-a6f5-f66405a8af90",
    "text": "The 'Good Friday Agreement' of 1998, which helped end decades of conflict in Northern Ireland, involved diplomatic negotiations between how many governments?",
    "options": [
      "Two",
      "Three",
      "Four",
      "Five"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Good Friday Agreement involved the British government, Irish government, and Northern Ireland parties in trilateral negotiations.",
    "detailedExplanation": "The Good Friday Agreement (Belfast Agreement) of 1998 was the result of multi-party negotiations involving three governmental levels: the British government, the Irish government, and the various political parties in Northern Ireland representing both unionist and nationalist communities. The agreement was facilitated by international mediation, particularly from U.S. Senator George Mitchell. This complex diplomatic achievement established power-sharing arrangements in Northern Ireland, addressed the constitutional status of the region, and included provisions for prisoner releases and police reform, effectively ending the decades-long conflict known as 'The Troubles.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Good_Friday_Agreement",
    "citationTitle": "Wikipedia: Good Friday Agreement"
  },
  {
    "id": "0f4ae01a-715e-4486-8779-17277e78a27e",
    "text": "Which diplomatic practice, dating back to ancient times, involves exchanging hostages or family members to guarantee the fulfillment of treaties and agreements?",
    "options": [
      "Diplomatic asylum",
      "Hostage diplomacy",
      "Marriage diplomacy",
      "Tribute diplomacy"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Marriage diplomacy involves arranging marriages between ruling families to cement political alliances and treaties.",
    "detailedExplanation": "Marriage diplomacy, also known as matrimonial diplomacy, has been used throughout history as a way to forge and maintain political alliances between nations, kingdoms, and empires. By marrying members of royal or noble families to each other, rulers could create binding ties that would theoretically prevent warfare and ensure cooperation. This practice was particularly common in medieval and early modern Europe, where royal marriages were strategic political tools rather than matters of personal choice. Famous examples include the marriage of Catherine of Aragon to Henry VIII to strengthen English-Spanish relations, and numerous Habsburg marriages designed to expand their territorial influence across Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marriage_diplomacy",
    "citationTitle": "Wikipedia: Marriage diplomacy"
  },
  {
    "id": "f1c22d43-eb85-449a-b0fb-e1375ad0a2b1",
    "text": "The 'Truman Doctrine' of 1947, which pledged U.S. support to countries threatened by Soviet expansion, was first applied to provide aid to which two countries?",
    "options": [
      "Poland and Czechoslovakia",
      "Greece and Turkey",
      "Italy and France",
      "Iran and Afghanistan"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Truman Doctrine was first implemented to provide military and economic aid to Greece and Turkey in 1947.",
    "detailedExplanation": "The Truman Doctrine was announced by President Harry S. Truman on March 12, 1947, in response to the British government's inability to continue supporting the Greek government against communist insurgents and Turkey against Soviet pressure. The doctrine established the principle that the United States would provide political, military, and economic assistance to all democratic nations under threat from external or internal authoritarian forces. Greece was facing a communist-led civil war, while Turkey was under pressure from the Soviet Union regarding control of the Turkish Straits. This marked a significant shift in American foreign policy from isolationism to active global engagement and became a cornerstone of Cold War diplomacy and the containment strategy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Truman_Doctrine",
    "citationTitle": "Wikipedia: Truman Doctrine"
  },
  {
    "id": "c52b03e7-e150-4f41-b5dc-9e624f98820c",
    "text": "Which diplomatic rank, traditionally held by representatives to smaller or less important countries, literally means 'sent' in Latin and ranks below an ambassador?",
    "options": [
      "Chargé d'affaires",
      "Minister plenipotentiary",
      "Envoy extraordinary",
      "Papal nuncio"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Minister plenipotentiary comes from Latin meaning 'sent with full power' and traditionally ranks below ambassador.",
    "detailedExplanation": "A Minister Plenipotentiary is a diplomatic rank that originated from the Latin term meaning 'sent with full power.' According to the Vienna Convention on Diplomatic Relations of 1961, this is the second-highest class of diplomatic representatives, ranking below ambassadors but above ministers resident and chargés d'affaires. Historically, ministers plenipotentiary were appointed to represent their country in nations considered less strategically important than those receiving ambassadors. They possess full authority to negotiate and conclude agreements on behalf of their government, hence the 'plenipotentiary' designation. This rank was more commonly used in the 19th and early 20th centuries, though some countries still employ it today, particularly for specific missions or to certain international organizations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Minister_plenipotentiary",
    "citationTitle": "Wikipedia: Minister plenipotentiary"
  },
  {
    "id": "27bd99ac-e39d-4663-a780-abb795b139cf",
    "text": "The diplomatic concept of 'most favored nation' (MFN) status in trade relations means that a country will receive what type of treatment?",
    "options": [
      "Exclusive trading privileges with the granting nation",
      "The same trade terms as the best-treated trading partner",
      "Preferential tariff rates below all other nations",
      "Guaranteed minimum import quotas regardless of demand"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "MFN status ensures a country receives the same favorable trade terms as the most privileged trading partner.",
    "detailedExplanation": "Most Favored Nation (MFN) status is a fundamental principle in international trade diplomacy that ensures non-discriminatory treatment between trading partners. When a country grants MFN status to another, it promises to extend any trade advantages, particularly lower tariffs or reduced trade barriers, that it offers to any third country. This means that if Country A grants a 5% tariff reduction to Country B, it must automatically extend the same 5% reduction to all countries with MFN status. The principle became a cornerstone of the General Agreement on Tariffs and Trade (GATT) and later the World Trade Organization (WTO), where it's referred to as 'normal trade relations.' Despite the name suggesting special treatment, MFN status is actually the standard level of treatment expected in modern international trade relations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Most_favoured_nation",
    "citationTitle": "Wikipedia: Most favoured nation"
  }
]