[
  {
    "id": "335cba50-15b9-49c3-99df-0eebc5b06e42",
    "text": "Which diplomatic principle, established in the 1648 Peace of Westphalia, forms the foundation of modern international relations?",
    "options": [
      "Balance of power",
      "Sovereign equality of states",
      "Collective security",
      "Economic interdependence"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Peace of Westphalia established the principle of sovereign equality, meaning states have equal rights regardless of size or power.",
    "detailedExplanation": "The Peace of Westphalia in 1648 ended the Thirty Years' War and established the Westphalian system of international relations. This system introduced the concept of sovereign equality, where all states, regardless of their size, population, or military strength, have equal standing in international law. This principle became the cornerstone of modern diplomacy and international relations, establishing that states should not interfere in each other's internal affairs and that territorial integrity should be respected.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_of_Westphalia",
    "citationTitle": "Wikipedia: Peace of Westphalia"
  },
  {
    "id": "c5586298-95d2-467c-8cf9-3aad0e5025f6",
    "text": "What is the term for a diplomat who is declared unwelcome by a host country and must leave immediately?",
    "options": [
      "Persona non grata",
      "Diplomatic pariah",
      "Ambassador emeritus",
      "Cultural attaché"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Persona non grata is the official diplomatic term for declaring a foreign diplomat unwelcome and requiring their departure.",
    "detailedExplanation": "Persona non grata is a Latin term meaning 'unwelcome person' used in diplomatic protocol. When a host country declares a foreign diplomat persona non grata, it means that person is no longer acceptable and must leave the country immediately. This is typically done in response to espionage activities, violations of diplomatic protocol, or as a form of diplomatic protest. The declaration is one of the strongest diplomatic tools short of severing diplomatic relations entirely, and it often leads to reciprocal actions by the affected diplomat's home country.",
    "citationUrl": "https://en.wikipedia.org/wiki/Persona_non_grata",
    "citationTitle": "Wikipedia: Persona non grata"
  },
  {
    "id": "0e2472bc-c619-49f9-b709-240e098dcc5c",
    "text": "Which country holds the record for having diplomatic relations with the most countries in the world?",
    "options": [
      "United States",
      "China",
      "United Kingdom",
      "France"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "China maintains diplomatic relations with 180 countries, more than any other nation, including many that don't recognize Taiwan.",
    "detailedExplanation": "China has established diplomatic relations with approximately 180 countries worldwide, making it the nation with the most diplomatic partnerships. This extensive network is partly due to China's 'One China' policy, where countries must choose between recognizing either the People's Republic of China or Taiwan (Republic of China), but not both. China's growing economic influence through initiatives like the Belt and Road Initiative has also helped expand its diplomatic reach, particularly in Africa, Asia, and Latin America. The United States maintains relations with about 195 countries but has fewer formal diplomatic partnerships due to various political considerations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Foreign_relations_of_China",
    "citationTitle": "Wikipedia: Foreign relations of China"
  },
  {
    "id": "64d855f7-5d1f-4bad-8023-168ec78386be",
    "text": "What diplomatic immunity principle prevents foreign diplomats from being prosecuted under local laws?",
    "options": [
      "Vienna Convention",
      "Geneva Protocol",
      "Hague Convention",
      "Brussels Agreement"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Vienna Convention on Diplomatic Relations (1961) codifies diplomatic immunity, protecting diplomats from local prosecution.",
    "detailedExplanation": "The Vienna Convention on Diplomatic Relations, signed in 1961, is the international treaty that governs diplomatic immunity. Under this convention, diplomatic agents cannot be arrested, detained, or prosecuted by the host country's legal system. This immunity extends to their official residences, documents, and correspondence. The principle exists to ensure diplomats can perform their duties without fear of harassment or intimidation by host governments. However, diplomats can still be declared persona non grata for serious violations, and their home country may waive immunity in exceptional cases. The convention has been ratified by 192 countries, making it nearly universal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vienna_Convention_on_Diplomatic_Relations",
    "citationTitle": "Wikipedia: Vienna Convention on Diplomatic Relations"
  },
  {
    "id": "b48b108c-2c81-4e74-a669-b38108fc2851",
    "text": "Which two countries famously restored diplomatic relations in 2015 after more than 50 years of hostility?",
    "options": [
      "North Korea and South Korea",
      "India and Pakistan",
      "Cuba and the United States",
      "Iran and Saudi Arabia"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Cuba and the US restored diplomatic relations in 2015 under President Obama, ending over 50 years of diplomatic isolation.",
    "detailedExplanation": "In December 2014, Presidents Barack Obama and Raúl Castro announced the decision to restore diplomatic relations between Cuba and the United States, which had been severed in 1961 during the Cold War. The normalization process included prisoner exchanges, the reopening of embassies in both countries in 2015, and the easing of some trade and travel restrictions. This historic rapprochement ended the longest diplomatic standoff in the Western Hemisphere. However, relations have fluctuated since then, with subsequent U.S. administrations taking different approaches to Cuba policy, demonstrating how diplomatic relations can be influenced by changing political leadership.",
    "citationUrl": "https://en.wikipedia.org/wiki/2014%E2%80%9316_Cuban_thaw",
    "citationTitle": "Wikipedia: 2014–16 Cuban thaw"
  },
  {
    "id": "185b0296-a841-4671-b926-4eaa604140d6",
    "text": "What is the highest-ranking diplomatic position below ambassador in most embassy structures?",
    "options": [
      "Consul General",
      "Deputy Chief of Mission",
      "Political Counselor",
      "First Secretary"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Deputy Chief of Mission (DCM) is typically the second-highest ranking diplomat in an embassy, serving as the ambassador's deputy.",
    "detailedExplanation": "The Deputy Chief of Mission (DCM) serves as the ambassador's principal deputy and second-in-command at an embassy. The DCM typically holds the personal rank of Minister-Counselor and assumes the role of Chargé d'Affaires when the ambassador is absent or when the ambassadorial position is vacant. This position requires extensive diplomatic experience and often serves as a stepping stone to becoming an ambassador. The DCM coordinates the work of various embassy sections, represents the ambassador at important meetings, and manages day-to-day embassy operations. Different countries may use slightly different titles, but the DCM role is standard in most diplomatic missions worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Deputy_chief_of_mission",
    "citationTitle": "Wikipedia: Deputy chief of mission"
  },
  {
    "id": "151bbfeb-679c-4394-bdf6-9426e78a774f",
    "text": "Which international organization serves as the primary forum for multilateral diplomacy with 193 member states?",
    "options": [
      "World Trade Organization",
      "United Nations",
      "International Monetary Fund",
      "World Health Organization"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The United Nations, with 193 member states, is the world's primary forum for international diplomacy and multilateral negotiations.",
    "detailedExplanation": "The United Nations, established in 1945, serves as the world's most important platform for multilateral diplomacy. With 193 member states, it provides a forum where countries can discuss global issues, negotiate treaties, and attempt to resolve international disputes peacefully. The UN General Assembly acts as a global parliament where each member state has one vote, while the Security Council handles matters of international peace and security. The organization facilitates diplomatic dialogue on issues ranging from climate change to human rights, trade disputes to peacekeeping operations. Its headquarters in New York hosts thousands of diplomatic meetings annually, making it the epicenter of international diplomacy.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Nations",
    "citationTitle": "Wikipedia: United Nations"
  },
  {
    "id": "ad5275e2-4c68-4b81-8894-07c61c86cf07",
    "text": "What term describes the practice of conducting negotiations and maintaining relations between nations through official representatives?",
    "options": [
      "Statecraft",
      "Diplomacy",
      "International law",
      "Foreign policy"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Diplomacy is the specific term for conducting international relations and negotiations through official representatives.",
    "detailedExplanation": "Diplomacy is the art and practice of conducting negotiations and maintaining relations between nations through their official representatives. It encompasses various activities including negotiating treaties, resolving disputes, gathering intelligence about other countries' intentions, and promoting trade and cultural exchanges. Modern diplomacy evolved from ancient practices but became formalized during the Renaissance period with the establishment of permanent embassies. Diplomatic practice includes both bilateral relations (between two countries) and multilateral diplomacy (involving multiple nations). Effective diplomacy often prevents conflicts and promotes peaceful resolution of international disputes, making it essential for global stability and cooperation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diplomacy",
    "citationTitle": "Wikipedia: Diplomacy"
  },
  {
    "id": "8e1cc762-4486-43d2-8873-9e154b637e1e",
    "text": "Which city hosts the most diplomatic missions and embassies in the world?",
    "options": [
      "New York City",
      "Washington D.C.",
      "London",
      "Geneva"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Washington D.C. hosts approximately 175 foreign embassies, making it the world's largest diplomatic hub.",
    "detailedExplanation": "Washington D.C. serves as the world's primary diplomatic center, hosting more foreign embassies than any other city globally. As the capital of the United States, it houses approximately 175 foreign diplomatic missions, ranging from major embassies to smaller diplomatic offices. This concentration of diplomatic activity makes Washington D.C. a crucial hub for international relations and bilateral diplomacy, with embassy row being one of the most diplomatically significant areas in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_diplomatic_missions_in_Washington,_D.C.",
    "citationTitle": "Wikipedia: List of diplomatic missions in Washington, D.C."
  },
  {
    "id": "82bcae96-b7d8-4e9a-817a-f821622a6df6",
    "text": "What is the name of the 1961 international treaty that codified the rules governing diplomatic relations between countries?",
    "options": [
      "Geneva Convention on Diplomacy",
      "Vienna Convention on Diplomatic Relations",
      "Treaty of Rome on Diplomacy",
      "Brussels Protocol on Embassy Relations"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Vienna Convention on Diplomatic Relations, signed in 1961, established the framework for diplomatic relations and embassy operations worldwide.",
    "detailedExplanation": "The Vienna Convention on Diplomatic Relations, concluded in Vienna on April 18, 1961, is the cornerstone treaty governing diplomatic relations between independent countries. It codified centuries of diplomatic practice and custom into international law, establishing clear rules for embassy operations, diplomatic immunity, and the conduct of diplomatic personnel. The convention has been ratified by nearly all UN member states and remains the primary legal framework that governs how countries interact through their diplomatic missions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vienna_Convention_on_Diplomatic_Relations",
    "citationTitle": "Wikipedia: Vienna Convention on Diplomatic Relations"
  },
  {
    "id": "7dbea00b-a5f1-4364-8294-3148ceb43e7c",
    "text": "Which country maintained diplomatic relations with both East and West Germany simultaneously during the Cold War?",
    "options": [
      "Sweden",
      "Switzerland",
      "Austria",
      "Finland"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Sweden was one of the few Western nations to maintain diplomatic relations with both German states throughout the Cold War period.",
    "detailedExplanation": "During the Cold War division of Germany (1949-1990), most Western countries followed the Hallstein Doctrine and refused to recognize East Germany diplomatically. However, Sweden pursued a policy of neutrality and pragmatic diplomacy, maintaining official diplomatic relations with both the Federal Republic of Germany (West Germany) and the German Democratic Republic (East Germany). This dual recognition allowed Sweden to serve as an important diplomatic bridge between the two German states and facilitated various negotiations and exchanges during the Cold War period.",
    "citationUrl": "https://en.wikipedia.org/wiki/East_Germany%E2%80%93Sweden_relations",
    "citationTitle": "Wikipedia: East Germany–Sweden relations"
  },
  {
    "id": "ca4b0afc-d9dc-4436-85a8-44631618dbf5",
    "text": "What is the term for a temporary diplomatic representative sent to handle specific negotiations or crises?",
    "options": [
      "Chargé d'affaires",
      "Special envoy",
      "Cultural attaché",
      "Trade commissioner"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "A special envoy is a diplomatic agent sent on a specific mission, often to handle particular negotiations or crisis situations.",
    "detailedExplanation": "A special envoy is a diplomatic representative appointed to handle specific situations, negotiations, or crises that require specialized attention beyond regular embassy operations. Unlike permanent diplomatic staff, special envoys are typically appointed for limited periods and specific purposes, such as peace negotiations, trade disputes, or humanitarian crises. They often carry the authority to negotiate on behalf of their government and may hold ranks equivalent to or higher than regular ambassadors, depending on the importance of their mission.",
    "citationUrl": "https://en.wikipedia.org/wiki/Special_envoy",
    "citationTitle": "Wikipedia: Special envoy"
  },
  {
    "id": "ced79f09-003d-427d-841d-6afff550a2f6",
    "text": "Which African country has never established diplomatic relations with Israel since its independence?",
    "options": [
      "Nigeria",
      "South Africa",
      "Algeria",
      "Kenya"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Algeria has maintained its position of not recognizing Israel diplomatically since gaining independence in 1962.",
    "detailedExplanation": "Algeria is one of the few countries worldwide that has never established diplomatic relations with Israel since Algeria's independence in 1962. This policy stems from Algeria's strong support for Palestinian rights and its opposition to Israeli policies in the occupied territories. Algeria has consistently supported the Arab League's positions regarding Israel and has maintained that diplomatic recognition should only come after a comprehensive resolution to the Palestinian-Israeli conflict. This stance has remained consistent across different Algerian governments over the decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Algeria%E2%80%93Israel_relations",
    "citationTitle": "Wikipedia: Algeria–Israel relations"
  },
  {
    "id": "7904c310-79ac-440d-9989-50665f31adea",
    "text": "In which year did the Vatican and Israel officially establish full diplomatic relations?",
    "options": [
      "1967",
      "1979",
      "1993",
      "2000"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Vatican and Israel established full diplomatic relations in 1993 with the signing of the Fundamental Agreement.",
    "detailedExplanation": "The Holy See and Israel established full diplomatic relations on December 30, 1993, with the signing of the Fundamental Agreement between the Holy See and the State of Israel. This historic agreement ended decades of complex relations and theological tensions. The breakthrough came after years of gradual warming, particularly following the Second Vatican Council's declaration Nostra aetate in 1965, which improved Catholic-Jewish relations. The establishment of diplomatic ties was significant both politically and religiously, representing the Vatican's recognition of Israel's right to exist and Israel's acknowledgment of the Holy See's spiritual authority.",
    "citationUrl": "https://en.wikipedia.org/wiki/Holy_See%E2%80%93Israel_relations",
    "citationTitle": "Wikipedia: Holy See–Israel relations"
  },
  {
    "id": "e8e49610-0fed-4532-9eaf-f3ae06809468",
    "text": "What color is traditionally associated with diplomatic license plates in most countries?",
    "options": [
      "Blue",
      "Red",
      "Green",
      "White"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Blue diplomatic license plates are the international standard for identifying vehicles used by diplomatic missions.",
    "detailedExplanation": "Blue diplomatic license plates have become the internationally recognized standard for identifying vehicles belonging to diplomatic missions and their personnel. This color coding system helps local authorities, police, and traffic officials immediately recognize diplomatic vehicles and apply appropriate protocols regarding diplomatic immunity and privileges. While some countries may use variations or additional markings, the blue background has been widely adopted as it provides clear visual identification and helps facilitate the smooth operation of diplomatic missions by ensuring proper recognition of diplomatic status on the roads.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diplomatic_license_plates",
    "citationTitle": "Wikipedia: Diplomatic license plates"
  },
  {
    "id": "d60768d7-65df-4531-9cae-8825e6edb6b0",
    "text": "Which two countries notably conduct their bilateral meetings in alternating locations, known as 'shuttle diplomacy'?",
    "options": [
      "India and Pakistan",
      "North and South Korea",
      "China and Taiwan",
      "Greece and Turkey"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "North and South Korea often conduct high-level meetings in alternating locations, including the DMZ, as part of their unique diplomatic arrangements.",
    "detailedExplanation": "North and South Korea have developed a unique diplomatic practice where their high-level meetings and summits are held in alternating locations, often including the Demilitarized Zone (DMZ) that separates the two countries. This arrangement reflects the special nature of their relationship as two states that technically remain at war but periodically engage in diplomatic dialogue. The alternating venue system helps maintain diplomatic balance and prevents either side from appearing to have the upper hand. Notable examples include summits at Panmunjom in the DMZ, meetings in Pyongyang, and gatherings in Seoul, depending on the political climate and negotiation dynamics.",
    "citationUrl": "https://en.wikipedia.org/wiki/North_Korea%E2%80%93South_Korea_relations",
    "citationTitle": "Wikipedia: North Korea–South Korea relations"
  },
  {
    "id": "56097a30-0d1a-42ca-a128-7dd1ee38f6ba",
    "text": "Which maritime incident in 1807 led to the complete breakdown of diplomatic relations between Britain and the Ottoman Empire?",
    "options": [
      "The Dardanelles Operation",
      "The Alexandria Bombardment",
      "The Battle of the Nile",
      "The Constantinople Affair"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Dardanelles Operation in 1807 resulted in Britain breaking diplomatic relations with the Ottoman Empire.",
    "detailedExplanation": "In February 1807, a British naval squadron forced passage through the Dardanelles strait and anchored off Constantinople, demanding the Ottoman Empire break its alliance with France. When the Ottomans refused and the British attempt to coerce them failed, it led to a complete rupture in Anglo-Ottoman diplomatic relations. This incident highlighted how military pressure could backfire and destroy diplomatic ties entirely.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dardanelles_Operation",
    "citationTitle": "Wikipedia: Dardanelles Operation"
  },
  {
    "id": "d782e698-4a47-461c-84ed-a2a6844970ad",
    "text": "What is the standard duration for a diplomatic note to be considered 'delivered' under international protocol?",
    "options": [
      "24 hours",
      "48 hours",
      "72 hours",
      "One week"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Under diplomatic protocol, 48 hours is the standard timeframe for a diplomatic note to be considered officially delivered.",
    "detailedExplanation": "Diplomatic notes follow strict protocols regarding delivery and response times. The 48-hour rule ensures that receiving governments have adequate time to acknowledge receipt and prepare appropriate responses. This timeframe has become standardized in international diplomatic practice and is crucial for maintaining proper diplomatic communications, especially during crises or when time-sensitive matters are being discussed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diplomatic_note",
    "citationTitle": "Wikipedia: Diplomatic note"
  },
  {
    "id": "5b71ef29-d18c-42ed-84ff-d18df3e48603",
    "text": "Which country pioneered the modern concept of 'economic diplomacy' by systematically linking trade agreements with political objectives in the 1970s?",
    "options": [
      "Japan",
      "West Germany",
      "France",
      "Canada"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Japan pioneered modern economic diplomacy in the 1970s by systematically linking trade with political objectives.",
    "detailedExplanation": "Following World War II, Japan developed a distinctive approach to international relations that prioritized economic instruments over military ones. In the 1970s, Japan systematically began linking trade agreements, foreign investment, and economic aid to broader political and strategic objectives. This approach became known as 'economic diplomacy' and influenced how other nations began to integrate economic tools into their diplomatic strategies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Economic_diplomacy",
    "citationTitle": "Wikipedia: Economic diplomacy"
  },
  {
    "id": "15a07795-4af9-411c-ad19-a439f470dd47",
    "text": "In diplomatic protocol, what does the 'agrément' procedure specifically refer to?",
    "options": [
      "Signing of bilateral treaties",
      "Approval of an ambassador before appointment",
      "Exchange of diplomatic gifts",
      "Recall of diplomatic staff"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Agrément is the formal approval process where the receiving country accepts a proposed ambassador before their official appointment.",
    "detailedExplanation": "The agrément procedure is a crucial step in diplomatic appointments where the sending state requests approval from the receiving state before officially appointing an ambassador. The receiving country can grant or refuse agrément without providing reasons, effectively giving them veto power over who represents another country on their territory. This process ensures that ambassadors are acceptable to their host countries and helps prevent diplomatic complications from the outset.",
    "citationUrl": "https://en.wikipedia.org/wiki/Agr%C3%A9ment",
    "citationTitle": "Wikipedia: Agrément"
  }
]