[
  {
    "id": "80882cb1-cf27-4554-bb84-9f13bd31e1fe",
    "text": "Which artist holds the record for most Grammy Awards won by any artist in history?",
    "options": [
      "Taylor Swift",
      "Beyoncé",
      "Alison Krauss",
      "Quincy Jones"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Beyoncé holds the record with 32 Grammy wins.",
    "detailedExplanation": "Beyoncé made Grammy history in February 2023 when she broke the all-time record for most Grammy wins by any artist. With 32 total wins (including her time with Destiny's Child and solo career), she surpassed classical conductor Georg Solti's previous record of 31 Grammys. Her wins span multiple categories including Best R&B Performance, Song of the Year, and Album of the Year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Beyonc%C3%A9",
    "citationTitle": "Wikipedia: Beyoncé"
  },
  {
    "id": "e82ee40e-d848-4fbb-921e-1e4726a7f751",
    "text": "Which Beatles album won the Grammy Award for Album of the Year in 1968?",
    "options": [
      "Revolver",
      "Sgt. Pepper's Lonely Hearts Club Band",
      "Abbey Road",
      "The White Album"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sgt. Pepper's Lonely Hearts Club Band won Album of the Year at the 10th Grammy Awards.",
    "detailedExplanation": "The Beatles' groundbreaking album 'Sgt. Pepper's Lonely Hearts Club Band' won the Grammy Award for Album of the Year at the 10th Annual Grammy Awards ceremony in 1968. This was a significant moment as it marked one of the first times a rock album received this prestigious honor, helping to legitimize rock music in the eyes of the recording industry establishment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sgt._Pepper%27s_Lonely_Hearts_Club_Band",
    "citationTitle": "Wikipedia: Sgt. Pepper's Lonely Hearts Club Band"
  },
  {
    "id": "371c6c32-e63b-48d7-8735-64cd73d0c889",
    "text": "At what age did Billie Eilish become the youngest person to win Album of the Year?",
    "options": [
      "17",
      "18",
      "19",
      "20"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Billie Eilish was 18 years old when she won Album of the Year for 'When We All Fall Asleep, Where Do We Go?'",
    "detailedExplanation": "At the 62nd Annual Grammy Awards in January 2020, Billie Eilish made history by becoming the youngest artist ever to win Album of the Year at age 18 for her debut album 'When We All Fall Asleep, Where Do We Go?' She also became the first artist since Christopher Cross in 1981 to win all four major Grammy categories (Album, Record, and Song of the Year, plus Best New Artist) in the same year.",
    "citationUrl": "https://en.wikipedia.org/wiki/Billie_Eilish",
    "citationTitle": "Wikipedia: Billie Eilish"
  },
  {
    "id": "f1ccc367-10ee-4b36-ab19-d2c156108934",
    "text": "Which rapper was the first to win a Grammy Award for Best Rap Performance?",
    "options": [
      "Run-DMC",
      "LL Cool J",
      "DJ Jazzy Jeff & The Fresh Prince",
      "Public Enemy"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "DJ Jazzy Jeff & The Fresh Prince won the first Grammy for Best Rap Performance in 1989 for 'Parents Just Don't Understand.'",
    "detailedExplanation": "DJ Jazzy Jeff & The Fresh Prince (Will Smith) won the inaugural Grammy Award for Best Rap Performance at the 31st Annual Grammy Awards in 1989 for their hit song 'Parents Just Don't Understand.' This marked the first time the Grammy Awards recognized rap music as a legitimate genre, though the category was notably not televised during the ceremony, leading to a boycott by several prominent rap artists.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grammy_Award_for_Best_Rap_Performance",
    "citationTitle": "Wikipedia: Grammy Award for Best Rap Performance"
  },
  {
    "id": "c2d593bc-7aa2-4781-878a-0a8b0c53dbc8",
    "text": "Which song won Adele the Grammy for Record of the Year in 2012?",
    "options": [
      "Someone Like You",
      "Rolling in the Deep",
      "Set Fire to the Rain",
      "Hello"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Rolling in the Deep' won Adele the Grammy for Record of the Year at the 54th Grammy Awards.",
    "detailedExplanation": "Adele's powerful ballad 'Rolling in the Deep' won the Grammy Award for Record of the Year at the 54th Annual Grammy Awards in 2012. This was part of Adele's historic sweep that night, where she won six Grammy Awards total, including Album of the Year for '21' and Song of the Year for 'Rolling in the Deep.' The song became one of her signature hits and helped establish her as a global superstar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rolling_in_the_Deep",
    "citationTitle": "Wikipedia: Rolling in the Deep"
  },
  {
    "id": "dc0359f5-18c3-4c3e-9ffd-3afbac602237",
    "text": "Which country music legend has won the most Grammy Awards in country music history?",
    "options": [
      "Dolly Parton",
      "Willie Nelson",
      "Alison Krauss",
      "Johnny Cash"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Alison Krauss has won 27 Grammy Awards, the most in country music history.",
    "detailedExplanation": "Alison Krauss holds the record for most Grammy Awards won in country music with 27 wins throughout her career. Her victories span both solo work and collaborations with Union Station, as well as her notable album 'Raising Sand' with Robert Plant. She was the most awarded artist in Grammy history until Beyoncé surpassed her record in 2023, and she remains the most awarded female artist and country artist in Grammy history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alison_Krauss",
    "citationTitle": "Wikipedia: Alison Krauss"
  },
  {
    "id": "d6a780a4-ff73-48a6-98b5-f7be50658c8c",
    "text": "What was the first year that the Grammy Awards ceremony was televised?",
    "options": [
      "1959",
      "1963",
      "1971",
      "1975"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Grammy Awards were first televised in 1971 during the 13th Annual Grammy Awards.",
    "detailedExplanation": "The Grammy Awards ceremony was first broadcast on television in 1971, covering the 13th Annual Grammy Awards. The ceremony was held at the Hollywood Palladium and was televised by ABC. Prior to this, the Grammy Awards were purely industry events without television coverage. The televised broadcast helped increase the profile and cultural impact of the Grammy Awards significantly, turning them into the major entertainment spectacle they are today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grammy_Awards",
    "citationTitle": "Wikipedia: Grammy Awards"
  },
  {
    "id": "8f3b6979-31ba-4496-8d4a-7adeed9bac1e",
    "text": "Which Michael Jackson album won a record-breaking 8 Grammy Awards in 1984?",
    "options": [
      "Off the Wall",
      "Thriller",
      "Bad",
      "Dangerous"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Thriller' won 8 Grammy Awards in 1984, setting a record for most Grammys won in a single year.",
    "detailedExplanation": "Michael Jackson's 'Thriller' made Grammy history at the 26th Annual Grammy Awards in 1984 by winning a record-breaking 8 Grammy Awards in a single night. The wins included Album of the Year for 'Thriller' and Record of the Year for 'Beat It.' This record stood for many years and helped cement Jackson's status as the 'King of Pop.' The album's unprecedented success at the Grammys matched its commercial dominance, as it became the best-selling album of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thriller_(album)",
    "citationTitle": "Wikipedia: Thriller (album)"
  },
  {
    "id": "d6b474fb-9325-4cd6-bc6a-7e094e91480e",
    "text": "Which iconic singer has won the Grammy Award for Best Pop Vocal Performance three times for the songs 'Don't Stop 'Til You Get Enough,' 'Rock with You,' and 'Billie Jean'?",
    "options": [
      "Prince",
      "Michael Jackson",
      "Stevie Wonder",
      "Elton John"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Michael Jackson won Best Pop Vocal Performance for these three hit songs.",
    "detailedExplanation": "Michael Jackson dominated the Best Pop Vocal Performance category during his peak years, winning for 'Don't Stop 'Til You Get Enough' (1979), 'Rock with You' (1981), and 'Billie Jean' (1983). These victories showcased his incredible vocal talent and helped establish him as the King of Pop during the Grammy Awards' recognition of his solo career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_Jackson_albums_discography",
    "citationTitle": "Wikipedia: Michael Jackson Albums Discography"
  },
  {
    "id": "2c48235f-4e31-40fa-8263-6c9f367d2bbe",
    "text": "Which female artist won her first Grammy Award in 2009 for Best New Artist and went on to become one of the most awarded country artists?",
    "options": [
      "Carrie Underwood",
      "Taylor Swift",
      "Miranda Lambert",
      "Kacey Musgraves"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Taylor Swift won Best New Artist in 2009 and has since won multiple Grammy Awards.",
    "detailedExplanation": "Taylor Swift won the Grammy Award for Best New Artist in 2009, launching what would become one of the most successful Grammy careers in music history. She has since won the Album of the Year award three times and has transitioned from country to pop music while maintaining her Grammy success across multiple genres.",
    "citationUrl": "https://en.wikipedia.org/wiki/Taylor_Swift",
    "citationTitle": "Wikipedia: Taylor Swift"
  },
  {
    "id": "0b54a030-ca69-46a7-801b-af69f693559e",
    "text": "What is the official name of the Grammy Award given to the producer, engineer, and mixer of the best-engineered album?",
    "options": [
      "Best Engineered Album",
      "Technical Excellence Award",
      "Best Recording Quality",
      "Audio Engineering Award"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Grammy Award for Best Engineered Album recognizes technical achievement in recording.",
    "detailedExplanation": "The Grammy Award for Best Engineered Album, Non-Classical has been presented since 1959 to recognize the audio engineers, mastering engineers, and producers who achieve the highest level of excellence in recording. This technical Grammy highlights the importance of sound engineering in creating outstanding musical recordings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grammy_Award_for_Best_Engineered_Album,_Non-Classical",
    "citationTitle": "Wikipedia: Grammy Award for Best Engineered Album"
  },
  {
    "id": "23c7b80f-7ae0-44f7-95f5-4d21d747435d",
    "text": "Which rock band won their first and only Grammy Award in 2014 for Best Rock Performance with the song 'Cut Me Some Slack'?",
    "options": [
      "Foo Fighters",
      "Nirvana members with Paul McCartney",
      "Pearl Jam",
      "Soundgarden"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The surviving members of Nirvana won with Paul McCartney for 'Cut Me Some Slack.'",
    "detailedExplanation": "In 2014, the surviving members of Nirvana (Dave Grohl, Krist Novoselic, and Pat Smear) won the Grammy Award for Best Rock Performance alongside Paul McCartney for the song 'Cut Me Some Slack.' This collaboration was particularly meaningful as it marked the first Grammy win associated with the Nirvana name, despite the band's massive cultural impact in the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nirvana_(band)",
    "citationTitle": "Wikipedia: Nirvana (band)"
  },
  {
    "id": "8cde8016-8db4-4d8d-8042-0408cc71862f",
    "text": "Which city has hosted the Grammy Awards ceremony the most times?",
    "options": [
      "New York City",
      "Nashville",
      "Los Angeles",
      "Las Vegas"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Los Angeles has been the primary host city for the Grammy Awards ceremony.",
    "detailedExplanation": "Los Angeles has hosted the Grammy Awards ceremony more than any other city, with the majority of ceremonies taking place at venues like the Staples Center (now Crypto.com Arena) and previously at locations like the Shrine Auditorium. The ceremony has occasionally been held in New York City and Nashville, but LA remains the Grammy's primary home due to its central location in the entertainment industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grammy_Awards",
    "citationTitle": "Wikipedia: Grammy Awards"
  },
  {
    "id": "af56a80c-c2e7-4256-b8e4-cb792a2b0dad",
    "text": "Which classical composer has won the most Grammy Awards posthumously?",
    "options": [
      "Mozart",
      "Beethoven",
      "Bach",
      "Tchaikovsky"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Johann Sebastian Bach has won the most posthumous Grammy Awards.",
    "detailedExplanation": "Johann Sebastian Bach holds the record for the most Grammy Awards won by a deceased artist, with numerous recordings of his works winning in classical categories over the decades. His compositions, particularly pieces like the Brandenburg Concertos and Well-Tempered Clavier, continue to be recorded and recognized by the Grammy Awards for their performances and interpretations by various classical musicians and orchestras.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johann_Sebastian_Bach",
    "citationTitle": "Wikipedia: Johann Sebastian Bach"
  },
  {
    "id": "08465524-2c2b-457a-b215-58261cfb2842",
    "text": "What unique Grammy record does the soundtrack album 'O Brother, Where Art Thou?' hold?",
    "options": [
      "First soundtrack to win Album of the Year",
      "Best-selling Grammy-winning soundtrack",
      "Most weeks at #1 for a soundtrack",
      "First bluegrass album to win Album of the Year"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "It was the first bluegrass/roots music album to win Album of the Year.",
    "detailedExplanation": "'O Brother, Where Art Thou?' soundtrack made Grammy history in 2002 by becoming the first album featuring primarily bluegrass and traditional American roots music to win the Grammy Award for Album of the Year. The soundtrack's success helped revive interest in traditional American music and demonstrated the Grammy voters' willingness to recognize non-mainstream genres in the top category.",
    "citationUrl": "https://en.wikipedia.org/wiki/O_Brother,_Where_Art_Thou%3F_(soundtrack)",
    "citationTitle": "Wikipedia: O Brother, Where Art Thou? Soundtrack"
  },
  {
    "id": "f511e168-918d-43e4-90b5-7f5a545dca80",
    "text": "Which band holds the record for most Grammy nominations without ever winning an award?",
    "options": [
      "The Kinks",
      "KISS",
      "Snoop Dogg",
      "Brian McKnight"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "KISS has received multiple Grammy nominations but has never won a Grammy Award.",
    "detailedExplanation": "Despite their massive influence on rock music and their Rock and Roll Hall of Fame induction, KISS has been nominated for Grammy Awards multiple times but has never won. This makes them one of the most notable examples of highly successful artists who have been overlooked by Grammy voters, joining other famous acts that have struggled to gain Grammy recognition despite their commercial success and cultural impact.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kiss_(band)",
    "citationTitle": "Wikipedia: Kiss (band)"
  },
  {
    "id": "ad33bdec-1151-4d03-9baf-ede775dd46ce",
    "text": "Which Grammy Award-winning song by Santana featuring Rob Thomas topped the charts in 1999?",
    "options": [
      "Smooth",
      "Maria Maria",
      "The Game of Love",
      "Black Magic Woman"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "\"Smooth\" featuring Rob Thomas won three Grammy Awards in 2000.",
    "detailedExplanation": "\"Smooth\" by Santana featuring Rob Thomas became a massive hit in 1999 and won three Grammy Awards at the 42nd Annual Grammy Awards in 2000: Record of the Year, Song of the Year, and Best Pop Collaboration with Vocals. The song spent 12 weeks at number one on the Billboard Hot 100 and helped revitalize Carlos Santana's career, introducing him to a new generation of fans.",
    "citationUrl": "https://en.wikipedia.org/wiki/Smooth_(Santana_song)",
    "citationTitle": "Wikipedia: Smooth (Santana song)"
  },
  {
    "id": "634c9409-e5fd-4363-b5af-35ae10862652",
    "text": "Which jazz vocalist won 14 Grammy Awards during her career and is known for her scat singing style?",
    "options": [
      "Billie Holiday",
      "Ella Fitzgerald",
      "Sarah Vaughan",
      "Nina Simone"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Ella Fitzgerald won 14 Grammy Awards and was known as the \"First Lady of Song.\"",
    "detailedExplanation": "Ella Fitzgerald, often called the \"First Lady of Song,\" won 14 Grammy Awards during her illustrious career. She was renowned for her pure tone, impeccable diction, and particularly her scat singing ability. Her Grammy wins spanned from 1958 to 1990, including multiple awards for Best Jazz Vocal Performance. Fitzgerald's technical skill and interpretive ability made her one of the most celebrated vocalists in jazz history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ella_Fitzgerald",
    "citationTitle": "Wikipedia: Ella Fitzgerald"
  },
  {
    "id": "9ba9ba87-7d03-428a-87d5-c69704bc7a7c",
    "text": "What is the name of the Grammy Award given specifically to recognize outstanding achievement in music videos?",
    "options": [
      "Best Music Film",
      "Best Music Video",
      "Best Visual Album",
      "Best Audiovisual Performance"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Grammy Award for Best Music Video recognizes excellence in music video production.",
    "detailedExplanation": "The Grammy Award for Best Music Video was first presented in 1982, initially called Best Video, Short Form. This category recognizes outstanding achievement in music video production, considering factors like creativity, technical merit, and overall impact. Notable winners have included iconic videos from artists like Michael Jackson, Madonna, and more recently, artists like Childish Gambino for \"This Is America\" and Taylor Swift for \"Bad Blood.\"",
    "citationUrl": "https://en.wikipedia.org/wiki/Grammy_Award_for_Best_Music_Video",
    "citationTitle": "Wikipedia: Grammy Award for Best Music Video"
  },
  {
    "id": "fc563a9a-1533-4c0f-96a0-c24bcae6d95c",
    "text": "Which Pink Floyd album won the Grammy Award for Best Engineered Album, Non-Classical in 1980?",
    "options": [
      "The Dark Side of the Moon",
      "The Wall",
      "Wish You Were Here",
      "Animals"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "\"The Wall\" won the Grammy for Best Engineered Album, Non-Classical in 1980.",
    "detailedExplanation": "Pink Floyd's \"The Wall\" won the Grammy Award for Best Engineered Album, Non-Classical at the 23rd Annual Grammy Awards in 1981 (for recordings from 1980). The double album was praised for its innovative sound engineering and production techniques. Engineers James Guthrie, Doug Sax, and James Guthrie were recognized for their work on this concept album, which featured complex layering, sound effects, and seamless transitions between tracks that helped tell the story of the protagonist Pink.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wall",
    "citationTitle": "Wikipedia: The Wall"
  }
]