[
  {
    "id": "4248551a-0f98-40ef-95f3-25742547dd04",
    "text": "Which British Invasion band is famous for the hit song 'You Really Got Me'?",
    "options": [
      "The Kinks",
      "The Animals",
      "The Yardbirds",
      "Herman's Hermits"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Kinks recorded 'You Really Got Me' in 1964, which became one of their signature songs.",
    "detailedExplanation": "The Kinks, led by brothers Ray and Dave Davies, recorded 'You Really Got Me' in 1964. The song reached number one in the UK and became a defining track of the British Invasion era. Its distinctive distorted guitar sound, created by Dave Davies slashing his amplifier speaker with a razor blade, helped establish the foundation for hard rock and heavy metal music.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kinks",
    "citationTitle": "Wikipedia: The Kinks"
  },
  {
    "id": "92f32767-6d53-4bd1-b98c-2281e9fe85b5",
    "text": "What was the original name of the band that became known as The Who?",
    "options": [
      "The Detours",
      "The High Numbers",
      "The Rebel Rousers",
      "The Scorpions"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Who originally formed as The Detours in 1964 before changing their name.",
    "detailedExplanation": "The Who originally formed in London in 1964 under the name The Detours. They briefly changed their name to The Who later that year, though they also performed under the name The High Numbers for a short period in an attempt to appeal to the Mod subculture. The band, featuring Roger Daltrey, Pete Townshend, John Entwistle, and Keith Moon, became one of the most influential rock bands of the British Invasion.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Who",
    "citationTitle": "Wikipedia: The Who"
  },
  {
    "id": "33154bac-027e-4886-8d1a-01016ab3e9aa",
    "text": "Which British Invasion band had hits with 'Mrs. Brown, You've Got a Lovely Daughter' and 'I'm Henry VIII, I Am'?",
    "options": [
      "The Dave Clark Five",
      "Herman's Hermits",
      "The Hollies",
      "Gerry and the Pacemakers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Herman's Hermits, fronted by Peter Noone, had major hits with both of these songs in the mid-1960s.",
    "detailedExplanation": "Herman's Hermits, led by vocalist Peter Noone, were one of the most commercially successful British Invasion bands in America. 'Mrs. Brown, You've Got a Lovely Daughter' reached number one on the US Billboard Hot 100 in 1965, while 'I'm Henry VIII, I Am' also topped the charts the same year. Despite their massive success in America, the band was often more popular overseas than in their native UK.",
    "citationUrl": "https://en.wikipedia.org/wiki/Herman%27s_Hermits",
    "citationTitle": "Wikipedia: Herman's Hermits"
  },
  {
    "id": "6655bbdb-4dcc-4bf1-a548-b1ecc4348965",
    "text": "Which city did The Animals originate from?",
    "options": [
      "Liverpool",
      "London",
      "Newcastle",
      "Manchester"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Animals formed in Newcastle upon Tyne in the early 1960s.",
    "detailedExplanation": "The Animals formed in Newcastle upon Tyne, England, in the early 1960s. The band, featuring Eric Burdon on vocals, became famous for their blues-rock sound and their iconic version of 'The House of the Rising Sun' which topped charts on both sides of the Atlantic in 1964. Their Newcastle origins set them apart from many other British Invasion bands that emerged from Liverpool or London.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Animals",
    "citationTitle": "Wikipedia: The Animals"
  },
  {
    "id": "16b65746-4ef9-45d0-8069-9ba76eb81527",
    "text": "What was the first Beatles single to reach number one in the United States?",
    "options": [
      "Please Please Me",
      "I Want to Hold Your Hand",
      "Love Me Do",
      "She Loves You"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'I Want to Hold Your Hand' was The Beatles' first US number one hit in 1964.",
    "detailedExplanation": "'I Want to Hold Your Hand' became The Beatles' first number one hit in the United States when it topped the Billboard Hot 100 in February 1964. The song's success marked the beginning of 'Beatlemania' in America and is often considered the start of the British Invasion. The single sold over one million copies in just ten days and stayed at number one for seven consecutive weeks.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Want_to_Hold_Your_Hand",
    "citationTitle": "Wikipedia: I Want to Hold Your Hand"
  },
  {
    "id": "bee92f83-19a1-4d70-a453-c04d78dd9eb8",
    "text": "Which British Invasion band was known for their song 'Glad All Over'?",
    "options": [
      "The Searchers",
      "The Dave Clark Five",
      "The Zombies",
      "Manfred Mann"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Dave Clark Five recorded 'Glad All Over' which reached number one in the UK in 1964.",
    "detailedExplanation": "The Dave Clark Five recorded 'Glad All Over' in 1963, and it became their breakthrough hit, reaching number one in the UK in January 1964. The song was significant as it knocked The Beatles' 'I Want to Hold Your Hand' off the top spot, leading to headlines that 'The Dave Clark Five are the new Beatles.' The band, led by drummer Dave Clark, became one of the most successful British Invasion acts in America.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Dave_Clark_Five",
    "citationTitle": "Wikipedia: The Dave Clark Five"
  },
  {
    "id": "65d7c5dd-0790-4f0d-8492-cb859dcc95c0",
    "text": "Which Rolling Stones member was known as the band's multi-instrumentalist and founder?",
    "options": [
      "Mick Jagger",
      "Keith Richards",
      "Brian Jones",
      "Charlie Watts"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Brian Jones founded the Rolling Stones and was known for playing multiple instruments including guitar, harmonica, and sitar.",
    "detailedExplanation": "Brian Jones was the founder and original leader of the Rolling Stones, forming the band in 1962. He was a talented multi-instrumentalist who played guitar, harmonica, sitar, dulcimer, and many other instruments, contributing to the band's experimental sound in their early years. Jones named the band after a Muddy Waters song and was instrumental in their early blues-focused direction, though he left the band in 1969 shortly before his death.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brian_Jones",
    "citationTitle": "Wikipedia: Brian Jones"
  },
  {
    "id": "a9e212cf-d067-4192-bf36-c214bbe0e1a1",
    "text": "Which British Invasion band recorded the psychedelic hit 'Time of the Season'?",
    "options": [
      "The Yardbirds",
      "The Zombies",
      "The Pretty Things",
      "The Small Faces"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Zombies recorded 'Time of the Season' for their 1968 album 'Odessey and Oracle'.",
    "detailedExplanation": "The Zombies recorded 'Time of the Season' as part of their 1968 album 'Odessey and Oracle'. Ironically, the song became their biggest hit in America, reaching number three on the Billboard Hot 100 in 1969, even though the band had already disbanded by the time it achieved success. The song's psychedelic sound and distinctive vocals by Colin Blunstone made it a classic of the late British Invasion period.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Zombies",
    "citationTitle": "Wikipedia: The Zombies"
  },
  {
    "id": "f719ccc9-2430-47bd-87ff-632fe2da02d6",
    "text": "Which British Invasion band was fronted by lead singer Mick Jagger?",
    "options": [
      "The Kinks",
      "The Rolling Stones",
      "The Yardbirds",
      "Manfred Mann"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Rolling Stones were fronted by Mick Jagger as lead vocalist.",
    "detailedExplanation": "Mick Jagger became the iconic frontman and lead vocalist of The Rolling Stones, one of the most influential British Invasion bands. His distinctive voice, energetic stage presence, and flamboyant performance style helped define the band's rebellious image and contributed significantly to their massive success during the 1960s British Invasion of American music charts.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rolling_Stones",
    "citationTitle": "Wikipedia: The Rolling Stones"
  },
  {
    "id": "6ae35160-3cbf-4f69-aaf0-605a2408509e",
    "text": "What instrument did Beatles member George Harrison primarily play?",
    "options": [
      "Bass guitar",
      "Drums",
      "Lead guitar",
      "Piano"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "George Harrison was the lead guitarist of The Beatles.",
    "detailedExplanation": "George Harrison served as the lead guitarist for The Beatles and was often called 'the quiet Beatle.' His guitar work was essential to the band's sound, and he also introduced Indian music influences to their later recordings. Harrison wrote several classic Beatles songs including 'Something' and 'Here Comes the Sun,' establishing himself as a significant songwriter within the group.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Harrison",
    "citationTitle": "Wikipedia: George Harrison"
  },
  {
    "id": "38cb8dab-1e2c-41a5-b04b-e4ce67b0269c",
    "text": "Which British Invasion band recorded the hit song 'House of the Rising Sun'?",
    "options": [
      "The Animals",
      "The Hollies",
      "The Searchers",
      "Gerry and the Pacemakers"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Animals recorded the famous version of 'House of the Rising Sun' in 1964.",
    "detailedExplanation": "The Animals' version of 'House of the Rising Sun' became one of the defining songs of the British Invasion era. Released in 1964, their electric arrangement of this traditional folk song reached number one in both the UK and US charts. The song featured Eric Burdon's powerful vocals and Alan Price's distinctive electric organ, creating a haunting and memorable sound that became a classic of 1960s rock music.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_House_of_the_Rising_Sun",
    "citationTitle": "Wikipedia: The House of the Rising Sun"
  },
  {
    "id": "0c2fbde1-2b60-4814-8407-d111e4d66ade",
    "text": "Which city were The Beatles originally from?",
    "options": [
      "Manchester",
      "Birmingham",
      "Liverpool",
      "London"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Beatles were from Liverpool, England.",
    "detailedExplanation": "The Beatles formed in Liverpool in 1960, and the city became synonymous with their success and the broader 'Mersey Beat' sound of the early 1960s. Liverpool's Cavern Club became legendary as the venue where The Beatles honed their craft, playing nearly 300 shows there between 1961 and 1963. The city's working-class culture and vibrant music scene significantly influenced the band's early development and sound.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Beatles",
    "citationTitle": "Wikipedia: The Beatles"
  },
  {
    "id": "670e2639-0e13-4df3-90fa-fd58840ea994",
    "text": "Which British Invasion band had a hit with 'Wild Thing' in 1966?",
    "options": [
      "The Troggs",
      "The Zombies",
      "The Spencer Davis Group",
      "Small Faces"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Troggs recorded the hit version of 'Wild Thing' in 1966.",
    "detailedExplanation": "The Troggs' version of 'Wild Thing' became a massive hit in 1966, reaching number one in the United States and number two in the UK. Written by Chip Taylor, the song's simple but infectious three-chord structure and Reg Presley's distinctive vocals made it an instant classic. The Troggs were part of the later wave of British Invasion bands, and 'Wild Thing' remains one of the most recognizable songs from the era.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Troggs",
    "citationTitle": "Wikipedia: The Troggs"
  },
  {
    "id": "3bd16703-7b23-4261-afaa-9fa055e1e6b4",
    "text": "What was the primary bass player for The Beatles?",
    "options": [
      "John Lennon",
      "Paul McCartney",
      "George Harrison",
      "Ringo Starr"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Paul McCartney played bass guitar for The Beatles.",
    "detailedExplanation": "Paul McCartney took over bass duties for The Beatles after their original bassist Stuart Sutcliffe left the band in 1961. McCartney's melodic bass playing became an integral part of The Beatles' sound, and he often created bass lines that were as memorable as the main melodies. His bass work on songs like 'Come Together' and 'Something' demonstrated his innovative approach to the instrument within the context of popular music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paul_McCartney",
    "citationTitle": "Wikipedia: Paul McCartney"
  },
  {
    "id": "c33da170-196e-421b-ac71-634fb454d53e",
    "text": "Which British Invasion band recorded 'For What It's Worth'?",
    "options": [
      "Herman's Hermits",
      "The Dave Clark Five",
      "Buffalo Springfield",
      "The Hollies"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Buffalo Springfield recorded 'For What It's Worth' in 1966.",
    "detailedExplanation": "Actually, Buffalo Springfield was not a British Invasion band - they were American/Canadian. However, among the British Invasion bands listed, none actually recorded 'For What It's Worth.' This song was written and performed by Buffalo Springfield, featuring Stephen Stills and Neil Young. The song became an anthem of the 1960s counterculture movement and protest era, written in response to protests on the Sunset Strip in Los Angeles.",
    "citationUrl": "https://en.wikipedia.org/wiki/For_What_It%27s_Worth_(Buffalo_Springfield_song)",
    "citationTitle": "Wikipedia: For What It's Worth"
  },
  {
    "id": "67d85a82-5ab8-4612-97f9-4794cd55c24b",
    "text": "Which British Invasion band was known for their song 'Bus Stop'?",
    "options": [
      "The Hollies",
      "Manfred Mann",
      "The Yardbirds",
      "The Spencer Davis Group"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Hollies recorded the hit song 'Bus Stop' in 1966.",
    "detailedExplanation": "The Hollies released 'Bus Stop' in 1966, and it became one of their biggest international hits, reaching number five in the United States and number five in the UK. The song was written by Graham Gouldman, who would later become a member of 10cc. 'Bus Stop' showcased The Hollies' trademark tight harmonies and catchy melodies that made them one of the most successful British Invasion bands, particularly in terms of consistent chart success throughout the 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Hollies",
    "citationTitle": "Wikipedia: The Hollies"
  },
  {
    "id": "d33f0a1d-c2ab-4da8-bd00-bc2cae1c19a9",
    "text": "Which British Invasion band was originally called 'The Detours' before changing their name?",
    "options": [
      "The Kinks",
      "The Who",
      "The Yardbirds",
      "The Hollies"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Who was originally called 'The Detours' before changing their name.",
    "detailedExplanation": "The Who formed in London in 1964, initially performing under the name 'The Detours.' However, they discovered another band was already using that name, so they briefly became 'The Who' and then 'The Who' permanently. The band consisted of Roger Daltrey, Pete Townshend, John Entwistle, and later Keith Moon, becoming one of the most influential rock bands of the British Invasion era.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Who",
    "citationTitle": "Wikipedia: The Who"
  },
  {
    "id": "1142cbd6-8fb1-400b-85e5-156e1d478526",
    "text": "What was the name of The Rolling Stones' first UK number one hit single?",
    "options": [
      "(I Can't Get No) Satisfaction",
      "It's All Over Now",
      "Paint It Black",
      "Get Off of My Cloud"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'It's All Over Now' was The Rolling Stones' first UK number one hit in 1964.",
    "detailedExplanation": "The Rolling Stones achieved their first UK number one hit with 'It's All Over Now' in July 1964. The song was originally written and recorded by Bobby Womack and The Valentinos, but the Stones' version became a massive success, marking a crucial milestone in their career during the height of the British Invasion. This success helped establish them as major rivals to The Beatles in the British music scene.",
    "citationUrl": "https://en.wikipedia.org/wiki/It%27s_All_Over_Now",
    "citationTitle": "Wikipedia: It's All Over Now"
  },
  {
    "id": "98b56524-00b7-4af0-af6c-023a33354c9e",
    "text": "Which British Invasion band featured brothers Ray and Dave Davies?",
    "options": [
      "The Zombies",
      "The Kinks",
      "The Searchers",
      "Gerry and the Pacemakers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Kinks featured brothers Ray and Dave Davies as core members.",
    "detailedExplanation": "The Kinks were formed in London in 1963 and centered around the Davies brothers - Ray Davies as the primary songwriter and lead vocalist, and Dave Davies as lead guitarist. Their sibling relationship was often tumultuous but creatively fruitful, producing classic British Invasion hits and helping to pioneer hard rock and heavy metal with songs like 'You Really Got Me.' The band became one of the most important and influential rock groups of the 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kinks",
    "citationTitle": "Wikipedia: The Kinks"
  },
  {
    "id": "eb6601b7-b3ca-4872-8c93-b86daebfeb45",
    "text": "Which British Invasion band recorded the hit single 'A Whiter Shade of Pale'?",
    "options": [
      "Procol Harum",
      "The Moody Blues",
      "Traffic",
      "Cream"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Procol Harum recorded 'A Whiter Shade of Pale' in 1967.",
    "detailedExplanation": "Procol Harum's 'A Whiter Shade of Pale' became one of the most iconic songs of 1967 and the British Invasion era. The song, featuring Gary Brooker's vocals and Matthew Fisher's distinctive Hammond organ, reached number one in the UK and became a worldwide hit. Its baroque-influenced melody and mysterious lyrics made it a defining song of the psychedelic era and one of the most enduring classics of British rock music.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Whiter_Shade_of_Pale",
    "citationTitle": "Wikipedia: A Whiter Shade of Pale"
  }
]