[
  {
    "id": "826eb550-00e4-4df8-a267-a1cb650cb798",
    "text": "Which British Invasion band was originally called 'The Detours' before changing their name due to another band already using it?",
    "options": [
      "The Kinks",
      "The Who",
      "The Animals",
      "The Yardbirds"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Who were originally called The Detours before discovering another band with the same name.",
    "detailedExplanation": "The Who, one of the most influential rock bands of the British Invasion, began their career in 1964 under the name 'The Detours.' However, they quickly discovered that another group was already using this name, forcing them to find an alternative. After briefly considering 'The Who' as a temporary solution, the name stuck and became iconic in rock history. The band, featuring Roger Daltrey, Pete Townshend, John Entwistle, and Keith Moon, went on to become pioneers of hard rock and are known for classics like 'My Generation' and 'Won't Get Fooled Again.'",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Who",
    "citationTitle": "Wikipedia: The Who"
  },
  {
    "id": "951e1eab-a2b1-45a2-b682-71577a0899b5",
    "text": "Which member of The Rolling Stones was found dead in his swimming pool at Cotchford Farm in 1969?",
    "options": [
      "Brian Jones",
      "Keith Richards",
      "Bill Wyman",
      "Mick Taylor"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Brian Jones, founding member of The Rolling Stones, drowned in his swimming pool in July 1969.",
    "detailedExplanation": "Brian Jones, the founding member and original leader of The Rolling Stones, was found dead in the swimming pool at his home, Cotchford Farm in Sussex, on July 3, 1969. Jones had been struggling with drug and alcohol problems and had been dismissed from the band just a month earlier due to his unreliability and legal troubles. His death at age 27 was ruled 'death by misadventure,' though conspiracy theories have persisted over the years. Jones was a multi-instrumentalist who contributed significantly to the Stones' early experimental sound, particularly their exploration of world music influences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brian_Jones",
    "citationTitle": "Wikipedia: Brian Jones"
  },
  {
    "id": "2807ad94-2d7b-4b50-9f3c-22ecc2f9a880",
    "text": "Which British Invasion band recorded the original version of 'House of the Rising Sun' that became a #1 hit in 1964?",
    "options": [
      "The Kinks",
      "The Animals",
      "The Searchers",
      "Manfred Mann"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Animals recorded the definitive version of 'House of the Rising Sun' which topped charts worldwide in 1964.",
    "detailedExplanation": "The Animals, led by Eric Burdon's powerful vocals and featuring Alan Price's distinctive organ work, recorded their version of the traditional folk song 'House of the Rising Sun' in 1964. While the song's origins trace back to traditional American folk music, The Animals' arrangement transformed it into a haunting, blues-rock masterpiece that reached #1 in the UK, US, and several other countries. The song's success helped establish The Animals as major players in the British Invasion and demonstrated how British bands could reinterpret American musical traditions with their own unique style.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_House_of_the_Rising_Sun",
    "citationTitle": "Wikipedia: The House of the Rising Sun"
  },
  {
    "id": "b4959edd-f54a-4efa-8835-684f42a680c2",
    "text": "Which guitarist played with The Yardbirds between Jeff Beck and Jimmy Page's tenures with the band?",
    "options": [
      "Eric Clapton",
      "Mick Taylor",
      "Peter Green",
      "This never happened - Beck and Page overlapped"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Jeff Beck and Jimmy Page actually played together in The Yardbirds for several months in 1966, with no guitarist between them.",
    "detailedExplanation": "The Yardbirds are famous for featuring three guitar legends: Eric Clapton (1963-1965), Jeff Beck (1965-1968), and Jimmy Page (1966-1968). However, contrary to popular belief, there was no guitarist between Beck and Page. Instead, Jimmy Page initially joined as a bassist in June 1966 while Beck was still the lead guitarist. When bassist Paul Samwell-Smith left, Page moved to bass, and for several months in 1966, both Beck and Page played guitars simultaneously, creating a unique dual-guitar lineup. Beck left in October 1968, leaving Page as the sole lead guitarist until the band's transformation into Led Zeppelin.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Yardbirds",
    "citationTitle": "Wikipedia: The Yardbirds"
  },
  {
    "id": "a3887c4b-31b6-4bbe-a09b-bdd90c2b8c82",
    "text": "Which British Invasion band's manager, Kit Lambert, was the son of classical composer Constant Lambert?",
    "options": [
      "The Kinks",
      "The Who",
      "Small Faces",
      "The Zombies"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Kit Lambert, co-manager of The Who, was the son of renowned classical composer and conductor Constant Lambert.",
    "detailedExplanation": "Kit Lambert, who co-managed The Who with Chris Stamp from 1964 to 1974, came from a distinguished musical family. His father, Constant Lambert, was a prominent British composer, conductor, and critic who worked extensively with the Royal Ballet and was a key figure in 20th-century British classical music. Kit Lambert's classical background influenced his ambitious vision for The Who, leading to groundbreaking projects like the rock opera 'Tommy' and the conceptual album 'The Who Sell Out.' His sophisticated understanding of music and theatrical presentation helped elevate The Who from a simple rock band to pioneering artists who pushed the boundaries of popular music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kit_Lambert",
    "citationTitle": "Wikipedia: Kit Lambert"
  },
  {
    "id": "375e7a37-24ad-4cb8-a30a-190f6ee4a63b",
    "text": "Which British Invasion band recorded the theme song for the 1965 James Bond film 'Thunderball' that was later rejected in favor of Tom Jones' version?",
    "options": [
      "The Kinks",
      "Manfred Mann",
      "Johnny Kidd & the Pirates",
      "Dionne Warwick recorded it, not a British band"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "While several artists recorded versions, no British Invasion band recorded an official 'Thunderball' theme that was rejected for Tom Jones.",
    "detailedExplanation": "This is a trick question based on a common misconception. While Tom Jones did indeed record the theme for 'Thunderball,' no British Invasion band recorded an official rejected version. However, Dionne Warwick recorded a version that was initially considered, and Johnny Cash also recorded one. The confusion may stem from the fact that several British artists were considered for Bond themes during this period. Tom Jones' version was ultimately selected and became a hit. The 1960s saw various British artists contributing to Bond soundtracks, but 'Thunderball' specifically was not a case where a British Invasion band was rejected in favor of Tom Jones.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thunderball_(song)",
    "citationTitle": "Wikipedia: Thunderball (song)"
  },
  {
    "id": "7c33cc85-951d-4d9c-83fd-f5186b9df243",
    "text": "Which British Invasion band was banned from appearing on 'The Ed Sullivan Show' after guitarist Pete Townshend used profanity during a live broadcast?",
    "options": [
      "The Who",
      "The Rolling Stones",
      "The Kinks",
      "This incident never happened"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "This incident is fictional - The Who appeared on The Ed Sullivan Show multiple times without such a controversy.",
    "detailedExplanation": "This is a trick question as no such incident occurred. The Who actually appeared on The Ed Sullivan Show several times during their career without being banned for profanity. The confusion might stem from various real controversies involving British Invasion bands on television, such as The Rolling Stones being asked to change lyrics, or The Doors' Jim Morrison (though American) refusing to change lyrics on The Ed Sullivan Show. The Who were known for their explosive live performances and Pete Townshend's guitar smashing, but they maintained professional behavior during their television appearances, understanding the importance of these platforms for reaching American audiences.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Ed_Sullivan_Show",
    "citationTitle": "Wikipedia: The Ed Sullivan Show"
  },
  {
    "id": "60d99719-cd6c-49b3-9e50-7e6b4f4933a4",
    "text": "Which British Invasion band's lead singer was born Reginald Kenneth Dwight?",
    "options": [
      "This describes Elton John, who wasn't a British Invasion band member",
      "The Moody Blues",
      "The Hollies",
      "Procol Harum"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Reginald Kenneth Dwight is Elton John's birth name, but he was not part of the British Invasion movement of the 1960s.",
    "detailedExplanation": "This is a trick question designed to test knowledge of both British rock history and the specific timeframe of the British Invasion. Reginald Kenneth Dwight is indeed the birth name of Elton John, one of Britain's most successful musicians. However, Elton John was not part of the British Invasion, which primarily occurred from 1964-1967. Elton John's breakthrough came in the early 1970s, well after the British Invasion period had ended. The British Invasion specifically refers to the wave of British rock and pop bands that became popular in the United States starting with The Beatles' appearance on The Ed Sullivan Show in February 1964.",
    "citationUrl": "https://en.wikipedia.org/wiki/British_Invasion",
    "citationTitle": "Wikipedia: British Invasion"
  },
  {
    "id": "0255b5a4-cc84-464f-8e51-d0ff217d1aec",
    "text": "Which British Invasion band was the first to use a sitar on a pop recording, predating The Beatles' use of the instrument on 'Norwegian Wood'?",
    "options": [
      "The Kinks",
      "The Yardbirds",
      "Manfred Mann",
      "The Zombies"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Kinks used a sitar on 'See My Friends' in July 1965, recorded before The Beatles' 'Norwegian Wood'.",
    "detailedExplanation": "The Kinks were pioneers in incorporating Eastern instruments into Western pop music. Ray Davies used a sitar on 'See My Friends,' which was recorded in July 1965 and released as a single in August. This predated The Beatles' famous use of the sitar on 'Norwegian Wood,' which was recorded in October 1965 for the 'Rubber Soul' album. Davies' early experimentation with the sitar helped influence the psychedelic and world music elements that would become prominent in rock music.",
    "citationUrl": "https://en.wikipedia.org/wiki/See_My_Friends",
    "citationTitle": "Wikipedia: See My Friends"
  },
  {
    "id": "b0a5c214-c4d0-4393-adc7-9275001447dd",
    "text": "Which British Invasion band's drummer, Keith Moon, allegedly blew up hotel toilets with cherry bombs, leading to them being banned from several major hotel chains?",
    "options": [
      "The Rolling Stones",
      "The Who",
      "The Kinks",
      "The Small Faces"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Keith Moon of The Who was notorious for his destructive behavior, including blowing up toilets with cherry bombs at hotels.",
    "detailedExplanation": "Keith Moon of The Who was legendary for his wild and destructive behavior both on and off stage. His hotel room antics became the stuff of rock and roll legend, including his habit of blowing up toilets with cherry bombs (powerful firecrackers). This behavior, along with driving cars into swimming pools and general mayhem, led to The Who being banned from several major hotel chains, including Holiday Inn. Moon's destructive tendencies were so notorious that the band had to pay substantial deposits when booking hotels, and his exploits helped establish the template for rock star excess.",
    "citationUrl": "https://en.wikipedia.org/wiki/Keith_Moon",
    "citationTitle": "Wikipedia: Keith Moon"
  },
  {
    "id": "b033d51a-8cde-4d2a-ad61-2a73f19ff781",
    "text": "Which British Invasion band recorded under the pseudonym 'The Masked Marauders' for a hoax album that supposedly featured Bob Dylan and Mick Jagger?",
    "options": [
      "The Byrds",
      "The Turtles",
      "Buffalo Springfield",
      "The Lovin' Spoonful"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Turtles recorded the hoax album 'The Masked Marauders' in 1969, pretending to be a supergroup.",
    "detailedExplanation": "In 1969, Rolling Stone magazine published a fake review of a non-existent album called 'The Masked Marauders,' supposedly featuring Bob Dylan, Mick Jagger, Paul McCartney, and Neil Young. The hoax became so believable that Deity Records commissioned The Turtles to actually record the album under the Masked Marauders pseudonym. Though The Turtles were American, they were closely associated with the British Invasion sound and scene. The album was recorded quickly with deliberately crude production to match the bootleg aesthetic described in the fake review, and it actually sold reasonably well despite being revealed as a hoax.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Masked_Marauders",
    "citationTitle": "Wikipedia: The Masked Marauders"
  },
  {
    "id": "e5f880fc-88f9-401e-bd04-e0d504c5d4af",
    "text": "Which British Invasion band's song 'For Your Love' caused Eric Clapton to quit the group because he felt they were moving too far away from blues music?",
    "options": [
      "The Yardbirds",
      "John Mayall & the Bluesbreakers",
      "Cream",
      "The Jeff Beck Group"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Eric Clapton left The Yardbirds in 1965 because he disapproved of their more commercial direction with 'For Your Love'.",
    "detailedExplanation": "Eric Clapton left The Yardbirds in March 1965, frustrated with the band's shift toward a more commercial pop sound. The breaking point was 'For Your Love,' written by Graham Gouldman, which featured harpsichord and bongos instead of the blues-based guitar work Clapton preferred. Clapton felt the song was too far removed from the blues purist approach he wanted to pursue. He was replaced by Jeff Beck, and the song became The Yardbirds' biggest hit, reaching #6 in the UK and #6 in the US. Clapton went on to join John Mayall & the Bluesbreakers, where he could focus on his preferred blues style.",
    "citationUrl": "https://en.wikipedia.org/wiki/For_Your_Love",
    "citationTitle": "Wikipedia: For Your Love"
  },
  {
    "id": "7d27fb37-c39a-48f6-87ba-6ac75314ec60",
    "text": "Which British Invasion band was formed by art school students and named themselves after a Muddy Waters song called 'Rollin' Stone'?",
    "options": [
      "The Rolling Stones",
      "The Pretty Things",
      "The Moody Blues",
      "The Hollies"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Rolling Stones took their name from the Muddy Waters song 'Rollin' Stone' (also known as 'Catfish Blues').",
    "detailedExplanation": "The Rolling Stones were named by Brian Jones after the Muddy Waters song 'Rollin' Stone' (also known as 'Catfish Blues'), reflecting their deep connection to American blues music. The band was formed in 1962 by Jones, Mick Jagger, and Keith Richards, who had met at Dartford Grammar School and later reconnected while studying at the London School of Economics and Sidcup Art College respectively. The name perfectly captured their blues influences and rebellious image, contrasting with the more polished pop sound of other British Invasion bands like The Beatles. This blues foundation would remain central to their identity throughout their career.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rolling_Stones",
    "citationTitle": "Wikipedia: The Rolling Stones"
  },
  {
    "id": "6ccb1e15-3f46-4287-a4e6-7c245b53db83",
    "text": "Which British Invasion band's lead guitarist, Dave Davies, is credited with creating one of the first heavily distorted guitar sounds by slashing his amplifier speaker with a razor blade?",
    "options": [
      "The Animals",
      "The Kinks",
      "The Troggs",
      "The Spencer Davis Group"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Dave Davies of The Kinks created a distinctive distorted sound by damaging his amplifier speaker, heard on songs like 'You Really Got Me'.",
    "detailedExplanation": "Dave Davies of The Kinks is credited as one of the pioneers of distorted guitar sound in rock music. For the recording of 'You Really Got Me' in 1964, Davies achieved his distinctive fuzzy, overdriven guitar tone by slashing the speaker cone of his Elpico amplifier with a razor blade and poking it with knitting needles. This created a heavily distorted sound that was revolutionary for its time and influenced the development of hard rock and heavy metal. The technique was born out of necessity and experimentation rather than expensive effects pedals, which didn't exist yet, making Davies' innovation particularly significant in rock history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dave_Davies",
    "citationTitle": "Wikipedia: Dave Davies"
  },
  {
    "id": "8f0f2217-208a-48e9-9867-c5f08db3969c",
    "text": "Which British Invasion band featured a young Rod Stewart as lead vocalist before he joined The Faces and launched his solo career?",
    "options": [
      "The Jeff Beck Group",
      "Steampacket",
      "The Hoochie Coochie Men",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Rod Stewart performed with all three groups during the British Invasion era before achieving major success with The Faces and as a solo artist.",
    "detailedExplanation": "Before becoming a major star, Rod Stewart was a journeyman musician who performed with several British Invasion-era groups. He was a member of The Jeff Beck Group from 1967-1969, which included future Led Zeppelin members John Paul Jones and briefly Jimmy Page. He also performed with Steampacket, a blues-rock supergroup that included Long John Baldry and Julie Driscoll, and The Hoochie Coochie Men, led by Long John Baldry. These experiences in the British blues and rock scene of the mid-1960s helped Stewart develop his distinctive raspy vocal style and stage presence that would later make him famous with The Faces and in his hugely successful solo career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rod_Stewart",
    "citationTitle": "Wikipedia: Rod Stewart"
  },
  {
    "id": "d8ddbd01-10fa-4227-bd54-117e00194f6d",
    "text": "Which British Invasion band's song 'Gloria' became a garage rock anthem, though it was originally recorded by the American band Them?",
    "options": [
      "This is a trick question - Them was actually Irish",
      "The Shadows",
      "The Searchers",
      "Herman's Hermits"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Them, led by Van Morrison, was actually from Belfast, Northern Ireland, making them part of the British Invasion despite being Irish.",
    "detailedExplanation": "Them was formed in Belfast, Northern Ireland in 1964, with Van Morrison as lead vocalist. While technically Irish, Northern Ireland was (and remains) part of the United Kingdom, so Them is generally classified as part of the British Invasion. Their song 'Gloria,' written by Van Morrison, became one of the most influential garage rock songs ever recorded. The song's simple three-chord structure and Morrison's powerful vocal delivery made it a favorite among American garage bands, and it has been covered countless times. The original version reached the top 10 in several countries and helped establish Van Morrison's reputation before his solo career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Them_(band)",
    "citationTitle": "Wikipedia: Them (band)"
  },
  {
    "id": "1a868824-5dec-4b78-9f75-ad15ce280234",
    "text": "Which British Invasion band's debut album was recorded in just 10 hours and cost only £1,782 to produce, yet became one of the most influential albums in rock history?",
    "options": [
      "The Beatles - Please Please Me",
      "The Rolling Stones - The Rolling Stones",
      "The Kinks - Kinks",
      "The Who - My Generation"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Beatles recorded 'Please Please Me' in a single 13-hour session on February 11, 1963, for £1,782.",
    "detailedExplanation": "The Beatles' debut album 'Please Please Me' was famously recorded in a marathon 13-hour session at Abbey Road Studios on February 11, 1963, with total production costs of just £1,782. The band recorded 10 new songs in one day to complete the album, with John Lennon's voice nearly giving out by the end - particularly noticeable on the final track 'Twist and Shout.' Despite its minimal budget and rushed recording schedule, the album spent 30 weeks at number one on the UK Albums Chart and established The Beatles as the leading force of the British Invasion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Please_Please_Me",
    "citationTitle": "Wikipedia: Please Please Me"
  },
  {
    "id": "741d7561-5837-44fd-ad0c-e9f9439de5b4",
    "text": "Which British Invasion band was the first British group to have a number one hit on the US Billboard Hot 100, breaking the American market wide open for other UK acts?",
    "options": [
      "The Beatles with 'I Want to Hold Your Hand'",
      "Petula Clark with 'Downtown'",
      "The Tornados with 'Telstar'",
      "Dusty Springfield with 'I Only Want to Be with You'"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Tornados reached #1 with 'Telstar' in December 1962, predating The Beatles' US success by over a year.",
    "detailedExplanation": "The Tornados, an instrumental group produced by Joe Meek, achieved the first US number one hit by a British group with 'Telstar' in December 1962. This space-age themed instrumental, named after the telecommunications satellite, topped the Billboard Hot 100 more than a year before The Beatles' 'I Want to Hold Your Hand' reached number one in February 1964. While The Beatles are often credited with starting the British Invasion, The Tornados actually broke the barrier first, proving that British acts could succeed in the American market and paving the way for the massive wave that followed.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Tornados",
    "citationTitle": "Wikipedia: The Tornados"
  },
  {
    "id": "fb70d126-b555-44f5-bbf3-d32644273cc2",
    "text": "Which British Invasion band's manager famously locked them in a studio and refused to let them out until they wrote their first original hit song?",
    "options": [
      "The Rolling Stones",
      "Herman's Hermits",
      "The Hollies",
      "Manfred Mann"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Andrew Loog Oldham locked Mick Jagger and Keith Richards in a room until they wrote 'As Tears Go By' in 1964.",
    "detailedExplanation": "Rolling Stones manager Andrew Loog Oldham famously locked Mick Jagger and Keith Richards in a room and told them he wouldn't let them out until they had written a song together. This forced collaboration in 1964 resulted in 'As Tears Go By,' which became their first original composition to achieve commercial success. Initially recorded by Marianne Faithfull (who was dating Jagger), the song marked the beginning of the Jagger-Richards songwriting partnership that would become one of rock's most successful creative teams. Oldham's unconventional management technique transformed the Stones from a blues cover band into original songwriters.",
    "citationUrl": "https://en.wikipedia.org/wiki/As_Tears_Go_By_(song)",
    "citationTitle": "Wikipedia: As Tears Go By (song)"
  },
  {
    "id": "93dcbe3f-ce15-4579-95b3-5bbc97fff30c",
    "text": "Which British Invasion band performed the longest set at the legendary Monterey Pop Festival in 1967, playing for over 90 minutes and helping establish their reputation in America?",
    "options": [
      "The Who",
      "Traffic",
      "Eric Burdon and The Animals",
      "The Jimi Hendrix Experience"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Traffic played the longest set at Monterey Pop Festival, performing for over 90 minutes across two separate performances.",
    "detailedExplanation": "Traffic, the psychedelic rock band led by Steve Winwood, performed the longest set at the historic Monterey Pop Festival in June 1967. The band played for over 90 minutes across two separate performances during the three-day festival, helping to establish their reputation in the American market. While acts like The Who's destructive performance and Jimi Hendrix's guitar-burning finale received more media attention, Traffic's extended showcase demonstrated their musical versatility and improvisational skills. The festival appearance was crucial for introducing the band's unique blend of rock, jazz, and folk to American audiences during the height of the psychedelic era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Monterey_Pop_Festival",
    "citationTitle": "Wikipedia: Monterey Pop Festival"
  }
]