[
  {
    "id": "c47c9865-5082-4e8b-8851-639ded93005c",
    "text": "Which famous art forger successfully deceived Nazi officials and art experts by creating fake Vermeer paintings during World War II?",
    "options": [
      "Han van Meegeren",
      "Elmyr de Hory",
      "Tom Keating",
      "Eric Hebborn"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Han van Meegeren was a Dutch painter who forged works by Johannes Vermeer and other artists, famously selling fake Vermeers to Nazi leaders.",
    "detailedExplanation": "Han van Meegeren (1889-1947) was one of the most successful art forgers in history. During World War II, he created convincing fake paintings attributed to Johannes Vermeer and other Dutch Golden Age masters. His forgeries were so convincing that they fooled leading art experts and Nazi officials, including Hermann Göring, who purchased 'The Woman Taken in Adultery' for his collection. Van Meegeren's deception was only discovered after the war when he was charged with collaboration for selling Dutch cultural treasures to the enemy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Han_van_Meegeren",
    "citationTitle": "Wikipedia: Han van Meegeren"
  },
  {
    "id": "49aae827-e512-4997-9588-fa928f2db582",
    "text": "The mysterious disappearance of which Leonardo da Vinci painting from the Louvre in 1911 actually helped make it one of the world's most famous artworks?",
    "options": [
      "The Last Supper",
      "Mona Lisa",
      "Vitruvian Man",
      "Lady with an Ermine"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Mona Lisa was stolen from the Louvre in 1911 by employee Vincenzo Peruggia, and the theft made it internationally famous.",
    "detailedExplanation": "On August 21, 1911, the Mona Lisa was stolen from the Louvre by Italian handyman Vincenzo Peruggia, who had helped install the painting's protective glass case. The theft wasn't discovered until the next day, sparking an international manhunt and massive media coverage. Ironically, before the theft, the Mona Lisa was known mainly to art connoisseurs, but the extensive newspaper coverage of its disappearance made it a household name worldwide. The painting was recovered in 1913 when Peruggia attempted to sell it to an art dealer in Florence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Theft_of_the_Mona_Lisa",
    "citationTitle": "Wikipedia: Theft of the Mona Lisa"
  },
  {
    "id": "03b63515-f9ec-44de-9deb-de4f2c905ce9",
    "text": "What scientific technique revolutionized art authentication by allowing experts to see underlying layers and detect anachronistic materials?",
    "options": [
      "Carbon dating",
      "X-ray radiography",
      "DNA analysis",
      "Spectrography"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "X-ray radiography allows art experts to see through paint layers, revealing underlying sketches, changes, and materials that can expose forgeries.",
    "detailedExplanation": "X-ray radiography became a game-changer in art authentication when it was first applied to paintings in the 1920s. This technique allows conservators and authentication experts to see through layers of paint to reveal underlying sketches (called pentimenti), previous compositions, and the canvas or wood support beneath. X-rays can also detect modern materials like titanium white pigment (invented in 1916) in paintings supposedly from earlier periods, immediately exposing them as forgeries. This non-invasive technique has helped authenticate countless masterpieces and expose numerous fakes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_forgery",
    "citationTitle": "Wikipedia: Art forgery"
  },
  {
    "id": "6a1bef0e-eda1-456e-802e-96117b5fda99",
    "text": "Which famous painting, supposedly by Jackson Pollock, became the subject of a major authentication controversy after being featured in a documentary called 'Who the #$&% Is Jackson Pollock?'",
    "options": [
      "No. 1, 1950 (Lavender Mist)",
      "Convergence",
      "Teri Horton's painting",
      "Blue Poles"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Teri Horton purchased a painting at a thrift store for $5 that some believe to be an authentic Jackson Pollock worth millions.",
    "detailedExplanation": "In the early 1990s, truck driver Teri Horton bought a painting at a California thrift store for $5 as a joke gift. When she later tried to sell it at a garage sale, an art teacher suggested it might be a Jackson Pollock. The painting became the center of a decades-long authentication battle, with some forensic experts finding evidence supporting its authenticity, including a possible fingerprint match to Pollock. However, the Pollock-Krasner Authentication Board and many art experts remain skeptical. The story was documented in the 2006 film 'Who the #$&% Is Jackson Pollock?' and the painting's value remains disputed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Teri_Horton",
    "citationTitle": "Wikipedia: Teri Horton"
  },
  {
    "id": "4575bf53-382f-42ab-a80c-26ad5e1e21b4",
    "text": "The infamous 'Knoedler Gallery scandal' involved fake paintings supposedly by which group of artists that cost collectors over $80 million?",
    "options": [
      "Impressionists like Monet and Renoir",
      "Abstract Expressionists like Pollock and Rothko",
      "Renaissance masters like Leonardo and Michelangelo",
      "Post-Impressionists like Van Gogh and Cézanne"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Knoedler Gallery scandal involved fake Abstract Expressionist paintings, including works attributed to Pollock, Rothko, and Motherwell.",
    "detailedExplanation": "The Knoedler Gallery scandal, which came to light in 2011, involved the sale of at least 40 fake paintings attributed to major Abstract Expressionist artists including Jackson Pollock, Mark Rothko, Robert Motherwell, and Willem de Kooning. The forgeries were created in a garage in Queens by Chinese artist Pei-Shen Qian and sold through the prestigious 165-year-old Knoedler & Company gallery in Manhattan. The scandal ultimately led to the closure of America's oldest art gallery and multiple lawsuits from collectors who paid millions for worthless fakes. The total losses to buyers exceeded $80 million.",
    "citationUrl": "https://en.wikipedia.org/wiki/Knoedler_Gallery",
    "citationTitle": "Wikipedia: Knoedler Gallery"
  },
  {
    "id": "6215e630-d131-482a-8c72-d0f964adc990",
    "text": "What unusual material did British forger Shaun Greenhalgh use to artificially age his fake ancient sculptures and pottery?",
    "options": [
      "Coffee grounds and tea bags",
      "Cigarette smoke and dirt",
      "His mother's oven and garden soil",
      "Vinegar and rust"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Shaun Greenhalgh aged his forgeries using his mother's kitchen oven and soil from their garden to create convincing patina and weathering.",
    "detailedExplanation": "Shaun Greenhalgh, working with his elderly parents from their modest home in Bolton, England, created some of the most convincing art forgeries of the early 2000s. His technique for aging sculptures and ceramics involved baking them in his mother's kitchen oven and then burying them in their garden soil to create authentic-looking patina and weathering. The family successfully sold fake ancient Egyptian sculptures, Roman statues, and medieval artifacts to major museums and collectors for over a decade. Their operation was finally exposed in 2006 when experts became suspicious of an 'Assyrian relief' they tried to sell to the British Museum.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shaun_Greenhalgh",
    "citationTitle": "Wikipedia: Shaun Greenhalgh"
  },
  {
    "id": "b3ce38f1-211e-49a0-bbd3-0e1e9c78ef93",
    "text": "Which famous sculpture, discovered in 1861, had its authenticity questioned when experts noticed that Venus's pose appeared to be inspired by a much later artistic style?",
    "options": [
      "Venus de Milo",
      "Winged Victory of Samothrace",
      "Laocoön and His Sons",
      "Apollo Belvedere"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Venus de Milo's authenticity was questioned because her contrapposto pose seemed influenced by later Hellenistic rather than Classical Greek art.",
    "detailedExplanation": "The Venus de Milo, discovered on the Greek island of Milos in 1820 (not 1861), has faced periodic authentication challenges since its discovery. Some scholars have questioned whether this famous sculpture truly dates to ancient Greece (around 130-100 BCE) or could be a later creation. Skeptics point to the sophisticated contrapposto pose and the sculpture's remarkably good condition as potentially suspicious. However, most art historians and archaeologists accept its authenticity based on the Hellenistic style, the circumstances of its discovery, and various technical analyses. The sculpture remains one of the Louvre's most prized possessions despite occasional scholarly debates.",
    "citationUrl": "https://en.wikipedia.org/wiki/Venus_de_Milo",
    "citationTitle": "Wikipedia: Venus de Milo"
  },
  {
    "id": "92127b5b-520a-481b-b4fc-8b96b99d2539",
    "text": "The 'Amarna Princess' sculpture, bought by the Bolton Museum for £440,000, was later revealed to be a fake created by which notorious forger?",
    "options": [
      "Tom Keating",
      "Shaun Greenhalgh",
      "Eric Hebborn",
      "Alceo Dossena"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The 'Amarna Princess' was created by Shaun Greenhalgh and sold as an authentic ancient Egyptian sculpture, fooling experts for years.",
    "detailedExplanation": "The 'Amarna Princess,' supposedly a 3,300-year-old ancient Egyptian sculpture from the time of Akhenaten, was purchased by Bolton Museum in 2003 for £440,000 after being authenticated by several experts. The sculpture was believed to be a rare example of Amarna period art and was even loaned to other prestigious institutions. However, in 2006, it was revealed to be a modern forgery created by Shaun Greenhalgh in his garden shed. The revelation was particularly embarrassing because Greenhalgh lived just a few miles from the museum that bought his fake. This case highlighted how even respected institutions and experts can be fooled by skilled forgers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shaun_Greenhalgh",
    "citationTitle": "Wikipedia: Shaun Greenhalgh"
  },
  {
    "id": "5595753a-f20f-4e31-9678-9a29c1da4d05",
    "text": "Which notorious art forger created over 2,000 fake works spanning 300 years of art history and famously said 'I am probably the most famous unknown artist in history'?",
    "options": [
      "John Myatt",
      "Elmyr de Hory",
      "Wolfgang Beltracchi",
      "Tom Keating"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Wolfgang Beltracchi created thousands of fake paintings across multiple artistic periods and made this famous quote.",
    "detailedExplanation": "Wolfgang Beltracchi is considered one of the most prolific art forgers in history, having created over 2,000 fake works spanning three centuries of art history. His forgeries included works supposedly by Max Ernst, Heinrich Campendonk, and Kees van Dongen, among others. Beltracchi was particularly skilled at creating works 'in the style of' famous artists rather than copying existing pieces, making his fakes harder to detect. He was finally caught in 2010 and sentenced to six years in prison.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wolfgang_Beltracchi",
    "citationTitle": "Wikipedia: Wolfgang Beltracchi"
  },
  {
    "id": "81d2617a-ab6d-4cc2-a2d3-2b1c684a9c93",
    "text": "The 'Supper at Emmaus' painting that was authenticated as a Caravaggio in 1999 and later sold for millions was discovered to be a fake by which forger?",
    "options": [
      "Michelangelo Merisi",
      "Louis Marcy",
      "Denis Mahon",
      "The painting's authenticity remains disputed"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Caravaggio 'Supper at Emmaus' remains one of the most controversial attributions, with experts still divided on its authenticity.",
    "detailedExplanation": "The painting known as 'Supper at Emmaus' became one of the most controversial art authentication cases of the 21st century. Initially discovered in 1999 and authenticated by some experts as a lost Caravaggio work, it sold for millions of pounds. However, other scholars questioned its attribution, pointing to stylistic inconsistencies and technical issues. The controversy highlights the ongoing challenges in art authentication, where expert opinions can vary dramatically even with modern scientific analysis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Caravaggio",
    "citationTitle": "Wikipedia: Caravaggio"
  },
  {
    "id": "25fb1122-61ef-449e-afe3-a141f3a0a146",
    "text": "What famous Rodin sculpture was the center of a major authentication scandal when multiple versions appeared on the market, leading to questions about which were genuine?",
    "options": [
      "The Thinker",
      "The Kiss",
      "The Burghers of Calais",
      "The Gates of Hell"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Multiple versions of 'The Thinker' have caused authentication problems due to Rodin's practice of creating multiple casts.",
    "detailedExplanation": "Auguste Rodin's 'The Thinker' has been at the center of numerous authentication controversies due to Rodin's practice of creating multiple bronze casts of his sculptures during his lifetime and the continued casting after his death. The Rodin estate and museums have struggled to determine which versions are authentic lifetime casts versus later reproductions. This has led to complex legal battles and authentication disputes, as the market value differs dramatically between genuine Rodin casts and later reproductions.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Thinker",
    "citationTitle": "Wikipedia: The Thinker"
  },
  {
    "id": "57b9df11-b6d1-41aa-b9ce-79e2047e535e",
    "text": "The mysterious 'Portrait of a Young Man' by Raphael, worth an estimated $100 million, disappeared during which historical event and has never been recovered?",
    "options": [
      "The French Revolution",
      "World War I",
      "World War II",
      "The Russian Revolution"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Raphael's 'Portrait of a Young Man' was stolen by the Nazis during World War II and remains missing.",
    "detailedExplanation": "Raphael's 'Portrait of a Young Man' is considered one of the most valuable missing paintings in the world. The painting was stolen from the Czartoryski Museum in Kraków by Nazi forces during World War II. Despite extensive searches and investigations over the decades, including theories about it being hidden in various locations or destroyed, the painting has never been recovered. It remains on the FBI's Top Ten Art Crimes list and is valued at over $100 million.",
    "citationUrl": "https://en.wikipedia.org/wiki/Portrait_of_a_Young_Man_(Raphael)",
    "citationTitle": "Wikipedia: Portrait of a Young Man (Raphael)"
  },
  {
    "id": "bc8c5f84-8520-4f66-bf8b-a618d87ba041",
    "text": "Which technique did forger Eric Hebborn famously use to create convincing fake old master drawings that fooled experts for decades?",
    "options": [
      "Using period-appropriate paper and inks",
      "Copying existing works exactly",
      "Using modern materials aged artificially",
      "Digital manipulation techniques"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Eric Hebborn used authentic old paper and period-appropriate materials to create convincing fake old master drawings.",
    "detailedExplanation": "Eric Hebborn was one of the most successful art forgers of the 20th century, specializing in old master drawings. His key to success was his meticulous attention to using authentic materials from the appropriate time periods. He would source old paper from the margins of period books and use historically accurate inks and drawing techniques. Hebborn studied the masters intensively and could mimic their styles convincingly. His forgeries fooled major auction houses and museums for decades before suspicions arose in the 1970s and 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eric_Hebborn",
    "citationTitle": "Wikipedia: Eric Hebborn"
  },
  {
    "id": "a76493a0-f029-498e-84ff-33ec74a9b074",
    "text": "The 'Gardner Museum Heist' of 1990 resulted in the theft of 13 artworks worth over $500 million. Which artist's works made up the most valuable single loss in the theft?",
    "options": [
      "Johannes Vermeer",
      "Rembrandt van Rijn",
      "Edgar Degas",
      "Édouard Manet"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Vermeer's 'The Concert' was the most valuable single work stolen in the Gardner Museum heist.",
    "detailedExplanation": "The Isabella Stewart Gardner Museum heist remains the largest unsolved art theft in history. Among the 13 stolen works, Johannes Vermeer's 'The Concert' is considered the most valuable single piece, estimated to be worth over $200 million. The painting, one of only 34 known works by Vermeer, was painted around 1664. Despite a $10 million reward and decades of investigation, none of the stolen artworks have been recovered, making this one of art history's greatest unsolved mysteries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Isabella_Stewart_Gardner_Museum_theft",
    "citationTitle": "Wikipedia: Isabella Stewart Gardner Museum theft"
  },
  {
    "id": "f54a444b-fa6f-4b46-94f6-5165f63da8db",
    "text": "What unusual method did forger John Drewe use to legitimize the fake paintings created by John Myatt in their elaborate scheme?",
    "options": [
      "Creating fake auction records",
      "Infiltrating museum archives to insert false documentation",
      "Bribing art experts",
      "Using stolen authentic paintings as templates"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "John Drewe infiltrated museum and gallery archives to insert fake provenance documents for Myatt's forged paintings.",
    "detailedExplanation": "John Drewe orchestrated one of the most sophisticated art fraud schemes by infiltrating the archives of prestigious institutions like the Tate Gallery and Victoria and Albert Museum. He would insert fake documents, exhibition catalogs, and provenance records to create seemingly legitimate histories for the paintings forged by John Myatt. This gave the fake works convincing paper trails that fooled auction houses and collectors. The scheme ran for nearly a decade before being discovered in the 1990s, demonstrating how crucial provenance documentation is in art authentication.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Myatt",
    "citationTitle": "Wikipedia: John Myatt"
  },
  {
    "id": "5b3b532c-1348-4e07-adce-317e009006bf",
    "text": "The 'Salvator Mundi' painting attributed to Leonardo da Vinci became controversial after selling for a record $450 million in 2017. What is the main source of the authentication dispute?",
    "options": [
      "The painting's mysterious disappearance after the sale",
      "Disagreement over whether it was painted entirely by Leonardo or his workshop",
      "Questions about the painting's age using carbon dating",
      "Discovery that the painting was stolen during World War II"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Experts debate whether 'Salvator Mundi' was painted entirely by Leonardo da Vinci or partially by his workshop assistants.",
    "detailedExplanation": "The attribution of 'Salvator Mundi' remains highly controversial among art historians and experts. While some scholars accept it as a genuine work by Leonardo da Vinci, others argue that it was largely painted by his workshop with only minimal input from the master himself. The painting's condition, having been heavily restored, makes definitive authentication challenging. Additionally, the work's mysterious whereabouts since its record-breaking sale have added to the controversy, with some experts questioning whether a work of uncertain attribution should command such an astronomical price.",
    "citationUrl": "https://en.wikipedia.org/wiki/Salvator_Mundi_(Leonardo)",
    "citationTitle": "Wikipedia: Salvator Mundi (Leonardo)"
  },
  {
    "id": "42dcea1c-47f7-46a2-b779-cbcec1d61bba",
    "text": "Which art authentication scandal involved fake prehistoric cave paintings that fooled experts for over 20 years before being exposed in the 1980s?",
    "options": [
      "Rouffignac Cave hoax",
      "Beringer's Lying Stones",
      "Piltdown Cave fraud",
      "Glozel archaeological forgeries"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Glozel archaeological forgeries involved fake prehistoric artifacts and cave paintings that deceived experts from the 1920s to the 1980s.",
    "detailedExplanation": "The Glozel affair was one of archaeology's greatest scandals, involving fake prehistoric artifacts and cave paintings discovered near the French village of Glozel starting in 1924. For decades, these forgeries fooled numerous experts and divided the archaeological community. The artifacts included tablets with mysterious inscriptions, pottery, and cave paintings that were supposedly thousands of years old. It wasn't until advanced scientific dating methods were applied in the 1980s that the hoax was definitively exposed, revealing that the items were modern fabrications buried to simulate ancient discoveries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glozel",
    "citationTitle": "Wikipedia: Glozel"
  },
  {
    "id": "f90ca093-6533-4704-bdd6-86e013143d14",
    "text": "What unusual authentication mark did British forger Tom Keating deliberately include in his fake paintings to signal they were not genuine?",
    "options": [
      "His initials hidden in the brushwork",
      "Modern paint containing titanium white",
      "The word 'FAKE' written under the paint layer",
      "A small self-portrait in the corner"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "Tom Keating wrote 'FAKE' or other messages under the paint layers as a way to signal his works were forgeries, calling them 'Sexton Blake' paintings.",
    "detailedExplanation": "Tom Keating was a unique figure in art forgery who often included hidden messages under his paintings, most famously writing 'FAKE' or 'This is a fake' beneath the paint layers. He called his forgeries 'Sexton Blake' paintings (rhyming slang for fake) and claimed he was exposing the corrupt art market rather than trying to deceive permanently. Keating created over 2,000 fake works in the styles of various masters, and his hidden messages were intended to eventually expose the paintings as forgeries when subjected to X-ray analysis. His case became famous when he was prosecuted in 1977, though charges were dropped due to his poor health and public sympathy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tom_Keating",
    "citationTitle": "Wikipedia: Tom Keating"
  },
  {
    "id": "22771e5d-cfd9-4c77-a60d-7a44f5dfee50",
    "text": "The mysterious 'Rothko Chapel' paintings were at the center of which authentication controversy involving the artist's estate?",
    "options": [
      "Claims they were painted by assistants rather than Rothko himself",
      "Disputes over whether they were completed before or after his suicide",
      "Questions about whether the color formulations matched Rothko's usual paints",
      "Allegations that some panels were modern reproductions replacing damaged originals"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The Rothko Chapel paintings were controversial because some were completed after Rothko's suicide in 1970, raising questions about their authenticity and attribution.",
    "detailedExplanation": "The Rothko Chapel in Houston houses 14 large-scale paintings by Mark Rothko, but their authentication became controversial because the project was completed after the artist's suicide in February 1970. While Rothko had been working on the commission since 1964, several of the final paintings were completed posthumously, leading to disputes about their attribution and authenticity. The question of whether works finished after an artist's death can truly be considered authentic works by that artist has broader implications for the art world. The chapel opened in 1971, and while the paintings are generally accepted as Rothko's work, the timing of their completion continues to be a point of scholarly discussion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rothko_Chapel",
    "citationTitle": "Wikipedia: Rothko Chapel"
  },
  {
    "id": "c3cc9a90-c77f-4ab3-84c6-484486473ff5",
    "text": "Which famous museum unknowingly displayed a forged ancient Greek marble statue called the 'Getty kouros' for years before its authenticity was seriously questioned?",
    "options": [
      "British Museum",
      "Louvre Museum",
      "J. Paul Getty Museum",
      "Metropolitan Museum of Art"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "medium",
    "explanation": "The J. Paul Getty Museum purchased and displayed the 'Getty kouros' in 1985, but its authenticity has been heavily debated ever since.",
    "detailedExplanation": "The Getty kouros is a marble statue purportedly from ancient Greece that the J. Paul Getty Museum acquired in 1985 for around $7 million. Almost immediately after its acquisition, scholars began questioning its authenticity, pointing to inconsistencies in its style, surface treatment, and the suspicious circumstances of its discovery. Some experts argued that certain stylistic elements didn't align with known examples from the supposed time period, while others defended it as genuine. The controversy has continued for decades, with the museum eventually changing its label to note the 'questions about its authenticity.' The case highlights the challenges museums face in authenticating ancient works and the sophisticated nature of modern forgeries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Getty_kouros",
    "citationTitle": "Wikipedia: Getty kouros"
  }
]