[
  {
    "id": "b91214db-26cf-48e6-97f1-9934e3918aa6",
    "text": "Which poet wrote the epic poem 'Paradise Lost' and was blind when he composed most of it?",
    "options": [
      "Geoffrey Chaucer",
      "John Milton",
      "Edmund Spenser",
      "William Blake"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "John Milton wrote Paradise Lost while blind, dictating the epic poem to scribes.",
    "detailedExplanation": "John Milton (1608-1674) composed his masterpiece 'Paradise Lost' while completely blind, having lost his sight by 1652. The epic poem, which tells the biblical story of the Fall of Man, was dictated to his daughters and scribes between 1658-1664. Milton's blindness didn't diminish his poetic powers; instead, many scholars argue it enhanced his ability to create the rich, complex imagery that makes Paradise Lost one of the greatest works in English literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Milton",
    "citationTitle": "Wikipedia: John Milton"
  },
  {
    "id": "314a610f-7662-4bc1-84b1-e9e824983a24",
    "text": "What is the name of the Persian poet who wrote 'The Rubaiyat', famously translated into English by Edward FitzGerald?",
    "options": [
      "Hafez",
      "Omar Khayyam",
      "Rumi",
      "Saadi"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Omar Khayyam was the Persian poet whose Rubaiyat was translated by Edward FitzGerald in 1859.",
    "detailedExplanation": "Omar Khayyam (1048-1131) was a Persian polymath who was not only a poet but also a mathematician and astronomer. His collection of quatrains called 'The Rubaiyat' remained relatively obscure until Edward FitzGerald's loose English translation was published in 1859. FitzGerald's version became immensely popular in Victorian England and introduced Western readers to Khayyam's philosophical poetry about the transience of life, love, and the pursuit of pleasure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Omar_Khayyam",
    "citationTitle": "Wikipedia: Omar Khayyam"
  },
  {
    "id": "32e51a18-9b3e-4966-ac0b-cd0b6b6436b5",
    "text": "Which modernist poet wrote 'The Waste Land' and won the Nobel Prize in Literature in 1948?",
    "options": [
      "Ezra Pound",
      "T.S. Eliot",
      "William Carlos Williams",
      "Wallace Stevens"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "T.S. Eliot wrote 'The Waste Land' in 1922 and received the Nobel Prize in Literature in 1948.",
    "detailedExplanation": "Thomas Stearns Eliot (1888-1965) published 'The Waste Land' in 1922, a poem that became one of the most important works of modernist literature. The fragmented, allusive poem reflects the disillusionment following World War I and revolutionized poetry with its innovative structure and style. Eliot was awarded the Nobel Prize in Literature in 1948 'for his outstanding, pioneer contribution to present-day poetry,' recognizing both The Waste Land and his other influential works including 'Four Quartets.'",
    "citationUrl": "https://en.wikipedia.org/wiki/T._S._Eliot",
    "citationTitle": "Wikipedia: T. S. Eliot"
  },
  {
    "id": "d7ccfffd-18c2-4803-b4d2-062ac067c9ba",
    "text": "What poetic form, consisting of 14 lines with a specific rhyme scheme, was perfected by Shakespeare?",
    "options": [
      "Villanelle",
      "Sestina",
      "Sonnet",
      "Pantoum"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The sonnet is a 14-line poem, and Shakespeare developed his own variation of the form.",
    "detailedExplanation": "The sonnet is a 14-line poetic form that originated in Italy with Petrarch, but Shakespeare developed his own variation known as the Shakespearean or English sonnet. Unlike the Petrarchan sonnet's octave and sestet structure, the Shakespearean sonnet follows an ABABCDCDEFEFGG rhyme scheme, consisting of three quatrains and a final couplet. Shakespeare wrote 154 sonnets, exploring themes of love, beauty, mortality, and time, and his mastery of this form influenced countless poets who followed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shakespearean_sonnet",
    "citationTitle": "Wikipedia: Shakespearean sonnet"
  },
  {
    "id": "73370f9a-5a5f-4618-9b41-5c3b4948fbee",
    "text": "Which Beat Generation poet wrote 'Howl' and faced obscenity charges for its publication?",
    "options": [
      "Jack Kerouac",
      "Allen Ginsberg",
      "Lawrence Ferlinghetti",
      "Gary Snyder"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Allen Ginsberg wrote 'Howl' in 1955, which led to an obscenity trial for its publisher.",
    "detailedExplanation": "Allen Ginsberg (1926-1997) wrote 'Howl' in 1955, a groundbreaking poem that became an anthem of the Beat Generation. When Lawrence Ferlinghetti's City Lights Bookstore published it in 1956, the book was seized by police and Ferlinghetti was arrested on obscenity charges due to the poem's frank discussion of sexuality and drug use. The subsequent trial, which Ferlinghetti won, became a landmark case for freedom of expression in American literature and helped establish 'Howl' as one of the most important poems of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Howl",
    "citationTitle": "Wikipedia: Howl"
  },
  {
    "id": "0f3df4ae-2bfc-4359-9b64-6f7c4696fd79",
    "text": "What is the term for a poem that mourns the death of a person or laments something lost, such as Tennyson's 'In Memoriam A.H.H.'?",
    "options": [
      "Epithalamion",
      "Elegy",
      "Pastoral",
      "Ode"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "An elegy is a mournful poem, typically lamenting the dead or something lost.",
    "detailedExplanation": "An elegy is a poetic form that expresses sorrow, typically for someone who has died, though it can also lament other losses. Tennyson's 'In Memoriam A.H.H.' (1850) is one of the most famous elegies in English literature, written to mourn his close friend Arthur Henry Hallam who died suddenly at age 22. The poem, consisting of 131 sections, took Tennyson 17 years to complete and explores themes of grief, faith, and the meaning of life and death, becoming a defining work of Victorian literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elegy",
    "citationTitle": "Wikipedia: Elegy"
  },
  {
    "id": "0756919d-bd2f-4608-a553-d4e5e74a9d86",
    "text": "Which African American poet wrote 'I Know Why the Caged Bird Sings' and was the first African American woman to recite a poem at a U.S. presidential inauguration?",
    "options": [
      "Gwendolyn Brooks",
      "Maya Angelou",
      "Nikki Giovanni",
      "Audre Lorde"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Maya Angelou wrote the autobiography 'I Know Why the Caged Bird Sings' and recited at Clinton's 1993 inauguration.",
    "detailedExplanation": "Maya Angelou (1928-2014) was a groundbreaking poet and author whose autobiography 'I Know Why the Caged Bird Sings' (1969) became a classic of American literature. In 1993, she made history by becoming the first African American woman to recite a poem at a presidential inauguration, delivering 'On the Pulse of Morning' at Bill Clinton's ceremony. Her work addressed themes of racism, identity, and resilience, and she became one of the most influential voices in American literature, receiving numerous awards including the Presidential Medal of Freedom.",
    "citationUrl": "https://en.wikipedia.org/wiki/Maya_Angelou",
    "citationTitle": "Wikipedia: Maya Angelou"
  },
  {
    "id": "1a2abdae-0b95-4d13-8be2-a5ff22715d12",
    "text": "What is the name of the ancient Greek epic poem attributed to Homer that tells the story of Odysseus's journey home after the Trojan War?",
    "options": [
      "The Iliad",
      "The Odyssey",
      "The Aeneid",
      "The Metamorphoses"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Odyssey is Homer's epic about Odysseus's ten-year journey home after the Trojan War.",
    "detailedExplanation": "The Odyssey is an ancient Greek epic poem attributed to Homer, composed in the 8th century BCE. It tells the story of Odysseus (Ulysses in Roman mythology) and his ten-year journey home to Ithaca after the fall of Troy. The epic is divided into 24 books and features famous episodes including encounters with the Cyclops Polyphemus, the Sirens, and Circe. Along with The Iliad, The Odyssey is considered one of the foundational works of Western literature and has influenced countless writers and storytellers throughout history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Odyssey",
    "citationTitle": "Wikipedia: Odyssey"
  },
  {
    "id": "914f6ec9-2a24-4653-8147-f755d1761ff9",
    "text": "Which Welsh poet wrote 'Do not go gentle into that good night' and died at age 39 in New York City?",
    "options": [
      "W.H. Auden",
      "Dylan Thomas",
      "Philip Larkin",
      "Ted Hughes"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Dylan Thomas wrote this famous villanelle and died young in New York in 1953.",
    "detailedExplanation": "Dylan Thomas, the Welsh poet known for his vivid imagery and musical language, wrote the famous villanelle 'Do not go gentle into that good night' in 1947. The poem, written for his dying father, became one of the most recognizable poems in English literature. Thomas died tragically young at age 39 in 1953 during a reading tour in New York City, cementing his reputation as a romantic figure of 20th-century poetry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dylan_Thomas",
    "citationTitle": "Wikipedia: Dylan Thomas"
  },
  {
    "id": "eb76dba1-e41f-45c7-be03-81a07c1d3bcc",
    "text": "What is the name of the complex poetic form consisting of 19 lines with only two rhymes, popularized by poets like Auden and Bishop?",
    "options": [
      "Sestina",
      "Villanelle",
      "Pantoum",
      "Ghazal"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "A villanelle is a 19-line form with two rhymes and two refrains, used in famous poems like 'Do Not Go Gentle Into That Good Night.'",
    "detailedExplanation": "The villanelle is a highly structured poetic form consisting of 19 lines with only two rhyme sounds throughout. It follows a specific pattern with five tercets (three-line stanzas) followed by a quatrain (four-line stanza), featuring two refrains that repeat according to a strict pattern. Famous examples include Dylan Thomas's 'Do Not Go Gentle Into That Good Night' and Elizabeth Bishop's 'One Art.' The form originated in French poetry but became popular among English-language poets in the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Villanelle",
    "citationTitle": "Wikipedia: Villanelle"
  },
  {
    "id": "98d9d168-389d-49e9-8772-9d3f59298a6c",
    "text": "Which Russian poet, author of 'Eugene Onegin,' died in a duel at age 37 and is considered the founder of modern Russian literature?",
    "options": [
      "Mikhail Lermontov",
      "Alexander Pushkin",
      "Boris Pasternak",
      "Anna Akhmatova"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Alexander Pushkin wrote 'Eugene Onegin' and died in a duel in 1837, profoundly influencing Russian literature.",
    "detailedExplanation": "Alexander Pushkin (1799-1837) is widely regarded as the greatest Russian poet and the founder of modern Russian literature. His novel in verse 'Eugene Onegin' is considered his masterpiece and a cornerstone of Russian literature. Pushkin's life was cut tragically short when he died in a duel at age 37, fighting to defend his wife's honor. His influence on Russian literature cannot be overstated, and his works continue to be celebrated worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alexander_Pushkin",
    "citationTitle": "Wikipedia: Alexander Pushkin"
  },
  {
    "id": "af5dc0ad-80d4-42cd-9b4a-44558f7eab19",
    "text": "Which Confessional poet wrote 'Ariel' and 'The Bell Jar,' and was married to fellow poet Ted Hughes?",
    "options": [
      "Sylvia Plath",
      "Anne Sexton",
      "Adrienne Rich",
      "Sharon Olds"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Sylvia Plath wrote both the poetry collection 'Ariel' and the novel 'The Bell Jar,' and was married to Ted Hughes.",
    "detailedExplanation": "Sylvia Plath (1932-1963) was an American poet and novelist associated with the Confessional poetry movement. She wrote the poetry collection 'Ariel,' published posthumously in 1965, and the semi-autobiographical novel 'The Bell Jar' (1963). Plath was married to British poet Ted Hughes from 1956 until her death. Her intense, emotionally charged poetry and her tragic suicide at age 30 have made her one of the most studied and celebrated poets of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sylvia_Plath",
    "citationTitle": "Wikipedia: Sylvia Plath"
  },
  {
    "id": "1461a2d0-29cf-40b6-9edf-e4896c66a1ea",
    "text": "What is the name of the ancient Sanskrit epic poem attributed to Valmiki that tells the story of Rama's quest to rescue Sita?",
    "options": [
      "Mahabharata",
      "Ramayana",
      "Bhagavad Gita",
      "Puranas"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Ramayana, attributed to the sage Valmiki, narrates Prince Rama's journey to rescue his wife Sita from the demon king Ravana.",
    "detailedExplanation": "The Ramayana is one of the two great Sanskrit epics of ancient India, traditionally attributed to the sage Valmiki. Composed sometime between the 7th and 4th centuries BCE, it tells the story of Prince Rama's exile, his wife Sita's abduction by the demon king Ravana, and Rama's epic quest to rescue her with the help of the monkey god Hanuman and his army. The epic consists of approximately 24,000 verses divided into seven books and remains one of the most important works in Hindu literature and culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ramayana",
    "citationTitle": "Wikipedia: Ramayana"
  },
  {
    "id": "13ab7a0b-68a5-4a9b-ad37-e6c187a1f8bd",
    "text": "Which Romantic poet wrote 'Kubla Khan' after allegedly waking from an opium-induced dream and being interrupted by a 'person from Porlock'?",
    "options": [
      "Lord Byron",
      "Percy Shelley",
      "Samuel Taylor Coleridge",
      "John Keats"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Samuel Taylor Coleridge wrote 'Kubla Khan' after a vivid dream, though he claimed he was interrupted while writing it down.",
    "detailedExplanation": "Samuel Taylor Coleridge claimed he wrote 'Kubla Khan' in 1797 after waking from an opium-influenced dream in which he had composed a much longer poem. According to Coleridge's account, he was interrupted while writing down the poem by a visitor from the nearby town of Porlock, and when he returned to his writing, he could no longer remember the rest of the dream-poem. This famous interruption has become part of literary legend, though some scholars question the literal truth of Coleridge's account.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kubla_Khan",
    "citationTitle": "Wikipedia: Kubla Khan"
  },
  {
    "id": "bdd18fb4-bce7-46b5-a964-602fc67c22db",
    "text": "Which Japanese poetic form, traditionally containing 17 syllables in three lines, was mastered by poets like Bashō and Buson?",
    "options": [
      "Tanka",
      "Haiku",
      "Renga",
      "Kyōka"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Haiku is the traditional Japanese form with three lines and 17 syllables, perfected by masters like Matsuo Bashō.",
    "detailedExplanation": "Haiku is a traditional Japanese poetic form consisting of three lines with a 5-7-5 syllable pattern, though modern haiku often vary from this strict structure. The form developed from the opening stanza (hokku) of collaborative renga poetry and became independent in the 19th century. Matsuo Bashō (1644-1694) is considered the greatest master of haiku, along with later poets like Yosa Buson and Kobayashi Issa. Haiku traditionally captures a moment in nature and often includes a seasonal reference (kigo) and a cutting word (kireji).",
    "citationUrl": "https://en.wikipedia.org/wiki/Haiku",
    "citationTitle": "Wikipedia: Haiku"
  },
  {
    "id": "5abc10fc-a6cd-4569-8a6b-cea211ba4097",
    "text": "Which Harlem Renaissance poet wrote 'The Negro Speaks of Rivers' and asked 'What happens to a dream deferred?' in another famous poem?",
    "options": [
      "Claude McKay",
      "Countee Cullen",
      "Langston Hughes",
      "Jean Toomer"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Langston Hughes wrote both 'The Negro Speaks of Rivers' and 'Harlem' (which begins 'What happens to a dream deferred?').",
    "detailedExplanation": "Langston Hughes (1902-1967) was a central figure of the Harlem Renaissance and one of the most influential African American poets. He wrote 'The Negro Speaks of Rivers' when he was just 19 years old, and it became one of his most celebrated works. His poem 'Harlem' (also known as 'A Dream Deferred') opens with the famous line 'What happens to a dream deferred?' and explores the consequences of racial inequality. Hughes was known for incorporating jazz rhythms and vernacular speech into his poetry, making it accessible and musically rich.",
    "citationUrl": "https://en.wikipedia.org/wiki/Langston_Hughes",
    "citationTitle": "Wikipedia: Langston Hughes"
  }
]