[
  {
    "id": "c7261207-502b-4cde-9d39-22cb528ead3d",
    "text": "Which medieval European university, founded in 1088, is considered the oldest continuously operating university in the world?",
    "options": [
      "University of Paris",
      "University of Bologna",
      "University of Oxford",
      "University of Salamanca"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The University of Bologna was founded in 1088 and is recognized as the oldest continuously operating university in the world.",
    "detailedExplanation": "The University of Bologna was established in 1088 in Bologna, Italy, making it the oldest continuously operating university in the world. It was particularly famous for its law school and attracted students from across Europe. The university's founding marked the beginning of the medieval university system that would spread throughout Europe, with other famous institutions like the University of Paris (c. 1150) and Oxford (c. 1167) following later.",
    "citationUrl": "https://en.wikipedia.org/wiki/University_of_Bologna",
    "citationTitle": "Wikipedia: University of Bologna"
  },
  {
    "id": "f94c38c8-bd2c-4308-a333-a27071b5dd90",
    "text": "The devastating pandemic known as the Black Death reached its peak in Europe during which decade?",
    "options": [
      "1320s",
      "1340s",
      "1360s",
      "1380s"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Black Death reached its peak in Europe during the 1340s, killing an estimated one-third of the European population.",
    "detailedExplanation": "The Black Death, one of the most devastating pandemics in human history, swept through Europe in the mid-14th century, peaking in the 1340s. The plague, caused by the bacterium Yersinia pestis, arrived in Europe via trading ships from Asia in 1347 and spread rapidly across the continent. It killed an estimated 75-200 million people, representing 30-60% of Europe's population at the time, fundamentally altering European society, economy, and culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Black_Death",
    "citationTitle": "Wikipedia: Black Death"
  },
  {
    "id": "12244e2c-4fd5-4f3e-b590-4e66e6a85837",
    "text": "The Magna Carta, signed in 1215, limited the power of which English king?",
    "options": [
      "King Richard I",
      "King John",
      "King Henry II",
      "King Edward I"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "King John signed the Magna Carta in 1215 after being pressured by rebellious barons to limit his royal powers.",
    "detailedExplanation": "King John of England was forced to sign the Magna Carta at Runnymede on June 15, 1215, after a rebellion by his barons who were frustrated with his arbitrary rule, heavy taxation, and military failures. The document established the principle that even the king was subject to the law and included provisions for due process and protection from illegal imprisonment. Though John later repudiated it, the Magna Carta became a foundational document for constitutional law and individual rights.",
    "citationUrl": "https://en.wikipedia.org/wiki/Magna_Carta",
    "citationTitle": "Wikipedia: Magna Carta"
  },
  {
    "id": "f54928b4-8136-4322-8950-4a2ac5b8c0f7",
    "text": "Which medieval military order was founded to protect Christian pilgrims traveling to the Holy Land?",
    "options": [
      "Knights Hospitaller",
      "Knights Templar",
      "Teutonic Knights",
      "Knights of Santiago"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Knights Templar was founded around 1119 specifically to protect Christian pilgrims traveling to Jerusalem and the Holy Land.",
    "detailedExplanation": "The Poor Fellow-Soldiers of Christ and of the Temple of Solomon, commonly known as the Knights Templar, was founded around 1119 by French knight Hugues de Payens. Initially, their mission was to protect Christian pilgrims traveling to Jerusalem during the Crusades. The order grew enormously wealthy and powerful, developing an extensive network across Europe and the Middle East. They were eventually disbanded in 1312 by Pope Clement V under pressure from King Philip IV of France, who owed them substantial debts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Knights_Templar",
    "citationTitle": "Wikipedia: Knights Templar"
  },
  {
    "id": "1f252534-5082-4961-bdc1-b7f6b2b8caa3",
    "text": "The Hundred Years' War was primarily fought between England and which other European nation?",
    "options": [
      "Spain",
      "France",
      "Germany",
      "Italy"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Hundred Years' War (1337-1453) was fought primarily between England and France over territorial and dynastic claims.",
    "detailedExplanation": "The Hundred Years' War was a series of conflicts fought between England and France from 1337 to 1453, lasting 116 years. The war began over English claims to the French throne and territorial disputes over English-held lands in France. Famous battles included Crécy (1346), Poitiers (1356), and Agincourt (1415). The conflict saw the rise of notable figures like Joan of Arc and marked the transition from medieval to early modern warfare, with the increasing use of gunpowder weapons and the decline of heavy cavalry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hundred_Years%27_War",
    "citationTitle": "Wikipedia: Hundred Years' War"
  },
  {
    "id": "7a25dfd7-ea54-4ff6-bc7f-242990c7059c",
    "text": "Which powerful medieval trade association dominated commerce in Northern Europe and the Baltic Sea region?",
    "options": [
      "Venetian Republic",
      "Hanseatic League",
      "Flemish Guild",
      "Lombard League"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Hanseatic League was a powerful medieval trade confederation that dominated commerce in Northern Europe and the Baltic Sea from the 13th to 17th centuries.",
    "detailedExplanation": "The Hanseatic League was a commercial and defensive confederation of merchant guilds and market towns that dominated trade along the coast of Northern Europe from the 13th to the 17th century. At its peak, the League included over 200 cities, with major centers including Lübeck, Hamburg, Bergen, and Novgorod. The League controlled trade in goods like timber, furs, amber, dried fish, and grain, and had its own legal system and naval forces. It played a crucial role in the economic development of medieval Northern Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hanseatic_League",
    "citationTitle": "Wikipedia: Hanseatic League"
  },
  {
    "id": "0231d8aa-47d5-4d76-87ac-15b1e5ab6e6e",
    "text": "The medieval farming system where peasants worked strips of land in exchange for protection was known as what?",
    "options": [
      "Mercantilism",
      "Feudalism",
      "Monasticism",
      "Scholasticism"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Feudalism was the medieval system where peasants worked land in exchange for protection from lords, creating a hierarchical social structure.",
    "detailedExplanation": "Feudalism was the dominant social and economic system in medieval Europe, characterized by a hierarchy of personal relationships based on land tenure. Under this system, peasants (serfs) worked strips of land belonging to a lord in exchange for protection and the right to farm small plots for their own subsistence. Lords, in turn, owed military service to higher nobles or the king. This system provided stability and security during a time of frequent warfare, but also created rigid social stratification that limited social mobility for the vast majority of the population.",
    "citationUrl": "https://en.wikipedia.org/wiki/Feudalism",
    "citationTitle": "Wikipedia: Feudalism"
  },
  {
    "id": "680987e7-37a3-41a6-8d60-c98f15eb1a23",
    "text": "Which medieval king was known as 'The Lionheart' and led the Third Crusade?",
    "options": [
      "Henry II",
      "Richard I",
      "John I",
      "Edward I"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Richard I of England (1157-1199) was nicknamed 'The Lionheart' for his role as a leader of the Third Crusade.",
    "detailedExplanation": "Richard I, known as Richard the Lionheart, was King of England from 1189 until his death in 1199. He earned his nickname through his reputation as a great military leader and warrior during the Third Crusade (1189-1192). Despite being King of England, Richard spent very little time in his kingdom, preferring to focus on his crusading activities in the Holy Land where he fought against Saladin.",
    "citationUrl": "https://en.wikipedia.org/wiki/Richard_I_of_England",
    "citationTitle": "Wikipedia: Richard I of England"
  },
  {
    "id": "9c7e0c4c-0218-48eb-a7f7-b54609505fda",
    "text": "What was the primary purpose of medieval guilds?",
    "options": [
      "Military defense",
      "Religious worship",
      "Regulating trades and crafts",
      "Tax collection"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Medieval guilds were associations that regulated trades, crafts, and commerce, controlling quality, prices, and membership in various professions.",
    "detailedExplanation": "Medieval guilds were powerful associations of craftsmen or merchants that emerged in European towns during the High Middle Ages. They served multiple functions including regulating trade practices, maintaining quality standards, controlling prices, training apprentices, and providing social support for members. Guilds essentially controlled entire industries within towns, from blacksmithing and weaving to baking and carpentry, ensuring fair competition and protecting the interests of their members.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guild",
    "citationTitle": "Wikipedia: Guild"
  },
  {
    "id": "3aba829f-5a9b-42bc-a4b5-3dbf909a775b",
    "text": "In which year did the Norman Conquest of England take place?",
    "options": [
      "1066",
      "1054",
      "1072",
      "1086"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Norman Conquest occurred in 1066 when William the Conqueror defeated King Harold II at the Battle of Hastings.",
    "detailedExplanation": "The Norman Conquest of England took place in 1066, beginning with William of Normandy's invasion and culminating in his victory over the Anglo-Saxon King Harold Godwinson at the Battle of Hastings on October 14, 1066. This event fundamentally transformed English society, bringing Norman-French culture, language, and administrative practices to England. William claimed the English throne based on his assertion that Edward the Confessor had promised it to him and that Harold had sworn to support his claim.",
    "citationUrl": "https://en.wikipedia.org/wiki/Norman_Conquest",
    "citationTitle": "Wikipedia: Norman Conquest"
  },
  {
    "id": "7f315ebc-cf3e-4a54-8bae-7da881e24df9",
    "text": "What was the Black Death that devastated Europe in the 14th century?",
    "options": [
      "A series of wars",
      "A bubonic plague pandemic",
      "A volcanic winter",
      "A religious persecution"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Black Death was a devastating bubonic plague pandemic that swept through Europe from 1347-1351, killing an estimated one-third of the population.",
    "detailedExplanation": "The Black Death was one of the most devastating pandemics in human history, caused primarily by the bacterium Yersinia pestis, which causes bubonic plague. It arrived in Europe in 1347 through trade routes and spread rapidly, killing an estimated 75-200 million people, or 30-60% of Europe's population. The pandemic had profound social, economic, and cultural effects, leading to labor shortages, religious upheaval, and significant changes in European society. It fundamentally altered the feudal system and contributed to the end of the Middle Ages.",
    "citationUrl": "https://en.wikipedia.org/wiki/Black_Death",
    "citationTitle": "Wikipedia: Black Death"
  },
  {
    "id": "797d7521-9369-4f0f-8a08-ed10764b6487",
    "text": "Which empire did Charlemagne establish when he was crowned emperor in 800 CE?",
    "options": [
      "Byzantine Empire",
      "Holy Roman Empire",
      "Carolingian Empire",
      "Frankish Empire"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Charlemagne established the Carolingian Empire, though it later became known as the Holy Roman Empire under his successors.",
    "detailedExplanation": "When Charlemagne was crowned Emperor by Pope Leo III on Christmas Day in 800 CE, he established what historians call the Carolingian Empire, named after the Carolingian dynasty. This empire covered much of Western and Central Europe, including present-day France, Germany, northern Italy, and parts of Eastern Europe. While Charlemagne's empire is sometimes referred to as the predecessor to the Holy Roman Empire, the Carolingian Empire was the specific term for his realm. The empire represented a revival of the Western Roman Empire and marked the beginning of a new phase in European political organization.",
    "citationUrl": "https://en.wikipedia.org/wiki/Carolingian_Empire",
    "citationTitle": "Wikipedia: Carolingian Empire"
  },
  {
    "id": "446c1e21-5160-4c1f-9b13-c41773db5d91",
    "text": "What was the main economic system that dominated medieval European society?",
    "options": [
      "Capitalism",
      "Mercantilism",
      "Feudalism",
      "Socialism"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Feudalism was the dominant economic and social system in medieval Europe, based on land ownership and personal obligations between lords and vassals.",
    "detailedExplanation": "Feudalism was the dominant socioeconomic system in medieval Europe, particularly from the 9th to 15th centuries. It was based on the holding of land in exchange for service or labor. The system created a hierarchy where kings granted land (fiefs) to nobles (vassals) in exchange for military service and loyalty. These nobles, in turn, granted portions of their land to lesser nobles or knights, and at the bottom were peasants or serfs who worked the land. This system provided security and organization during a time when central authority was often weak, but it also created rigid social stratification.",
    "citationUrl": "https://en.wikipedia.org/wiki/Feudalism",
    "citationTitle": "Wikipedia: Feudalism"
  },
  {
    "id": "b0ac35e6-7ca4-4590-9d78-ffe7638286f1",
    "text": "Which architectural style was dominant in European church building from roughly 1000-1200 CE?",
    "options": [
      "Gothic",
      "Romanesque",
      "Byzantine",
      "Renaissance"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Romanesque architecture dominated European church building from approximately 1000-1200 CE, characterized by thick walls, round arches, and sturdy construction.",
    "detailedExplanation": "Romanesque architecture was the dominant architectural style in Europe from roughly 1000 to 1200 CE, preceding the Gothic style. Romanesque buildings, particularly churches and monasteries, were characterized by thick stone walls, round arches, sturdy pillars, barrel vaults, large towers, and decorative arcading. The style emphasized solidity and strength, reflecting both practical needs for defense and spiritual symbolism. Famous examples include the Abbey Church of Sainte-Foy in France and Durham Cathedral in England. The style gradually evolved into Gothic architecture, which introduced pointed arches, flying buttresses, and larger windows.",
    "citationUrl": "https://en.wikipedia.org/wiki/Romanesque_architecture",
    "citationTitle": "Wikipedia: Romanesque architecture"
  },
  {
    "id": "3519482d-e6e3-469b-be13-9f6eac10230c",
    "text": "What was the primary language of scholarship and the Church throughout medieval Europe?",
    "options": [
      "French",
      "German",
      "Latin",
      "Greek"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Latin was the universal language of scholarship, administration, and the Catholic Church throughout medieval Europe.",
    "detailedExplanation": "Throughout the medieval period, Latin served as the lingua franca of educated Europe. It was the language of the Catholic Church, universities, scholarly works, official documents, and international diplomacy. While vernacular languages were spoken by common people in their daily lives, anyone seeking education or advancement in the Church, government, or academia needed to master Latin. This created a unified intellectual culture across Europe, allowing scholars from different regions to communicate and share knowledge. Latin's dominance began to decline in the later medieval period as vernacular languages gained prestige in literature and administration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Medieval_Latin",
    "citationTitle": "Wikipedia: Medieval Latin"
  },
  {
    "id": "976281c8-3292-414a-b98f-efac976c0323",
    "text": "Which medieval European city was known as the 'Queen of the Adriatic' and became enormously wealthy through maritime trade?",
    "options": [
      "Genoa",
      "Venice",
      "Pisa",
      "Amalfi"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Venice was called the 'Queen of the Adriatic' and dominated Mediterranean trade for centuries.",
    "detailedExplanation": "Venice earned the title 'Queen of the Adriatic' through its strategic position and maritime dominance from roughly the 9th to 15th centuries. Built on a lagoon, Venice became one of Europe's wealthiest cities by controlling trade routes between Europe and the Byzantine Empire, as well as with Asia via the Silk Road. The city's unique political system, powerful navy, and merchant families like the Medicis made it a major medieval power.",
    "citationUrl": "https://en.wikipedia.org/wiki/Republic_of_Venice",
    "citationTitle": "Wikipedia: Republic of Venice"
  },
  {
    "id": "6a0fe9a8-f1a9-4afd-853c-a7ba1ac9656e",
    "text": "The medieval agricultural system known as the 'three-field system' was an improvement over earlier methods because it:",
    "options": [
      "Used only the best quality soil",
      "Left one-third of land fallow each year",
      "Required fewer farm animals",
      "Eliminated the need for fertilizer"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The three-field system rotated crops across three fields, leaving one fallow each year to restore soil fertility.",
    "detailedExplanation": "The three-field system was a major agricultural innovation that emerged in medieval Europe around the 8th century. It divided farmland into three sections: one planted with winter crops (like wheat), one with spring crops (like oats or barley), and one left fallow to recover. This rotation system increased agricultural productivity compared to the earlier two-field system, as it allowed two-thirds rather than half of the land to be productive each year, while still maintaining soil fertility through the fallow period.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three-field_system",
    "citationTitle": "Wikipedia: Three-field system"
  },
  {
    "id": "7dcb5fc4-aea6-4840-a38f-f854726dca65",
    "text": "The medieval European university system first emerged in which century?",
    "options": [
      "9th century",
      "10th century",
      "11th century",
      "12th century"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The first European universities were established in the 11th century, beginning with the University of Bologna.",
    "detailedExplanation": "The medieval university system began in the 11th century with institutions like the University of Bologna (founded around 1088), followed by the University of Paris and University of Oxford in the 12th century. These institutions evolved from cathedral schools and monastic schools, representing a formalization of higher learning. They typically focused on the liberal arts, theology, law, and medicine, and established the foundation for the modern university system including degrees, curricula, and academic governance structures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Medieval_university",
    "citationTitle": "Wikipedia: Medieval university"
  },
  {
    "id": "ccca5ed7-7167-4a56-94cc-ee1b454187f8",
    "text": "The devastating plague that swept through Europe in the 14th century, killing an estimated one-third of the population, was commonly known as:",
    "options": [
      "The Great Mortality",
      "The Black Death",
      "The Sweating Sickness",
      "The Dancing Plague"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "The Black Death (1347-1351) was the most devastating pandemic in European history, killing 30-60% of the population.",
    "detailedExplanation": "The Black Death was a bubonic plague pandemic that ravaged Europe from 1347 to 1351, caused by the bacterium Yersinia pestis. Originating in Central Asia, it spread along trade routes and arrived in Europe via merchant ships. The plague got its name from the dark swellings (buboes) that appeared on victims' bodies. It fundamentally changed European society, leading to labor shortages, economic upheaval, religious questioning, and social unrest, while also contributing to the decline of feudalism and the rise of a money-based economy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Black_Death",
    "citationTitle": "Wikipedia: Black Death"
  },
  {
    "id": "ef98563e-4bff-4ac6-83cf-19f430049611",
    "text": "Which medieval European king was known as 'The Lionheart' and died in 1199 from a crossbow wound while besieging a castle in France?",
    "options": [
      "Richard I of England",
      "Edward I of England",
      "Philip II of France",
      "Frederick Barbarossa"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Richard I of England, known as 'The Lionheart', died in 1199 from a crossbow wound at the siege of Châlus.",
    "detailedExplanation": "Richard I of England (1157-1199), famously known as 'The Lionheart' or 'Coeur de Lion', was one of the most renowned crusader kings of medieval Europe. Despite being King of England, he spent most of his reign in the Holy Land during the Third Crusade and in defending his French territories. His death came during the siege of Châlus-Chabrol castle in the Limousin region of France, where he was struck by a crossbow bolt fired from the castle walls. The wound became infected, leading to his death on April 6, 1199, at the age of 41.",
    "citationUrl": "https://en.wikipedia.org/wiki/Richard_I_of_England",
    "citationTitle": "Wikipedia: Richard I of England"
  }
]