[
  {
    "id": "f028aea0-6e28-4784-b237-f48d3b603768",
    "text": "Which rock and roll legend is known as 'The King of Rock and Roll'?",
    "options": [
      "Elvis Presley",
      "Chuck Berry",
      "Little Richard",
      "Jerry Lee Lewis"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Elvis Presley earned the title 'The King of Rock and Roll' through his massive popularity and influence on the genre.",
    "detailedExplanation": "Elvis Presley became known as 'The King of Rock and Roll' due to his revolutionary impact on popular music in the 1950s. His unique blend of country, rhythm and blues, and pop, combined with his charismatic stage presence and good looks, made him a global phenomenon. He helped bring rock and roll into the mainstream and influenced countless musicians who followed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elvis_Presley",
    "citationTitle": "Wikipedia: Elvis Presley"
  },
  {
    "id": "97a1a73c-ac0f-4f82-b5e0-d9da32ded7cf",
    "text": "What was the name of The Beatles' final studio album?",
    "options": [
      "Let It Be",
      "Abbey Road",
      "The White Album",
      "Revolver"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Abbey Road was The Beatles' final recorded studio album, though Let It Be was released later.",
    "detailedExplanation": "Abbey Road, released in 1969, was the last album The Beatles recorded together as a group, though Let It Be was actually released after it in 1970. The album is famous for its iconic cover showing the four band members crossing Abbey Road in London, and contains classic songs like 'Come Together' and 'Here Comes the Sun.' It represented the band's final collaborative effort before their breakup.",
    "citationUrl": "https://en.wikipedia.org/wiki/Abbey_Road",
    "citationTitle": "Wikipedia: Abbey Road"
  },
  {
    "id": "835825cd-3884-4db7-b595-ed0b164d6773",
    "text": "Which guitarist is famous for playing with his teeth and setting his guitar on fire?",
    "options": [
      "Eric Clapton",
      "Jimi Hendrix",
      "Jimmy Page",
      "Keith Richards"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jimi Hendrix was renowned for his theatrical performances, including playing guitar with his teeth and burning his instruments on stage.",
    "detailedExplanation": "Jimi Hendrix revolutionized rock guitar playing not only through his innovative musical techniques but also his spectacular stage performances. He was famous for playing his guitar behind his head, with his teeth, and most memorably, setting his Fender Stratocaster on fire at the Monterey Pop Festival in 1967. These theatrical elements, combined with his extraordinary musical talent, made him one of the most influential guitarists in rock history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jimi_Hendrix",
    "citationTitle": "Wikipedia: Jimi Hendrix"
  },
  {
    "id": "e5abe1c8-2915-4022-a012-893ef1c3d46d",
    "text": "What was the original name of the band that became Queen?",
    "options": [
      "The Reaction",
      "Smile",
      "The Opposition",
      "Wreckage"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Queen evolved from the band Smile, which featured Brian May and Roger Taylor before Freddie Mercury joined.",
    "detailedExplanation": "Before becoming Queen, Brian May and Roger Taylor were in a band called Smile with vocalist Tim Staffell. When Staffell left the band in 1970, Freddie Mercury (then known as Farrokh Bulsara) joined May and Taylor, and they recruited bassist John Deacon. Mercury suggested the name 'Queen' for the new lineup, and the rest is rock history. The transformation from Smile to Queen marked the beginning of one of rock's most successful and theatrical bands.",
    "citationUrl": "https://en.wikipedia.org/wiki/Queen_(band)",
    "citationTitle": "Wikipedia: Queen (band)"
  },
  {
    "id": "15523b68-60dd-4477-a354-f3da3789af4b",
    "text": "Which Rolling Stones song contains the famous lyric 'I can't get no satisfaction'?",
    "options": [
      "Paint It Black",
      "(I Can't Get No) Satisfaction",
      "Start Me Up",
      "Jumpin' Jack Flash"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The song is literally titled '(I Can't Get No) Satisfaction' and became one of The Rolling Stones' biggest hits.",
    "detailedExplanation": "'(I Can't Get No) Satisfaction' was released in 1965 and became The Rolling Stones' first number-one hit in the United States. Written by Mick Jagger and Keith Richards, the song features one of the most recognizable guitar riffs in rock history. The distinctive fuzz-toned riff came to Keith Richards in a dream, and he recorded it on his bedside tape recorder. The song's themes of frustration and rebellion perfectly captured the spirit of the 1960s counterculture movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/(I_Can%27t_Get_No)_Satisfaction",
    "citationTitle": "Wikipedia: (I Can't Get No) Satisfaction"
  },
  {
    "id": "ddc32a9b-d5e9-4215-b737-a2d470d4098e",
    "text": "What was the name of Led Zeppelin's untitled fourth album, commonly known by fans?",
    "options": [
      "Black Dog",
      "Stairway to Heaven",
      "Led Zeppelin IV",
      "Runes"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Though officially untitled, the album is commonly referred to as 'Led Zeppelin IV' and features four mysterious symbols.",
    "detailedExplanation": "Led Zeppelin's fourth studio album, released in 1971, was officially untitled but is commonly known as 'Led Zeppelin IV' or sometimes 'Four Symbols' due to the four mysterious symbols on the cover representing each band member. The album contains some of the band's most famous songs, including 'Stairway to Heaven,' 'Black Dog,' and 'Rock and Roll.' It became one of the best-selling albums of all time and is often considered the band's masterpiece, showcasing their range from heavy rock to folk influences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Led_Zeppelin_IV",
    "citationTitle": "Wikipedia: Led Zeppelin IV"
  },
  {
    "id": "5dd509ce-c6a7-4c94-afc7-3c8bae37abee",
    "text": "Which rock legend died in a plane crash in 1959, an event known as 'The Day the Music Died'?",
    "options": [
      "Eddie Cochran",
      "Buddy Holly",
      "Ritchie Valens",
      "Both B and C"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Both Buddy Holly and Ritchie Valens died in the same plane crash on February 3, 1959, along with J.P. Richardson (The Big Bopper).",
    "detailedExplanation": "On February 3, 1959, a small aircraft crashed near Clear Lake, Iowa, killing rock and roll pioneers Buddy Holly, Ritchie Valens, and J.P. 'The Big Bopper' Richardson. This tragic event became known as 'The Day the Music Died' after being immortalized in Don McLean's 1971 song 'American Pie.' The crash occurred during a winter tour, and the musicians had chartered the plane to avoid a long, cold bus ride to their next venue. This event marked a significant moment in rock and roll history, cutting short the careers of three promising young artists.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Day_the_Music_Died",
    "citationTitle": "Wikipedia: The Day the Music Died"
  },
  {
    "id": "fa82428b-da99-4577-8032-4c4db33a6d69",
    "text": "What was the name of Bob Dylan's backing band during his famous 1965-1966 electric tours?",
    "options": [
      "The Band",
      "The Hawks",
      "The Electric Flag",
      "The Basement Band"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Hawks, later known simply as The Band, backed Dylan during his controversial transition to electric music.",
    "detailedExplanation": "The Hawks were a Canadian-American rock group led by Ronnie Hawkins that became Bob Dylan's backing band during his controversial electric period in 1965-1966. When Dylan 'went electric' at the Newport Folk Festival in 1965, many folk purists felt betrayed, and the Hawks supported him through the resulting backlash during world tours where audiences often booed. The group later became famous in their own right as simply 'The Band,' recording influential albums like 'Music from Big Pink' and 'The Band.' Their collaboration with Dylan was crucial in bridging folk and rock music.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Band",
    "citationTitle": "Wikipedia: The Band"
  },
  {
    "id": "9ef328f9-23a8-4dfd-8f66-716c5accd5f0",
    "text": "Which rock and roll pioneer recorded 'Johnny B. Goode' in 1958?",
    "options": [
      "Chuck Berry",
      "Little Richard",
      "Jerry Lee Lewis",
      "Buddy Holly"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Chuck Berry recorded 'Johnny B. Goode' in 1958, which became one of his most famous songs.",
    "detailedExplanation": "Chuck Berry wrote and recorded 'Johnny B. Goode' in 1958, and it became one of the most recognizable rock and roll songs of all time. The song showcased Berry's distinctive guitar style and storytelling ability, helping to establish many of the conventions of rock and roll music. It was selected for preservation in the National Recording Registry and was even included on the Voyager Golden Record sent into space.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johnny_B._Goode",
    "citationTitle": "Wikipedia: Johnny B. Goode"
  },
  {
    "id": "94d8b42c-c008-4244-a88a-62cf26585304",
    "text": "What was the name of Elvis Presley's manager who guided his career?",
    "options": [
      "Colonel Tom Parker",
      "Sam Phillips",
      "Scotty Moore",
      "Bill Black"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Colonel Tom Parker was Elvis Presley's manager from 1955 until Elvis's death in 1977.",
    "detailedExplanation": "Colonel Tom Parker, born Andreas Cornelis van Kuijk, became Elvis Presley's manager in 1955 and remained in that role throughout Elvis's career until his death in 1977. Parker was instrumental in negotiating Elvis's recording contracts, movie deals, and concert arrangements, though his management style was sometimes controversial. Despite his title, Parker was not actually a colonel in the military but received the honorary title from Louisiana governor Jimmie Davis.",
    "citationUrl": "https://en.wikipedia.org/wiki/Colonel_Tom_Parker",
    "citationTitle": "Wikipedia: Colonel Tom Parker"
  },
  {
    "id": "20786aac-b654-460c-939e-9996eb559d7e",
    "text": "Which city is considered the birthplace of Motown Records?",
    "options": [
      "Detroit",
      "Chicago",
      "Memphis",
      "Nashville"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Motown Records was founded in Detroit, Michigan by Berry Gordy Jr. in 1959.",
    "detailedExplanation": "Motown Records was founded in Detroit, Michigan in 1959 by Berry Gordy Jr. The label got its name from Detroit's nickname 'Motor City,' combining 'motor' and 'town.' Motown became one of the most successful record labels in history, launching the careers of legendary artists like The Supremes, The Temptations, Marvin Gaye, Stevie Wonder, and The Jackson 5. The distinctive 'Motown Sound' helped break down racial barriers in popular music during the 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Motown",
    "citationTitle": "Wikipedia: Motown"
  },
  {
    "id": "60fdab91-4c6a-44c3-981e-f6d8ddc4bb78",
    "text": "What instrument did Jerry Lee Lewis famously play while performing?",
    "options": [
      "Piano",
      "Guitar",
      "Saxophone",
      "Drums"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jerry Lee Lewis was known as 'The Killer' and was famous for his energetic piano performances.",
    "detailedExplanation": "Jerry Lee Lewis was renowned for his wild, energetic piano playing style that often included standing on the piano bench, playing with his feet, and even setting the piano on fire during performances. Known as 'The Killer,' Lewis was one of the pioneering figures of rock and roll, with hits like 'Great Balls of Fire' and 'Whole Lotta Shakin' Goin' On.' His flamboyant stage presence and piano virtuosity made him one of the most exciting live performers of the early rock and roll era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jerry_Lee_Lewis",
    "citationTitle": "Wikipedia: Jerry Lee Lewis"
  },
  {
    "id": "4dd5c6bd-8c46-4026-b827-68de00e57034",
    "text": "Which member of The Doors was known as the lead vocalist and primary lyricist?",
    "options": [
      "Jim Morrison",
      "Ray Manzarek",
      "Robby Krieger",
      "John Densmore"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jim Morrison was the charismatic lead singer and main songwriter for The Doors.",
    "detailedExplanation": "Jim Morrison served as the lead vocalist and primary lyricist for The Doors from their formation in 1965 until his death in 1971. Known for his deep, distinctive voice and poetic lyrics, Morrison became an iconic figure of the 1960s counterculture movement. His theatrical stage presence and controversial performances made The Doors one of the most influential bands of the era, with classics like 'Light My Fire,' 'Break on Through,' and 'Riders on the Storm.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Jim_Morrison",
    "citationTitle": "Wikipedia: Jim Morrison"
  },
  {
    "id": "4c567b8b-1b7d-4161-9e78-7c7c2403365f",
    "text": "What was the name of David Bowie's flamboyant alter ego from the early 1970s?",
    "options": [
      "Ziggy Stardust",
      "The Thin White Duke",
      "Aladdin Sane",
      "Diamond Dogs"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Ziggy Stardust was David Bowie's most famous persona, introduced in 1972.",
    "detailedExplanation": "Ziggy Stardust was David Bowie's most iconic alter ego, introduced with the 1972 album 'The Rise and Fall of Ziggy Stardust and the Spiders from Mars.' This flamboyant, androgynous rock star character helped define the glam rock movement and showcased Bowie's theatrical approach to performance. The Ziggy persona featured elaborate costumes, makeup, and staging, and songs like 'Starman' and 'Suffragette City' became classics of the era. Bowie famously 'killed off' the character during a concert in 1973.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rise_and_Fall_of_Ziggy_Stardust_and_the_Spiders_from_Mars",
    "citationTitle": "Wikipedia: The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },
  {
    "id": "75d4c711-6b2e-4f4e-886e-c4aae117939d",
    "text": "Which rock legend founded the record label Sun Records in Memphis?",
    "options": [
      "Sam Phillips",
      "Leonard Chess",
      "Ahmet Ertegun",
      "Berry Gordy Jr."
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sam Phillips founded Sun Records in 1952, which launched the careers of Elvis Presley, Johnny Cash, and others.",
    "detailedExplanation": "Sam Phillips founded Sun Records in Memphis, Tennessee in 1952, and it became one of the most important independent record labels in rock and roll history. Sun Records was where Elvis Presley made his first recordings in 1954, and Phillips also discovered and recorded other legendary artists including Johnny Cash, Jerry Lee Lewis, Carl Perkins, and Roy Orbison. The label's distinctive sound, often called the 'Sun Sound,' helped define early rock and roll and rockabilly music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sun_Records",
    "citationTitle": "Wikipedia: Sun Records"
  },
  {
    "id": "ebfab75c-f8b6-4f26-9d2a-9f2199a8c85c",
    "text": "What was the nickname given to the group of musicians who frequently backed Bob Dylan in the 1970s and 1980s?",
    "options": [
      "The Heartbreakers",
      "The E Street Band",
      "The Silver Bullet Band",
      "The Traveling Wilburys"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Heartbreakers, led by Tom Petty, frequently served as Bob Dylan's backing band during tours in the 1980s.",
    "detailedExplanation": "Tom Petty and the Heartbreakers served as Bob Dylan's backing band during several major tours in the 1980s, most notably the successful 1986 'True Confessions' tour with Dylan and the Heartbreakers co-headlining. This collaboration was so successful that it led to the formation of the supergroup The Traveling Wilburys in 1988, which included Dylan, Petty, George Harrison, Jeff Lynne, and Roy Orbison. The partnership helped revitalize Dylan's live performances during this period.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tom_Petty_and_the_Heartbreakers",
    "citationTitle": "Wikipedia: Tom Petty and the Heartbreakers"
  },
  {
    "id": "19ee2a83-80f3-4cd7-9d75-0377ccebd0a3",
    "text": "Which rock and roll legend was known by the nickname 'The Killer' and was famous for his wild piano performances?",
    "options": [
      "Jerry Lee Lewis",
      "Little Richard",
      "Fats Domino",
      "Ray Charles"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jerry Lee Lewis was nicknamed 'The Killer' for his aggressive piano style and wild stage performances.",
    "detailedExplanation": "Jerry Lee Lewis earned the nickname 'The Killer' due to his explosive and aggressive piano playing style, combined with his wild stage antics that included kicking his piano bench away and playing standing up. Born in 1935 in Louisiana, Lewis became one of the pioneers of rock and roll in the 1950s with hits like 'Great Balls of Fire' and 'Whole Lotta Shakin' Goin' On.' His performances were characterized by his blonde hair flying as he pounded the keys with incredible energy and showmanship.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jerry_Lee_Lewis",
    "citationTitle": "Wikipedia: Jerry Lee Lewis"
  },
  {
    "id": "cb8245bf-b002-4a06-8004-822541b8195a",
    "text": "What was the name of Janis Joplin's final band before her death in 1970?",
    "options": [
      "Big Brother and the Holding Company",
      "Full Tilt Boogie Band",
      "Kozmic Blues Band",
      "The Grateful Dead"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Janis Joplin's final band was the Full Tilt Boogie Band, formed in 1970 shortly before her death.",
    "detailedExplanation": "The Full Tilt Boogie Band was formed by Janis Joplin in May 1970, just months before her tragic death in October of that year. The band included John Till on guitar, Richard Bell on piano, Brad Campbell on bass, and Clark Pierson on drums. They recorded what would become Joplin's posthumously released album 'Pearl,' which included her biggest hit 'Me and Bobby McGee.' This was her third major musical project, following her time with Big Brother and the Holding Company and the Kozmic Blues Band.",
    "citationUrl": "https://en.wikipedia.org/wiki/Janis_Joplin",
    "citationTitle": "Wikipedia: Janis Joplin"
  },
  {
    "id": "a2560aa2-2d74-4a63-84fd-99e0acea95a5",
    "text": "Which rock legend was inducted into the Rock and Roll Hall of Fame three separate times?",
    "options": [
      "Paul McCartney",
      "Eric Clapton",
      "Neil Young",
      "Stevie Nicks"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Eric Clapton was inducted three times: as a solo artist, with The Yardbirds, and with Cream.",
    "detailedExplanation": "Eric Clapton holds the unique distinction of being inducted into the Rock and Roll Hall of Fame three separate times, reflecting his impact across multiple phases of rock history. He was first inducted in 1992 as a member of The Yardbirds, then again in 1993 as part of the power trio Cream alongside Jack Bruce and Ginger Baker, and finally in 2000 as a solo artist. This triple induction recognizes his contributions as one of the most influential guitarists in rock history, spanning his work from the British Invasion era through blues rock and his successful solo career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eric_Clapton",
    "citationTitle": "Wikipedia: Eric Clapton"
  },
  {
    "id": "1ac565d1-8983-4678-8422-b6828e04e175",
    "text": "What was the name of the famous music festival where Jimi Hendrix performed his iconic rendition of 'The Star-Spangled Banner'?",
    "options": [
      "Monterey Pop Festival",
      "Woodstock",
      "Isle of Wight Festival",
      "Atlanta International Pop Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jimi Hendrix performed his legendary version of the national anthem at Woodstock in 1969.",
    "detailedExplanation": "Jimi Hendrix's electrifying and controversial performance of 'The Star-Spangled Banner' took place at the Woodstock Music & Art Fair on August 18, 1969. His psychedelic rock interpretation of the national anthem, complete with feedback and distortion effects that mimicked the sounds of war, became one of the most iconic moments in rock history. The performance occurred during the early morning hours as the festival was winding down, and it was captured on film, becoming a defining symbol of the counterculture movement and anti-war sentiment of the 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jimi_Hendrix",
    "citationTitle": "Wikipedia: Jimi Hendrix"
  }
]