[
  {
    "id": "050c7cb3-3108-4434-981c-466b8411040d",
    "text": "Which rock legend was born Vincent Eugene Craddock and later became famous for his theatrical performances and black leather stage attire?",
    "options": [
      "Gene Vincent",
      "Eddie Cochran",
      "Buddy Holly",
      "Jerry Lee Lewis"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Gene Vincent was born Vincent Eugene Craddock in 1935.",
    "detailedExplanation": "Gene Vincent, born Vincent Eugene Craddock in Norfolk, Virginia in 1935, became one of the pioneering figures of rockabilly and early rock and roll. Known for his distinctive black leather stage attire and dramatic performances, Vincent recorded the classic 'Be-Bop-A-Lula' in 1956. His theatrical style and rebellious image helped establish the template for rock star persona that would influence countless musicians. Despite a leg injury from a motorcycle accident that caused him to perform with a limp, Vincent continued touring extensively, particularly finding success in the UK where he was revered by British rock musicians.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gene_Vincent",
    "citationTitle": "Wikipedia: Gene Vincent"
  },
  {
    "id": "935d85ed-45d1-4787-ba25-e4f678522e17",
    "text": "What was the name of the backing band that played with Buddy Holly after he split from The Crickets?",
    "options": [
      "The Comets",
      "The Blue Caps",
      "The Fireballs",
      "The Picks"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Fireballs became Buddy Holly's backing band after his split from The Crickets.",
    "detailedExplanation": "After Buddy Holly's acrimonious split from The Crickets in late 1958, he began working with The Fireballs, an instrumental rock band from New Mexico. The Fireballs had already established themselves as skilled musicians with their own hit instrumental 'Torquay.' Holly was planning to record with them and had begun incorporating them as his live backing band. Tragically, this collaboration was cut short when Holly died in the plane crash on February 3, 1959. The Fireballs later went on to have success in the 1960s, including backing other artists and scoring hits like 'Sugar Shack' with Jimmy Gilmer.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Fireballs",
    "citationTitle": "Wikipedia: The Fireballs"
  },
  {
    "id": "a1ece42d-66e1-45a1-a37f-696b85cfac7a",
    "text": "Which Chuck Berry song was specifically written about his experience being detained at the US-Mexico border?",
    "options": [
      "Nadine",
      "No Particular Place to Go",
      "Promised Land",
      "Havana Moon"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Promised Land' was inspired by Chuck Berry's experience being detained while trying to cross the US-Mexico border.",
    "detailedExplanation": "Chuck Berry wrote 'Promised Land' in 1964 while serving time in federal prison, but the song was inspired by an earlier experience when he was detained at the US-Mexico border while trying to bring a young woman across for his club. The song tells the story of a journey from Norfolk, Virginia to the 'promised land' of California, mapping out a specific route across America. The biblical reference to the 'promised land' combined with Berry's personal experience of restriction and the desire for freedom created one of his most enduring compositions. The song later became a major hit for Elvis Presley in 1975.",
    "citationUrl": "https://en.wikipedia.org/wiki/Promised_Land_(song)",
    "citationTitle": "Wikipedia: Promised Land (song)"
  },
  {
    "id": "f77352b1-7de0-42fc-a70c-ad53db3d80f5",
    "text": "What was the original name of the song that became Little Richard's breakthrough hit 'Tutti Frutti'?",
    "options": [
      "Good Golly",
      "Wop Bop",
      "Tutti Frutti, Good Booty",
      "Long Tall Sally"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The original version was called 'Tutti Frutti, Good Booty' with much more explicit lyrics.",
    "detailedExplanation": "Little Richard's breakthrough hit 'Tutti Frutti' began life as a much more risqué song called 'Tutti Frutti, Good Booty.' The original version contained sexually explicit lyrics that Richard would perform in clubs, but when he got the chance to record for Specialty Records in 1955, songwriter Dorothy LaBostrie was brought in to clean up the lyrics for radio play. The famous 'A-wop-bop-a-loo-bop-a-lop-bam-boom' opening remained, but the explicit sexual content was replaced with more radio-friendly lyrics about a girl named Sue. This sanitized version became the song that launched Richard's career and helped establish the sound of rock and roll.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tutti_Frutti_(song)",
    "citationTitle": "Wikipedia: Tutti Frutti (song)"
  },
  {
    "id": "255a46f6-6177-4a15-9617-14fbb46e6550",
    "text": "Which member of The Big Bopper's family became a successful country music artist decades after the 1959 plane crash?",
    "options": [
      "His son Jay P. Richardson",
      "His brother Tommy Richardson",
      "His nephew Bobby Richardson",
      "His cousin Danny Richardson"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Jay P. 'The Big Bopper' Richardson Jr., son of the original Big Bopper, became a country music performer.",
    "detailedExplanation": "Jay P. Richardson Jr., son of J.P. 'The Big Bopper' Richardson who died in the 1959 plane crash, followed in his father's musical footsteps decades later. Born just months after his father's death, Jay P. Jr. grew up never knowing his famous father but eventually embraced his musical heritage. He became a country music performer and also worked to preserve his father's legacy, including having his father's body exhumed in 2007 to finally determine the exact cause of death. Jay P. Jr. has performed his father's hits and written songs about the tragedy, helping to keep The Big Bopper's memory alive for new generations.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Big_Bopper",
    "citationTitle": "Wikipedia: The Big Bopper"
  },
  {
    "id": "db92d319-27f9-4f1c-88b4-6868cbc223be",
    "text": "Bo Diddley's distinctive rectangular guitar was inspired by which household item?",
    "options": [
      "A television set",
      "A cigar box",
      "A breadbox",
      "A radio"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bo Diddley's famous rectangular guitar design was inspired by a cigar box.",
    "detailedExplanation": "Bo Diddley's iconic rectangular guitar, which became as much his trademark as his distinctive rhythm, was inspired by the cigar boxes he used to make makeshift instruments as a child. Growing up poor in Mississippi and later Chicago, Diddley learned to be resourceful and created his first guitars from cigar boxes, violin necks, and other found materials. When he became successful, he had Gretsch build him custom rectangular guitars that maintained the basic shape of those early cigar box instruments. The unique shape not only gave him a distinctive visual identity but also contributed to his sound, as the rectangular body affected the guitar's resonance and tone.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bo_Diddley",
    "citationTitle": "Wikipedia: Bo Diddley"
  },
  {
    "id": "9dbc2219-4142-421b-9cdb-5fc00fe6ee57",
    "text": "What tragic event caused Eddie Cochran to write the song 'Three Stars' in 1959?",
    "options": [
      "His own car accident",
      "The death of Buddy Holly, The Big Bopper, and Ritchie Valens",
      "His military draft notice",
      "His breakup with Sharon Sheeley"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Three Stars' was Eddie Cochran's tribute to Buddy Holly, The Big Bopper, and Ritchie Valens after their deaths in the 1959 plane crash.",
    "detailedExplanation": "Eddie Cochran wrote and recorded 'Three Stars' as a heartfelt tribute to his fellow rock and roll pioneers Buddy Holly, J.P. 'The Big Bopper' Richardson, and Ritchie Valens after they died in the February 3, 1959 plane crash near Clear Lake, Iowa. The song was recorded just days after the tragedy and featured Cochran on vocals and guitar with minimal instrumentation, giving it a somber, respectful tone. Each verse honored one of the fallen musicians, with Cochran singing about how their music would live on. Tragically, Cochran himself would die in a car accident in England just over a year later, making 'Three Stars' a poignant reminder of the fragility of life during rock and roll's early years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three_Stars_(song)",
    "citationTitle": "Wikipedia: Three Stars (song)"
  },
  {
    "id": "1c0f9a65-3230-4510-be63-76fe16dce3f0",
    "text": "Which piano technique, famously used by Jerry Lee Lewis, involves striking the keys with the side of the hand?",
    "options": [
      "Glissando",
      "Tremolo",
      "Cluster bombing",
      "Hand roll"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Jerry Lee Lewis popularized the 'cluster bombing' technique of striking piano keys with the side of his hand.",
    "detailedExplanation": "Jerry Lee Lewis revolutionized rock and roll piano performance with his aggressive technique that included 'cluster bombing' - striking multiple keys simultaneously with the side of his hand or fist to create dramatic percussive effects. This technique, combined with his wild stage antics like playing with his feet, standing on the piano, and even setting it on fire, helped establish the template for rock showmanship. Lewis's percussive approach to the piano transformed it from a genteel parlor instrument into a powerful rock and roll weapon. His style influenced countless rock pianists and helped cement the piano's place in rock music alongside the guitar and drums as a lead instrument capable of driving a song's energy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jerry_Lee_Lewis",
    "citationTitle": "Wikipedia: Jerry Lee Lewis"
  },
  {
    "id": "04986d6a-8e81-4121-8571-44faec9cd2ee",
    "text": "What was the real name of the radio DJ who coined the term 'rock and roll' and was later destroyed by the payola scandal?",
    "options": [
      "Alan Freed",
      "Wolfman Jack",
      "Murray Kaufman",
      "George Woods"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Alan Freed coined the term 'rock and roll' and was destroyed by the payola scandal.",
    "detailedExplanation": "Alan Freed, born Albert James Freed, was a Cleveland radio DJ who popularized the term 'rock and roll' in the early 1950s. He organized some of the first rock concerts and was instrumental in breaking down racial barriers in music by playing both black and white artists. However, his career was destroyed in 1959-1960 when he was implicated in the payola scandal, where DJs accepted bribes to play certain records. He refused to sign a statement denying he had taken payola, effectively ending his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alan_Freed",
    "citationTitle": "Wikipedia: Alan Freed"
  },
  {
    "id": "b5a1f6b5-5061-4ce4-9adb-e1bdc09fac7f",
    "text": "Which Elvis Presley song was banned by many radio stations for being too sexually suggestive, despite becoming his first national hit?",
    "options": [
      "Heartbreak Hotel",
      "Hound Dog",
      "That's All Right",
      "Good Rockin' Tonight"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'That's All Right' was Elvis's first national hit but was banned by many stations for its suggestive nature.",
    "detailedExplanation": "Recorded at Sun Records in July 1954, 'That's All Right' was Elvis Presley's first commercial recording and breakthrough hit. The song, originally by blues artist Arthur Crudup, was transformed by Elvis's unique style that blended country, blues, and pop. Many radio stations initially refused to play it, considering Elvis's vocal style and the song's rhythm too sexually suggestive for mainstream audiences. The controversy only added to its popularity, helping establish Elvis as a revolutionary figure in popular music.",
    "citationUrl": "https://en.wikipedia.org/wiki/That%27s_All_Right",
    "citationTitle": "Wikipedia: That's All Right"
  },
  {
    "id": "a45a734e-c2d1-428d-8da0-cbc4773b8a7a",
    "text": "What was the name of the Memphis recording studio where Elvis, Johnny Cash, Jerry Lee Lewis, and Carl Perkins all recorded their early hits?",
    "options": [
      "Stax Records",
      "Hi Records",
      "Sun Studio",
      "American Sound Studio"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Sun Studio in Memphis was where these rock and roll legends recorded their early breakthrough hits.",
    "detailedExplanation": "Sun Studio at 706 Union Avenue in Memphis, Tennessee, was founded by Sam Phillips in 1950. Known as the 'Birthplace of Rock and Roll,' it's where Elvis Presley, Johnny Cash, Jerry Lee Lewis, Carl Perkins, and many other legends recorded their first hits. The famous 'Million Dollar Quartet' session took place there on December 4, 1956, featuring an impromptu jam session with Elvis, Johnny Cash, Jerry Lee Lewis, and Carl Perkins. The studio's distinctive sound, created by Phillips's innovative recording techniques, helped define the early rock and roll sound.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sun_Studio",
    "citationTitle": "Wikipedia: Sun Studio"
  },
  {
    "id": "588b7949-663c-4136-9480-57e8a657a3e4",
    "text": "Which pioneering female rock and roll artist was known as the 'Queen of Rockabilly' and recorded 'Fujiyama Mama'?",
    "options": [
      "Wanda Jackson",
      "Janis Martin",
      "Brenda Lee",
      "Patsy Cline"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Wanda Jackson was known as the 'Queen of Rockabilly' and recorded the hit 'Fujiyama Mama.'",
    "detailedExplanation": "Wanda Jackson, born in 1937, was one of the first women to record rock and roll music and earned the title 'Queen of Rockabilly.' Her 1958 recording of 'Fujiyama Mama' became a massive hit, particularly in Japan where it reached #1. Jackson's powerful voice and wild stage presence broke barriers for women in rock and roll. She was encouraged by Elvis Presley himself to pursue rock and roll after they dated briefly in the mid-1950s. She successfully crossed between country and rock genres throughout her career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wanda_Jackson",
    "citationTitle": "Wikipedia: Wanda Jackson"
  },
  {
    "id": "d44312b7-84ad-45a8-946e-77695dc9a657",
    "text": "What was unusual about Ritchie Valens' recording of 'La Bamba' that made it groundbreaking for 1950s rock and roll?",
    "options": [
      "It was recorded live in one take",
      "It was sung entirely in Spanish",
      "It featured a full orchestra",
      "It was over 10 minutes long"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'La Bamba' was groundbreaking because it was sung entirely in Spanish on mainstream rock radio.",
    "detailedExplanation": "Ritchie Valens' 1958 recording of 'La Bamba' was revolutionary because it was sung entirely in Spanish at a time when non-English songs rarely received mainstream radio play in the United States. Valens adapted the traditional Mexican folk song 'La Bamba' into a rock and roll arrangement, making it one of the first Spanish-language rock hits. This was particularly significant as it introduced Latin American musical elements to rock and roll and helped pave the way for future Latino artists in mainstream American music. Tragically, Valens died in the same 1959 plane crash that killed Buddy Holly and The Big Bopper.",
    "citationUrl": "https://en.wikipedia.org/wiki/La_Bamba_(song)",
    "citationTitle": "Wikipedia: La Bamba (song)"
  },
  {
    "id": "341eaafe-61d7-49ca-b280-4cd0ad40982c",
    "text": "Which rock and roll legend was nicknamed 'The Killer' and once set his piano on fire during a performance?",
    "options": [
      "Little Richard",
      "Jerry Lee Lewis",
      "Fats Domino",
      "Ray Charles"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Jerry Lee Lewis was nicknamed 'The Killer' and famously set his piano on fire during performances.",
    "detailedExplanation": "Jerry Lee Lewis earned the nickname 'The Killer' due to his wild, energetic performances and rebellious personality. He was famous for his theatrical stage antics, including standing on the piano, playing with his feet, and most memorably, setting the piano on fire with gasoline and matches during a 1957 concert. This dramatic gesture was reportedly done to upstage Chuck Berry, who was headlining the show. Lewis's explosive performances and hits like 'Great Balls of Fire' and 'Whole Lotta Shakin' Goin' On' made him one of rock and roll's most controversial and exciting performers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jerry_Lee_Lewis",
    "citationTitle": "Wikipedia: Jerry Lee Lewis"
  },
  {
    "id": "153163c3-d36e-4948-bbcd-c7188e970348",
    "text": "What was the original profession of Bill Haley before he became famous with 'Rock Around the Clock'?",
    "options": [
      "Country and western musician",
      "Radio announcer",
      "Car mechanic",
      "School teacher"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Bill Haley was originally a country and western musician before transitioning to rock and roll.",
    "detailedExplanation": "Before becoming the 'Father of Rock and Roll' with hits like 'Rock Around the Clock,' Bill Haley was a country and western musician who performed with various bands including the Four Aces of Western Swing and Bill Haley's Saddlemen. In the early 1950s, he began incorporating rhythm and blues elements into his country sound, eventually transforming his group into Bill Haley & His Comets. This transition from country to rock and roll was crucial in the development of the genre, as Haley helped bridge the gap between country music and the emerging rock sound.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bill_Haley",
    "citationTitle": "Wikipedia: Bill Haley"
  },
  {
    "id": "520451e4-0604-4527-909f-ba204f94f673",
    "text": "Which rock and roll pioneer was partially paralyzed from polio as a child but still became famous for his energetic stage performances?",
    "options": [
      "Gene Vincent",
      "Eddie Cochran",
      "Carl Perkins",
      "Johnny Burnette"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Gene Vincent overcame partial paralysis from polio to become a dynamic rock and roll performer.",
    "detailedExplanation": "Gene Vincent, born Vincent Eugene Craddock, contracted polio as a child which left him with a weakened left leg. Despite this physical challenge, he became one of rock and roll's most dynamic performers, known for his wild stage presence and hits like 'Be-Bop-A-Lula.' Vincent often wore a leather jacket and limped noticeably on stage, but he transformed his disability into part of his rebellious image. His theatrical performances and distinctive vocal style influenced many future rock stars, and he remained popular in Europe even after his American success waned.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gene_Vincent",
    "citationTitle": "Wikipedia: Gene Vincent"
  },
  {
    "id": "37c8e787-eb85-4f66-92c2-176dbe72b57c",
    "text": "Which rock and roll legend famously had their original recording contract sold to RCA Records by Sam Phillips for $35,000 because Sun Records needed the money to stay afloat?",
    "options": [
      "Carl Perkins",
      "Elvis Presley",
      "Roy Orbison",
      "Johnny Cash"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Sam Phillips sold Elvis Presley's contract to RCA Records in November 1955 for $35,000.",
    "detailedExplanation": "In November 1955, Sam Phillips made the difficult decision to sell Elvis Presley's recording contract to RCA Records for $35,000 plus $5,000 in back royalties owed to Elvis. Phillips needed the money to keep Sun Records operating and to promote his other artists. This deal allowed RCA to take Elvis national, leading to his first RCA single 'Heartbreak Hotel' becoming a massive hit and launching his legendary career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elvis_Presley",
    "citationTitle": "Wikipedia: Elvis Presley"
  },
  {
    "id": "c88e840f-8dd0-49f6-b830-c643de536387",
    "text": "What was the name of the controversial 1956 TV appearance that showed Elvis Presley only from the waist up due to censorship concerns?",
    "options": [
      "The Steve Allen Show",
      "American Bandstand",
      "The Ed Sullivan Show",
      "The Milton Berle Show"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Elvis appeared on The Ed Sullivan Show three times in 1956-57, with the third appearance famously showing him only from the waist up.",
    "detailedExplanation": "Elvis Presley's appearances on The Ed Sullivan Show were pivotal moments in rock and roll history. His first two appearances in September and October 1956 showed him full-body, but his provocative hip movements caused such controversy that CBS executives decided to film his third appearance in January 1957 from the waist up only. Despite the censorship, these appearances helped establish Elvis as a national phenomenon and brought rock and roll into mainstream American homes.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Ed_Sullivan_Show",
    "citationTitle": "Wikipedia: The Ed Sullivan Show"
  },
  {
    "id": "5770c0fa-1ba4-4f9e-b5a1-0fe8790f1af5",
    "text": "Which guitar technique, pioneered by Chuck Berry and later adopted by countless rock guitarists, involves bending the strings while playing to create a distinctive sliding sound?",
    "options": [
      "Hammer-on",
      "String bending",
      "Tremolo picking",
      "Palm muting"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Chuck Berry popularized string bending technique, which became fundamental to rock guitar playing.",
    "detailedExplanation": "Chuck Berry revolutionized electric guitar playing by popularizing string bending, a technique where the guitarist pushes or pulls the strings while fretting them to raise the pitch. This created the distinctive 'crying' or sliding sound that became synonymous with rock and roll guitar solos. Berry's innovative use of string bending in songs like 'Johnny B. Goode' and 'Roll Over Beethoven' influenced virtually every rock guitarist who followed, from Keith Richards to Jimi Hendrix to modern players.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chuck_Berry",
    "citationTitle": "Wikipedia: Chuck Berry"
  },
  {
    "id": "da4d9adc-ca5e-418e-974b-6cb86c58c231",
    "text": "What was the name of the 1958 tour that ended tragically with a plane crash, killing three major rock and roll stars on what Don McLean called 'The Day the Music Died'?",
    "options": [
      "Winter Dance Party",
      "Rock and Roll Revue",
      "Stars of Tomorrow Tour",
      "Midwest Rock Spectacular"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Winter Dance Party tour ended with the February 3, 1959 plane crash that killed Buddy Holly, Ritchie Valens, and The Big Bopper.",
    "detailedExplanation": "The Winter Dance Party was a 1959 concert tour organized by General Artists Corporation that featured Buddy Holly, Ritchie Valens, The Big Bopper, and others. The tour was plagued by problems including a broken-down tour bus in freezing Midwest weather. On February 3, 1959, after a show in Clear Lake, Iowa, Holly chartered a small plane to fly to the next venue. The plane crashed shortly after takeoff, killing Holly, Valens, and The Big Bopper. This tragedy became immortalized as 'The Day the Music Died' in Don McLean's 1971 song 'American Pie.'",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Day_the_Music_Died",
    "citationTitle": "Wikipedia: The Day the Music Died"
  }
]