[
  {
    "id": "39f87cc9-ea8b-4fd9-b818-01bc0583c396",
    "text": "Which rock and roll legend was known as 'The King of Rock and Roll'?",
    "options": [
      "Chuck Berry",
      "Elvis Presley",
      "Little Richard",
      "Jerry Lee Lewis"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Elvis Presley earned the nickname 'The King of Rock and Roll' due to his massive cultural impact and popularity.",
    "detailedExplanation": "Elvis Presley became known as 'The King of Rock and Roll' through his revolutionary fusion of country, blues, and pop music, combined with his charismatic performances and unprecedented commercial success. His influence on popular culture and music made him an icon who helped bring rock and roll into the mainstream during the 1950s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elvis_Presley",
    "citationTitle": "Wikipedia: Elvis Presley"
  },
  {
    "id": "b9ba1966-6dab-4d8b-9997-2acfcf15ccb9",
    "text": "What was the name of Buddy Holly's backing band?",
    "options": [
      "The Comets",
      "The Crickets",
      "The Flames",
      "The Blue Caps"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Buddy Holly performed with his backing band called The Crickets, who helped create his distinctive sound.",
    "detailedExplanation": "The Crickets were Buddy Holly's backing band, formed in 1957 in Lubbock, Texas. The band included Jerry Allison on drums, Joe B. Mauldin on bass, and Niki Sullivan on rhythm guitar. Together, they recorded classic hits like 'That'll Be the Day' and 'Peggy Sue,' helping to establish the standard rock band lineup of guitars, bass, and drums.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Crickets",
    "citationTitle": "Wikipedia: The Crickets"
  },
  {
    "id": "c1cce0ed-49f0-4cee-94de-591e72f0adf7",
    "text": "Which Chuck Berry song features the famous lyric 'Go Johnny go'?",
    "options": [
      "Roll Over Beethoven",
      "Maybellene",
      "Johnny B. Goode",
      "Sweet Little Sixteen"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Johnny B. Goode' contains the iconic lyric 'Go Johnny go' in its chorus.",
    "detailedExplanation": "'Johnny B. Goode' was released by Chuck Berry in 1958 and became one of his most famous songs. The track tells the story of a young guitarist from Louisiana and features the memorable chant 'Go Johnny go' throughout the chorus. The song is considered one of the most influential rock and roll songs ever recorded and was even included on the Voyager Golden Record sent into space.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johnny_B._Goode",
    "citationTitle": "Wikipedia: Johnny B. Goode"
  },
  {
    "id": "4584c3d7-656a-4fa2-a9a5-ab12ff4f3a2b",
    "text": "Jerry Lee Lewis was famous for playing which instrument in a wild, energetic style?",
    "options": [
      "Guitar",
      "Piano",
      "Saxophone",
      "Drums"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jerry Lee Lewis was renowned for his explosive piano playing, often performing while standing and even climbing on the instrument.",
    "detailedExplanation": "Jerry Lee Lewis earned the nickname 'The Killer' for his wild, uninhibited piano performances that often included standing on the piano bench, playing with his feet, and sometimes even lighting the piano on fire. His energetic style on songs like 'Great Balls of Fire' and 'Whole Lotta Shakin' Goin' On' made him one of rock and roll's most dynamic performers and helped establish the piano as a lead instrument in rock music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jerry_Lee_Lewis",
    "citationTitle": "Wikipedia: Jerry Lee Lewis"
  },
  {
    "id": "72222b79-ab08-46e7-a52b-a5cd6db15597",
    "text": "What tragic event occurred to Ritchie Valens, Buddy Holly, and The Big Bopper in 1959?",
    "options": [
      "Car accident",
      "Plane crash",
      "Hotel fire",
      "Stage collapse"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "All three musicians died in a plane crash on February 3, 1959, an event later called 'The Day the Music Died.'",
    "detailedExplanation": "On February 3, 1959, Ritchie Valens, Buddy Holly, and The Big Bopper (J.P. Richardson) were killed when their chartered plane crashed near Clear Lake, Iowa, during a winter storm. They were traveling between concert venues on the Winter Dance Party tour. This tragedy was later immortalized in Don McLean's 1971 song 'American Pie' with the phrase 'the day the music died,' referring to the significant loss to rock and roll.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Day_the_Music_Died",
    "citationTitle": "Wikipedia: The Day the Music Died"
  },
  {
    "id": "355c5364-7e8b-4a34-970c-d860df5d6f67",
    "text": "Bo Diddley was famous for playing a guitar with what distinctive shape?",
    "options": [
      "Star-shaped",
      "Rectangular/square",
      "Triangle",
      "Heart-shaped"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Bo Diddley was known for his custom rectangular or square-shaped guitars, which became his signature look.",
    "detailedExplanation": "Bo Diddley played custom-made guitars with distinctive rectangular or square bodies, which he designed himself. These unique instruments became as much a part of his identity as his innovative 'Bo Diddley beat' rhythm. He used various versions throughout his career, and the unconventional shape became iconic in rock and roll history, influencing other musicians to experiment with non-traditional guitar designs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bo_Diddley",
    "citationTitle": "Wikipedia: Bo Diddley"
  },
  {
    "id": "9f967934-17b4-4c73-8d5b-b3898635a5cf",
    "text": "Which Little Richard song became his first major hit and helped launch his career?",
    "options": [
      "Good Golly Miss Molly",
      "Long Tall Sally",
      "Tutti Frutti",
      "Lucille"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Tutti Frutti' was Little Richard's breakthrough hit in 1955, launching his rock and roll career.",
    "detailedExplanation": "'Tutti Frutti' was recorded by Little Richard in September 1955 and became his first major hit, reaching number 17 on the Billboard pop charts. The song's energetic vocals, driving piano, and infectious 'A-wop-bop-a-loo-bop-a-lop-bam-boom' opening made it an instant classic. It established Little Richard as one of rock and roll's founding fathers and demonstrated his ability to blend gospel, R&B, and pop into something entirely new.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tutti_Frutti_(song)",
    "citationTitle": "Wikipedia: Tutti Frutti (song)"
  },
  {
    "id": "4e638b49-9670-4a32-86c1-c1b6e0824169",
    "text": "Eddie Cochran died tragically young at what age in a car accident in England?",
    "options": [
      "19",
      "21",
      "23",
      "25"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Eddie Cochran died at age 21 in April 1960 following a car accident while touring in England.",
    "detailedExplanation": "Eddie Cochran died on April 17, 1960, at just 21 years old, following a car accident near Chippenham, Wiltshire, England. He was traveling from a concert in Bristol to London when the taxi crashed. Despite his brief career, Cochran left a lasting impact on rock and roll with hits like 'Summertime Blues' and 'C'mon Everybody.' His death, along with other young rock stars of the era, highlighted the dangers faced by touring musicians in the early days of rock and roll.",
    "citationUrl": "https://en.wikipedia.org/wiki/Eddie_Cochran",
    "citationTitle": "Wikipedia: Eddie Cochran"
  },
  {
    "id": "7f9ee60e-ce78-45d1-a24d-d5998a9b5dc1",
    "text": "Which rock and roll pioneer's real name was Richard Wayne Penniman?",
    "options": [
      "Little Richard",
      "Fats Domino",
      "Chuck Berry",
      "Jerry Lee Lewis"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Little Richard's birth name was Richard Wayne Penniman.",
    "detailedExplanation": "Richard Wayne Penniman, known professionally as Little Richard, was born in 1932 in Macon, Georgia. He became one of the founding fathers of rock and roll with his flamboyant performance style, powerful vocals, and energetic piano playing. His theatrical stage presence and gender-bending appearance challenged social norms of the 1950s and influenced countless musicians including The Beatles, Elvis Presley, and Prince.",
    "citationUrl": "https://en.wikipedia.org/wiki/Little_Richard",
    "citationTitle": "Wikipedia: Little Richard"
  },
  {
    "id": "48799d6b-8eba-480c-a886-8376352edf41",
    "text": "What was the original name of Bill Haley's famous backing group before they became known as the Comets?",
    "options": [
      "The Saddlemen",
      "The Cowboys",
      "The Four Aces of Western Swing",
      "The Range Riders"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Bill Haley's group was originally called The Saddlemen before becoming Bill Haley & His Comets.",
    "detailedExplanation": "Bill Haley originally performed country and western music with his group called The Saddlemen in the early 1950s. As they transitioned to rock and roll, they changed their name to Bill Haley & His Comets in 1952. The name change reflected their shift from country music to the new rock and roll sound that would make them famous with hits like 'Rock Around the Clock' and 'Shake, Rattle and Roll.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Bill_Haley_%26_His_Comets",
    "citationTitle": "Wikipedia: Bill Haley & His Comets"
  },
  {
    "id": "42419800-5e0e-49be-8a13-09c7dbccd300",
    "text": "Which record label was home to many early rock and roll legends including Chuck Berry, Bo Diddley, and Muddy Waters?",
    "options": [
      "Sun Records",
      "Chess Records",
      "Atlantic Records",
      "King Records"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Chess Records, based in Chicago, was the legendary label that recorded Chuck Berry, Bo Diddley, and Muddy Waters.",
    "detailedExplanation": "Chess Records, founded by Leonard and Phil Chess in Chicago in 1950, became one of the most important independent record labels in the development of rock and roll and electric blues. The label was instrumental in the careers of Chuck Berry, Bo Diddley, Muddy Waters, Howlin' Wolf, and Etta James. Chess Records' distinctive sound and the artists it nurtured had a profound influence on the British Invasion bands like The Rolling Stones, who named themselves after a Muddy Waters song.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chess_Records",
    "citationTitle": "Wikipedia: Chess Records"
  },
  {
    "id": "04124669-a582-407d-a0d5-5388fee3a73a",
    "text": "What song is considered to be the first rock and roll record to reach #1 on the Billboard charts?",
    "options": [
      "Rock Around the Clock",
      "Heartbreak Hotel",
      "That's All Right",
      "Rocket 88"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Bill Haley & His Comets' 'Rock Around the Clock' was the first rock and roll song to reach #1 on the Billboard charts in 1955.",
    "detailedExplanation": "While there's debate about what constitutes the 'first' rock and roll record, 'Rock Around the Clock' by Bill Haley & His Comets holds the distinction of being the first rock and roll song to reach #1 on the Billboard pop charts, achieving this milestone in July 1955. The song gained massive popularity after being featured in the film 'Blackboard Jungle' and stayed at #1 for eight weeks, marking rock and roll's arrival as a dominant force in popular music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rock_Around_the_Clock",
    "citationTitle": "Wikipedia: Rock Around the Clock"
  },
  {
    "id": "4767354b-4176-4120-bc8e-a7fcac4bbe9b",
    "text": "Which rock and roll legend was nicknamed 'The Killer'?",
    "options": [
      "Gene Vincent",
      "Eddie Cochran",
      "Jerry Lee Lewis",
      "Carl Perkins"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jerry Lee Lewis earned the nickname 'The Killer' for his wild, energetic performances.",
    "detailedExplanation": "Jerry Lee Lewis earned the nickname 'The Killer' not for any violent tendencies, but for his ability to 'kill' audiences with his explosive piano performances and wild stage antics. Known for playing piano with his feet, setting pianos on fire, and his incredibly energetic performances of songs like 'Great Balls of Fire' and 'Whole Lotta Shakin' Goin' On,' Lewis became one of the most dynamic performers of the early rock and roll era, though his career was temporarily derailed by scandal in the late 1950s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jerry_Lee_Lewis",
    "citationTitle": "Wikipedia: Jerry Lee Lewis"
  },
  {
    "id": "4ee5d94d-c357-4bf2-9a3a-adb231f22251",
    "text": "What was Elvis Presley's middle name?",
    "options": [
      "Aaron",
      "Andrew",
      "Anthony",
      "Alexander"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Elvis Presley's full name was Elvis Aaron Presley, though it was later spelled 'Aron' on some documents.",
    "detailedExplanation": "Elvis Presley was born Elvis Aaron Presley on January 8, 1935, in Tupelo, Mississippi. Interestingly, there has been some confusion over the spelling of his middle name throughout his life and career. While his birth certificate shows 'Aaron,' it was sometimes spelled 'Aron' on various documents, including his gravestone at Graceland, which uses the 'Aron' spelling to match his father Vernon's middle name and honor his stillborn twin brother Jesse Garon Presley.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elvis_Presley",
    "citationTitle": "Wikipedia: Elvis Presley"
  },
  {
    "id": "79d917b8-964b-466d-a871-79a8ee4fd7b0",
    "text": "Which Sun Records artist recorded the original version of 'Blue Suede Shoes'?",
    "options": [
      "Elvis Presley",
      "Johnny Cash",
      "Carl Perkins",
      "Roy Orbison"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Carl Perkins wrote and originally recorded 'Blue Suede Shoes' for Sun Records in 1955.",
    "detailedExplanation": "Carl Perkins wrote and recorded the original version of 'Blue Suede Shoes' at Sun Records in Memphis on December 19, 1955. The song became a crossover hit, reaching the top 5 on the country, pop, and R&B charts simultaneously - a rare achievement at the time. While Elvis Presley later recorded a famous version of the song, Perkins' original recording established him as one of the key architects of rockabilly and earned him recognition as one of rock and roll's founding fathers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blue_Suede_Shoes",
    "citationTitle": "Wikipedia: Blue Suede Shoes"
  },
  {
    "id": "4245bd64-737f-496d-9126-08f47559b0d1",
    "text": "What was the name of the famous music venue in New York where many early rock and roll acts performed, known for its amateur nights?",
    "options": [
      "The Cavern Club",
      "The Apollo Theater",
      "The Fillmore",
      "The Whisky a Go Go"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Apollo Theater in Harlem was famous for launching many careers through its Amateur Night competitions.",
    "detailedExplanation": "The Apollo Theater in Harlem, New York, became legendary for its Amateur Night at the Apollo, which began in 1935. This venue served as a launching pad for countless performers who would become rock and roll and R&B legends, including James Brown, Stevie Wonder, The Jackson 5, and many others. The theater's tough audience was known for either embracing new talent or booing performers off stage, making it both feared and revered among aspiring musicians. Many early rock and roll artists got their start or gained credibility by performing at the Apollo.",
    "citationUrl": "https://en.wikipedia.org/wiki/Apollo_Theater",
    "citationTitle": "Wikipedia: Apollo Theater"
  },
  {
    "id": "598c1b29-0e9f-4137-8fa4-9668963fd396",
    "text": "Which rock and roll legend recorded the influential album 'Here's Little Richard' and was known for his flamboyant pompadour hairstyle and makeup?",
    "options": [
      "Jerry Lee Lewis",
      "Little Richard",
      "Chuck Berry",
      "Fats Domino"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Little Richard recorded 'Here's Little Richard' in 1957 and was famous for his theatrical appearance.",
    "detailedExplanation": "Little Richard was not only a musical pioneer but also a visual innovator who broke gender norms with his flamboyant style. His 1957 album 'Here's Little Richard' featured many of his classic hits and showcased his wild, energetic piano playing and distinctive vocal style. His pompadour hairstyle, makeup, and theatrical stage presence influenced countless rock performers who came after him, making him as much a visual icon as a musical one.",
    "citationUrl": "https://en.wikipedia.org/wiki/Little_Richard",
    "citationTitle": "Wikipedia: Little Richard"
  },
  {
    "id": "300274e4-2889-4f07-bb81-e897103d5b0a",
    "text": "What was the name of the dance that became a worldwide craze after Bill Haley & His Comets recorded the song of the same name in 1954?",
    "options": [
      "The Twist",
      "Rock Around the Clock",
      "The Stroll",
      "Shake, Rattle and Roll"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Rock Around the Clock' became both a massive hit song and sparked a dance craze of the same name.",
    "detailedExplanation": "Bill Haley & His Comets' recording of 'Rock Around the Clock' in 1954 became one of the first rock and roll songs to achieve mainstream success worldwide. The song not only topped charts but also inspired a dance craze where people would literally dance around the clock at sock hops and dance halls. The song gained even more popularity when it was featured in the 1955 film 'Blackboard Jungle,' helping to establish rock and roll as the soundtrack of teenage rebellion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rock_Around_the_Clock",
    "citationTitle": "Wikipedia: Rock Around the Clock"
  },
  {
    "id": "4353ed66-cd51-4238-9a7f-8621f5a96bed",
    "text": "Which rock and roll pioneer was born McKinley Morganfield and became known as the 'father of modern Chicago blues'?",
    "options": [
      "Howlin' Wolf",
      "Muddy Waters",
      "B.B. King",
      "Robert Johnson"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Muddy Waters, born McKinley Morganfield, was crucial in developing the Chicago blues sound that influenced rock and roll.",
    "detailedExplanation": "Muddy Waters, born McKinley Morganfield in Mississippi in 1913, moved to Chicago in the 1940s where he pioneered the electric blues sound that would become foundational to rock and roll. His amplified, aggressive style contrasted sharply with the acoustic Delta blues of his roots. Songs like 'Hoochie Coochie Man' and 'Mannish Boy' directly influenced rock legends like The Rolling Stones (who took their name from his song 'Rollin' Stone'), Led Zeppelin, and Eric Clapton.",
    "citationUrl": "https://en.wikipedia.org/wiki/Muddy_Waters",
    "citationTitle": "Wikipedia: Muddy Waters"
  },
  {
    "id": "44a1c4ed-a1bd-4f44-a76d-e253502c45e6",
    "text": "In what year did Alan Freed first use the term 'rock and roll' to describe this new style of music on his radio show?",
    "options": [
      "1949",
      "1951",
      "1954",
      "1956"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "DJ Alan Freed began using the term 'rock and roll' on his radio show in 1951.",
    "detailedExplanation": "Alan Freed, a Cleveland DJ, is widely credited with popularizing the term 'rock and roll' when he started using it on his radio show 'Moondog's Rock and Roll Party' in 1951. While the term existed before in blues lyrics as a euphemism, Freed was the first to use it to describe this new genre of music that blended rhythm and blues with country influences. His promotion of the music and the concerts he organized helped bring rock and roll to mainstream white audiences, though this also led to significant controversy and accusations of promoting racial integration through music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alan_Freed",
    "citationTitle": "Wikipedia: Alan Freed"
  }
]