[
  {
    "id": "862388c0-4d79-4751-9ab0-aef21299c3eb",
    "text": "Which French fashion designer is famous for creating the 'little black dress' and the perfume Chanel No. 5?",
    "options": [
      "Coco Chanel",
      "Christian Dior",
      "Yves Saint Laurent",
      "Pierre Cardin"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Coco Chanel revolutionized women's fashion and created the iconic little black dress and Chanel No. 5 perfume.",
    "detailedExplanation": "Gabrielle 'Coco' Chanel (1883-1971) was a pioneering French fashion designer who fundamentally changed the way women dressed. She introduced the concept of the 'little black dress' in 1926, which Vogue called 'Chanel's Ford' - comparing it to the universal Model T car. She also launched the legendary Chanel No. 5 perfume in 1921, which remains one of the world's best-selling fragrances. Chanel liberated women from the corseted silhouettes of the early 20th century, introducing comfortable, elegant designs that emphasized simplicity and functionality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coco_Chanel",
    "citationTitle": "Wikipedia: Coco Chanel"
  },
  {
    "id": "517b3dc7-200e-4104-9a51-67e9986b0dfc",
    "text": "Which Italian designer founded the luxury fashion house known for its Medusa logo?",
    "options": [
      "Giorgio Armani",
      "Gianni Versace",
      "Valentino Garavani",
      "Domenico Dolce"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Gianni Versace founded Versace in 1978, using the Medusa head as the brand's distinctive logo.",
    "detailedExplanation": "Gianni Versace (1946-1997) founded the luxury fashion company Versace in Milan in 1978. The brand's iconic logo features the head of Medusa, a figure from Greek mythology. Versace chose this symbol because he believed it would make people fall in love with his designs and never want to leave, just as those who looked at Medusa were turned to stone. The brand became synonymous with bold, glamorous designs and was favored by celebrities and royalty. Versace's innovative use of materials, vibrant colors, and classical motifs made him one of the most influential designers of the late 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gianni_Versace",
    "citationTitle": "Wikipedia: Gianni Versace"
  },
  {
    "id": "418e2f8f-d95d-441d-927f-445e6b09c65c",
    "text": "What revolutionary fashion item did Christian Dior introduce in 1947 that used yards of fabric and emphasized an hourglass silhouette?",
    "options": [
      "The A-Line",
      "The New Look",
      "The Empire Waist",
      "The Shift Dress"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Christian Dior's 'New Look' collection in 1947 featured full skirts and nipped waists, using unprecedented amounts of fabric.",
    "detailedExplanation": "Christian Dior's 'New Look' collection, debuted on February 12, 1947, marked a dramatic departure from the practical, fabric-rationed clothing of World War II. The collection featured jackets with padded hips and full skirts that used up to 25 yards of fabric - a luxurious amount for the time. The silhouette emphasized a tiny waist, rounded shoulders, and a full bust, creating an ultra-feminine hourglass shape. While initially controversial due to its extravagant use of materials during post-war shortages, the New Look became hugely influential and established Dior as one of the most important fashion houses in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christian_Dior",
    "citationTitle": "Wikipedia: Christian Dior"
  },
  {
    "id": "f7841b2e-3f78-4d78-9701-9c45b84b0550",
    "text": "Which American fashion designer is known for creating practical, sporty clothes and popularizing casual American style?",
    "options": [
      "Marc Jacobs",
      "Tommy Hilfiger",
      "Ralph Lauren",
      "Calvin Klein"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Ralph Lauren built his empire on American casual style, including polo shirts, preppy looks, and Western wear.",
    "detailedExplanation": "Ralph Lauren (born Ralph Lifshitz in 1939) is an American fashion designer who became famous for capturing and commercializing the American casual lifestyle. Starting with men's ties in the late 1960s, he expanded into a fashion empire known for polo shirts, preppy New England style, and Western-inspired ranch wear. Lauren's designs often evoke images of American aristocracy, country clubs, and the great outdoors. His Polo Ralph Lauren brand became synonymous with a relaxed yet refined American aesthetic, influencing global fashion and making casual wear acceptable in previously formal settings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ralph_Lauren",
    "citationTitle": "Wikipedia: Ralph Lauren"
  },
  {
    "id": "f4db0bec-3fdd-4a3b-b382-bf555c2bcae8",
    "text": "Which British fashion designer is famous for her punk-inspired designs and for dressing the Sex Pistols?",
    "options": [
      "Stella McCartney",
      "Vivienne Westwood",
      "Mary Quant",
      "Zandra Rhodes"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Vivienne Westwood pioneered punk fashion in the 1970s and designed clothes for the Sex Pistols band.",
    "detailedExplanation": "Vivienne Westwood (1941-2022) was a British fashion designer who played a crucial role in bringing punk fashion into the mainstream. Along with her partner Malcolm McLaren, she ran the boutique 'SEX' (later 'Seditionaries') on King's Road in Chelsea, which became the epicenter of punk fashion in the 1970s. Westwood designed the iconic clothing worn by the Sex Pistols, incorporating elements like safety pins, bondage gear, and provocative slogans. Her designs challenged conventional fashion norms and social attitudes, making her one of the most influential and controversial designers of her generation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vivienne_Westwood",
    "citationTitle": "Wikipedia: Vivienne Westwood"
  },
  {
    "id": "2c044296-4e71-466b-a97a-4d746cd96c3f",
    "text": "Which Japanese designer is known for avant-garde, deconstructed clothing and founded the brand Comme des Garçons?",
    "options": [
      "Issey Miyake",
      "Rei Kawakubo",
      "Yohji Yamamoto",
      "Kenzo Takada"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Rei Kawakubo founded Comme des Garçons and is renowned for her conceptual, often deconstructed fashion designs.",
    "detailedExplanation": "Rei Kawakubo (born 1942) is a Japanese fashion designer who founded Comme des Garçons in Tokyo in 1969. She is known for her avant-garde approach to fashion, creating conceptual designs that often challenge traditional notions of beauty and form. Her work frequently features deconstructed elements, unusual silhouettes, and a predominantly black color palette. Kawakubo's designs are often described as 'anti-fashion' because they deliberately subvert conventional fashion principles. She gained international recognition in the early 1980s when she began showing in Paris, and her influence extends beyond fashion into art and architecture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rei_Kawakubo",
    "citationTitle": "Wikipedia: Rei Kawakubo"
  },
  {
    "id": "1e98fb0c-1569-492e-972d-ee6978a055ca",
    "text": "Which German-born American fashion designer founded a wrap dress company and became a prominent businesswoman and philanthropist?",
    "options": [
      "Diane von Furstenberg",
      "Carolina Herrera",
      "Donna Karan",
      "Betsey Johnson"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Diane von Furstenberg created the iconic wrap dress in the 1970s and built a successful fashion empire around it.",
    "detailedExplanation": "Diane von Furstenberg (born Diane Simone Michelle Halfin in 1946) is a Belgian-American fashion designer best known for creating the wrap dress in 1974. This simple yet elegant design became a symbol of female empowerment and independence, allowing women to feel both comfortable and sophisticated. The wrap dress was revolutionary because it was versatile, flattering to many body types, and easy to wear - embodying the changing role of women in society. Von Furstenberg built a fashion empire around this design and became a prominent advocate for women's rights and entrepreneurship.",
    "citationUrl": "https://en.wikipedia.org/wiki/Diane_von_Furstenberg",
    "citationTitle": "Wikipedia: Diane von Furstenberg"
  },
  {
    "id": "48f5ba6d-18d8-4f2a-b20e-893ca5292678",
    "text": "Which Italian fashion designer duo founded the luxury brand known for its bold prints and the hashtag #DGFamily?",
    "options": [
      "Dolce & Gabbana",
      "Fendi Sisters",
      "Prada & Miuccia",
      "Missoni Family"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Domenico Dolce and Stefano Gabbana founded their eponymous brand in 1985, famous for bold Italian glamour.",
    "detailedExplanation": "Domenico Dolce (born 1958) and Stefano Gabbana (born 1962) founded their luxury fashion house Dolce & Gabbana in Milan in 1985. The duo became famous for their bold, sensual designs that celebrate Sicilian culture and Italian craftsmanship. Their collections often feature vibrant prints, religious imagery, and references to Italian pop culture and history. The brand has dressed numerous celebrities and is known for its dramatic fashion shows. The #DGFamily hashtag represents their approach to treating customers, models, and collaborators as part of an extended family, emphasizing the warm, personal relationships central to Italian culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dolce_%26_Gabbana",
    "citationTitle": "Wikipedia: Dolce & Gabbana"
  },
  {
    "id": "960f4886-f4d9-4a5d-a00c-55b3addea4a0",
    "text": "Which fashion designer founded the luxury brand known for its iconic polo player logo?",
    "options": [
      "Ralph Lauren",
      "Tommy Hilfiger",
      "Calvin Klein",
      "Michael Kors"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Ralph Lauren founded Polo Ralph Lauren in 1967, featuring the iconic polo player logo.",
    "detailedExplanation": "Ralph Lauren began his fashion career in 1967 when he founded Polo Ralph Lauren. The brand's iconic polo player logo became one of the most recognizable symbols in fashion, representing the preppy, American aristocratic lifestyle that Lauren sought to embody in his designs. The logo appears on everything from polo shirts to home goods, making it a billion-dollar brand empire.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ralph_Lauren",
    "citationTitle": "Wikipedia: Ralph Lauren"
  },
  {
    "id": "a840de27-12fc-4a12-89f3-baca41bf91ee",
    "text": "Which French fashion house is famous for its quilted handbags with chain straps?",
    "options": [
      "Louis Vuitton",
      "Hermès",
      "Chanel",
      "Dior"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Chanel is renowned for its quilted handbags with chain straps, first introduced in 1955.",
    "detailedExplanation": "The Chanel quilted handbag with chain straps was introduced by Coco Chanel in February 1955, which is why it's called the '2.55' bag. The quilted design was inspired by jockeys' jackets, while the chain strap allowed women to have their hands free - a revolutionary concept at the time. This design became one of the most copied and coveted handbag styles in fashion history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chanel_2.55",
    "citationTitle": "Wikipedia: Chanel 2.55"
  },
  {
    "id": "25258982-b7e5-4cd3-8d96-b3218ae74c60",
    "text": "Which Spanish fashion brand is known for bringing fast fashion to the mainstream market?",
    "options": [
      "Mango",
      "Zara",
      "Desigual",
      "Custo Dalmau"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Zara, founded by Amancio Ortega, revolutionized the fashion industry with its fast fashion model.",
    "detailedExplanation": "Zara was founded in 1975 by Amancio Ortega in Spain and became the pioneer of fast fashion. The brand revolutionized the industry by dramatically reducing the time between design and retail, bringing runway-inspired styles to stores within weeks rather than months. This business model influenced the entire fashion retail landscape and made Ortega one of the world's richest people.",
    "citationUrl": "https://en.wikipedia.org/wiki/Zara_(retailer)",
    "citationTitle": "Wikipedia: Zara (retailer)"
  },
  {
    "id": "c215d29c-378a-4756-a2d7-f9470c59cba9",
    "text": "Which designer is credited with inventing the modern bikini in 1946?",
    "options": [
      "Jacques Heim",
      "Louis Réard",
      "Pierre Cardin",
      "André Courrèges"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Louis Réard, a French engineer turned fashion designer, created the modern bikini in 1946.",
    "detailedExplanation": "Louis Réard introduced the modern bikini on July 5, 1946, just four days after Jacques Heim introduced a similar two-piece called the 'Atome.' Réard named his creation 'bikini' after the Bikini Atoll where atomic bomb tests were being conducted, suggesting his design would have an explosive effect on fashion. The bikini was initially so scandalous that Réard had to hire a nude dancer to model it, as no fashion model would wear it.",
    "citationUrl": "https://en.wikipedia.org/wiki/Louis_R%C3%A9ard",
    "citationTitle": "Wikipedia: Louis Réard"
  },
  {
    "id": "6019bd58-874b-4220-badc-3e4dea7afa04",
    "text": "Which Italian fashion designer founded the luxury brand known for its colorful knitwear and zigzag patterns?",
    "options": [
      "Ottavio Missoni",
      "Giorgio Armani",
      "Valentino Garavani",
      "Stefano Gabbana"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Ottavio Missoni co-founded Missoni with his wife, creating the brand famous for colorful zigzag knitwear.",
    "detailedExplanation": "Ottavio Missoni, along with his wife Rosita, founded the Missoni fashion house in 1953. The brand became internationally famous for its distinctive colorful zigzag patterns and innovative knitwear techniques. Their psychedelic patterns and vibrant color combinations became a signature style that influenced fashion for decades, making Missoni one of Italy's most recognizable luxury brands.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ottavio_Missoni",
    "citationTitle": "Wikipedia: Ottavio Missoni"
  },
  {
    "id": "90092776-2e7b-4b83-9898-823ccd44c9aa",
    "text": "Which designer created the famous 'safety pin dress' worn by Elizabeth Hurley in 1994?",
    "options": [
      "Azzedine Alaïa",
      "Versace",
      "Roberto Cavalli",
      "Thierry Mugler"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Versace created the iconic black dress held together by gold safety pins that Elizabeth Hurley wore to a 1994 film premiere.",
    "detailedExplanation": "The famous safety pin dress was designed by Gianni Versace and worn by Elizabeth Hurley to the London premiere of 'Four Weddings and a Funeral' in 1994. The black Versace dress was held together by oversized gold safety pins and became one of the most talked-about red carpet moments in fashion history. The dress catapulted Hurley to international fame and became an iconic symbol of 1990s fashion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Safety_pin_dress",
    "citationTitle": "Wikipedia: Safety pin dress"
  },
  {
    "id": "73e9368f-e200-438f-ab92-416dac91114c",
    "text": "Which Belgian fashion designer is known as one of the 'Antwerp Six' and famous for deconstructed fashion?",
    "options": [
      "Martin Margiela",
      "Dries van Noten",
      "Ann Demeulemeester",
      "Walter Van Beirendonck"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Martin Margiela was part of the Antwerp Six and is renowned for his deconstructed, conceptual approach to fashion.",
    "detailedExplanation": "Martin Margiela was part of the 'Antwerp Six,' a group of Belgian fashion designers who graduated from Antwerp's Royal Academy of Fine Arts in the 1980s. Margiela became famous for his deconstructed designs, often showing the construction of garments on the outside, using unconventional materials, and maintaining anonymity by never appearing at his fashion shows. His brand Maison Margiela became highly influential in avant-garde fashion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Martin_Margiela",
    "citationTitle": "Wikipedia: Martin Margiela"
  },
  {
    "id": "300ad1e0-e949-4e12-b895-14c092aad768",
    "text": "Which American fashion designer founded the brand known for its distinctive uppercase logo and minimalist aesthetic?",
    "options": [
      "Marc Jacobs",
      "Calvin Klein",
      "Donna Karan",
      "Oscar de la Renta"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Calvin Klein founded his eponymous brand known for its minimalist designs and distinctive uppercase logo.",
    "detailedExplanation": "Calvin Klein founded his fashion house in 1968 and became famous for clean, minimalist designs and provocative advertising campaigns. The brand's distinctive uppercase 'CALVIN KLEIN' logo became iconic in the 1980s and 1990s, particularly on underwear and jeans. Klein's minimalist aesthetic and controversial advertising campaigns featuring celebrities like Brooke Shields and Mark Wahlberg helped establish the brand as a major force in American fashion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Calvin_Klein",
    "citationTitle": "Wikipedia: Calvin Klein"
  },
  {
    "id": "b2c1a8e4-fea7-43c4-a79d-46616c38a5e1",
    "text": "Which fashion designer is credited with creating the first tuxedo for women in 1966?",
    "options": [
      "Yves Saint Laurent",
      "Pierre Cardin",
      "Hubert de Givenchy",
      "André Courrèges"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Yves Saint Laurent created 'Le Smoking', the first women's tuxedo suit in 1966.",
    "detailedExplanation": "Yves Saint Laurent revolutionized women's fashion in 1966 when he introduced 'Le Smoking', the first tuxedo suit designed specifically for women. This groundbreaking design challenged traditional gender norms in fashion and became one of his most iconic creations. The sharp-shouldered, androgynous silhouette empowered women to dress with the same authority as men, making it a feminist statement as much as a fashion one.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yves_Saint_Laurent",
    "citationTitle": "Wikipedia: Yves Saint Laurent"
  },
  {
    "id": "566f95ba-1bd1-4d0d-bc5b-0a5b28065e61",
    "text": "Which American fashion designer is known for creating the wedding dress worn by Jacqueline Kennedy when she married President John F. Kennedy?",
    "options": [
      "Halston",
      "Ann Lowe",
      "Norman Norell",
      "Mainbocher"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Ann Lowe, an African American designer, created Jacqueline Kennedy's wedding dress in 1953.",
    "detailedExplanation": "Ann Lowe was a pioneering African American fashion designer who created the wedding dress worn by Jacqueline Bouvier when she married Senator John F. Kennedy in 1953. Despite facing racial discrimination in the fashion industry, Lowe became renowned for her exquisite craftsmanship and elegant designs. She dressed many prominent society figures but often received little public recognition for her work due to the social barriers of her time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ann_Lowe",
    "citationTitle": "Wikipedia: Ann Lowe"
  },
  {
    "id": "2bec0c6a-dc09-41cd-acdd-d25a2d1ca913",
    "text": "What is the real name of the fashion designer known professionally as Halston?",
    "options": [
      "Roy Halston Frowick",
      "Harold Stanley Friedman",
      "Henry Albert Livingston",
      "Robert Hall Stone"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Halston's full birth name was Roy Halston Frowick, born in Iowa in 1932.",
    "detailedExplanation": "Roy Halston Frowick, known simply as Halston, was born in Des Moines, Iowa, in 1932. He became one of America's most influential fashion designers in the 1970s, famous for his minimalist, elegant designs and for dressing celebrities like Bianca Jagger, Liza Minnelli, and Elizabeth Taylor. His career began with hat design before he moved into women's ready-to-wear fashion, becoming synonymous with the glamorous Studio 54 era of New York.",
    "citationUrl": "https://en.wikipedia.org/wiki/Halston",
    "citationTitle": "Wikipedia: Halston"
  },
  {
    "id": "492165c9-91cd-428b-8704-ce931dfd59d0",
    "text": "Which fashion designer founded the luxury brand known for its distinctive tartan patterns and trench coats?",
    "options": [
      "Alexander McQueen",
      "Stella McCartney",
      "Thomas Burberry",
      "Paul Smith"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Thomas Burberry founded Burberry in 1856, famous for its iconic tartan check and trench coats.",
    "detailedExplanation": "Thomas Burberry founded his eponymous fashion house in 1856 in Basingstoke, England. He revolutionized outerwear by inventing gabardine, a waterproof yet breathable fabric that became the foundation for Burberry's famous trench coats. The brand's distinctive tartan check pattern, originally used as a lining for their coats, became one of the most recognizable patterns in fashion history. Burberry trench coats were worn by explorers, military officers, and later became a luxury fashion staple.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burberry",
    "citationTitle": "Wikipedia: Burberry"
  }
]