[
  {
    "id": "04a9aa53-2573-47a7-8d77-01fe6f7a1ac4",
    "text": "What is the name of the Philadelphia Eagles' mascot?",
    "options": [
      "Swoop",
      "Screech",
      "Talon",
      "Eagle Eye"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Swoop is the official mascot of the Philadelphia Eagles NFL team.",
    "detailedExplanation": "Swoop has been the official mascot of the Philadelphia Eagles since 1996. The green eagle mascot is known for entertaining fans at Lincoln Financial Field and making appearances throughout the Philadelphia community. Swoop was designed to embody the spirit and intensity of the Eagles franchise and has become a beloved figure among Eagles fans.",
    "citationUrl": "https://en.wikipedia.org/wiki/Swoop_(mascot)",
    "citationTitle": "Wikipedia: Swoop (mascot)"
  },
  {
    "id": "397b6043-6e84-46e0-81ce-1cf02c8467dc",
    "text": "Which Major League Baseball stadium is known as 'The House That Ruth Built'?",
    "options": [
      "Fenway Park",
      "Wrigley Field",
      "Original Yankee Stadium",
      "Comiskey Park"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The original Yankee Stadium was nicknamed 'The House That Ruth Built' after Babe Ruth.",
    "detailedExplanation": "The original Yankee Stadium, which opened in 1923, earned the nickname 'The House That Ruth Built' because it was constructed largely due to the popularity and success of Babe Ruth, who had been acquired by the Yankees from the Boston Red Sox in 1920. Ruth's drawing power and legendary performances helped justify the construction of the new stadium. The original stadium served as the Yankees' home until 2008, when it was replaced by the new Yankee Stadium across the street.",
    "citationUrl": "https://en.wikipedia.org/wiki/Original_Yankee_Stadium",
    "citationTitle": "Wikipedia: Original Yankee Stadium"
  },
  {
    "id": "c75bd890-f474-48c8-840c-5c1c3eac6c1c",
    "text": "What type of animal is the San Diego Chicken, a famous sports mascot?",
    "options": [
      "Duck",
      "Rooster",
      "Chicken",
      "Turkey"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The San Diego Chicken is a chicken mascot, also known as the Famous Chicken.",
    "detailedExplanation": "The San Diego Chicken, also known as the Famous Chicken, is one of the most recognizable sports mascots in history. Created in 1974, the mascot was originally associated with the San Diego Padres baseball team and KGB radio station. The character, performed by Ted Giannoulas for many years, became famous for its comedic antics, elaborate costumes changes, and interactions with players and umpires. The San Diego Chicken helped establish the modern era of professional sports mascots.",
    "citationUrl": "https://en.wikipedia.org/wiki/San_Diego_Chicken",
    "citationTitle": "Wikipedia: San Diego Chicken"
  },
  {
    "id": "6e904140-5edd-4427-9ac0-a6eb27470b9c",
    "text": "At which stadium do the Green Bay Packers play their home games?",
    "options": [
      "Soldier Field",
      "Lambeau Field",
      "Metrodome",
      "Camp Randall"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The Green Bay Packers play at Lambeau Field, named after team founder Curly Lambeau.",
    "detailedExplanation": "Lambeau Field has been the home of the Green Bay Packers since 1957. The stadium is named after Curly Lambeau, who founded the Packers in 1919 and served as the team's first coach. Located in Green Bay, Wisconsin, Lambeau Field is known for its historic significance and the passionate fan base called 'Cheeseheads.' The stadium is famous for its frozen tundra conditions during winter games and has been the site of many legendary NFL moments, including multiple championship games.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lambeau_Field",
    "citationTitle": "Wikipedia: Lambeau Field"
  },
  {
    "id": "058e5fef-6568-423c-834c-83d6330d8c95",
    "text": "What is the name of the Chicago Bulls' mascot?",
    "options": [
      "Benny the Bull",
      "Billy the Bull",
      "Bruno the Bull",
      "Bullseye"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Benny the Bull is the official mascot of the Chicago Bulls NBA team.",
    "detailedExplanation": "Benny the Bull has been the official mascot of the Chicago Bulls since 1969, making him one of the oldest mascots in professional sports. Known for his red fur, energetic personality, and comedic skits during games, Benny the Bull performs at the United Center and has become an iconic figure in Chicago sports culture. The mascot is famous for his acrobatic stunts, dance routines, and interactions with fans, and has been recognized as one of the best mascots in professional sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Benny_the_Bull",
    "citationTitle": "Wikipedia: Benny the Bull"
  },
  {
    "id": "4c01aa7b-8a46-42fe-91bf-8aafb9ddbcc1",
    "text": "Which baseball stadium features the famous 'Green Monster' wall?",
    "options": [
      "Yankee Stadium",
      "Wrigley Field",
      "Fenway Park",
      "Camden Yards"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Fenway Park's left field wall is known as the Green Monster.",
    "detailedExplanation": "The Green Monster is the famous 37-foot-high left field wall at Fenway Park, home of the Boston Red Sox. Built in 1912, this distinctive green wall is located just 310 feet from home plate, making it one of the shortest distances to a foul pole in Major League Baseball. The wall has manual scoreboard operators and features unique angles that can turn routine fly balls into doubles or cause line drives to become singles. The Green Monster has become one of the most iconic features in all of baseball.",
    "citationUrl": "https://en.wikipedia.org/wiki/Green_Monster",
    "citationTitle": "Wikipedia: Green Monster"
  },
  {
    "id": "16782ab4-d24b-4f6c-ba65-439bba7b5b5e",
    "text": "What is the name of the University of Oregon's duck mascot?",
    "options": [
      "Puddles",
      "Donald",
      "The Oregon Duck",
      "Quacker"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The University of Oregon's mascot is simply called 'The Oregon Duck.'",
    "detailedExplanation": "The University of Oregon's mascot is officially known as 'The Oregon Duck,' though it's based on Donald Duck through a special agreement with Disney that began in the 1940s. The mascot represents the Oregon Ducks athletic teams and performs at football games in Autzen Stadium and basketball games in Matthew Knight Arena. The character has gone through various design changes over the years but has maintained its connection to the Disney character while serving as a symbol of Oregon athletics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oregon_Duck",
    "citationTitle": "Wikipedia: Oregon Duck"
  },
  {
    "id": "d9c54d6d-5f07-47d0-9e31-f07e29eb8e6e",
    "text": "At which stadium do the Pittsburgh Steelers play their home games?",
    "options": [
      "Three Rivers Stadium",
      "Heinz Field",
      "Acrisure Stadium",
      "Steel Stadium"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The Pittsburgh Steelers currently play at Acrisure Stadium, formerly known as Heinz Field.",
    "detailedExplanation": "The Pittsburgh Steelers have played at what is now called Acrisure Stadium since 2001. The stadium was originally named Heinz Field after the H.J. Heinz Company purchased naming rights, but was renamed Acrisure Stadium in 2022 when Acrisure, an insurance company, acquired the naming rights. Located on Pittsburgh's North Shore, the stadium replaced Three Rivers Stadium and features distinctive yellow seats that match the team's colors. The facility is known for its passionate fan base, called the 'Steeler Nation,' and the famous 'Terrible Towel' tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Acrisure_Stadium",
    "citationTitle": "Wikipedia: Acrisure Stadium"
  },
  {
    "id": "7bb238d3-a8ba-4401-94fe-f21e6045b364",
    "text": "What is the name of the Miami Heat's flaming basketball mascot?",
    "options": [
      "Burnie",
      "Blaze",
      "Flame",
      "Heat Wave"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Burnie is the Miami Heat's orange and red mascot who represents the team's fiery spirit.",
    "detailedExplanation": "Burnie has been the official mascot of the Miami Heat since the team's inception in 1988. Named after the team's fiery theme, Burnie is an anthropomorphic basketball-like character with orange fur and red accents. He's known for his high-energy performances during games and community appearances throughout South Florida, often incorporating fire-themed stunts and entertainment into his routines.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burnie_(mascot)",
    "citationTitle": "Wikipedia: Burnie (mascot)"
  },
  {
    "id": "0e0dca74-cc1d-4989-9b87-d9b728ad7760",
    "text": "Which NFL stadium is nicknamed 'The Frozen Tundra'?",
    "options": [
      "Soldier Field",
      "Lambeau Field",
      "Heinz Field",
      "Gillette Stadium"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Lambeau Field in Green Bay, Wisconsin is famously called 'The Frozen Tundra' due to its cold weather conditions.",
    "detailedExplanation": "Lambeau Field earned the nickname 'The Frozen Tundra' due to the harsh winter conditions that frequently occur during late-season games in Green Bay, Wisconsin. The term became particularly famous after the 1967 NFL Championship Game, known as the 'Ice Bowl,' where temperatures reached -15°F with wind chills of -48°F. The stadium's grass field and Wisconsin's brutal winters create challenging conditions that have become legendary in NFL lore.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lambeau_Field",
    "citationTitle": "Wikipedia: Lambeau Field"
  },
  {
    "id": "bdf6d9bb-580e-4558-a0e3-41a135a3da31",
    "text": "What animal is the Los Angeles Lakers' mascot?",
    "options": [
      "Eagle",
      "Bear",
      "Lion",
      "Panther"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The Lakers don't have an official mascot, but when they do use one, it's typically a lion.",
    "detailedExplanation": "The Los Angeles Lakers are one of the few major professional sports teams that doesn't have a regular official mascot. However, when mascots have been used for special events or promotions, they have typically featured lions, playing on the 'Lakers' name and Los Angeles connection. The team has historically relied more on celebrity fans, cheerleaders, and their winning tradition rather than a costumed mascot to energize crowds at their home games.",
    "citationUrl": "https://en.wikipedia.org/wiki/Los_Angeles_Lakers",
    "citationTitle": "Wikipedia: Los Angeles Lakers"
  },
  {
    "id": "7aea0a7d-657e-4d87-856b-1f165847a710",
    "text": "At which baseball stadium would you find the famous 'Ivy-covered outfield walls'?",
    "options": [
      "Fenway Park",
      "Wrigley Field",
      "Yankee Stadium",
      "Dodger Stadium"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Wrigley Field in Chicago is famous for its ivy-covered brick outfield walls.",
    "detailedExplanation": "Wrigley Field, home of the Chicago Cubs since 1916, features distinctive ivy-covered brick walls in the outfield that have become one of baseball's most iconic features. The ivy was planted in 1937 and consists primarily of Boston ivy and bittersweet vines. These walls create unique playing conditions, as balls can sometimes get lost in the ivy, leading to special ground rules. The ivy, along with the manual scoreboard, gives Wrigley Field its classic, old-time baseball atmosphere.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wrigley_Field",
    "citationTitle": "Wikipedia: Wrigley Field"
  },
  {
    "id": "2239151c-adde-47a1-935e-a991764091d6",
    "text": "What is the name of the Toronto Raptors' dinosaur mascot?",
    "options": [
      "Rex",
      "Raptor",
      "The Raptor",
      "Dino"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The Toronto Raptors' mascot is simply called 'The Raptor.'",
    "detailedExplanation": "The Raptor has been the official mascot of the Toronto Raptors since the team's inaugural season in 1995. As a purple anthropomorphic dinosaur, The Raptor fits perfectly with the team's prehistoric theme, which was inspired by the popularity of the movie Jurassic Park during the team's founding. The mascot is known for energetic performances, acrobatic dunks, and entertaining crowds during timeouts and halftime shows at Scotiabank Arena.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Raptor",
    "citationTitle": "Wikipedia: The Raptor"
  },
  {
    "id": "2e389f88-7e78-4c81-854d-947fac196039",
    "text": "Which MLB stadium features a swimming pool beyond the outfield fence?",
    "options": [
      "Minute Maid Park",
      "Chase Field",
      "Coors Field",
      "Marlins Park"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Chase Field in Arizona has a swimming pool area in right-center field.",
    "detailedExplanation": "Chase Field, home of the Arizona Diamondbacks, features a unique swimming pool and spa area located beyond the right-center field fence. This distinctive feature reflects Arizona's desert climate and resort culture. The pool area can accommodate about 35 people and serves as both a seating area and entertainment space during games. It's one of the most unusual stadium features in professional sports, allowing fans to literally take a dip while watching baseball.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chase_Field",
    "citationTitle": "Wikipedia: Chase Field"
  },
  {
    "id": "61e3a64f-45ab-4543-b26a-ff1cd04d11b2",
    "text": "What is the name of the Dallas Cowboys' mascot?",
    "options": [
      "Dallas",
      "Cowboy Joe",
      "Rowdy",
      "Star"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Rowdy is the official mascot of the Dallas Cowboys.",
    "detailedExplanation": "Rowdy has been the official mascot of the Dallas Cowboys since 1996. He's an anthropomorphic cowboy character who embodies the spirit of the American West and Texas culture. Rowdy appears at all Cowboys home games at AT&T Stadium, as well as community events throughout the Dallas-Fort Worth area. He's known for his energetic performances and his role in pumping up the crowd, working alongside the famous Dallas Cowboys Cheerleaders to create game-day excitement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rowdy_(Dallas_Cowboys)",
    "citationTitle": "Wikipedia: Rowdy (Dallas Cowboys)"
  },
  {
    "id": "bbaec44b-48c2-43a1-969e-a6fcf8b62e0a",
    "text": "Which soccer stadium is known as 'The Theatre of Dreams'?",
    "options": [
      "Wembley Stadium",
      "Old Trafford",
      "Emirates Stadium",
      "Anfield"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Old Trafford, home of Manchester United, is nicknamed 'The Theatre of Dreams.'",
    "detailedExplanation": "Old Trafford earned the nickname 'The Theatre of Dreams' due to the magical moments and legendary performances that have taken place there throughout Manchester United's history. The phrase was popularized by former United player and manager Sir Bobby Charlton. With a capacity of over 74,000, it's the largest club football stadium in the United Kingdom and has witnessed countless memorable matches, championship celebrations, and career-defining moments for some of football's greatest players.",
    "citationUrl": "https://en.wikipedia.org/wiki/Old_Trafford",
    "citationTitle": "Wikipedia: Old Trafford"
  },
  {
    "id": "1af5819a-0000-41fe-bf99-ab096efd26e0",
    "text": "What is the name of the New York Yankees' pinstriped mascot?",
    "options": [
      "Dandy",
      "Mr. Met",
      "Slider",
      "The Oriole Bird"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Dandy is the New York Yankees' mascot who wears the team's iconic pinstripes.",
    "detailedExplanation": "Dandy is the official mascot of the New York Yankees, introduced in 1979. He's a mustachioed character who wears the team's famous pinstriped uniform and Yankees cap. While the Yankees are known for their tradition and have historically been less mascot-focused than other teams, Dandy serves as their official representative at games and community events, embodying the team's classic image.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_Major_League_Baseball_mascots",
    "citationTitle": "Wikipedia: List of Major League Baseball mascots"
  },
  {
    "id": "3ebf1d14-ae9e-4557-961c-7d98c9048a11",
    "text": "Which NBA arena is nicknamed 'The Garden' and hosts the New York Knicks?",
    "options": [
      "Madison Square Garden",
      "Barclays Center",
      "United Center",
      "TD Garden"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Madison Square Garden is the home arena of the New York Knicks and is commonly called 'The Garden'.",
    "detailedExplanation": "Madison Square Garden, located in Manhattan, New York City, is one of the most famous arenas in sports and entertainment. Known simply as 'The Garden' or 'MSG', it has been the home of the New York Knicks since 1968 and also hosts the New York Rangers hockey team. The current building is actually the fourth venue to bear the Madison Square Garden name and is considered one of the most prestigious venues in professional sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Madison_Square_Garden",
    "citationTitle": "Wikipedia: Madison Square Garden"
  },
  {
    "id": "e10d30d0-278a-48fd-a642-aa3f9b72a326",
    "text": "What is the name of the Denver Broncos' horse mascot?",
    "options": [
      "Thunder",
      "Miles",
      "Blitz",
      "Stampede"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Miles is the Denver Broncos' official horse mascot, named after the 'Mile High City'.",
    "detailedExplanation": "Miles has been the Denver Broncos' mascot since 2001, replacing the previous mascot. He's an orange horse who represents the team's connection to Denver, which is known as the 'Mile High City' due to its elevation of approximately 5,280 feet above sea level. Miles performs at all Broncos home games at Empower Field at Mile High and makes appearances throughout the Denver community, embodying the spirit and energy of Broncos Country.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_National_Football_League_mascots",
    "citationTitle": "Wikipedia: List of National Football League mascots"
  },
  {
    "id": "9b8bce13-1cc4-45cc-b148-3bc426d526bb",
    "text": "Which MLB stadium features the famous 'Pesky's Pole' down the right field foul line?",
    "options": [
      "Yankee Stadium",
      "Fenway Park",
      "Wrigley Field",
      "Camden Yards"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Pesky's Pole is located at Fenway Park, named after former Red Sox player Johnny Pesky.",
    "detailedExplanation": "Pesky's Pole is the right field foul pole at Fenway Park, home of the Boston Red Sox. It's named after Johnny Pesky, a beloved Red Sox player from the 1940s and 1950s who later served as a coach and broadcaster for the team. The pole is only 302 feet from home plate, making it one of the shortest distances to a foul pole in Major League Baseball. Despite its proximity, hitting a home run that wraps around Pesky's Pole requires precise placement and has become one of Fenway's most distinctive features.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fenway_Park",
    "citationTitle": "Wikipedia: Fenway Park"
  }
]