[
  {
    "id": "46c28690-47d3-41a9-aad1-bc85c6226129",
    "text": "Which MLB stadium is famous for its 37-foot-tall left field wall known as 'The Green Monster'?",
    "options": [
      "Yankee Stadium",
      "Fenway Park",
      "Wrigley Field",
      "Camden Yards"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Fenway Park's Green Monster is one of baseball's most iconic features.",
    "detailedExplanation": "Fenway Park in Boston, home of the Red Sox since 1912, features the famous Green Monster - a 37-foot-2-inch tall left field wall that sits just 310 feet from home plate. This distinctive green wall has become one of the most recognizable features in all of baseball, dramatically affecting gameplay and serving as a backdrop for countless memorable moments in Red Sox history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fenway_Park",
    "citationTitle": "Wikipedia: Fenway Park"
  },
  {
    "id": "5f0bcf4d-5860-4468-807b-11dec3fbe677",
    "text": "What is the name of the Philadelphia Eagles' mascot, a large green bird known for his aggressive antics?",
    "options": [
      "Swoop",
      "Screech",
      "Soar",
      "Talon"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Swoop has been the Eagles' official mascot since 1996.",
    "detailedExplanation": "Swoop is the official mascot of the Philadelphia Eagles, introduced in 1996. Standing 6 feet tall with a 9-foot wingspan, this large green eagle is known for his energetic and sometimes controversial behavior at games. Swoop has been involved in various stunts and interactions with fans, embodying the passionate and sometimes aggressive spirit of Philadelphia sports culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Swoop_(mascot)",
    "citationTitle": "Wikipedia: Swoop (mascot)"
  },
  {
    "id": "ca76bf10-490a-4ec3-9508-e2992f8ebdfd",
    "text": "Which NBA arena is nicknamed 'The Mecca' and was the first to have a suspended scoreboard?",
    "options": [
      "Madison Square Garden",
      "Boston Garden",
      "The Forum",
      "Chicago Stadium"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Madison Square Garden is called 'The Mecca' and pioneered the center-hung scoreboard.",
    "detailedExplanation": "Madison Square Garden in New York City, home to the Knicks and Rangers, is reverently called 'The Mecca' due to its legendary status in basketball and hockey. The current arena, opened in 1968, was the first to feature a center-hung scoreboard suspended from the ceiling, revolutionizing arena design. This innovation provided better sightlines for fans and became the standard for modern arenas worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Madison_Square_Garden",
    "citationTitle": "Wikipedia: Madison Square Garden"
  },
  {
    "id": "4c64a781-e471-43c5-8d38-bb579a752be0",
    "text": "The San Diego Chicken, one of sports' most famous mascots, was originally created to promote which business?",
    "options": [
      "KFC restaurant",
      "Radio station KGB",
      "Padres season tickets",
      "Local car dealership"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The San Diego Chicken started as a promotional character for radio station KGB-FM.",
    "detailedExplanation": "The San Diego Chicken, performed by Ted Giannoulas, began in 1974 as a promotional stunt for San Diego radio station KGB-FM. Originally called the 'KGB Chicken,' Giannoulas was hired to wear the costume and hand out Easter eggs at the San Diego Zoo. The character became so popular at Padres games and other events that it evolved into one of the most recognizable and influential mascots in sports history, inspiring mascot culture across professional sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/San_Diego_Chicken",
    "citationTitle": "Wikipedia: San Diego Chicken"
  },
  {
    "id": "e5c04050-3a68-4798-ad21-fd8e4f813eb3",
    "text": "Which NFL stadium features a 142-foot-tall lighthouse and a ship in its design, paying homage to the team's pirate theme?",
    "options": [
      "Hard Rock Stadium",
      "TIAA Bank Field",
      "Raymond James Stadium",
      "Mercedes-Benz Stadium"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Raymond James Stadium in Tampa Bay features pirate-themed architecture including a replica ship.",
    "detailedExplanation": "Raymond James Stadium, home of the Tampa Bay Buccaneers, opened in 1998 with distinctive pirate-themed features that match the team's identity. The stadium includes a 103-foot replica pirate ship that fires cannons after every Buccaneers touchdown and field goal, along with a 142-foot-tall lighthouse structure. These unique architectural elements make it one of the most visually distinctive stadiums in the NFL, perfectly embodying the swashbuckling spirit of the Buccaneers brand.",
    "citationUrl": "https://en.wikipedia.org/wiki/Raymond_James_Stadium",
    "citationTitle": "Wikipedia: Raymond James Stadium"
  },
  {
    "id": "993fdaca-ae92-46d2-8882-63f17050a37d",
    "text": "What is the name of the Toronto Raptors' mascot, a purple dinosaur who is famous for his acrobatic dunks?",
    "options": [
      "Rex",
      "Dino",
      "The Raptor",
      "Spike"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Raptor has been entertaining fans with spectacular dunks since 1995.",
    "detailedExplanation": "The Raptor, the official mascot of the Toronto Raptors, has been a fan favorite since the team's inception in 1995. This purple velociraptor is renowned for his incredible acrobatic abilities, particularly his spectacular slam dunks from trampolines and elevated platforms during halftime shows. The Raptor has won multiple NBA Mascot of the Year awards and is considered one of the most athletic and entertaining mascots in professional sports, perfectly embodying the fierce and dynamic nature of his namesake dinosaur.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Raptor",
    "citationTitle": "Wikipedia: The Raptor"
  },
  {
    "id": "7c47c9a5-2ac2-4cb1-a3a4-ac95d3f8ffb2",
    "text": "Which MLB ballpark is built 24 feet below sea level and features a distinctive warehouse beyond right field?",
    "options": [
      "Tropicana Field",
      "Minute Maid Park",
      "Oriole Park at Camden Yards",
      "Marlins Park"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Camden Yards sits below sea level and features the iconic B&O Warehouse.",
    "detailedExplanation": "Oriole Park at Camden Yards in Baltimore, which opened in 1992, is built approximately 24 feet below sea level due to the natural topography of the area. The ballpark is famous for incorporating the historic B&O Warehouse, built in 1905, which sits beyond the right field wall and serves as the stadium's office building. This integration of historic architecture with modern stadium design helped revolutionize ballpark construction and inspired the 'retro ballpark' movement of the 1990s and 2000s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oriole_Park_at_Camden_Yards",
    "citationTitle": "Wikipedia: Oriole Park at Camden Yards"
  },
  {
    "id": "2bfa5868-ba0e-49c8-b639-397e1539242c",
    "text": "Gritty, the controversial orange mascot introduced in 2018, represents which NHL team?",
    "options": [
      "Philadelphia Flyers",
      "Anaheim Ducks",
      "Nashville Predators",
      "Vegas Golden Knights"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Gritty became the Philadelphia Flyers' mascot in 2018 and quickly gained internet fame.",
    "detailedExplanation": "Gritty was introduced as the Philadelphia Flyers' mascot in September 2018, becoming an instant internet sensation and cultural phenomenon. This orange, furry creature with googly eyes was initially met with mixed reactions but quickly became beloved for his chaotic energy and meme-worthy antics. Gritty's unconventional appearance and unpredictable behavior perfectly captured Philadelphia's reputation for passionate, sometimes unruly sports culture, making him one of the most recognizable mascots introduced in recent years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gritty",
    "citationTitle": "Wikipedia: Gritty"
  },
  {
    "id": "7f2bdf87-a8e9-44c9-aaf7-15ddb299159e",
    "text": "Which college football stadium is known as 'The Big House' and holds the record for the largest capacity in the United States?",
    "options": [
      "Ohio Stadium",
      "Michigan Stadium",
      "Beaver Stadium",
      "Tiger Stadium"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Michigan Stadium in Ann Arbor is nicknamed 'The Big House' and has a capacity of over 107,000.",
    "detailedExplanation": "Michigan Stadium, home to the University of Michigan Wolverines, is officially the largest stadium in the United States and the second-largest in the world by capacity. With an official capacity of 107,601, it has been nicknamed 'The Big House' since the 1980s. The stadium opened in 1927 and has undergone several expansions, with the most recent major renovation completed in 2010 that added luxury boxes and club seating while maintaining its iconic bowl design.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michigan_Stadium",
    "citationTitle": "Wikipedia: Michigan Stadium"
  },
  {
    "id": "3f4078b6-c372-47da-81f0-c396d083743d",
    "text": "The Phanatic, known for his wild green fur and long snout, has been the beloved mascot of which MLB team since 1978?",
    "options": [
      "Philadelphia Phillies",
      "Pittsburgh Pirates",
      "Miami Marlins",
      "Seattle Mariners"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Phillie Phanatic has been the Philadelphia Phillies' mascot since 1978 and is considered one of the best mascots in sports.",
    "detailedExplanation": "The Phillie Phanatic is widely regarded as one of the most successful mascots in professional sports. Created by Bonnie Erickson and Wayde Harrison of Harrison/Erickson, the same team that created Miss Piggy, the Phanatic made his debut on April 25, 1978. The green, furry creature with a cylindrical snout is known for his energetic antics, including riding his ATV around the field, dancing on dugouts, and playfully taunting opposing players and fans. The character has become so iconic that it's been featured in commercials, has its own merchandise line, and even appeared in movies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Phillie_Phanatic",
    "citationTitle": "Wikipedia: Phillie Phanatic"
  },
  {
    "id": "0f5a2e77-16d2-47cf-9674-883ea1020a84",
    "text": "Which NBA arena is famous for having the steepest upper deck in the league, earning it the nickname 'The Loudest Arena in the NBA'?",
    "options": [
      "Chesapeake Energy Arena",
      "Vivint Arena",
      "Golden 1 Center",
      "Wells Fargo Center"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Chesapeake Energy Arena (now Paycom Center) in Oklahoma City is known for its steep design that creates an incredibly loud atmosphere.",
    "detailedExplanation": "The Paycom Center (formerly Chesapeake Energy Arena) in Oklahoma City is renowned for its unique architectural design that creates one of the loudest environments in professional basketball. The arena's steep upper deck design places fans closer to the action and creates a 'wall of sound' effect that has been measured as one of the loudest in the NBA. This design was intentional, as the arena was built with acoustics in mind to give the Oklahoma City Thunder a significant home-court advantage. The steep seating bowl design has been credited with helping create some of the most intimidating atmospheres for visiting teams.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paycom_Center",
    "citationTitle": "Wikipedia: Paycom Center"
  },
  {
    "id": "88b3d285-1bd9-4ec8-a095-119ff314226f",
    "text": "What is the name of the University of Oregon's duck mascot, who is officially licensed from a famous entertainment company?",
    "options": [
      "Ducky",
      "Puddles",
      "The Oregon Duck",
      "Webfoot Willie"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Oregon Duck is the official mascot, which is actually Donald Duck licensed from Disney.",
    "detailedExplanation": "The University of Oregon's mascot is simply called 'The Oregon Duck,' but it's actually Donald Duck in a green and yellow Oregon uniform. This unique arrangement began in the 1940s when Disney allowed Oregon to use Donald Duck as their mascot, making it the only college in the nation with an official Disney character as their mascot. The licensing agreement with Disney has continued for decades, though it has faced some challenges over the years regarding commercial use and licensing fees. The duck mascot performs at football games and other athletic events, maintaining the classic Donald Duck appearance while sporting Oregon colors and uniforms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oregon_Duck",
    "citationTitle": "Wikipedia: Oregon Duck"
  },
  {
    "id": "c53de485-179d-46af-af5b-9b0a4b34c015",
    "text": "Which NHL arena features a massive 1,600-pound bronze bull statue outside and is known for having the longest consecutive sellout streak in sports history?",
    "options": [
      "United Center",
      "Scotiabank Arena",
      "TD Garden",
      "Amalie Arena"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The United Center in Chicago has a bronze bull statue and the Chicago Blackhawks had a record sellout streak there.",
    "detailedExplanation": "The United Center in Chicago is home to both the Bulls and Blackhawks and features a massive bronze statue of a bull outside the arena, commemorating the Chicago Bulls' championship era. The arena is also famous for the Chicago Blackhawks' incredible home sellout streak that lasted from 2008 to 2021, spanning over 500 consecutive regular season games. This streak was recognized as the longest in NHL history and one of the longest in professional sports. The United Center, which opened in 1994, has a capacity of over 20,000 for hockey games and has been the site of numerous championship celebrations for both teams.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Center",
    "citationTitle": "Wikipedia: United Center"
  },
  {
    "id": "8d12a0d2-d7aa-4a75-b8d4-8ab0daebe6f7",
    "text": "Benny the Bull, famous for his elaborate stunts and comedic performances, represents which NBA team and was the first NBA mascot to be inducted into the Mascot Hall of Fame?",
    "options": [
      "Chicago Bulls",
      "Miami Heat",
      "Milwaukee Bucks",
      "Atlanta Hawks"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Benny the Bull is the Chicago Bulls' mascot and was the first NBA mascot inducted into the Mascot Hall of Fame.",
    "detailedExplanation": "Benny the Bull has been the Chicago Bulls' mascot since 1969, making him one of the oldest mascots in professional sports. He gained particular fame during the Bulls' championship runs in the 1990s, when his performances became as entertaining as the games themselves. Benny is known for his elaborate stunts, including rappelling from the rafters, performing complex dance routines, and engaging in comedic skits during timeouts. His popularity and innovation in mascot performance led to him being the first NBA mascot inducted into the Mascot Hall of Fame. The character has been portrayed by several performers over the years, with each bringing their own athletic and comedic talents to the role.",
    "citationUrl": "https://en.wikipedia.org/wiki/Benny_the_Bull",
    "citationTitle": "Wikipedia: Benny the Bull"
  },
  {
    "id": "99c42666-ac24-4f25-a03e-587ee3f51079",
    "text": "Which MLB ballpark is built into a hillside and features McCovey Cove beyond right field, where home run balls land in the San Francisco Bay?",
    "options": [
      "Petco Park",
      "Oracle Park",
      "T-Mobile Park",
      "Coors Field"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Oracle Park (formerly AT&T Park) in San Francisco has McCovey Cove where 'splash hits' land in the bay.",
    "detailedExplanation": "Oracle Park, home of the San Francisco Giants, is famous for its unique location along San Francisco Bay. The ballpark features McCovey Cove beyond the right field wall, named after Giants legend Willie McCovey. Home runs hit into the cove are called 'splash hits' and have become a signature feature of the ballpark since it opened in 2000. The park is built into the hillside of the China Basin neighborhood, and kayakers often gather in the cove during games hoping to retrieve home run balls. The short right field dimension (309 feet down the line) and the 24-foot high wall make splash hits a realistic possibility, adding excitement to every at-bat by left-handed power hitters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oracle_Park",
    "citationTitle": "Wikipedia: Oracle Park"
  },
  {
    "id": "21635979-0542-4573-ba25-a5cd0c7b11af",
    "text": "Which NFL stadium is built partially underground and features a distinctive white fabric roof designed to resemble a Teflon-coated fiberglass tent?",
    "options": [
      "U.S. Bank Stadium",
      "Mercedes-Benz Stadium",
      "BC Place",
      "Hubert H. Humphrey Metrodome"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "U.S. Bank Stadium in Minneapolis has a distinctive translucent roof and is partially built into the ground.",
    "detailedExplanation": "U.S. Bank Stadium, home of the Minnesota Vikings, opened in 2016 and features one of the most distinctive roof designs in professional sports. The stadium's translucent ETFE (ethylene tetrafluoroethylene) roof is designed to withstand Minnesota's harsh winters while allowing natural light to filter through. The building is partially constructed below ground level to reduce its visual impact on the Minneapolis skyline and to help with climate control. The roof's angular design and translucent panels create a unique aesthetic that changes appearance throughout the day as light conditions change. This innovative design has made it a popular venue for major events, including Super Bowl LII and the NCAA Final Four.",
    "citationUrl": "https://en.wikipedia.org/wiki/U.S._Bank_Stadium",
    "citationTitle": "Wikipedia: U.S. Bank Stadium"
  },
  {
    "id": "01ce5bca-7cfc-47c0-ba0f-4def4b76e71e",
    "text": "Which Major League Baseball stadium features a manual scoreboard operated by workers inside the wall and a ivy-covered outfield wall that can create unique ground rules?",
    "options": [
      "Fenway Park",
      "Wrigley Field",
      "Yankee Stadium",
      "Dodger Stadium"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Wrigley Field features both a manually operated scoreboard and ivy-covered brick walls in the outfield.",
    "detailedExplanation": "Wrigley Field, home of the Chicago Cubs since 1914, is famous for its manually operated scoreboard that requires workers to change numbers by hand from inside the wall structure. The stadium's iconic ivy-covered brick walls in the outfield create unique ground rules - if a ball gets stuck in the ivy, it's ruled a ground-rule double. These features make Wrigley one of baseball's most distinctive and traditional ballparks.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wrigley_Field",
    "citationTitle": "Wikipedia: Wrigley Field"
  },
  {
    "id": "7c72e6f2-1132-476c-a046-f45bcc017f8f",
    "text": "Which NFL team's mascot is actually a real live animal that flies around the stadium during games and has its own custom perch in the end zone?",
    "options": [
      "Atlanta Falcons",
      "Baltimore Ravens",
      "Philadelphia Eagles",
      "Seattle Seahawks"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Atlanta Falcons have a live red-tailed hawk named 'Freddie Falcon' that performs flight demonstrations at Mercedes-Benz Stadium.",
    "detailedExplanation": "The Atlanta Falcons employ a live red-tailed hawk as their official live mascot, which performs flights around Mercedes-Benz Stadium during pregame ceremonies and special events. The hawk has a custom-built perch in the end zone and is handled by professional falconers. This makes the Falcons unique among NFL teams for using an actual bird of prey as part of their game-day experience, complementing their costumed mascot 'Freddie Falcon.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Atlanta_Falcons",
    "citationTitle": "Wikipedia: Atlanta Falcons"
  },
  {
    "id": "4c9f844f-9454-42f3-b56e-6dba66642e03",
    "text": "What is the name of the Seattle Mariners' mascot, a large green creature known for riding his ATV around the warning track and shooting t-shirts from his snout?",
    "options": [
      "The Mariner Moose",
      "Sluggerrr",
      "Slider",
      "Orbit"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "The Mariner Moose has been the Seattle Mariners' mascot since 1990 and is famous for his ATV rides and t-shirt cannon antics.",
    "detailedExplanation": "The Mariner Moose has been entertaining Seattle Mariners fans at T-Mobile Park since 1990. Despite his name suggesting he's a moose, his appearance is more of a green furry creature. He's become famous for his high-energy antics including riding an ATV around the warning track during games and shooting t-shirts from a cannon built into his snout. The Moose has also gained notoriety for various on-field mishaps and stunts, including a famous incident where he broke his ankle while rollerblading during a game.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Mariner_Moose",
    "citationTitle": "Wikipedia: The Mariner Moose"
  },
  {
    "id": "3ddf3691-ba32-4f63-92f1-1c4736ee69e7",
    "text": "Which college basketball arena is known as 'The Phog' and is named after the coach who is considered the 'Father of Basketball Coaching'?",
    "options": [
      "Cameron Indoor Stadium",
      "Rupp Arena",
      "Allen Fieldhouse",
      "Pauley Pavilion"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Allen Fieldhouse at the University of Kansas is nicknamed 'The Phog' after legendary coach Phog Allen.",
    "detailedExplanation": "Allen Fieldhouse at the University of Kansas is nicknamed 'The Phog' in honor of Forrest Clare 'Phog' Allen, who coached the Jayhawks for 39 years and is considered the 'Father of Basketball Coaching.' Allen was a student of basketball's inventor, James Naismith, and went on to coach legendary players and coaches. The arena, which opened in 1955, is renowned for its incredible atmosphere and acoustics, with its steep seating bowl creating one of the loudest environments in college basketball. The fieldhouse has been called 'the loudest college arena in the country' and regularly ranks among the top college basketball venues.",
    "citationUrl": "https://en.wikipedia.org/wiki/Allen_Fieldhouse",
    "citationTitle": "Wikipedia: Allen Fieldhouse"
  }
]