[
  {
    "id": "5a56cd65-2d8b-4681-826b-2662414774e2",
    "text": "Which MLB stadium is famous for its 37-foot-high left field wall known as the 'Green Monster'?",
    "options": [
      "Yankee Stadium",
      "Fenway Park",
      "Wrigley Field",
      "Camden Yards"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Fenway Park's Green Monster is the iconic 37-foot-high left field wall.",
    "detailedExplanation": "Fenway Park, home of the Boston Red Sox since 1912, features the famous Green Monster - a 37-foot-high left field wall that sits just 310 feet from home plate. Originally built to prevent fans from watching games for free from the street, the Green Monster has become one of baseball's most recognizable features. The wall creates unique playing conditions and has been both friend and foe to countless batters throughout baseball history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fenway_Park",
    "citationTitle": "Wikipedia: Fenway Park"
  },
  {
    "id": "b5f2846e-c84f-474a-a3b3-f3b2b0037a69",
    "text": "What type of animal is Benny the Bull, mascot of the Chicago Bulls?",
    "options": [
      "Buffalo",
      "Bull",
      "Cow",
      "Ox"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Benny the Bull is a bull mascot, matching the Chicago Bulls team name.",
    "detailedExplanation": "Benny the Bull has been the Chicago Bulls' mascot since 1969, making him one of the oldest mascots in professional sports. Known for his energetic performances and comedic antics at United Center games, Benny has won multiple Mascot of the Year awards and is considered one of the most entertaining mascots in the NBA. His popularity extends beyond basketball, making him a cultural icon in Chicago sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Benny_the_Bull",
    "citationTitle": "Wikipedia: Benny the Bull"
  },
  {
    "id": "acb0403f-c7a8-4c24-b97d-31419771e122",
    "text": "Which NFL stadium has a retractable roof and is known as 'Jerry World'?",
    "options": [
      "Mercedes-Benz Stadium",
      "AT&T Stadium",
      "Lucas Oil Stadium",
      "Ford Field"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "AT&T Stadium, home of the Dallas Cowboys, is nicknamed 'Jerry World' after owner Jerry Jones.",
    "detailedExplanation": "AT&T Stadium in Arlington, Texas, opened in 2009 as the new home of the Dallas Cowboys. Nicknamed 'Jerry World' after team owner Jerry Jones, the stadium cost $1.15 billion to build and features a retractable roof, massive HD video boards, and can seat over 100,000 fans with standing room. The stadium has hosted Super Bowls, college football championships, and numerous other major events, establishing itself as one of the premier sports venues in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/AT%26T_Stadium",
    "citationTitle": "Wikipedia: AT&T Stadium"
  },
  {
    "id": "87dc4e33-7fbd-487c-8899-8546384ca042",
    "text": "What is the name of the San Diego Padres' mascot, a green and brown creature?",
    "options": [
      "The Friar",
      "Swinging Friar",
      "San Diego Chicken",
      "Paws"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Swinging Friar is the official mascot of the San Diego Padres.",
    "detailedExplanation": "The Swinging Friar has been associated with the San Diego Padres since the team's inception in 1969, though the mascot has undergone several redesigns over the years. The current version features a friendly friar in brown and tan robes, reflecting the team's name which honors the Spanish Franciscan friars who founded San Diego. The mascot performs at Petco Park and represents the team's connection to San Diego's rich Spanish colonial history.",
    "citationUrl": "https://en.wikipedia.org/wiki/San_Diego_Padres",
    "citationTitle": "Wikipedia: San Diego Padres"
  },
  {
    "id": "84d9de3e-f3ca-49bc-997a-de303ae79b71",
    "text": "Which NBA arena is known for having the steepest upper deck in professional basketball?",
    "options": [
      "Madison Square Garden",
      "Target Center",
      "Chesapeake Energy Arena",
      "State Farm Arena"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Target Center in Minneapolis has the steepest upper deck seating in the NBA.",
    "detailedExplanation": "Target Center, home of the Minnesota Timberwolves since 1990, is renowned for having the steepest upper deck in the NBA. The arena's design creates an intimidating atmosphere for visiting teams, with the upper level seats positioned at such a sharp angle that fans are practically on top of the action. This unique architectural feature has made Target Center one of the more distinctive venues in professional basketball, though it has also sparked some safety discussions over the years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Target_Center",
    "citationTitle": "Wikipedia: Target Center"
  },
  {
    "id": "d768ee3b-47e3-4235-996a-3dc90d66c9e2",
    "text": "What is the name of the Seattle Seahawks' mascot, a large bird of prey?",
    "options": [
      "Blitz",
      "Taima",
      "Boom",
      "Striker"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Blitz is the official mascot of the Seattle Seahawks NFL team.",
    "detailedExplanation": "Blitz has been the Seattle Seahawks' official mascot since 1998, representing the team at Lumen Field and community events throughout the Pacific Northwest. The large blue and green bird mascot is known for his high-energy performances and crowd interaction during games. Blitz complements the team's use of real birds of prey in pre-game ceremonies, helping to reinforce the Seahawks' connection to their avian namesake and the region's wildlife.",
    "citationUrl": "https://en.wikipedia.org/wiki/Seattle_Seahawks",
    "citationTitle": "Wikipedia: Seattle Seahawks"
  },
  {
    "id": "7b52b542-5f1a-43b3-b89f-105510cd7921",
    "text": "Which MLB stadium is located at the highest altitude above sea level?",
    "options": [
      "Coors Field",
      "Chase Field",
      "Kauffman Stadium",
      "Minute Maid Park"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Coors Field in Denver sits at 5,200 feet above sea level, the highest in MLB.",
    "detailedExplanation": "Coors Field, home of the Colorado Rockies since 1995, sits at 5,200 feet above sea level in Denver, Colorado, making it the highest-altitude ballpark in Major League Baseball. This elevation significantly affects gameplay, as baseballs travel farther in the thin air, leading to more home runs. To compensate, the Rockies store baseballs in a humidor to reduce their flight distance. The stadium's 20th row is marked with purple seats to indicate the 'mile-high' point of exactly 5,280 feet above sea level.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coors_Field",
    "citationTitle": "Wikipedia: Coors Field"
  },
  {
    "id": "ae7498b7-0a01-45d3-9148-619ee940ce3b",
    "text": "What is the name of the Philadelphia Flyers' notorious orange mascot known for his wild antics and mischievous behavior?",
    "options": [
      "Gritty",
      "Phanatic",
      "Swoop",
      "Franklin"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Gritty is the Philadelphia Flyers' orange, furry mascot who debuted in 2018.",
    "detailedExplanation": "Gritty became an internet sensation when he was introduced as the Philadelphia Flyers' mascot in September 2018. The orange, furry creature with googly eyes quickly gained fame for his chaotic energy and unpredictable behavior at games. Despite initial mixed reactions, Gritty has become beloved by fans and even gained political and cultural significance beyond hockey, representing Philadelphia's gritty spirit.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gritty",
    "citationTitle": "Wikipedia: Gritty"
  },
  {
    "id": "d03295b9-20fb-4732-bbe1-85b969ee2676",
    "text": "Which soccer stadium is known as 'The Theatre of Dreams' and serves as the home ground for Manchester United?",
    "options": [
      "Emirates Stadium",
      "Old Trafford",
      "Stamford Bridge",
      "Anfield"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Old Trafford is Manchester United's home stadium, nicknamed 'The Theatre of Dreams' by Bobby Charlton.",
    "detailedExplanation": "Old Trafford has been Manchester United's home since 1910 and is one of the most iconic football stadiums in the world. The nickname 'The Theatre of Dreams' was coined by legendary Manchester United player Bobby Charlton, reflecting the stadium's reputation for hosting memorable matches and nurturing football dreams. With a capacity of over 74,000, it's the largest club stadium in the United Kingdom and has witnessed countless historic moments in football history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Old_Trafford",
    "citationTitle": "Wikipedia: Old Trafford"
  },
  {
    "id": "64004d64-fc59-47f3-93a8-611b9226be20",
    "text": "What is the name of the University of Oregon's duck mascot that was inspired by Donald Duck?",
    "options": [
      "Puddles",
      "The Oregon Duck",
      "Quackers",
      "Webfoot Willie"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Oregon Duck is the official mascot of the University of Oregon, based on Donald Duck through a licensing agreement with Disney.",
    "detailedExplanation": "The University of Oregon's mascot is simply called 'The Oregon Duck' and has a unique connection to Disney's Donald Duck. The relationship began in the 1940s when Oregon's athletic director met Walt Disney at a party, leading to a handshake agreement that allowed Oregon to use Donald Duck's likeness. This makes Oregon one of the few schools with a Disney-licensed mascot. The duck costume closely resembles Donald Duck and has become one of the most recognizable mascots in college sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oregon_Duck",
    "citationTitle": "Wikipedia: Oregon Duck"
  },
  {
    "id": "541689a1-854f-432d-af4c-3e56e082b097",
    "text": "Which Major League Baseball stadium features a manual scoreboard and ivy-covered outfield walls?",
    "options": [
      "Yankee Stadium",
      "Wrigley Field",
      "Camden Yards",
      "Petco Park"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Wrigley Field is famous for its ivy-covered brick walls and manual scoreboard operated by hand.",
    "detailedExplanation": "Wrigley Field, home of the Chicago Cubs since 1916, is one of baseball's most historic ballparks. Its distinctive ivy-covered outfield walls were planted in 1937 and have become an iconic feature, sometimes affecting gameplay when balls get stuck in the ivy. The manual scoreboard, also installed in 1937, is still operated by hand from inside the scoreboard structure. These features, along with the ballpark's neighborhood setting in Wrigleyville, make it one of baseball's most beloved and nostalgic venues.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wrigley_Field",
    "citationTitle": "Wikipedia: Wrigley Field"
  },
  {
    "id": "22e14c2c-8309-4cd8-b3a0-157d28052db1",
    "text": "What is the name of the Miami Heat's mascot, a red creature known for his acrobatic dunks and entertainment?",
    "options": [
      "Burnie",
      "Blaze",
      "Scorch",
      "Flame"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Burnie is the Miami Heat's mascot, named after the team's original arena location on Biscayne Boulevard.",
    "detailedExplanation": "Burnie has been the Miami Heat's mascot since the team's inception in 1988. The orange and red furry character gets his name from the team's original home arena location on Biscayne Boulevard. Burnie is known for his high-energy performances, acrobatic dunks from trampolines, and elaborate entertainment segments during games. He's considered one of the NBA's most athletic and entertaining mascots, often performing dangerous stunts and interactive comedy routines that have made him a fan favorite in Miami.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burnie_(mascot)",
    "citationTitle": "Wikipedia: Burnie (mascot)"
  },
  {
    "id": "357b5bcb-6841-4fc0-ba0b-4c78777d7ea9",
    "text": "Which NFL stadium is known for its 'Lambeau Leap' tradition where players jump into the stands after scoring?",
    "options": [
      "Soldier Field",
      "Lambeau Field",
      "U.S. Bank Stadium",
      "Ford Field"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Lambeau Field is where the 'Lambeau Leap' tradition began, with Green Bay Packers players jumping into the stands.",
    "detailedExplanation": "Lambeau Field, home of the Green Bay Packers since 1957, is famous for the 'Lambeau Leap' celebration. This tradition began in 1993 when safety LeRoy Butler spontaneously jumped into the stands after scoring a touchdown, and fans lifted him up in celebration. The tradition has continued with Packers players regularly performing the leap after scoring touchdowns at home games. The stadium's design, with lower seating close to the field, makes this celebration possible and has become one of the most iconic traditions in professional sports.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lambeau_Field",
    "citationTitle": "Wikipedia: Lambeau Field"
  },
  {
    "id": "dd387df6-41c9-4020-8895-eee9629e09c2",
    "text": "What is the name of the Dallas Mavericks' horse mascot that was introduced in 2018?",
    "options": [
      "Mavs Man",
      "Champ",
      "Thunder",
      "Spirit"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Champ is the Dallas Mavericks' horse mascot that debuted during the 2018-19 NBA season.",
    "detailedExplanation": "Champ was introduced as the Dallas Mavericks' official mascot in October 2018, ending the team's long period without a mascot. The blue horse character was designed to represent the 'Maverick' spirit - originally referring to unbranded horses in the American West. Champ performs various entertainment routines during games and community events, and his introduction marked the first time in over a decade that the Mavericks had an official mascot, as team owner Mark Cuban had previously been opposed to having one.",
    "citationUrl": "https://en.wikipedia.org/wiki/Champ_(mascot)",
    "citationTitle": "Wikipedia: Champ (mascot)"
  },
  {
    "id": "9a256382-e63a-4e16-9b90-949d6fa6cb86",
    "text": "Which tennis venue is famous for its retractable roof on Centre Court and is known as the 'Home of Tennis'?",
    "options": [
      "Roland Garros",
      "Wimbledon",
      "Flushing Meadows",
      "Melbourne Park"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Wimbledon's Centre Court features a retractable roof installed in 2009, and the venue is known as the 'Home of Tennis'.",
    "detailedExplanation": "The All England Lawn Tennis and Croquet Club at Wimbledon is often called the 'Home of Tennis' as it hosts the oldest tennis tournament in the world, dating back to 1877. Centre Court received its retractable roof in 2009, allowing play to continue during London's frequent rain showers. The roof can close in about 10 minutes and has been crucial for maintaining the tournament schedule. Wimbledon's traditions, including the all-white dress code and grass courts, along with its historic significance, cement its status as tennis's most prestigious venue.",
    "citationUrl": "https://en.wikipedia.org/wiki/Centre_Court",
    "citationTitle": "Wikipedia: Centre Court"
  },
  {
    "id": "c552ef3f-26a8-4162-b4c9-e5bef962866c",
    "text": "Which NHL mascot was infamously arrested in 2001 for allegedly assaulting a fan during a game?",
    "options": [
      "Harvey the Hound",
      "Blades the Bruin",
      "Iceburgh",
      "Wild Wing"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Harvey the Hound of the Calgary Flames was arrested in 2001 for allegedly assaulting a fan.",
    "detailedExplanation": "Harvey the Hound, the mascot of the Calgary Flames, became the center of controversy in 2001 when he was arrested for allegedly assaulting a fan during a game against the Edmonton Oilers. The incident involved Harvey supposedly grabbing and shaking a fan who was heckling him. This unusual event made headlines as it was extremely rare for a sports mascot to face criminal charges for their in-game behavior.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harvey_the_Hound",
    "citationTitle": "Wikipedia: Harvey the Hound"
  },
  {
    "id": "1cfaf788-d8ea-4277-a80a-d39f1ac94ebc",
    "text": "What unique feature does the Detroit Tigers' Comerica Park have in its outfield that pays tribute to the team's history?",
    "options": [
      "A tiger statue that roars after home runs",
      "Retired number monuments",
      "A carousel with tigers",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Comerica Park features all three: roaring tiger statues, retired number monuments, and a carousel.",
    "detailedExplanation": "Comerica Park, home of the Detroit Tigers since 2000, is known for its unique outfield features that celebrate the team's history and Detroit's heritage. The park includes tiger statues that have glowing eyes and roar after Tigers home runs, a series of statues honoring Tigers greats along the concourse, and a hand-carved carousel featuring 30 tigers that children can ride. These features make Comerica Park one of the most family-friendly and distinctive ballparks in Major League Baseball.",
    "citationUrl": "https://en.wikipedia.org/wiki/Comerica_Park",
    "citationTitle": "Wikipedia: Comerica Park"
  },
  {
    "id": "6e865b3b-a6fd-4383-915f-8c48974559e3",
    "text": "Which college football stadium is known as 'Death Valley' and holds over 102,000 fans?",
    "options": [
      "LSU's Tiger Stadium",
      "Clemson's Memorial Stadium",
      "Alabama's Bryant-Denny Stadium",
      "Auburn's Jordan-Hare Stadium"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "LSU's Tiger Stadium is nicknamed 'Death Valley' and has a capacity of over 102,000.",
    "detailedExplanation": "LSU's Tiger Stadium in Baton Rouge, Louisiana, is famously known as 'Death Valley' due to its intimidating atmosphere and the difficulty visiting teams face when playing there. With a current capacity of 102,321, it ranks among the largest stadiums in college football. The nickname was coined in the 1960s when the Tigers had a dominant home record. Interestingly, Clemson's Memorial Stadium also uses the 'Death Valley' nickname, leading to a friendly rivalry over the moniker between the two schools.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tiger_Stadium_(LSU)",
    "citationTitle": "Wikipedia: Tiger Stadium (LSU)"
  },
  {
    "id": "e2efee26-5f78-4b3e-b2e8-48063cd6633f",
    "text": "What is the name of the Pittsburgh Penguins' mascot who was introduced in 1992 and is known for his mischievous personality?",
    "options": [
      "Iceburgh",
      "Slapshot",
      "Chilly",
      "Freeze"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Iceburgh is the Pittsburgh Penguins' mascot, introduced in 1992.",
    "detailedExplanation": "Iceburgh has been the official mascot of the Pittsburgh Penguins since 1992. Named after Pittsburgh's nickname 'The Steel City' and the famous Iceberg, this penguin mascot is known for his playful and sometimes mischievous antics during games at PPG Paints Arena. Iceburgh entertains fans with various skits, dance routines, and interactions throughout Penguins home games, and has become an integral part of the team's fan experience over his three-decade tenure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iceburgh",
    "citationTitle": "Wikipedia: Iceburgh"
  },
  {
    "id": "763a3efd-dca8-490e-9fee-dc0582427811",
    "text": "Which NBA arena is famous for its unusual parquet floor pattern made of red oak?",
    "options": [
      "Madison Square Garden",
      "TD Garden",
      "United Center",
      "Staples Center"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "TD Garden, home of the Boston Celtics, features the famous parquet floor.",
    "detailedExplanation": "TD Garden in Boston is renowned for its distinctive parquet floor, which has been a trademark of the Boston Celtics since 1946. The floor is made of red oak arranged in a square parquet pattern, creating a unique visual appearance that is instantly recognizable. The original floor was installed at the old Boston Garden due to post-World War II material shortages, but the distinctive look became so iconic that it was preserved when the team moved to TD Garden in 1995. The parquet floor has become synonymous with Celtics basketball and their storied history.",
    "citationUrl": "https://en.wikipedia.org/wiki/TD_Garden",
    "citationTitle": "Wikipedia: TD Garden"
  }
]