[
  {
    "id": "5b74ad93-b0cc-4d4a-849d-9258fdf8546d",
    "text": "In 'Citizen Kane' (1941), what was the name of Charles Foster Kane's childhood sled that becomes a central symbol in the film?",
    "options": [
      "Rosebud",
      "Lightning",
      "Thunder",
      "Snowfall"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Rosebud was the name painted on Kane's childhood sled, revealed at the film's end.",
    "detailedExplanation": "The mystery of 'Rosebud' drives the narrative of Citizen Kane, with reporters trying to uncover the meaning of Kane's final word. The film's famous ending reveals that Rosebud was simply the brand name painted on Kane's beloved childhood sled, representing his lost innocence and the simple happiness he could never recapture despite his wealth and power. This revelation is considered one of cinema's most powerful endings.",
    "citationUrl": "https://en.wikipedia.org/wiki/Citizen_Kane",
    "citationTitle": "Wikipedia: Citizen Kane"
  },
  {
    "id": "e3383667-0aa3-4430-856c-78537839161c",
    "text": "Which 1944 film noir starring Barbara Stanwyck and Fred MacMurray was based on James M. Cain's novella and features one of cinema's most famous femme fatales?",
    "options": [
      "The Postman Always Rings Twice",
      "Double Indemnity",
      "Mildred Pierce",
      "The Big Sleep"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Double Indemnity featured Stanwyck as Phyllis Dietrichson, manipulating MacMurray's insurance salesman into murder.",
    "detailedExplanation": "Double Indemnity is considered a masterpiece of film noir, directed by Billy Wilder and co-written by Wilder and Raymond Chandler. Barbara Stanwyck's portrayal of Phyllis Dietrichson, who seduces insurance salesman Walter Neff (Fred MacMurray) into killing her husband for the insurance money, established the template for the classic film noir femme fatale. The film was nominated for seven Academy Awards and is preserved in the National Film Registry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Double_Indemnity",
    "citationTitle": "Wikipedia: Double Indemnity"
  },
  {
    "id": "3d39b783-1720-4aff-aceb-bc1426dd5b91",
    "text": "What was the original title of the 1942 film that became 'Casablanca' when it was adapted from an unproduced stage play?",
    "options": [
      "Everybody Comes to Rick's",
      "Cafe Americain",
      "Letters of Transit",
      "Here's Looking at You"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Everybody Comes to Rick's' was the original play title before being adapted into Casablanca.",
    "detailedExplanation": "Murray Burnett and Joan Alison wrote the unproduced stage play 'Everybody Comes to Rick's' in 1940, which Warner Bros. purchased for $20,000 in 1942. The play was set in Rick's Cafe Americain in Casablanca and featured many of the same characters that would appear in the film. The movie's title was changed to simply 'Casablanca' to emphasize the exotic location and wartime setting that would resonate with audiences during World War II.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casablanca_(film)",
    "citationTitle": "Wikipedia: Casablanca (film)"
  },
  {
    "id": "f86b7797-68c0-4234-b259-39aef78dc16b",
    "text": "In 'Sunset Boulevard' (1950), which real-life silent film star played the faded actress Norma Desmond?",
    "options": [
      "Mary Pickford",
      "Pola Negri",
      "Gloria Swanson",
      "Theda Bara"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Gloria Swanson, herself a major silent film star, played the delusional former silent screen queen Norma Desmond.",
    "detailedExplanation": "Gloria Swanson's casting as Norma Desmond was particularly poignant as she had been one of the biggest stars of the silent era, making the role deeply personal and meta-textual. Director Billy Wilder initially considered several other former silent stars, but Swanson's performance became legendary, earning her an Academy Award nomination. The film's famous line 'I'm ready for my close-up, Mr. DeMille' was delivered to the real Cecil B. DeMille, who appeared as himself and had actually directed Swanson in several silent films.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sunset_Boulevard_(film)",
    "citationTitle": "Wikipedia: Sunset Boulevard (film)"
  },
  {
    "id": "e976c35a-6b82-4d48-9767-aa5de7470643",
    "text": "Which cinematographer, known for his deep focus technique, shot both 'Citizen Kane' and 'The Best Years of Our Lives'?",
    "options": [
      "James Wong Howe",
      "Gregg Toland",
      "Karl Freund",
      "Arthur Miller"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Gregg Toland pioneered the deep focus technique that became signature to both films' visual style.",
    "detailedExplanation": "Gregg Toland revolutionized cinematography with his innovative deep focus technique, which allowed multiple planes of action to remain in sharp focus simultaneously. This technique was particularly notable in Citizen Kane, where foreground and background elements could be seen clearly in the same shot, enhancing the film's dramatic impact. Toland won the Academy Award for Best Cinematography for The Best Years of Our Lives in 1946. His collaboration with Orson Welles on Citizen Kane is considered one of the most important director-cinematographer partnerships in film history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gregg_Toland",
    "citationTitle": "Wikipedia: Gregg Toland"
  },
  {
    "id": "2ce73ca5-235a-4503-b50f-7cb99d623090",
    "text": "In 'The Treasure of the Sierra Madre' (1948), what is the famous line spoken by Gold Hat, the Mexican bandit leader?",
    "options": [
      "We don't need no stinking badges!",
      "Badges? We ain't got no badges!",
      "We don't got to show you no stinking badges!",
      "Badges? We don't need no stinking badges!"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The actual line is 'Badges? We ain't got no badges! We don't need no badges! I don't have to show you any stinking badges!'",
    "detailedExplanation": "This line, spoken by Alfonso Bedoya as Gold Hat, has become one of the most misquoted lines in film history. The actual dialogue is longer and slightly different from how it's commonly remembered: 'Badges? We ain't got no badges! We don't need no badges! I don't have to show you any stinking badges!' The line has been parodied countless times in later films and popular culture, often in the shortened form 'We don't need no stinking badges!' The film won three Academy Awards, including Best Director and Best Supporting Actor for Walter Huston.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Treasure_of_the_Sierra_Madre_(film)",
    "citationTitle": "Wikipedia: The Treasure of the Sierra Madre (film)"
  },
  {
    "id": "d6905d76-9833-4578-ad0d-a4452ab04891",
    "text": "Which 1946 film features the famous quote 'Every time a bell rings, an angel gets his wings' and was initially a box office disappointment?",
    "options": [
      "The Bishop's Wife",
      "It's a Wonderful Life",
      "Miracle on 34th Street",
      "The Best Years of Our Lives"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "It's a Wonderful Life contains this famous quote and initially failed at the box office despite later becoming a Christmas classic.",
    "detailedExplanation": "Frank Capra's It's a Wonderful Life was initially considered a commercial failure, losing money for RKO Pictures despite receiving five Academy Award nominations. The film's reputation was rehabilitated decades later when it entered the public domain in the 1970s, leading to frequent television broadcasts that made it a beloved Christmas classic. The quote about angels getting wings is spoken by Zuzu Bailey, George Bailey's daughter, and represents the film's themes of faith, redemption, and the value of individual lives in the community.",
    "citationUrl": "https://en.wikipedia.org/wiki/It%27s_a_Wonderful_Life",
    "citationTitle": "Wikipedia: It's a Wonderful Life"
  },
  {
    "id": "84ff7e80-0954-49a4-8a00-4e34f3c785a0",
    "text": "What was the name of the production company co-founded by Charlie Chaplin, Mary Pickford, Douglas Fairbanks, and D.W. Griffith in 1919?",
    "options": [
      "Independent Artists Corporation",
      "United Artists",
      "First National Pictures",
      "Liberty Films"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "United Artists was formed to give these major stars and directors more control over their films and profits.",
    "detailedExplanation": "United Artists was founded in 1919 by four of the most powerful figures in early Hollywood who wanted greater artistic control and a larger share of profits from their films. When a reporter heard about the formation of the company, he allegedly quipped that 'the inmates have taken over the asylum,' referring to the unprecedented move of talent forming their own distribution company. The company's motto was 'The Entertainment Company,' and it revolutionized the film industry by giving creators more autonomy. United Artists became one of the major Hollywood studios and continues to operate today.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_Artists",
    "citationTitle": "Wikipedia: United Artists"
  },
  {
    "id": "f9f134d7-b5c1-4e7a-821a-9f7cadf9ab91",
    "text": "In 'Casablanca' (1942), what was the original name of Rick's Café Américain in the unproduced play 'Everybody Comes to Rick's'?",
    "options": [
      "Café Américain",
      "Rick's Place",
      "The Blue Parrot",
      "Sam's Joint"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The café was simply called 'Rick's Place' in the original unproduced play.",
    "detailedExplanation": "Murray Burnett and Joan Alison's unproduced stage play 'Everybody Comes to Rick's' served as the basis for Casablanca. In the original play, the establishment was called 'Rick's Place' rather than the more elaborate 'Rick's Café Américain' that appeared in the film. The writers drew inspiration from a nightclub they visited in France, and the play was written in 1940 but never produced on Broadway before being adapted for the screen.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casablanca_(film)",
    "citationTitle": "Wikipedia: Casablanca (film)"
  },
  {
    "id": "f2599d0a-0e2f-4ed1-a1da-6c159c2795a9",
    "text": "Which cinematographer won back-to-back Academy Awards for Best Cinematography in 1940 and 1941, both for films starring Joan Fontaine?",
    "options": [
      "George Barnes",
      "Joseph Ruttenberg",
      "George Folsey",
      "Leon Shamroy"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "George Barnes won for 'Rebecca' (1940) and 'How Green Was My Valley' (1941).",
    "detailedExplanation": "George Barnes achieved the rare feat of winning consecutive Academy Awards for Best Cinematography, taking home the honor for Alfred Hitchcock's 'Rebecca' in 1940 and John Ford's 'How Green Was My Valley' in 1941. However, there's an error in the question setup - Joan Fontaine starred in 'Rebecca' but not in 'How Green Was My Valley.' Barnes was known for his innovative lighting techniques and worked on numerous classic films throughout his career, including many Hitchcock productions.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Barnes_(cinematographer)",
    "citationTitle": "Wikipedia: George Barnes (cinematographer)"
  },
  {
    "id": "f00e8a10-146f-4dcc-be73-be2268db0055",
    "text": "In 'The Third Man' (1949), what unusual instrument plays the film's iconic theme music?",
    "options": [
      "Harmonica",
      "Zither",
      "Accordion",
      "Mandolin"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The haunting theme was played on a zither by Anton Karas.",
    "detailedExplanation": "The distinctive theme music for 'The Third Man' was composed and performed by Anton Karas on a zither, a traditional Austrian stringed instrument. Director Carol Reed discovered Karas playing in a Viennese wine garden and was so impressed that he commissioned him to create the entire score. The 'Harry Lime Theme' became a massive international hit, reaching number one on the charts in multiple countries and becoming one of the most recognizable film themes in cinema history.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Third_Man",
    "citationTitle": "Wikipedia: The Third Man"
  },
  {
    "id": "a321dc80-0d2b-4c84-bfd6-d65eb20c7782",
    "text": "Which actor was originally cast as the Tin Man in 'The Wizard of Oz' (1939) but had to be replaced due to an allergic reaction to the makeup?",
    "options": [
      "Ray Bolger",
      "Buddy Ebsen",
      "Frank Morgan",
      "Bert Lahr"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Buddy Ebsen suffered a severe allergic reaction to the aluminum powder makeup and was replaced by Jack Haley.",
    "detailedExplanation": "Buddy Ebsen was originally cast as the Tin Man and had already begun filming when he developed a severe allergic reaction to the aluminum powder used in his makeup. The aluminum dust coated his lungs and caused breathing difficulties so severe that he was hospitalized. Jack Haley replaced him, using a different aluminum paste makeup instead of the powder. Ebsen later became famous for playing Jed Clampett in 'The Beverly Hillbillies' and the title character in 'Barnaby Jones.'",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wizard_of_Oz_(1939_film)",
    "citationTitle": "Wikipedia: The Wizard of Oz (1939 film)"
  },
  {
    "id": "673a5b7c-e96d-47dc-8241-31c05829a50e",
    "text": "What was the first film to use the newly developed three-strip Technicolor process for a full-length feature?",
    "options": [
      "Gone with the Wind",
      "The Wizard of Oz",
      "Becky Sharp",
      "Snow White and the Seven Dwarfs"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "'Becky Sharp' (1935) was the first feature film shot entirely in three-strip Technicolor.",
    "detailedExplanation": "Rouben Mamoulian's 'Becky Sharp' (1935), based on Thackeray's novel 'Vanity Fair,' was the first feature-length film to be shot entirely using Technicolor's revolutionary three-strip process. This new technology could capture a full spectrum of colors, unlike earlier two-strip processes that were limited in their color range. The film starred Miriam Hopkins and was specifically chosen to showcase the new color technology, though it was not a commercial success. The three-strip process would later be used for classics like 'The Wizard of Oz' and 'Gone with the Wind.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Becky_Sharp_(1935_film)",
    "citationTitle": "Wikipedia: Becky Sharp (1935 film)"
  },
  {
    "id": "e2926add-b6bc-4dc5-b6fe-f6ee693a4ab9",
    "text": "In 'Sunset Boulevard' (1950), which real-life silent film director played himself as the butler Max von Mayerling?",
    "options": [
      "D.W. Griffith",
      "Erich von Stroheim",
      "F.W. Murnau",
      "King Vidor"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Erich von Stroheim played Max, Norma Desmond's devoted butler who was once her director and husband.",
    "detailedExplanation": "Erich von Stroheim, the legendary silent film director known for films like 'Greed' and 'The Wedding March,' played Max von Mayerling, the devoted butler to Gloria Swanson's Norma Desmond. In a brilliant piece of meta-casting, the character was revealed to be Norma's former director and first husband, mirroring von Stroheim's real-life role as a prominent silent film director. This casting choice added layers of authenticity and poignancy to Billy Wilder's meditation on Hollywood's past, as von Stroheim himself had experienced the transition from silent films to talkies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sunset_Boulevard_(film)",
    "citationTitle": "Wikipedia: Sunset Boulevard (film)"
  },
  {
    "id": "aa9d5e97-0b8c-47c7-850d-ff49a127a69c",
    "text": "Which 1941 film was the first to use deep focus photography extensively, allowing both foreground and background to remain in sharp focus simultaneously?",
    "options": [
      "The Maltese Falcon",
      "Citizen Kane",
      "How Green Was My Valley",
      "The Best Years of Our Lives"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Cinematographer Gregg Toland pioneered deep focus photography in 'Citizen Kane' with Orson Welles.",
    "detailedExplanation": "Gregg Toland's cinematography for Orson Welles' 'Citizen Kane' revolutionized film photography through extensive use of deep focus, a technique that kept both foreground and background elements in sharp focus simultaneously. This was achieved through a combination of special lenses, increased lighting, and faster film stock. The technique allowed Welles to stage complex scenes with multiple planes of action, eliminating the need for constant cutting between shots and giving audiences more control over what to watch within the frame.",
    "citationUrl": "https://en.wikipedia.org/wiki/Citizen_Kane",
    "citationTitle": "Wikipedia: Citizen Kane"
  },
  {
    "id": "c10e6fb9-b4dd-48f6-88d1-bce18fefe395",
    "text": "What was the original ending of 'The Big Sleep' (1946) that was changed during reshoots to increase the romantic chemistry between Humphrey Bogart and Lauren Bacall?",
    "options": [
      "Marlowe dies in a shootout",
      "Vivian is revealed as the murderer",
      "Carmen Sternwood kills herself",
      "Marlowe walks away alone"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The original version ended with Marlowe leaving alone, but reshoots added romantic scenes and a different ending.",
    "detailedExplanation": "Howard Hawks' 'The Big Sleep' underwent significant reshoots and re-editing between its initial 1945 version and its 1946 theatrical release. The original ending was more faithful to Raymond Chandler's novel, with Philip Marlowe walking away from the case alone after solving it. However, after test screenings and the success of Bogart and Bacall's chemistry in 'To Have and Have Not,' Warner Bros. ordered reshoots to emphasize their romantic relationship. New scenes were added and the ending was changed to show Marlowe and Vivian together, creating one of cinema's great romantic partnerships.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Big_Sleep_(1946_film)",
    "citationTitle": "Wikipedia: The Big Sleep (1946 film)"
  },
  {
    "id": "c21465b6-3038-4114-9bcc-99bc72b970bc",
    "text": "Which classic Hollywood film holds the record for the most Academy Award nominations ever received by a single movie?",
    "options": [
      "Gone with the Wind (1939)",
      "All About Eve (1950)",
      "Titanic (1997)",
      "Ben-Hur (1959)"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "All About Eve received 14 Oscar nominations in 1951, a record that still stands today.",
    "detailedExplanation": "All About Eve, starring Bette Davis and directed by Joseph L. Mankiewicz, made Oscar history by receiving 14 nominations across multiple categories including Best Picture, Best Director, and multiple acting nominations. This record has been tied by Titanic and La La Land but never surpassed. The film won six Oscars including Best Picture and Best Director, and remains a benchmark for Academy Award recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/All_About_Eve",
    "citationTitle": "Wikipedia: All About Eve"
  },
  {
    "id": "b564e96e-13eb-4cc2-bba7-80e3c4a6788e",
    "text": "In the 1941 film 'The Maltese Falcon,' what is the actual material that the fake falcon statue is made of?",
    "options": [
      "Lead painted black",
      "Plaster of Paris",
      "Papier-mâché",
      "Cast iron"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The fake Maltese Falcon in the film is revealed to be made of lead and painted black to disguise its true nature.",
    "detailedExplanation": "In John Huston's directorial debut 'The Maltese Falcon,' the climactic revelation occurs when the characters discover that the coveted falcon statue, supposedly made of gold and encrusted with jewels, is actually a worthless lead replica painted black. This twist drives home the film's themes about deception and the illusory nature of dreams of easy wealth. The lead falcon serves as a perfect metaphor for the false promises that drive the characters throughout the noir classic.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Maltese_Falcon_(1941_film)",
    "citationTitle": "Wikipedia: The Maltese Falcon (1941 film)"
  },
  {
    "id": "f79a35a8-af02-4bed-8982-04250735ece1",
    "text": "Which actress turned down the female lead role in 'Casablanca' (1942) that eventually went to Ingrid Bergman?",
    "options": [
      "Hedy Lamarr",
      "Ann Sheridan",
      "Michele Morgan",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Hedy Lamarr, Ann Sheridan, and Michele Morgan were all considered or approached for the role of Ilsa before Ingrid Bergman was cast.",
    "detailedExplanation": "The iconic role of Ilsa Lund in Casablanca wasn't Ingrid Bergman's from the start. Warner Bros. initially considered several actresses for the part, including Hedy Lamarr, who was the studio's first choice but was unavailable due to scheduling conflicts. Ann Sheridan was also seriously considered, and French actress Michele Morgan was approached for the role. The casting process was complicated by the fact that the script wasn't completed when filming began, making it difficult to attract top talent to what seemed like an uncertain project.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casablanca_(film)",
    "citationTitle": "Wikipedia: Casablanca (film)"
  },
  {
    "id": "3651c280-8640-4ae6-9cdf-1665cd78ce00",
    "text": "What was the original profession of director Frank Capra before he entered the film industry?",
    "options": [
      "Newspaper reporter",
      "Chemical engineer",
      "Theater actor",
      "Music composer"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Frank Capra was a chemical engineer who graduated from Caltech before transitioning into filmmaking in the 1920s.",
    "detailedExplanation": "Before becoming one of Hollywood's most celebrated directors with films like 'It's a Wonderful Life' and 'Mr. Smith Goes to Washington,' Frank Capra earned a degree in chemical engineering from the California Institute of Technology in 1918. After serving in World War I and struggling to find work as an engineer, he stumbled into the film industry almost by accident when he convinced a small film company to let him direct a short film. His engineering background influenced his meticulous approach to filmmaking and his understanding of the technical aspects of cinema production.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frank_Capra",
    "citationTitle": "Wikipedia: Frank Capra"
  }
]