[
  {
    "id": "c308b4c2-3794-4861-8a05-f9c3a64edd50",
    "text": "Which 1942 film was voted the greatest American film of all time by the American Film Institute in 2007?",
    "options": [
      "Gone with the Wind",
      "Citizen Kane",
      "Casablanca",
      "The Wizard of Oz"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Citizen Kane topped the AFI's 2007 list of greatest American films.",
    "detailedExplanation": "Citizen Kane, directed by and starring Orson Welles, has long been regarded as one of cinema's greatest achievements. The American Film Institute ranked it #1 on their 2007 list of the 100 Greatest American Films of All Time, praising its innovative cinematography, storytelling techniques, and Welles' groundbreaking directorial debut. The film's influence on cinema continues to this day.",
    "citationUrl": "https://en.wikipedia.org/wiki/Citizen_Kane",
    "citationTitle": "Wikipedia: Citizen Kane"
  },
  {
    "id": "1301f102-685c-4ea2-aa06-ab05f453f23a",
    "text": "What was the first feature-length animated film ever produced by Walt Disney Studios?",
    "options": [
      "Pinocchio",
      "Snow White and the Seven Dwarfs",
      "Fantasia",
      "Bambi"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Snow White and the Seven Dwarfs was Disney's first full-length animated feature, released in 1937.",
    "detailedExplanation": "Released in 1937, Snow White and the Seven Dwarfs was not only Disney's first feature-length animated film but also the first full-length cel-animated feature film in cinema history. Many in Hollywood dubbed it 'Disney's Folly' during production, believing audiences wouldn't sit through a feature-length cartoon. However, it became a massive success and established Disney as a major force in filmmaking.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_film)",
    "citationTitle": "Wikipedia: Snow White and the Seven Dwarfs (1937 film)"
  },
  {
    "id": "f4bd9830-d5f0-4cca-9af8-84368ee1d4fd",
    "text": "Which actress won the Academy Award for Best Actress for her role in the 1944 film 'Gaslight'?",
    "options": [
      "Bette Davis",
      "Ingrid Bergman",
      "Joan Crawford",
      "Greer Garson"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Ingrid Bergman won the Oscar for Best Actress for her performance as Paula Alquist Anton in Gaslight.",
    "detailedExplanation": "Ingrid Bergman's portrayal of Paula, a woman whose husband manipulates her into believing she's going insane, earned her the 1945 Academy Award for Best Actress. The film was so influential that 'gaslighting' became a psychological term for manipulative behavior designed to make someone question their own reality. This was Bergman's first of three Academy Awards for acting.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gaslight_(1944_film)",
    "citationTitle": "Wikipedia: Gaslight (1944 film)"
  },
  {
    "id": "427d90b8-1cc4-4650-ba7a-8756ffd5b729",
    "text": "In the 1939 film 'The Wizard of Oz', what were the ruby slippers originally in L. Frank Baum's novel?",
    "options": [
      "Golden slippers",
      "Silver shoes",
      "Crystal slippers",
      "Diamond shoes"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "In Baum's original novel, Dorothy wore silver shoes, not ruby slippers.",
    "detailedExplanation": "The iconic ruby slippers worn by Judy Garland in The Wizard of Oz were actually silver shoes in L. Frank Baum's original 1900 novel. The change was made specifically for the film to take advantage of the new Technicolor process and create a more visually striking contrast against the Yellow Brick Road. The ruby slippers have since become one of the most recognizable props in film history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ruby_slippers",
    "citationTitle": "Wikipedia: Ruby slippers"
  },
  {
    "id": "25957104-8728-413e-a4c4-d914166b6cac",
    "text": "Which director is known for classic films like 'Vertigo', 'Rear Window', and 'Psycho'?",
    "options": [
      "John Ford",
      "Billy Wilder",
      "Alfred Hitchcock",
      "Howard Hawks"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Alfred Hitchcock directed these three masterpieces of suspense cinema.",
    "detailedExplanation": "Alfred Hitchcock, known as the 'Master of Suspense', directed all three of these acclaimed films. Vertigo (1958) is often cited as one of the greatest films ever made, Rear Window (1954) showcased his ability to create tension within a confined space, and Psycho (1960) revolutionized horror cinema. Hitchcock's innovative camera techniques and psychological storytelling influenced generations of filmmakers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alfred_Hitchcock",
    "citationTitle": "Wikipedia: Alfred Hitchcock"
  },
  {
    "id": "2d96cc82-45ad-4411-9f1b-984d326f9ac6",
    "text": "Which 1950 film featured the famous line 'All right, Mr. DeMille, I'm ready for my close-up'?",
    "options": [
      "All About Eve",
      "Sunset Boulevard",
      "Born Yesterday",
      "The Asphalt Jungle"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "This iconic line was delivered by Gloria Swanson's character Norma Desmond in Sunset Boulevard.",
    "detailedExplanation": "Sunset Boulevard, directed by Billy Wilder, featured Gloria Swanson as faded silent film star Norma Desmond. The line 'All right, Mr. DeMille, I'm ready for my close-up' is spoken at the film's climax as Norma descends her staircase in a state of delusion. The reference to Cecil B. DeMille was particularly poignant as he had directed Swanson in several silent films, and actually appeared in the movie as himself.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sunset_Boulevard_(film)",
    "citationTitle": "Wikipedia: Sunset Boulevard (film)"
  },
  {
    "id": "552f7349-ef9a-4df0-9640-d7a3104eb7bd",
    "text": "Which 1946 Christmas classic was initially considered a box office disappointment but later became beloved through television broadcasts?",
    "options": [
      "Miracle on 34th Street",
      "It's a Wonderful Life",
      "The Bishop's Wife",
      "Christmas in Connecticut"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "It's a Wonderful Life was initially a commercial failure but gained popularity through TV reruns.",
    "detailedExplanation": "Frank Capra's It's a Wonderful Life, starring Jimmy Stewart, was initially a box office disappointment in 1946 and contributed to the financial troubles of Liberty Films. However, when the film's copyright lapsed in the 1970s, television stations began broadcasting it frequently during the holiday season because it was free to air. This exposure transformed it into one of America's most beloved Christmas films, leading to its reevaluation as a classic.",
    "citationUrl": "https://en.wikipedia.org/wiki/It%27s_a_Wonderful_Life",
    "citationTitle": "Wikipedia: It's a Wonderful Life"
  },
  {
    "id": "8da0e25c-c6ef-4da3-99ae-0cdd1464f9df",
    "text": "Which 1942 film starring Humphrey Bogart and Ingrid Bergman was famously set in a nightclub during World War II?",
    "options": [
      "The Maltese Falcon",
      "Casablanca",
      "To Have and Have Not",
      "Key Largo"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Casablanca is the iconic 1942 wartime romance set in Rick's Café Américain.",
    "detailedExplanation": "Casablanca, directed by Michael Curtiz, became one of the most beloved films of all time. Set in the Moroccan city during WWII, it tells the story of Rick Blaine (Bogart) who runs a nightclub and must choose between his love for Ilsa (Bergman) and helping her resistance leader husband escape the Nazis. The film won three Academy Awards and is famous for lines like 'Here's looking at you, kid.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Casablanca_(film)",
    "citationTitle": "Wikipedia: Casablanca (film)"
  },
  {
    "id": "d06dc601-71b6-4ff0-8ef2-087bc17536ae",
    "text": "Who directed the 1939 epic 'Gone with the Wind'?",
    "options": [
      "David O. Selznick",
      "Victor Fleming",
      "George Stevens",
      "William Wyler"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Victor Fleming directed Gone with the Wind, though George Cukor and Sam Wood also contributed as directors during production.",
    "detailedExplanation": "Victor Fleming received sole directorial credit for Gone with the Wind, despite the film's troubled production history that saw multiple directors involved. Fleming took over from George Cukor early in production and completed most of the film, though Sam Wood directed some scenes when Fleming was briefly working on The Wizard of Oz simultaneously. The film won Fleming the Academy Award for Best Director and remains one of the highest-grossing films of all time when adjusted for inflation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gone_with_the_Wind_(film)",
    "citationTitle": "Wikipedia: Gone with the Wind (film)"
  },
  {
    "id": "d12bf65a-3e49-479f-b361-e5fc97e0ccf5",
    "text": "In which 1950 film noir does Gloria Swanson play an aging silent film star named Norma Desmond?",
    "options": [
      "Double Indemnity",
      "The Big Sleep",
      "Sunset Boulevard",
      "Laura"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sunset Boulevard featured Gloria Swanson as the delusional former silent film star Norma Desmond.",
    "detailedExplanation": "Sunset Boulevard, directed by Billy Wilder, was a meta-cinematic masterpiece that cast real silent film star Gloria Swanson as Norma Desmond, a faded actress living in delusion about her comeback. The film brilliantly commented on Hollywood's treatment of aging stars and the transition from silent films to talkies. Swanson's powerful performance earned her an Oscar nomination, and the film is considered one of the greatest films about Hollywood itself.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sunset_Boulevard_(film)",
    "citationTitle": "Wikipedia: Sunset Boulevard (film)"
  },
  {
    "id": "5438e441-1fe5-4096-ae21-044429fadc4a",
    "text": "Which Alfred Hitchcock film features James Stewart as a photographer who spies on his neighbors from his apartment window?",
    "options": [
      "Vertigo",
      "North by Northwest",
      "Rear Window",
      "The Man Who Knew Too Much"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Rear Window (1954) stars James Stewart as L.B. Jefferies, a photographer confined to a wheelchair who becomes obsessed with watching his neighbors.",
    "detailedExplanation": "Rear Window is considered one of Hitchcock's masterpieces, featuring James Stewart as photographer L.B. 'Jeff' Jefferies who, confined to a wheelchair with a broken leg, begins surveilling his Greenwich Village neighbors and becomes convinced one of them has committed murder. The film co-starred Grace Kelly and was notable for its innovative single-location filming technique, with almost the entire movie shot from Jeff's apartment. The film explores themes of voyeurism and paranoia while maintaining Hitchcock's signature suspense.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rear_Window",
    "citationTitle": "Wikipedia: Rear Window"
  },
  {
    "id": "0fdb7eb9-33ef-42f5-9d38-303c9d16c8f2",
    "text": "What was the first feature-length film to win the Academy Award for Best Animated Feature?",
    "options": [
      "Snow White and the Seven Dwarfs",
      "Fantasia",
      "Pinocchio",
      "This category didn't exist in classic Hollywood era"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Best Animated Feature category wasn't created until 2001, after the classic Hollywood era ended.",
    "detailedExplanation": "This is a trick question that highlights the difference between classic and modern Hollywood. The Academy Award for Best Animated Feature wasn't established until 2001, well after the classic Hollywood era (generally considered 1930s-1960s). Snow White and the Seven Dwarfs (1937) was the first full-length animated feature film and received a special honorary Oscar, but there was no specific animated feature category during the classic era. The first winner of the modern category was Shrek in 2001.",
    "citationUrl": "https://en.wikipedia.org/wiki/Academy_Award_for_Best_Animated_Feature",
    "citationTitle": "Wikipedia: Academy Award for Best Animated Feature"
  },
  {
    "id": "80683ddb-a5b9-447a-8084-d2d5c65ba6f1",
    "text": "Which 1939 musical starring Judy Garland features the song 'Over the Rainbow'?",
    "options": [
      "Meet Me in St. Louis",
      "Easter Parade",
      "The Wizard of Oz",
      "A Star is Born"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Wizard of Oz featured Judy Garland's iconic performance of 'Over the Rainbow' as Dorothy.",
    "detailedExplanation": "The Wizard of Oz, directed by Victor Fleming, launched Judy Garland to stardom when she was just 16 years old. Her rendition of 'Over the Rainbow' became one of the most beloved songs in film history, later named the greatest movie song of all time by the American Film Institute. The film was groundbreaking for its use of Technicolor, transitioning from sepia-toned Kansas to the colorful Land of Oz. Despite being a box office disappointment initially, it became a beloved classic through television broadcasts.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wizard_of_Oz_(1939_film)",
    "citationTitle": "Wikipedia: The Wizard of Oz (1939 film)"
  },
  {
    "id": "9ad1c0f5-89e0-42cd-a91b-6821879affca",
    "text": "Who played the male lead opposite Marilyn Monroe in 'Some Like It Hot' (1959)?",
    "options": [
      "Tony Curtis and Jack Lemmon",
      "Cary Grant and James Stewart",
      "Frank Sinatra and Dean Martin",
      "Rock Hudson and Tony Curtis"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tony Curtis and Jack Lemmon played the two musicians who dress in drag to escape gangsters in Billy Wilder's comedy classic.",
    "detailedExplanation": "Some Like It Hot, directed by Billy Wilder, featured Tony Curtis and Jack Lemmon as jazz musicians who witness a mob hit and disguise themselves as women to join an all-female band and escape the gangsters. The film co-starred Marilyn Monroe as Sugar 'Sue' Kane, the band's vocalist and ukulele player. Considered one of the greatest comedies ever made, the film was groundbreaking for its cross-dressing theme and sexual innuendo, earning multiple Oscar nominations and consistently ranking high on 'greatest films' lists.",
    "citationUrl": "https://en.wikipedia.org/wiki/Some_Like_It_Hot",
    "citationTitle": "Wikipedia: Some Like It Hot"
  },
  {
    "id": "2e488247-313c-471a-b207-98c886e73b78",
    "text": "Which 1941 film is famous for the deep focus cinematography technique pioneered by Gregg Toland?",
    "options": [
      "The Best Years of Our Lives",
      "Citizen Kane",
      "The Grapes of Wrath",
      "How Green Was My Valley"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Citizen Kane revolutionized cinema with Gregg Toland's innovative deep focus photography techniques.",
    "detailedExplanation": "Citizen Kane, Orson Welles' directorial debut, featured groundbreaking cinematography by Gregg Toland that utilized deep focus techniques to keep both foreground and background in sharp focus simultaneously. This innovative approach allowed for more complex visual storytelling and influenced generations of filmmakers. The film, loosely based on newspaper magnate William Randolph Hearst, was initially a commercial failure but is now widely regarded as the greatest American film ever made, consistently topping critics' polls for decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Citizen_Kane",
    "citationTitle": "Wikipedia: Citizen Kane"
  },
  {
    "id": "acdb172d-0fe4-4980-ad12-c816d531a15a",
    "text": "Which 1942 film starring Humphrey Bogart was initially not expected to be a major success but became one of the most beloved movies of all time?",
    "options": [
      "The Maltese Falcon",
      "Casablanca",
      "The Big Sleep",
      "To Have and Have Not"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Casablanca was initially considered just another wartime drama but became a timeless classic.",
    "detailedExplanation": "Casablanca, released in 1942, was initially viewed by Warner Bros. as just another World War II drama. The studio had modest expectations for the film, but it went on to win three Academy Awards including Best Picture and has consistently ranked among the greatest films ever made. The movie's memorable quotes, romantic storyline, and stellar performances by Humphrey Bogart and Ingrid Bergman have made it an enduring classic that continues to captivate audiences decades later.",
    "citationUrl": "https://en.wikipedia.org/wiki/Casablanca_(film)",
    "citationTitle": "Wikipedia: Casablanca (film)"
  },
  {
    "id": "b81b8604-fbdb-4915-a817-f1b6902886c3",
    "text": "What was the first feature-length animated film produced by Walt Disney Studios?",
    "options": [
      "Pinocchio",
      "Snow White and the Seven Dwarfs",
      "Fantasia",
      "Bambi"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Snow White and the Seven Dwarfs was Disney's groundbreaking first full-length animated feature in 1937.",
    "detailedExplanation": "Snow White and the Seven Dwarfs, released in 1937, was Walt Disney's first feature-length animated film and a revolutionary achievement in cinema history. Many in Hollywood dubbed it 'Disney's Folly,' believing audiences wouldn't sit through a full-length cartoon. However, the film was a massive commercial and critical success, earning over $8 million during its initial release and establishing Disney as a major force in filmmaking. The movie's success paved the way for the golden age of Disney animation and proved that animated films could be serious artistic and commercial endeavors.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_film)",
    "citationTitle": "Wikipedia: Snow White and the Seven Dwarfs (1937 film)"
  },
  {
    "id": "3c65a858-120f-4db9-90f0-ab7a8e13f45a",
    "text": "Which director is famous for his cameo appearances in his own films and directed classics like 'Rear Window' and 'Vertigo'?",
    "options": [
      "Orson Welles",
      "John Ford",
      "Alfred Hitchcock",
      "Billy Wilder"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Alfred Hitchcock was known as the 'Master of Suspense' and made brief cameos in most of his films.",
    "detailedExplanation": "Alfred Hitchcock, known as the 'Master of Suspense,' directed numerous classic Hollywood thrillers and was famous for making brief cameo appearances in his own films. This became a trademark that audiences eagerly anticipated. Films like 'Rear Window' (1954), 'Vertigo' (1958), 'North by Northwest' (1959), and 'Psycho' (1960) showcased his mastery of suspense and psychological tension. His cameos ranged from walking past the camera to appearing in photographs or advertisements within the film, and this playful interaction with his audience became an integral part of the Hitchcock experience.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alfred_Hitchcock",
    "citationTitle": "Wikipedia: Alfred Hitchcock"
  },
  {
    "id": "31c58b39-a22f-4a34-b20a-b6432b273678",
    "text": "In 'The Wizard of Oz' (1939), what was used to create the snow that falls on Dorothy and her friends in the poppy field scene?",
    "options": [
      "Real snow",
      "Asbestos flakes",
      "Cotton fibers",
      "Soap flakes"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Unfortunately, asbestos was commonly used as artificial snow in early Hollywood films before its dangers were known.",
    "detailedExplanation": "In the famous poppy field scene in 'The Wizard of Oz,' the snow that falls to counteract the sleeping spell was actually made from asbestos flakes. This was a common practice in Hollywood during the 1930s and 1940s, as asbestos was readily available, fire-resistant, and created a realistic snow effect on camera. The health dangers of asbestos exposure were not widely understood at the time, and it wasn't until decades later that the serious health risks became apparent. This is one of many examples of how film production practices from Hollywood's golden age would be considered unsafe by today's standards.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wizard_of_Oz_(1939_film)",
    "citationTitle": "Wikipedia: The Wizard of Oz (1939 film)"
  },
  {
    "id": "e5b49bc0-b580-4087-9996-43121fece742",
    "text": "Which 1950 film about aging Broadway star Margo Channing won the Academy Award for Best Picture?",
    "options": [
      "Sunset Boulevard",
      "All About Eve",
      "A Streetcar Named Desire",
      "Born Yesterday"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "All About Eve won Best Picture in 1951 and starred Bette Davis as the aging Broadway star Margo Channing.",
    "detailedExplanation": "'All About Eve' (1950) won the Academy Award for Best Picture and holds the record for most Oscar nominations for a single film with 14 nominations, winning 6. The film starred Bette Davis as Margo Channing, an aging Broadway star who takes a young fan named Eve under her wing, only to discover Eve's ruthless ambitions. The movie featured an outstanding ensemble cast including Anne Baxter, George Sanders, and Celeste Holm. It's particularly famous for Bette Davis's line 'Fasten your seatbelts, it's going to be a bumpy night!' and is considered one of the finest films about theater and the entertainment industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/All_About_Eve",
    "citationTitle": "Wikipedia: All About Eve"
  }
]