[
  {
    "id": "22fdbc72-7dbc-43ef-b92a-40e777d22dba",
    "text": "Which British author created the fictional detective Sherlock Holmes?",
    "options": [
      "Arthur Conan Doyle",
      "Agatha Christie",
      "Dorothy L. Sayers",
      "Edgar Allan Poe"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Arthur Conan Doyle created Sherlock Holmes in 1887.",
    "detailedExplanation": "Sir Arthur Conan Doyle, a Scottish physician and writer, created the iconic detective Sherlock Holmes and his companion Dr. Watson. The character first appeared in 'A Study in Scarlet' published in 1887, and went on to feature in four novels and 56 short stories, making Holmes one of the most famous fictional characters in literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arthur_Conan_Doyle",
    "citationTitle": "Wikipedia: Arthur Conan Doyle"
  },
  {
    "id": "2e010d5e-c286-40ab-971b-61b3429bc326",
    "text": "What is the opening line of Jane Austen's 'Pride and Prejudice'?",
    "options": [
      "Call me Ishmael",
      "It was the best of times, it was the worst of times",
      "It is a truth universally acknowledged...",
      "In a hole in the ground there lived a hobbit"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The famous opening line is 'It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.'",
    "detailedExplanation": "Jane Austen's 1813 novel 'Pride and Prejudice' opens with one of the most recognizable lines in English literature: 'It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.' This ironic statement sets the tone for the novel's social commentary on marriage, class, and society in Regency England.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pride_and_Prejudice",
    "citationTitle": "Wikipedia: Pride and Prejudice"
  },
  {
    "id": "79348650-af8d-40ea-98b0-f4e5991078b1",
    "text": "Which Shakespeare play features the characters Romeo and Juliet?",
    "options": [
      "Hamlet",
      "Macbeth",
      "Romeo and Juliet",
      "Othello"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Romeo and Juliet are the title characters of Shakespeare's tragic play 'Romeo and Juliet.'",
    "detailedExplanation": "William Shakespeare's 'Romeo and Juliet,' written in the early part of his career (around 1594-1596), tells the story of two young star-crossed lovers from feuding families in Verona. The play is one of Shakespeare's most popular and frequently performed works, establishing many of the conventions of romantic tragedy that are still used today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Romeo_and_Juliet",
    "citationTitle": "Wikipedia: Romeo and Juliet"
  },
  {
    "id": "41654de9-c7f8-44ef-bf5a-4eb1780c9565",
    "text": "Who wrote the fantasy novel series 'The Chronicles of Narnia'?",
    "options": [
      "J.R.R. Tolkien",
      "C.S. Lewis",
      "Roald Dahl",
      "Philip Pullman"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "C.S. Lewis wrote 'The Chronicles of Narnia' series of seven fantasy novels.",
    "detailedExplanation": "Clive Staples Lewis, known as C.S. Lewis, was a British writer and academic who authored 'The Chronicles of Narnia,' a series of seven fantasy novels published between 1950 and 1956. The most famous book in the series, 'The Lion, the Witch and the Wardrobe,' introduces readers to the magical world of Narnia accessed through a wardrobe, featuring memorable characters like Aslan the lion and the White Witch.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Chronicles_of_Narnia",
    "citationTitle": "Wikipedia: The Chronicles of Narnia"
  },
  {
    "id": "8b603ada-6fc8-4930-aca1-784e0392e385",
    "text": "In which Charles Dickens novel does the character Ebenezer Scrooge appear?",
    "options": [
      "Great Expectations",
      "Oliver Twist",
      "A Christmas Carol",
      "David Copperfield"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Ebenezer Scrooge is the main character in Charles Dickens' 'A Christmas Carol.'",
    "detailedExplanation": "Ebenezer Scrooge is the miserly protagonist of Charles Dickens' novella 'A Christmas Carol,' published in 1843. The story follows Scrooge's transformation from a cold-hearted miser to a generous and kind-hearted man after being visited by the ghosts of Christmas Past, Present, and Yet to Come. The tale has become a beloved Christmas classic and has been adapted numerous times for stage, film, and television.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Christmas_Carol",
    "citationTitle": "Wikipedia: A Christmas Carol"
  },
  {
    "id": "655bbb7c-d399-400f-9b2d-df18135f8112",
    "text": "Which British author wrote the dystopian novel '1984'?",
    "options": [
      "Aldous Huxley",
      "George Orwell",
      "H.G. Wells",
      "Ray Bradbury"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "George Orwell wrote the dystopian novel '1984,' published in 1949.",
    "detailedExplanation": "Eric Arthur Blair, writing under the pen name George Orwell, published '1984' in 1949. This dystopian social science fiction novel depicts a totalitarian society ruled by Big Brother and introduces concepts like 'thoughtcrime,' 'doublethink,' and 'Newspeak' that have become part of common political discourse. The novel is considered one of the most influential works of the 20th century.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nineteen_Eighty-Four",
    "citationTitle": "Wikipedia: Nineteen Eighty-Four"
  },
  {
    "id": "c748a255-1d5f-4e43-9910-2092dd4900e0",
    "text": "What type of creature is Smaug in J.R.R. Tolkien's 'The Hobbit'?",
    "options": [
      "An orc",
      "A dragon",
      "A troll",
      "An eagle"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Smaug is a dragon who guards the treasure under the Lonely Mountain in 'The Hobbit.'",
    "detailedExplanation": "Smaug the Magnificent is a powerful and cunning dragon in J.R.R. Tolkien's 1937 novel 'The Hobbit.' He is the last of the great Fire-drakes of the North and serves as the main antagonist of the story. Smaug conquered the Dwarf kingdom of Erebor (the Lonely Mountain) and hoards the vast treasure within, which Bilbo Baggins and the company of dwarves seek to reclaim during their quest.",
    "citationUrl": "https://en.wikipedia.org/wiki/Smaug",
    "citationTitle": "Wikipedia: Smaug"
  },
  {
    "id": "2d9ed21e-b9bd-4793-8a42-34f56fc0a114",
    "text": "Which British poet wrote 'The Waste Land'?",
    "options": [
      "W.H. Auden",
      "T.S. Eliot",
      "William Blake",
      "Samuel Taylor Coleridge"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "T.S. Eliot wrote 'The Waste Land,' published in 1922.",
    "detailedExplanation": "Thomas Stearns Eliot, though born in America, became a British citizen and is considered one of the most important British modernist poets. 'The Waste Land,' published in 1922, is widely regarded as one of the most important poems of the 20th century. The 434-line poem is noted for its fragmented structure, multiple voices, and extensive literary allusions, capturing the disillusionment of the post-World War I era.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Waste_Land",
    "citationTitle": "Wikipedia: The Waste Land"
  },
  {
    "id": "429bdc4b-7825-48a7-b2c7-4f836bbc88b0",
    "text": "Which British author wrote the Gothic novel 'Frankenstein'?",
    "options": [
      "Mary Shelley",
      "Emily Brontë",
      "Virginia Woolf",
      "George Eliot"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Mary Shelley wrote 'Frankenstein' in 1818 when she was just 18 years old.",
    "detailedExplanation": "Mary Shelley wrote 'Frankenstein; or, The Modern Prometheus' in 1818, making her one of the pioneers of science fiction literature. The novel was conceived during a famous summer in 1816 at Villa Diodati near Lake Geneva, where Shelley was staying with her future husband Percy Bysshe Shelley, Lord Byron, and others. The story emerged from a ghost story competition, and Shelley's creation became one of the most enduring works of Gothic literature, exploring themes of scientific ethics and human nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mary_Shelley",
    "citationTitle": "Wikipedia: Mary Shelley"
  },
  {
    "id": "c15e2060-da08-4106-8f44-76dc08f89923",
    "text": "In which London location is Shakespeare's Globe Theatre situated?",
    "options": [
      "Covent Garden",
      "Southwark",
      "Westminster",
      "Camden"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Shakespeare's Globe Theatre is located in Southwark, on the south bank of the River Thames.",
    "detailedExplanation": "The modern reconstruction of Shakespeare's Globe Theatre stands in Southwark, London, close to the site of the original Globe Theatre where many of Shakespeare's plays were first performed in the early 1600s. The original theatre was built in 1599 and was associated with William Shakespeare's playing company. The current Globe is a faithful reconstruction that opened in 1997, built using traditional materials and techniques, and serves as both a working theatre and an educational center dedicated to Shakespeare's works.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shakespeare%27s_Globe",
    "citationTitle": "Wikipedia: Shakespeare's Globe"
  },
  {
    "id": "fb29d028-40ef-433a-8c71-b7405e8fdc83",
    "text": "Which British author created the character of Winnie-the-Pooh?",
    "options": [
      "Roald Dahl",
      "A.A. Milne",
      "Enid Blyton",
      "Lewis Carroll"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "A.A. Milne created Winnie-the-Pooh, inspired by his son Christopher Robin's toys.",
    "detailedExplanation": "A.A. Milne created the beloved character Winnie-the-Pooh in the 1920s, inspired by his son Christopher Robin Milne's collection of stuffed animals. The stories were first published in 'Winnie-the-Pooh' (1926) and 'The House at Pooh Corner' (1928). The character was named after a real bear called Winnie at London Zoo and a swan called Pooh. Set in the Hundred Acre Wood, which was based on the Five Hundred Acre Wood in Ashdown Forest in East Sussex, these stories became classics of children's literature worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/A._A._Milne",
    "citationTitle": "Wikipedia: A. A. Milne"
  },
  {
    "id": "18a8d134-93e9-4ed3-b1d7-ba32f0fdfbfb",
    "text": "Which novel begins with the famous line 'Call me Ishmael'... wait, that's American! Which British novel begins 'It was the best of times, it was the worst of times'?",
    "options": [
      "Great Expectations",
      "A Tale of Two Cities",
      "Oliver Twist",
      "David Copperfield"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'A Tale of Two Cities' by Charles Dickens opens with this famous contrasting line.",
    "detailedExplanation": "Charles Dickens' 'A Tale of Two Cities' (1859) begins with one of the most famous opening passages in literature: 'It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness...' The novel is set in London and Paris before and during the French Revolution, and tells the story of the French Doctor Manette and his daughter Lucie. Despite being a work of historical fiction, it became Dickens' most popular novel and remains one of the best-selling novels of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Tale_of_Two_Cities",
    "citationTitle": "Wikipedia: A Tale of Two Cities"
  },
  {
    "id": "766b7447-c7d0-4d73-87af-a8001ab07333",
    "text": "Which British author wrote 'Wuthering Heights'?",
    "options": [
      "Charlotte Brontë",
      "Emily Brontë",
      "Anne Brontë",
      "Elizabeth Gaskell"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Emily Brontë wrote 'Wuthering Heights', her only published novel.",
    "detailedExplanation": "Emily Brontë wrote 'Wuthering Heights', published in 1847 under the pseudonym Ellis Bell. It was her only novel, as she died of tuberculosis in 1848, just one year after publication. The novel tells the passionate and destructive love story between Heathcliff and Catherine Earnshaw, set on the Yorkshire moors. Initially, the book received mixed reviews due to its dark themes and complex narrative structure, but it is now considered a classic of English literature and a masterpiece of Gothic fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/Emily_Bront%C3%AB",
    "citationTitle": "Wikipedia: Emily Brontë"
  },
  {
    "id": "d434a41e-aaab-4515-9736-f2a8ee19b6cd",
    "text": "What is the name of Harry Potter's owl in J.K. Rowling's series?",
    "options": [
      "Errol",
      "Pigwidgeon",
      "Hedwig",
      "Archimedes"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Hedwig is Harry Potter's loyal snowy owl companion throughout most of the series.",
    "detailedExplanation": "Hedwig is Harry Potter's snowy owl, given to him by Hagrid as an 11th birthday present when Harry first enters the wizarding world. Throughout J.K. Rowling's series, Hedwig serves as both Harry's postal service in the wizarding world and a beloved companion. The name Hedwig comes from Saint Hedwig of Silesia, and the character represents one of Harry's first connections to the magical world. Hedwig appears in most of the seven books in the series, which has sold over 500 million copies worldwide and been translated into dozens of languages.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter",
    "citationTitle": "Wikipedia: Harry Potter"
  },
  {
    "id": "801e1955-5ad9-478b-bd8a-a32f945b0352",
    "text": "Which British author wrote the spy novels featuring the character James Bond?",
    "options": [
      "John le Carré",
      "Ian Fleming",
      "Frederick Forsyth",
      "Len Deighton"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Ian Fleming created James Bond, writing 12 novels and 2 short story collections featuring the secret agent.",
    "detailedExplanation": "Ian Fleming created the character James Bond, Agent 007, writing his first Bond novel 'Casino Royale' in 1953. Fleming wrote a total of 12 Bond novels and two collections of short stories between 1953 and his death in 1964. The character was partly inspired by Fleming's own experiences working in British Naval Intelligence during World War II. The Bond novels became incredibly successful and spawned one of the longest-running and most successful film franchises in cinema history, with the character becoming a British cultural icon worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ian_Fleming",
    "citationTitle": "Wikipedia: Ian Fleming"
  },
  {
    "id": "baf32aa0-a3d8-4453-826d-ffcdf2ebad87",
    "text": "Which Shakespeare play features the line 'To be or not to be, that is the question'?",
    "options": [
      "Macbeth",
      "King Lear",
      "Hamlet",
      "Othello"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "This famous soliloquy is spoken by Prince Hamlet in Shakespeare's tragedy 'Hamlet'.",
    "detailedExplanation": "The famous line 'To be or not to be, that is the question' is from Hamlet's soliloquy in Act 3, Scene 1 of Shakespeare's 'Hamlet'. In this soliloquy, Prince Hamlet contemplates life, death, and the nature of existence while considering whether to take action against his uncle Claudius, who murdered Hamlet's father. Written around 1600-1601, 'Hamlet' is one of Shakespeare's most performed and studied plays, and this particular soliloquy is among the most quoted passages in English literature, exploring universal themes of mortality and the human condition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hamlet",
    "citationTitle": "Wikipedia: Hamlet"
  },
  {
    "id": "84047f23-38d7-495f-a292-30e1eaf71857",
    "text": "Which British author wrote 'Alice's Adventures in Wonderland'?",
    "options": [
      "Lewis Carroll",
      "Roald Dahl",
      "Kenneth Grahame",
      "Beatrix Potter"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Lewis Carroll wrote 'Alice's Adventures in Wonderland' in 1865.",
    "detailedExplanation": "Lewis Carroll, the pen name of Charles Dodgson, wrote 'Alice's Adventures in Wonderland' in 1865. The story began as tales he told to the real Alice Liddell and her sisters during a boat trip. The book became one of the most famous works of Victorian children's literature and is known for its wordplay, logic puzzles, and fantastical characters like the Cheshire Cat and the Mad Hatter.",
    "citationUrl": "https://en.wikipedia.org/wiki/Alice%27s_Adventures_in_Wonderland",
    "citationTitle": "Wikipedia: Alice's Adventures in Wonderland"
  },
  {
    "id": "5c4ca21d-aab0-43fd-88f5-647990e1b8e2",
    "text": "Which British author created the character of Robinson Crusoe?",
    "options": [
      "Jonathan Swift",
      "Daniel Defoe",
      "Henry Fielding",
      "Samuel Richardson"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Daniel Defoe created Robinson Crusoe in his 1719 novel of the same name.",
    "detailedExplanation": "Daniel Defoe published 'Robinson Crusoe' in 1719, creating one of literature's most enduring characters. The novel tells the story of a castaway who survives on a remote island for 28 years. Often considered one of the first English novels, it was inspired by the real-life experiences of Alexander Selkirk, a Scottish sailor who was marooned on an island for four years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Robinson_Crusoe",
    "citationTitle": "Wikipedia: Robinson Crusoe"
  },
  {
    "id": "56c2beb0-7170-4d4a-965e-f2eabc66fe67",
    "text": "In which English county is Thomas Hardy's fictional region of Wessex primarily set?",
    "options": [
      "Devon",
      "Somerset",
      "Dorset",
      "Hampshire"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Hardy's Wessex is primarily based on Dorset, where he was born and lived.",
    "detailedExplanation": "Thomas Hardy created the fictional region of Wessex for his novels and poetry, primarily basing it on Dorset, his native county. While Hardy's Wessex encompasses parts of several southwestern English counties, Dorset forms its heart. Many locations in his novels like 'Tess of the d'Urbervilles' and 'The Mayor of Casterbridge' can be directly mapped to real places in Dorset, with Casterbridge representing Dorchester.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thomas_Hardy%27s_Wessex",
    "citationTitle": "Wikipedia: Thomas Hardy's Wessex"
  },
  {
    "id": "48d87ad6-be9b-493d-a8a7-1d2acd7cd4c0",
    "text": "Which British author wrote 'The Picture of Dorian Gray'?",
    "options": [
      "Oscar Wilde",
      "Bram Stoker",
      "Robert Louis Stevenson",
      "H.G. Wells"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Oscar Wilde wrote 'The Picture of Dorian Gray', published in 1890.",
    "detailedExplanation": "'The Picture of Dorian Gray' was Oscar Wilde's only novel, published in 1890. The story follows a young man whose portrait ages while he remains youthful, exploring themes of aestheticism, moral corruption, and hedonism. The novel caused scandal upon publication due to its perceived immoral content and homoerotic undertones, but is now considered a classic of British literature and a key work of the Aesthetic movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Picture_of_Dorian_Gray",
    "citationTitle": "Wikipedia: The Picture of Dorian Gray"
  }
]