[
  {
    "id": "0f6cc314-2022-49e6-8170-042083ad6d91",
    "text": "Which Virginia Woolf novel features the character Clarissa Dalloway hosting a party while contemplating her life over the course of a single day in post-WWI London?",
    "options": [
      "To the Lighthouse",
      "Mrs. Dalloway",
      "The Waves",
      "Orlando"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Mrs. Dalloway follows Clarissa Dalloway preparing for and hosting a party in one day.",
    "detailedExplanation": "Published in 1925, Mrs. Dalloway is Virginia Woolf's fourth novel and employs her signature stream-of-consciousness technique. The novel takes place over a single day in June 1923, following Clarissa Dalloway as she prepares for a party while reflecting on her past and present life. The narrative also follows Septimus Warren Smith, a shell-shocked war veteran, creating a parallel story that explores themes of mental illness, time, and the aftermath of World War I.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mrs_Dalloway",
    "citationTitle": "Wikipedia: Mrs Dalloway"
  },
  {
    "id": "cb62c901-8825-4dd9-99c5-1dd462664b70",
    "text": "In Geoffrey Chaucer's Canterbury Tales, which character is described as having a gap between her front teeth and claims to have had five husbands?",
    "options": [
      "The Prioress",
      "The Wife of Bath",
      "The Nun's Priest",
      "The Miller's Wife"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Wife of Bath is famous for her gap-toothed appearance and her five marriages.",
    "detailedExplanation": "The Wife of Bath, known as Alisoun, is one of the most memorable and controversial characters in Chaucer's Canterbury Tales. She is described as gap-toothed, which was considered a sign of lustfulness in medieval times. Her prologue is one of the longest in the collection, where she discusses her philosophy on marriage and sovereignty, drawing from her experience with five husbands. She represents a strong, independent woman who challenges medieval attitudes toward female sexuality and autonomy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wife_of_Bath",
    "citationTitle": "Wikipedia: Wife of Bath"
  },
  {
    "id": "0361fa5f-cb51-428d-8f67-df0f82c4dc67",
    "text": "Which Thomas Hardy novel features the tragic character Jude Fawley, who dreams of attending university but faces social and personal obstacles?",
    "options": [
      "Tess of the d'Urbervilles",
      "The Mayor of Casterbridge",
      "Far from the Madding Crowd",
      "Jude the Obscure"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Jude the Obscure tells the story of Jude Fawley's failed attempts at education and love.",
    "detailedExplanation": "Published in 1895, Jude the Obscure was Hardy's final novel and his most controversial. The story follows Jude Fawley, a working-class man who aspires to attend Oxford University but is repeatedly thwarted by social barriers and his own poor choices. The novel explores themes of class, education, religion, and marriage through Jude's relationships with his wife Arabella and his intellectual cousin Sue Bridehead. The book's frank treatment of sexuality, divorce, and criticism of marriage and religious institutions caused such outrage that Hardy abandoned novel-writing for poetry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jude_the_Obscure",
    "citationTitle": "Wikipedia: Jude the Obscure"
  },
  {
    "id": "0450ff61-0edf-4a27-9234-3db20abf7e0d",
    "text": "In which Shakespeare play does the character Iago manipulate Othello into believing his wife Desdemona is unfaithful?",
    "options": [
      "King Lear",
      "Macbeth",
      "Othello",
      "Hamlet"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Iago is the primary antagonist in Shakespeare's tragedy Othello.",
    "detailedExplanation": "Othello, written around 1603, is one of Shakespeare's major tragedies. The play centers on Othello, a Moorish military general in Venice, and his ensign Iago, who becomes one of literature's most notorious villains. Iago's manipulation stems from his resentment at being passed over for promotion in favor of Cassio. Through careful psychological manipulation and the planted evidence of a handkerchief, Iago convinces Othello that his wife Desdemona is having an affair with Cassio, ultimately leading to the tragic climax where Othello murders Desdemona.",
    "citationUrl": "https://en.wikipedia.org/wiki/Othello",
    "citationTitle": "Wikipedia: Othello"
  },
  {
    "id": "020984fe-6beb-46b6-a40a-50d81154a929",
    "text": "Which dystopian novel by Aldous Huxley features a society where people are genetically engineered and conditioned into a caste system, with characters like Bernard Marx and John the Savage?",
    "options": [
      "1984",
      "Animal Farm",
      "Brave New World",
      "The Time Machine"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Brave New World depicts Huxley's vision of a future society with genetic engineering and social conditioning.",
    "detailedExplanation": "Published in 1932, Brave New World presents Aldous Huxley's vision of a future World State where humans are artificially reproduced and conditioned into predetermined social castes (Alpha, Beta, Gamma, Delta, and Epsilon). The novel follows Bernard Marx, an Alpha-Plus who feels alienated from society, and John the Savage, who comes from a reservation where old ways still exist. The society uses the drug 'soma' to maintain happiness and suppress dissent, while natural reproduction and family relationships are considered obscene. The novel explores themes of technology, freedom, and what it means to be human.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brave_New_World",
    "citationTitle": "Wikipedia: Brave New World"
  },
  {
    "id": "bfbc5bd0-3d2b-45a8-b4e9-c58c406b8bd7",
    "text": "Which Graham Greene novel, set during World War II in London, follows Maurice Bendrix's affair with Sarah Miles and explores themes of love, jealousy, and faith?",
    "options": [
      "The Power and the Glory",
      "Brighton Rock",
      "The End of the Affair",
      "The Quiet American"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The End of the Affair deals with a wartime love triangle and religious conversion.",
    "detailedExplanation": "Published in 1951, The End of the Affair is considered one of Graham Greene's finest works and draws heavily on his own affair with Lady Catherine Walston. Set in wartime and post-war London, the novel is narrated by Maurice Bendrix, a bitter novelist who had an affair with Sarah Miles, the wife of a civil servant. When Sarah suddenly ends their relationship, Bendrix becomes obsessed with understanding why. The story unfolds through flashbacks and Sarah's diary, revealing her promise to God and her gradual conversion to Catholicism. The novel explores Greene's recurring themes of Catholic guilt, love, and the struggle between human and divine love.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_End_of_the_Affair",
    "citationTitle": "Wikipedia: The End of the Affair"
  },
  {
    "id": "567012d3-045e-404e-a39e-f71e2f2fd697",
    "text": "In which John Milton epic poem does Satan deliver the famous line 'Better to reign in Hell than serve in Heaven'?",
    "options": [
      "Paradise Regained",
      "Samson Agonistes",
      "Paradise Lost",
      "Comus"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Paradise Lost features Satan's rebellion and his famous declaration of defiance.",
    "detailedExplanation": "Paradise Lost, published in 1667, is John Milton's epic poem in blank verse that tells the biblical story of the Fall of Man. The poem is divided into twelve books and follows Satan's rebellion against God, his expulsion from Heaven, and his subsequent corruption of Adam and Eve in the Garden of Eden. Satan speaks the line 'Better to reign in Hell than serve in Heaven' in Book I, expressing his defiant attitude after his defeat and banishment. Milton's portrayal of Satan as a complex, charismatic character has led to centuries of literary debate about whether Satan is the poem's true protagonist and Milton's political sympathies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paradise_Lost",
    "citationTitle": "Wikipedia: Paradise Lost"
  },
  {
    "id": "3f5f7647-a5b5-4d11-848d-c2b9ab0e664f",
    "text": "Which D.H. Lawrence novel, banned for obscenity upon its initial publication, tells the story of Constance Chatterley's affair with her gamekeeper Oliver Mellors?",
    "options": [
      "Women in Love",
      "Sons and Lovers",
      "Lady Chatterley's Lover",
      "The Rainbow"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Lady Chatterley's Lover was banned for its explicit sexual content and class-crossing romance.",
    "detailedExplanation": "Published privately in Italy in 1928, Lady Chatterley's Lover was D.H. Lawrence's final novel and perhaps his most controversial. The story follows Constance 'Connie' Chatterley, whose husband Clifford is paralyzed from the waist down due to a war injury. She begins a passionate affair with Oliver Mellors, the estate's gamekeeper. The novel's explicit descriptions of sexual acts and its use of then-unprintable four-letter words led to its banning in the UK and US. The book wasn't legally published in Britain until 1960, after Penguin Books won a landmark obscenity trial, making it a pivotal moment in the fight against literary censorship.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lady_Chatterley%27s_Lover",
    "citationTitle": "Wikipedia: Lady Chatterley's Lover"
  },
  {
    "id": "261b3e57-5232-45fa-8ae6-57340b570a57",
    "text": "Which Charles Dickens novel opens with the famous line 'It was the best of times, it was the worst of times'?",
    "options": [
      "Great Expectations",
      "A Tale of Two Cities",
      "Oliver Twist",
      "David Copperfield"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "A Tale of Two Cities opens with this iconic contrasting phrase.",
    "detailedExplanation": "Charles Dickens' 1859 novel 'A Tale of Two Cities' begins with one of the most recognizable opening lines in English literature: 'It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness...' The novel is set in London and Paris before and during the French Revolution, exploring themes of resurrection, sacrifice, and redemption through characters like Sydney Carton and Lucie Manette.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Tale_of_Two_Cities",
    "citationTitle": "Wikipedia: A Tale of Two Cities"
  },
  {
    "id": "4b88870c-1b76-4326-89a8-84b1baf2f977",
    "text": "In Jane Austen's Pride and Prejudice, what is the name of Mr. Darcy's estate?",
    "options": [
      "Longbourn",
      "Netherfield Park",
      "Pemberley",
      "Rosings Park"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Pemberley is Mr. Darcy's grand estate in Derbyshire.",
    "detailedExplanation": "Pemberley is the fictional estate owned by Fitzwilliam Darcy in Jane Austen's 1813 novel 'Pride and Prejudice.' Located in Derbyshire, the magnificent estate plays a crucial role in Elizabeth Bennet's changing perception of Darcy's character. When Elizabeth visits Pemberley with her aunt and uncle, she is impressed by its beauty and the positive testimony of Darcy's servants, contributing to her evolving feelings toward him.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pride_and_Prejudice",
    "citationTitle": "Wikipedia: Pride and Prejudice"
  },
  {
    "id": "d8cd7c1b-3ee7-4e46-9b47-49db533dcb62",
    "text": "Which William Blake collection contains the poems 'The Tyger' and 'London'?",
    "options": [
      "Songs of Innocence",
      "Songs of Experience",
      "The Marriage of Heaven and Hell",
      "Jerusalem"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Both 'The Tyger' and 'London' appear in Blake's Songs of Experience.",
    "detailedExplanation": "William Blake's 'Songs of Experience' (1794) contains some of his most famous and dark poems, including 'The Tyger' with its famous opening 'Tyger Tyger, burning bright' and 'London,' which critiques the social conditions of the city. This collection was designed as a companion to his earlier 'Songs of Innocence' (1789), exploring the darker, more complex aspects of human nature and society in contrast to the innocent perspective of the earlier work.",
    "citationUrl": "https://en.wikipedia.org/wiki/Songs_of_Innocence_and_of_Experience",
    "citationTitle": "Wikipedia: Songs of Innocence and of Experience"
  },
  {
    "id": "de0e24ab-1386-4cae-9e19-be91821d0a7f",
    "text": "In George Orwell's Animal Farm, which pig becomes the farm's leader after the rebellion?",
    "options": [
      "Boxer",
      "Snowball",
      "Napoleon",
      "Squealer"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Napoleon eventually becomes the dictatorial leader of Animal Farm.",
    "detailedExplanation": "In George Orwell's 1945 allegorical novella 'Animal Farm,' Napoleon is the Berkshire boar who gradually becomes the tyrannical leader of the farm after the animals' rebellion against their human owner. Initially sharing leadership with Snowball, Napoleon eventually drives out his rival and establishes himself as the sole dictator, representing Stalin in Orwell's critique of the Russian Revolution and subsequent Soviet regime.",
    "citationUrl": "https://en.wikipedia.org/wiki/Animal_Farm",
    "citationTitle": "Wikipedia: Animal Farm"
  },
  {
    "id": "ac8634c1-e91d-4651-b48e-c5ccb8052929",
    "text": "Which Samuel Taylor Coleridge poem features the line 'Water, water, every where, / Nor any drop to drink'?",
    "options": [
      "Kubla Khan",
      "Christabel",
      "The Rime of the Ancient Mariner",
      "Frost at Midnight"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "This famous line about being surrounded by undrinkable seawater appears in The Rime of the Ancient Mariner.",
    "detailedExplanation": "Samuel Taylor Coleridge's 'The Rime of the Ancient Mariner' (1798) contains this famous paradoxical line spoken by the mariner who is stranded at sea. The supernatural ballad tells the story of a sailor who kills an albatross and faces dire consequences, including being surrounded by ocean water that cannot quench his thirst. The poem is considered one of the finest examples of Romantic poetry and explores themes of sin, redemption, and the relationship between humans and nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rime_of_the_Ancient_Mariner",
    "citationTitle": "Wikipedia: The Rime of the Ancient Mariner"
  },
  {
    "id": "6b4cb7ee-9dd7-4ef9-927d-c7853c5a3eb6",
    "text": "In Emily Brontë's Wuthering Heights, what is the name of the foundling adopted by Mr. Earnshaw?",
    "options": [
      "Edgar Linton",
      "Hareton Earnshaw",
      "Heathcliff",
      "Joseph"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Heathcliff is the mysterious foundling who becomes central to the novel's tragic love story.",
    "detailedExplanation": "Heathcliff is the dark, brooding character at the center of Emily Brontë's 1847 novel 'Wuthering Heights.' Found as a child on the streets of Liverpool and brought home by Mr. Earnshaw, Heathcliff's passionate and destructive relationship with Catherine Earnshaw drives the novel's plot. His mysterious origins, intense nature, and quest for revenge make him one of the most compelling and controversial characters in English literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wuthering_Heights",
    "citationTitle": "Wikipedia: Wuthering Heights"
  },
  {
    "id": "5d5bc523-d02d-451e-9c83-b74480f591f3",
    "text": "Which Oscar Wilde play features the character Lady Bracknell and her famous line about being born in a handbag?",
    "options": [
      "An Ideal Husband",
      "The Picture of Dorian Gray",
      "A Woman of No Importance",
      "The Importance of Being Earnest"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Lady Bracknell's shock at Jack's origins appears in The Importance of Being Earnest.",
    "detailedExplanation": "Oscar Wilde's 1895 comedy 'The Importance of Being Earnest' features the formidable Lady Bracknell, who delivers the memorable line 'A handbag?' when learning that Jack Worthing was found as a baby in a handbag at Victoria Station. This brilliant satire of Victorian society and its obsession with social status remains one of the most frequently performed English comedies, showcasing Wilde's wit and mastery of theatrical dialogue.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Importance_of_Being_Earnest",
    "citationTitle": "Wikipedia: The Importance of Being Earnest"
  },
  {
    "id": "622aea41-1002-4bcb-9165-e744899ca20c",
    "text": "In Christopher Marlowe's Doctor Faustus, for how many years does Faustus sell his soul to Mephistopheles?",
    "options": [
      "Twenty years",
      "Twenty-four years",
      "Thirty years",
      "Fifty years"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Faustus agrees to a twenty-four year contract for his soul.",
    "detailedExplanation": "In Christopher Marlowe's tragic play 'Doctor Faustus' (c. 1592), the protagonist makes a pact with the demon Mephistopheles to gain unlimited knowledge and magical powers in exchange for his soul after twenty-four years. This Elizabethan drama, based on the German Faust legend, explores themes of ambition, knowledge, and damnation. The play is considered one of the finest achievements of English Renaissance drama and established many conventions of the Faust story in literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doctor_Faustus_(play)",
    "citationTitle": "Wikipedia: Doctor Faustus (play)"
  },
  {
    "id": "179b31fc-3a21-49a2-a5d3-292671630a40",
    "text": "Which Joseph Conrad novel features the narrator Marlow recounting his journey up the Congo River to find the mysterious ivory trader Kurtz?",
    "options": [
      "Lord Jim",
      "Heart of Darkness",
      "Nostromo",
      "The Secret Agent"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Heart of Darkness features Marlow's journey up the Congo River to find Kurtz.",
    "detailedExplanation": "Heart of Darkness (1899) is Conrad's most famous novella, narrated by Marlow who tells of his steamboat journey into the African interior to locate Kurtz, an ivory trader who has gone rogue. The work explores themes of imperialism, corruption, and the darkness within human nature. Kurtz's final words 'The horror! The horror!' have become iconic in literature, and the novella later inspired Francis Ford Coppola's film Apocalypse Now.",
    "citationUrl": "https://en.wikipedia.org/wiki/Heart_of_Darkness",
    "citationTitle": "Wikipedia: Heart of Darkness"
  },
  {
    "id": "bc402778-5524-4a9e-874e-c8305ba4606f",
    "text": "In which T.S. Eliot poem does the speaker declare 'I have measured out my life with coffee spoons'?",
    "options": [
      "The Waste Land",
      "The Hollow Men",
      "The Love Song of J. Alfred Prufrock",
      "Ash Wednesday"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The famous line about measuring life with coffee spoons appears in 'The Love Song of J. Alfred Prufrock.'",
    "detailedExplanation": "'The Love Song of J. Alfred Prufrock' (1915) is Eliot's breakthrough modernist poem featuring the anxious, middle-aged narrator Prufrock who contemplates his mundane existence and social paralysis. The line 'I have measured out my life with coffee spoons' exemplifies the poem's themes of modern alienation and the triviality of bourgeois life. The poem's stream-of-consciousness style and fragmented imagery helped establish Eliot as a leading voice of literary modernism.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Love_Song_of_J._Alfred_Prufrock",
    "citationTitle": "Wikipedia: The Love Song of J. Alfred Prufrock"
  },
  {
    "id": "3ff6e468-f596-4721-b04d-04f4e808038e",
    "text": "Which Evelyn Waugh novel satirizes the British upper classes through the story of Captain Grimes, who allegedly dies but keeps reappearing throughout the narrative?",
    "options": [
      "Scoop",
      "A Handful of Dust",
      "Decline and Fall",
      "Vile Bodies"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Captain Grimes appears in 'Decline and Fall,' Waugh's debut novel where he repeatedly 'dies' only to resurface later.",
    "detailedExplanation": "Decline and Fall (1928) was Waugh's first novel and established his reputation for savage social satire. The story follows Paul Pennyfeather, an Oxford student who is expelled and becomes a teacher at a dubious Welsh boarding school. Captain Grimes, the disreputable sports master, becomes a running gag throughout the novel as he repeatedly appears to die in various circumstances only to turn up alive later, embodying Waugh's absurdist critique of British society and institutions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Decline_and_Fall",
    "citationTitle": "Wikipedia: Decline and Fall"
  },
  {
    "id": "3669d1a3-7d5c-49e2-8b2a-8893e3fe372c",
    "text": "In Edmund Spenser's epic poem 'The Faerie Queene,' which knight represents the virtue of Holiness in Book I?",
    "options": [
      "Sir Guyon",
      "Artegall",
      "The Redcrosse Knight",
      "Sir Calidore"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Redcrosse Knight is the protagonist of Book I and represents the virtue of Holiness.",
    "detailedExplanation": "The Faerie Queene (1590-1596) is Spenser's allegorical epic poem dedicated to Queen Elizabeth I. Each book follows a different knight representing a particular virtue. Book I features the Redcrosse Knight, who represents Holiness and is identified with Saint George, England's patron saint. His quest involves rescuing Una (representing Truth and the true Church) and defeating the dragon of sin and error. The complex allegory weaves together Christian symbolism, Arthurian romance, and contemporary political commentary in what is considered one of the longest poems in English literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Faerie_Queene",
    "citationTitle": "Wikipedia: The Faerie Queene"
  }
]