[
  {
    "id": "10ea9816-7286-4693-b8a9-c787d9328009",
    "text": "Which Dutch post-impressionist painter is famous for creating over 30 self-portraits during his career?",
    "options": [
      "Vincent van Gogh",
      "Rembrandt van Rijn",
      "Johannes Vermeer",
      "Piet Mondrian"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Vincent van Gogh created more than 30 self-portraits between 1886 and 1889.",
    "detailedExplanation": "Vincent van Gogh painted over 30 self-portraits during his artistic career, particularly concentrated between 1886 and 1889. These works served as both artistic practice and psychological exploration, as van Gogh couldn't afford to hire models. His self-portraits show his evolving style and provide insight into his mental state, making them some of the most recognizable and studied works in art history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Self-portraits_by_Vincent_van_Gogh",
    "citationTitle": "Wikipedia: Self-portraits by Vincent van Gogh"
  },
  {
    "id": "53f0715e-62d5-4f75-b73d-2747ba1aa0d8",
    "text": "Leonardo da Vinci's 'Mona Lisa' is housed in which famous museum?",
    "options": [
      "The Uffizi Gallery",
      "The Louvre",
      "The Metropolitan Museum",
      "The National Gallery"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "The Mona Lisa has been permanently housed in the Louvre Museum in Paris since 1797.",
    "detailedExplanation": "Leonardo da Vinci's Mona Lisa, painted between 1503-1519, is permanently displayed in the Louvre Museum in Paris, France. The painting arrived at the Louvre in 1797 and has become the museum's most famous attraction, drawing millions of visitors annually. The work is protected behind bulletproof glass due to various incidents over the years, including theft in 1911 and vandalism attempts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mona_Lisa",
    "citationTitle": "Wikipedia: Mona Lisa"
  },
  {
    "id": "f95cc40a-16c5-4407-ba99-fe396ab5da71",
    "text": "Which Mexican artist is known for her many self-portraits and her distinctive unibrow?",
    "options": [
      "Georgia O'Keeffe",
      "Frida Kahlo",
      "Remedios Varo",
      "Leonora Carrington"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Frida Kahlo painted 55 self-portraits and was known for depicting herself with a prominent unibrow.",
    "detailedExplanation": "Frida Kahlo created approximately 55 self-portraits out of her 143 paintings, often depicting herself with her characteristic unibrow and facial hair as a rejection of conventional beauty standards. Born in 1907, Kahlo began painting self-portraits while bedridden recovering from polio and later a serious accident. Her self-portraits often incorporated symbolism from Mexican culture and explored themes of identity, pain, and the human condition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Frida_Kahlo",
    "citationTitle": "Wikipedia: Frida Kahlo"
  },
  {
    "id": "1e78d025-7641-4113-ac37-a8b858326508",
    "text": "Edvard Munch's famous painting 'The Scream' was created in which decade?",
    "options": [
      "1880s",
      "1890s",
      "1900s",
      "1910s"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Edvard Munch created the first version of 'The Scream' in 1893.",
    "detailedExplanation": "Edvard Munch created the first version of 'The Scream' in 1893, with several versions following in subsequent years. The Norwegian artist was inspired by a personal experience of hearing 'the scream of nature' while walking at sunset. The painting has become one of the most iconic images in art history, symbolizing modern anxiety and existential angst. Multiple versions exist in different media, including pastels, tempera, and lithographs.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Scream",
    "citationTitle": "Wikipedia: The Scream"
  },
  {
    "id": "09067d70-8837-4c1f-bd3f-044f4bd68f97",
    "text": "Andy Warhol created multiple screen-printed portraits of which famous actress following her death in 1962?",
    "options": [
      "Grace Kelly",
      "Marilyn Monroe",
      "Elizabeth Taylor",
      "Audrey Hepburn"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Warhol created his famous Marilyn Diptych and other Marilyn portraits shortly after Monroe's death in August 1962.",
    "detailedExplanation": "Andy Warhol created his iconic series of Marilyn Monroe portraits immediately following the actress's death in August 1962. The most famous of these works is the 'Marilyn Diptych,' completed in 1962, which features 50 images of Monroe's face in bright colors on one side and black and white on the other. These works exemplified Warhol's pop art style and his commentary on celebrity culture, fame, and mortality in American society.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marilyn_Diptych",
    "citationTitle": "Wikipedia: Marilyn Diptych"
  },
  {
    "id": "ac1766ff-4edb-4a29-bdba-b1675bcdefe7",
    "text": "Which Renaissance master painted 'The Birth of Venus,' showing the goddess emerging from the sea?",
    "options": [
      "Michelangelo",
      "Sandro Botticelli",
      "Raphael",
      "Titian"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Sandro Botticelli painted 'The Birth of Venus' around 1484-1486 during the Italian Renaissance.",
    "detailedExplanation": "Sandro Botticelli painted 'The Birth of Venus' between 1484-1486, during the height of the Italian Renaissance. The painting depicts the Roman goddess Venus emerging from the sea as a fully grown woman, as described in classical mythology. The work is housed in the Uffizi Gallery in Florence and is considered one of the masterpieces of Western art, exemplifying the Renaissance ideals of beauty and the revival of classical themes in art.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Birth_of_Venus",
    "citationTitle": "Wikipedia: The Birth of Venus"
  },
  {
    "id": "474460e6-73ed-46d9-a87e-8a5c33c2028a",
    "text": "Pablo Picasso's revolutionary painting 'Les Demoiselles d'Avignon' is considered a founding work of which art movement?",
    "options": [
      "Impressionism",
      "Surrealism",
      "Cubism",
      "Expressionism"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Picasso's 'Les Demoiselles d'Avignon' (1907) is considered a proto-Cubist work that helped establish the Cubist movement.",
    "detailedExplanation": "Pablo Picasso's 'Les Demoiselles d'Avignon,' painted in 1907, is widely considered one of the founding works of Cubism. The painting depicts five nude female figures with faces inspired by African masks and Iberian sculpture, breaking away from traditional European painting conventions. The fragmented, geometric approach to representing the human form revolutionized art and paved the way for the development of Cubism, which Picasso would further develop with Georges Braque.",
    "citationUrl": "https://en.wikipedia.org/wiki/Les_Demoiselles_d%27Avignon",
    "citationTitle": "Wikipedia: Les Demoiselles d'Avignon"
  },
  {
    "id": "a17e4cf7-10eb-4fb8-a41c-e1a548dca0b7",
    "text": "Grant Wood's painting 'American Gothic' features a farmer holding which tool?",
    "options": [
      "A hammer",
      "A pitchfork",
      "A shovel",
      "A scythe"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "In 'American Gothic' (1930), the male figure holds a three-pronged pitchfork.",
    "detailedExplanation": "Grant Wood's 'American Gothic,' painted in 1930, features a farmer holding a three-pronged pitchfork standing beside a woman in front of a house with a distinctive Gothic Revival window. The painting has become one of the most parodied and recognizable images in American art. Wood used his sister and his dentist as models for the figures, and the house that inspired the painting is located in Eldon, Iowa. The work is housed in the Art Institute of Chicago.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_Gothic",
    "citationTitle": "Wikipedia: American Gothic"
  },
  {
    "id": "68ecd9ba-dd92-43b4-8ea9-6f6138f63be5",
    "text": "Which famous artist painted 'Girl with a Pearl Earring', often called the 'Mona Lisa of the North'?",
    "options": [
      "Johannes Vermeer",
      "Rembrandt van Rijn",
      "Jan van Eyck",
      "Pieter Bruegel"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Johannes Vermeer painted 'Girl with a Pearl Earring' around 1665.",
    "detailedExplanation": "Johannes Vermeer, the Dutch Baroque period painter, created 'Girl with a Pearl Earring' around 1665. This iconic portrait features a mysterious young woman wearing an exotic dress and a large pearl earring. The painting has become one of Vermeer's most well-known works and is often referred to as the 'Mona Lisa of the North' due to its enigmatic subject and widespread recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Girl_with_a_Pearl_Earring",
    "citationTitle": "Wikipedia: Girl with a Pearl Earring"
  },
  {
    "id": "90c62baf-2708-4f43-a224-3c89eef58027",
    "text": "Salvador Dalí's melting clocks appear in which of his most famous surrealist paintings?",
    "options": [
      "The Elephants",
      "The Persistence of Memory",
      "Dream Caused by the Flight of a Bee",
      "Metamorphosis of Narcissus"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "'The Persistence of Memory' (1931) features Dalí's iconic melting pocket watches.",
    "detailedExplanation": "Salvador Dalí's 'The Persistence of Memory', painted in 1931, is one of the most recognizable works of Surrealism. The painting features several melting pocket watches draped over various objects in a dreamlike landscape. Dalí described the soft watches as representing the relativity and fluidity of time, inspired by Einstein's theory of relativity and his observation of melting Camembert cheese.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Persistence_of_Memory",
    "citationTitle": "Wikipedia: The Persistence of Memory"
  },
  {
    "id": "fbfeb9e6-8a30-429f-85e9-ef0ef0685fe0",
    "text": "Which Italian Renaissance artist is famous for painting the ceiling of the Sistine Chapel?",
    "options": [
      "Leonardo da Vinci",
      "Raphael",
      "Michelangelo",
      "Donatello"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Michelangelo painted the Sistine Chapel ceiling between 1508 and 1512.",
    "detailedExplanation": "Michelangelo Buonarroti painted the ceiling of the Sistine Chapel in Vatican City between 1508 and 1512, commissioned by Pope Julius II. The ceiling features nine scenes from the Book of Genesis, including the famous 'Creation of Adam' where God gives life to the first man. This monumental work is considered one of the greatest achievements in Western art and required Michelangelo to work lying on his back on scaffolding for four years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sistine_Chapel_ceiling",
    "citationTitle": "Wikipedia: Sistine Chapel ceiling"
  },
  {
    "id": "01f14a5d-46c7-483a-868b-54483139f661",
    "text": "Gustav Klimt's golden portrait 'The Kiss' was painted during which artistic period of his career?",
    "options": [
      "Blue Period",
      "Golden Period",
      "Rose Period",
      "Cubist Period"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Klimt painted 'The Kiss' during his Golden Period (1907-1908).",
    "detailedExplanation": "Gustav Klimt painted 'The Kiss' between 1907 and 1908 during what is known as his 'Golden Period'. This phase of his career was characterized by the extensive use of gold leaf in his paintings, inspired by Byzantine mosaics he had seen in Ravenna. The painting depicts a couple embracing, with their bodies wrapped in elaborate robes decorated with colorful symbols and patterns against a bronze background.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kiss_(Klimt)",
    "citationTitle": "Wikipedia: The Kiss (Klimt)"
  },
  {
    "id": "131c1ae8-01ba-430b-ae25-898566eb7c38",
    "text": "Which Post-Impressionist painter created the series of water lily paintings displayed at the Musée de l'Orangerie in Paris?",
    "options": [
      "Pierre-Auguste Renoir",
      "Claude Monet",
      "Edgar Degas",
      "Paul Cézanne"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Claude Monet painted over 250 water lily paintings, with large panels displayed at the Orangerie.",
    "detailedExplanation": "Claude Monet created approximately 250 oil paintings of water lilies between 1896 and his death in 1926. The most famous of these are the large-scale panels housed in two oval rooms at the Musée de l'Orangerie in Paris. These monumental works were painted in Monet's garden at Giverny and represent the culmination of his lifelong interest in capturing the effects of light and reflection on water.",
    "citationUrl": "https://en.wikipedia.org/wiki/Water_Lilies_(Monet_series)",
    "citationTitle": "Wikipedia: Water Lilies (Monet series)"
  },
  {
    "id": "97a0ce9c-20ea-413a-b87c-0327f4c6c71f",
    "text": "Jackson Pollock is best known for pioneering which painting technique?",
    "options": [
      "Pointillism",
      "Drip painting",
      "Impasto",
      "Sfumato"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Pollock developed the drip painting technique, pouring and dripping paint onto canvas.",
    "detailedExplanation": "Jackson Pollock revolutionized abstract art with his drip painting technique, also known as 'action painting'. He would place large canvases on the floor and drip, pour, and splatter paint from above, often using sticks, brushes, or directly from paint cans. This technique allowed him to paint from all four sides of the canvas and created dynamic, energetic compositions. His most famous works using this method include 'No. 1, 1950 (Lavender Mist)' and 'Autumn Rhythm'.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jackson_Pollock",
    "citationTitle": "Wikipedia: Jackson Pollock"
  },
  {
    "id": "d1656c9a-c209-4995-b6ab-b66349035227",
    "text": "Which Japanese artist is famous for her polka dot infinity rooms and pumpkin sculptures?",
    "options": [
      "Yoko Ono",
      "Yayoi Kusama",
      "Takashi Murakami",
      "Katsushika Hokusai"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Yayoi Kusama is renowned for her polka dot 'Infinity Rooms' and colorful pumpkin artworks.",
    "detailedExplanation": "Yayoi Kusama is a contemporary Japanese artist known for her immersive 'Infinity Rooms' covered in polka dots and mirrors, creating the illusion of endless space. Her obsession with dots, which she calls 'infinity nets', stems from hallucinations she has experienced since childhood. Her iconic pumpkin sculptures, painted with her signature polka dots in bright colors, have become some of the most recognizable works in contemporary art.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yayoi_Kusama",
    "citationTitle": "Wikipedia: Yayoi Kusama"
  },
  {
    "id": "45885d22-a383-4012-b64d-e6433610355a",
    "text": "Rembrandt's painting 'The Night Watch' actually depicts which time of day?",
    "options": [
      "Early morning",
      "Midday",
      "Evening",
      "Midnight"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Despite its name, 'The Night Watch' actually shows a daytime scene at midday.",
    "detailedExplanation": "Rembrandt's famous 1642 painting, officially titled 'Militia Company of District II under the Command of Captain Frans Banninck Cocq', became known as 'The Night Watch' due to the dark varnish that accumulated over centuries, making it appear to be a nighttime scene. However, after restoration, it was revealed that the scene actually takes place during the day, with sunlight streaming across the composition. The painting depicts a city militia preparing to march out.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Night_Watch",
    "citationTitle": "Wikipedia: The Night Watch"
  },
  {
    "id": "2144724e-e650-415e-81ad-f23540e77f60",
    "text": "Which American artist painted the iconic 'Double Elvis' screen print featuring the King of Rock and Roll?",
    "options": [
      "Roy Lichtenstein",
      "Andy Warhol",
      "Jasper Johns",
      "Robert Rauschenberg"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Andy Warhol created the famous 'Double Elvis' screen print in 1963.",
    "detailedExplanation": "Andy Warhol's 'Double Elvis' (1963) is one of his most famous works from his celebrity portrait series. The screen print shows two overlapping images of Elvis Presley in a cowboy stance from the film 'Flaming Star.' This work exemplifies Warhol's fascination with fame, repetition, and mass media culture. The piece sold for over $37 million at auction in 2008, making it one of the most expensive Warhol works ever sold.",
    "citationUrl": "https://en.wikipedia.org/wiki/Double_Elvis",
    "citationTitle": "Wikipedia: Double Elvis"
  },
  {
    "id": "dee97d22-60d8-448e-b04a-682cc15072a3",
    "text": "Which famous Renaissance self-portrait shows the artist holding a palette and brushes while wearing a distinctive beret?",
    "options": [
      "Albrecht Dürer's self-portrait",
      "Raphael's self-portrait",
      "Rembrandt's self-portrait",
      "Caravaggio's self-portrait"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Rembrandt painted numerous self-portraits throughout his career, often showing himself with painting tools and wearing berets.",
    "detailedExplanation": "Rembrandt van Rijn created nearly 100 self-portraits during his lifetime, making him one of the most prolific self-portrait painters in art history. Many of these works show him in his artist's attire, including his characteristic beret, and holding his palette and brushes. These self-portraits serve as both artistic exercises and a visual autobiography, documenting his aging process and changing social status from a successful young artist to an older, financially struggling master.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rembrandt",
    "citationTitle": "Wikipedia: Rembrandt"
  },
  {
    "id": "b87631c6-8e2b-4ac4-90eb-65f4b264b85c",
    "text": "Pablo Picasso's 'Guernica' was painted in response to which historical event?",
    "options": [
      "World War I",
      "The Spanish Civil War",
      "World War II",
      "The French Revolution"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "'Guernica' was painted in 1937 as a response to the bombing of Guernica during the Spanish Civil War.",
    "detailedExplanation": "Pablo Picasso's 'Guernica' (1937) is one of the most powerful anti-war paintings in history. It was created in response to the devastating bombing of the Basque town of Guernica during the Spanish Civil War by Nazi German and Fascist Italian warplanes supporting Franco's Nationalist forces. The large-scale painting uses Picasso's cubist style to depict the horror and chaos of war, featuring fragmented figures of people, animals, and buildings in monochromatic tones.",
    "citationUrl": "https://en.wikipedia.org/wiki/Guernica_(Picasso)",
    "citationTitle": "Wikipedia: Guernica (Picasso)"
  },
  {
    "id": "5f0750b0-9361-48dc-bc3d-66f90a65b828",
    "text": "Which famous painting technique involves applying paint so thickly that brush strokes are clearly visible?",
    "options": [
      "Sfumato",
      "Chiaroscuro",
      "Impasto",
      "Glazing"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Impasto is the technique of applying paint thickly so that brush or palette knife strokes are visible.",
    "detailedExplanation": "Impasto is a painting technique where paint is laid on so thickly that the brush or palette knife strokes are visible. This technique gives texture and dimension to the painted surface and was famously used by artists like Vincent van Gogh, whose thick, expressive brushstrokes became a signature element of his style. The technique creates a three-dimensional quality that can catch and reflect light differently across the painting's surface, adding to its visual impact and emotional intensity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Impasto",
    "citationTitle": "Wikipedia: Impasto"
  }
]