[
  {
    "id": "20665a21-68d2-42b8-a3fa-e02d76b8ebcc",
    "text": "Which famous music festival takes place annually in Glastonbury, England?",
    "options": [
      "Reading Festival",
      "Glastonbury Festival",
      "Download Festival",
      "Latitude Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Glastonbury Festival is the iconic music festival held in Glastonbury, Somerset, England.",
    "detailedExplanation": "Glastonbury Festival is one of the world's most famous music festivals, held annually in Somerset, England. Founded by Michael Eavis in 1970, it features contemporary music performances across multiple stages and attracts hundreds of thousands of attendees. The festival is known for its diverse lineup spanning rock, pop, world music, jazz, and electronic music, as well as its iconic Pyramid Stage.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glastonbury_Festival",
    "citationTitle": "Wikipedia: Glastonbury Festival"
  },
  {
    "id": "501ec0c4-1827-4a9e-9537-b4ee3f49b9bf",
    "text": "In which US state does the famous Coachella music festival take place?",
    "options": [
      "Nevada",
      "Arizona",
      "California",
      "Texas"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Coachella takes place in Indio, California, in the Colorado Desert.",
    "detailedExplanation": "The Coachella Valley Music and Arts Festival, commonly known as Coachella, is held annually in Indio, California, located in the Colorado Desert. The festival typically takes place over two consecutive weekends in April and features a mix of popular and alternative rock, indie, hip hop, and electronic dance music artists. Since its inception in 1999, Coachella has become one of the most profitable and popular music festivals in the United States.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coachella_Valley_Music_and_Arts_Festival",
    "citationTitle": "Wikipedia: Coachella Valley Music and Arts Festival"
  },
  {
    "id": "ebf9beeb-85c5-4acb-b2be-f1c878e83ab0",
    "text": "What does the acronym 'EDM' commonly stand for in relation to electronic music festivals?",
    "options": [
      "Electric Dance Music",
      "Electronic Dance Music",
      "Electronic Digital Music",
      "Electric Digital Music"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "EDM stands for Electronic Dance Music, a broad range of electronic music genres made for dancing.",
    "detailedExplanation": "Electronic Dance Music (EDM) is a broad range of percussive electronic music genres made largely for nightclubs, raves, and festivals. EDM festivals have become increasingly popular worldwide, featuring DJ sets and live electronic performances. Major EDM festivals include Tomorrowland in Belgium, Ultra Music Festival in Miami, and Electric Daisy Carnival in Las Vegas, attracting hundreds of thousands of electronic music fans annually.",
    "citationUrl": "https://en.wikipedia.org/wiki/Electronic_dance_music",
    "citationTitle": "Wikipedia: Electronic dance music"
  },
  {
    "id": "21681443-62aa-45a6-a22b-d60886ba7e7a",
    "text": "Which music festival is famous for taking place in the Nevada desert and emphasizes art, self-expression, and community?",
    "options": [
      "Burning Man",
      "Electric Daisy Carnival",
      "Bonnaroo",
      "Lollapalooza"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Burning Man is the unique festival held in Nevada's Black Rock Desert, known for its focus on art, self-expression, and radical self-reliance.",
    "detailedExplanation": "Burning Man is an annual event held in Nevada's Black Rock Desert that combines music, art, self-expression, and self-reliance. While music is a significant component, the festival is equally known for its large-scale art installations, theme camps, and the burning of a large wooden effigy. The event operates on principles of gifting, decommodification, and leaving no trace, creating a temporary city that disappears after the festival ends.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burning_Man",
    "citationTitle": "Wikipedia: Burning Man"
  },
  {
    "id": "13eaae6d-7435-4483-b9b0-34c5218a057a",
    "text": "Woodstock, one of the most famous music festivals in history, took place in which decade?",
    "options": [
      "1950s",
      "1960s",
      "1970s",
      "1980s"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Woodstock took place in August 1969, making it a defining event of the 1960s.",
    "detailedExplanation": "The Woodstock Music & Art Fair took place from August 15-18, 1969, in Bethel, New York. Despite being planned for 50,000 people, an estimated 400,000 attendees gathered for the festival, which featured legendary performances by artists like Jimi Hendrix, Janis Joplin, and The Who. Woodstock became a symbol of the 1960s counterculture movement and is often cited as one of the most important moments in music history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Woodstock",
    "citationTitle": "Wikipedia: Woodstock"
  },
  {
    "id": "7ae3fe43-453b-4563-b1f0-1177f3878880",
    "text": "Which European country hosts the famous Tomorrowland electronic music festival?",
    "options": [
      "Netherlands",
      "Germany",
      "Belgium",
      "France"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tomorrowland takes place in Boom, Belgium, and is one of the world's largest electronic music festivals.",
    "detailedExplanation": "Tomorrowland is held annually in Boom, Belgium, and has become one of the world's most prestigious electronic dance music festivals since its inception in 2005. The festival is known for its elaborate stage designs, magical themes, and lineup of top international DJs and electronic music artists. Tomorrowland attracts attendees from around the globe and has expanded to include events in other countries, but its original and main location remains in Belgium.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tomorrowland_(festival)",
    "citationTitle": "Wikipedia: Tomorrowland (festival)"
  },
  {
    "id": "b915db2a-1a20-4347-81b5-b2130e87181e",
    "text": "Lollapalooza music festival was originally founded by which musician in 1991?",
    "options": [
      "Kurt Cobain",
      "Perry Farrell",
      "Eddie Vedder",
      "Chris Cornell"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Perry Farrell, lead singer of Jane's Addiction, founded Lollapalooza in 1991.",
    "detailedExplanation": "Lollapalooza was conceived and founded by Perry Farrell, the lead vocalist of the alternative rock band Jane's Addiction, in 1991. Originally created as a farewell tour for Jane's Addiction, the festival featured multiple stages with diverse musical genres and became a cultural phenomenon. After several years as a touring festival, Lollapalooza became a destination festival in Chicago's Grant Park in 2005, where it continues to be held annually.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lollapalooza",
    "citationTitle": "Wikipedia: Lollapalooza"
  },
  {
    "id": "2ae5cd36-a255-47a6-a455-015b8d6f4562",
    "text": "The Roskilde Festival, one of Europe's largest music festivals, takes place in which country?",
    "options": [
      "Sweden",
      "Norway",
      "Denmark",
      "Finland"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Roskilde Festival takes place in Roskilde, Denmark, and is one of Northern Europe's largest music festivals.",
    "detailedExplanation": "Roskilde Festival is held annually in Roskilde, Denmark, about 30 kilometers west of Copenhagen. Founded in 1971, it has grown to become one of Northern Europe's largest music festivals, featuring rock, pop, electronic, hip-hop, and world music. The festival is notable for being a non-profit event, with proceeds donated to humanitarian and cultural causes. It typically attracts over 100,000 attendees and runs for eight days, making it one of the longest-running festivals in Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roskilde_Festival",
    "citationTitle": "Wikipedia: Roskilde Festival"
  },
  {
    "id": "e94f0f45-66f3-4c66-a976-2d5964073006",
    "text": "Which music festival is known for its distinctive pyramid-shaped stage and takes place on Worthy Farm?",
    "options": [
      "Reading Festival",
      "Glastonbury Festival",
      "V Festival",
      "Download Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Glastonbury Festival is famous for its iconic pyramid-shaped Pyramid Stage located on Worthy Farm.",
    "detailedExplanation": "The Glastonbury Festival, held on Worthy Farm in Somerset, England, is renowned for its distinctive Pyramid Stage, which has become an iconic symbol of the festival. The current steel structure replaced earlier wooden versions and serves as the main stage where headline acts perform. The pyramid design has become synonymous with Glastonbury and is one of the most recognizable stage designs in the festival world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glastonbury_Festival",
    "citationTitle": "Wikipedia: Glastonbury Festival"
  },
  {
    "id": "4e0f7490-6134-4946-8be4-4de2a8d282e7",
    "text": "What is the typical duration of most major music festivals?",
    "options": [
      "1 day",
      "2-4 days",
      "1 week",
      "2 weeks"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Most major music festivals typically run for 2-4 days, usually over a weekend period.",
    "detailedExplanation": "The majority of prominent music festivals are designed to run over a weekend period, typically spanning 2-4 days. This format allows attendees to experience multiple days of performances while maintaining a manageable timeframe for both organizers and festival-goers. Weekend festivals usually run from Friday to Sunday (3 days) or Thursday to Sunday (4 days), though some smaller events may be single-day affairs and a few larger festivals extend beyond this typical range.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_festival",
    "citationTitle": "Wikipedia: Music Festival"
  },
  {
    "id": "128256a2-ec2e-46df-a49f-6d5103aad978",
    "text": "Which festival is famous for being held in a muddy field and is often associated with Wellington boots?",
    "options": [
      "Bonnaroo",
      "Glastonbury",
      "Sziget",
      "Rock am Ring"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Glastonbury is notoriously associated with muddy conditions and Wellington boots due to frequent rain.",
    "detailedExplanation": "Glastonbury Festival has gained legendary status not just for its music but also for its frequently muddy conditions. The Somerset location's propensity for rain, combined with hundreds of thousands of festival-goers trampling the grass, often creates a muddy landscape that has become part of the festival's character. Wellington boots (wellies) have become essential festival gear and almost a fashion statement at Glastonbury, with many attendees decorating them or buying special festival-themed designs.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glastonbury_Festival",
    "citationTitle": "Wikipedia: Glastonbury Festival"
  },
  {
    "id": "dc69ecda-1042-430a-a731-1c37d99edcc4",
    "text": "What do festival-goers typically sleep in when camping at multi-day music festivals?",
    "options": [
      "Hotels",
      "Tents",
      "RVs only",
      "Hostels"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tents are the most common accommodation for festival-goers camping at multi-day music festivals.",
    "detailedExplanation": "Camping is an integral part of the multi-day festival experience, with the vast majority of attendees staying in tents. Festival campsites are typically designated areas where people can pitch tents for the duration of the event. While some festivals offer RV camping options or nearby accommodation, tents remain the most popular, affordable, and practical choice for most festival-goers. The camping experience often extends the festival atmosphere beyond the music, creating temporary communities and adding to the overall festival culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_festival",
    "citationTitle": "Wikipedia: Music Festival"
  },
  {
    "id": "8885dbcf-83a3-44c5-b07a-b91d49653c07",
    "text": "Which season do most major outdoor music festivals take place in the Northern Hemisphere?",
    "options": [
      "Winter",
      "Spring",
      "Summer",
      "Fall"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Summer is the peak season for outdoor music festivals in the Northern Hemisphere due to favorable weather conditions.",
    "detailedExplanation": "Summer is overwhelmingly the most popular season for outdoor music festivals in the Northern Hemisphere, typically running from June through August. This timing takes advantage of warmer weather, longer daylight hours, and reduced chances of rain in many regions. The summer festival season has become a cultural phenomenon, with many festivals becoming annual traditions. While some festivals do occur in other seasons, the concentration of major outdoor festivals in summer months is due to practical considerations of weather, attendance, and the outdoor experience that defines most music festivals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_festival",
    "citationTitle": "Wikipedia: Music Festival"
  },
  {
    "id": "f566adf6-1bfe-412e-8fb0-c38e42a22246",
    "text": "What type of fencing is commonly used to separate different areas at music festivals?",
    "options": [
      "Wooden picket fences",
      "Brick walls",
      "Metal barriers",
      "Hedge rows"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Metal barriers are commonly used at music festivals for crowd control and area separation.",
    "detailedExplanation": "Metal barriers, often called crowd control barriers or festival barriers, are the standard fencing used at music festivals. These portable steel barriers can be quickly assembled and disassembled, making them ideal for temporary events. They're used to separate different areas such as VIP sections, backstage areas, and general admission zones, as well as to control crowd flow and ensure safety. The barriers are designed to be sturdy enough to withstand crowd pressure while being lightweight enough for easy transport and setup.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_festival",
    "citationTitle": "Wikipedia: Music Festival"
  },
  {
    "id": "b81dc2f5-c91d-4471-a82a-8a6aa0e8936f",
    "text": "What is the term for the area directly in front of the main stage at a music festival?",
    "options": [
      "The mosh pit",
      "The front row",
      "The pit",
      "The barrier"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The area directly in front of the main stage is commonly called 'the pit' at music festivals.",
    "detailedExplanation": "At music festivals, 'the pit' refers to the area immediately in front of the main stage, typically separated from the general admission area by barriers. This area often provides the closest viewing experience and is highly sought after by festival-goers wanting to be near their favorite performers. Access to the pit may be controlled through early admission, special tickets, or first-come-first-served basis. The term originates from concert venues where this area was often lower than surrounding areas, creating a 'pit-like' appearance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_venue",
    "citationTitle": "Wikipedia: Music Venue"
  },
  {
    "id": "6b768a74-4dc6-465b-83b0-7a093f6ec861",
    "text": "What essential item do music festivals typically require attendees to wear for identification and entry?",
    "options": [
      "Name tags",
      "Wristbands",
      "Badges",
      "T-shirts"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Wristbands are the standard identification and entry method used at most music festivals.",
    "detailedExplanation": "Festival wristbands have become the universal standard for music festival admission and identification. These are typically made of fabric, plastic, or tyvek material and are designed to be tamper-evident and difficult to remove or transfer. Wristbands often feature the festival's branding, year, and sometimes special coding or RFID technology for added security. They serve multiple purposes: proving admission, allowing re-entry to the festival grounds, and often differentiating between different ticket types (general admission, VIP, artist passes, etc.). Many festival-goers keep their wristbands as souvenirs long after the event.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_festival",
    "citationTitle": "Wikipedia: Music Festival"
  },
  {
    "id": "47c2ca73-2af0-4766-a157-3f2cdbd52bc8",
    "text": "Which music festival holds the Guinness World Record as the world's largest music festival by attendance?",
    "options": [
      "Rock in Rio",
      "Donauinselfest",
      "Summerfest",
      "Download Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Donauinselfest in Vienna, Austria holds the record with over 3 million attendees annually.",
    "detailedExplanation": "Donauinselfest, held annually on Vienna's Danube Island, has been recognized by Guinness World Records as the world's largest music festival by attendance. The free festival typically attracts over 3 million visitors across its three-day duration, featuring multiple stages with rock, pop, folk, and electronic music acts. What makes it unique is that admission is completely free, contributing to its massive attendance figures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Donauinselfest",
    "citationTitle": "Wikipedia: Donauinselfest"
  },
  {
    "id": "ec0abb8e-4d99-4eb7-af94-97b04a71d019",
    "text": "Which city is home to the South by Southwest (SXSW) music festival?",
    "options": [
      "Nashville",
      "Austin",
      "Atlanta",
      "New Orleans"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "SXSW takes place annually in Austin, Texas, combining music, interactive media, and film conferences.",
    "detailedExplanation": "South by Southwest (SXSW) has been held in Austin, Texas since 1987. Originally focused on music, it has expanded to include interactive media and film festivals alongside the music component. The festival is known for showcasing emerging artists and has become a major cultural event that significantly impacts Austin's economy and music scene each March.",
    "citationUrl": "https://en.wikipedia.org/wiki/South_by_Southwest",
    "citationTitle": "Wikipedia: South by Southwest"
  },
  {
    "id": "3c989ec1-da46-4b68-83d9-29c790c29d7b",
    "text": "The Reading Festival, one of the UK's oldest music festivals, was originally established in which decade?",
    "options": [
      "1950s",
      "1960s",
      "1970s",
      "1980s"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Reading Festival began in 1971 as the Reading Rock Festival, making it one of the UK's longest-running music festivals.",
    "detailedExplanation": "The Reading Festival was first held in 1971 at the National Jazz, Blues & Rock Festival site. Initially focusing on progressive rock and blues, it has evolved over the decades to include various genres of rock, alternative, and pop music. The festival now runs simultaneously with Leeds Festival, with the same lineup performing at both locations on alternating days, making it one of the UK's most significant annual music events.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reading_and_Leeds_Festivals",
    "citationTitle": "Wikipedia: Reading and Leeds Festivals"
  },
  {
    "id": "7d94a1c5-41c7-4023-94fe-3d5ea36f1560",
    "text": "Which music festival is famous for taking place entirely on boats and ships?",
    "options": [
      "Floating Festival",
      "Groove Cruise",
      "Sea Dance Festival",
      "Boat Party Music Fest"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Groove Cruise is a series of electronic music festivals that take place on cruise ships at sea.",
    "detailedExplanation": "Groove Cruise is a unique concept in music festivals, featuring electronic dance music events that take place entirely aboard cruise ships. These floating festivals typically last several days and sail to various destinations while featuring DJs and electronic music artists performing in different venues throughout the ship. The concept combines the festival experience with a cruise vacation, creating a distinctive party atmosphere surrounded by ocean views.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_festival",
    "citationTitle": "Wikipedia: Music Festival"
  }
]