[
  {
    "id": "16908a2e-767d-4226-bf0a-813a9c9244ea",
    "text": "Which music festival was infamously plagued by violence, overpricing, and logistical disasters in 1969, leading to multiple deaths and becoming synonymous with festival mismanagement?",
    "options": [
      "Woodstock",
      "Altamont Free Concert",
      "Monterey Pop Festival",
      "Isle of Wight Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Altamont Free Concert resulted in four deaths and widespread violence.",
    "detailedExplanation": "The Altamont Free Concert, held on December 6, 1969, in California, was intended to be a 'Woodstock West' but became a cautionary tale of poor planning. The Rolling Stones headlined the event, but the day was marred by violence from Hell's Angels security, inadequate facilities, and overcrowding. Four people died, including one stabbed to death during the Stones' performance, and the event became a symbol of the dark side of the 1960s counterculture movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Altamont_Free_Concert",
    "citationTitle": "Wikipedia: Altamont Free Concert"
  },
  {
    "id": "bb9c67d5-d25f-4f6a-a7d9-c3f1979f0ea9",
    "text": "Tomorrowland, one of the world's largest electronic dance music festivals, is held annually in which Belgian town?",
    "options": [
      "Boom",
      "Ghent",
      "Antwerp",
      "Leuven"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Tomorrowland takes place in the town of Boom in Belgium.",
    "detailedExplanation": "Tomorrowland has been held annually since 2005 in the town of Boom, located in the province of Antwerp, Belgium. The festival typically attracts over 400,000 attendees from around the world across two weekends in July. Known for its elaborate stage designs and fantasy themes, Tomorrowland has become one of the most prestigious electronic dance music festivals globally, with tickets often selling out within minutes of release.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tomorrowland_(festival)",
    "citationTitle": "Wikipedia: Tomorrowland (festival)"
  },
  {
    "id": "0d09b5f8-6da9-4f2c-a1b0-e0d6ce81b3fd",
    "text": "The Burning Man festival culminates with the burning of a large wooden effigy on which day of the week?",
    "options": [
      "Friday",
      "Saturday",
      "Sunday",
      "Monday"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Man is traditionally burned on Saturday night of the festival.",
    "detailedExplanation": "Burning Man, held annually in Nevada's Black Rock Desert, follows a specific schedule where the titular 'Man' - a large wooden effigy - is burned on Saturday night of the event. This burning serves as the climactic moment of the week-long festival. The event typically runs from the last Monday in August to the first Monday in September (Labor Day), and the Saturday burn is followed by the burning of the Temple structure on Sunday night, marking the festival's ceremonial conclusion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burning_Man",
    "citationTitle": "Wikipedia: Burning Man"
  },
  {
    "id": "406b1848-17a3-4c64-aa8e-9300d452115b",
    "text": "Which festival, founded by Jay-Z in 2012, was permanently cancelled after its 2013 edition due to financial losses and declining attendance?",
    "options": [
      "Made in America",
      "Budweiser Made in America",
      "Roc Nation Festival",
      "Budweiser Festival"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Made in America festival was cancelled after 2013 in Philadelphia, though it continued in other cities.",
    "detailedExplanation": "The Made in America festival was launched by Jay-Z in 2012 in Philadelphia's Benjamin Franklin Parkway. Despite initial success and high-profile performances, the Philadelphia edition faced significant financial challenges, with the city reportedly losing money on the event. The 2013 edition was the last held in Philadelphia, though the festival brand continued in other locations like Los Angeles. The festival featured a mix of hip-hop, rock, and pop artists and was intended to be an annual Labor Day weekend tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Made_in_America_Festival",
    "citationTitle": "Wikipedia: Made in America Festival"
  },
  {
    "id": "03c0e6bb-90a8-4761-a686-70386159347a",
    "text": "The Primavera Sound festival originated in which Spanish city in 2001?",
    "options": [
      "Madrid",
      "Valencia",
      "Barcelona",
      "Seville"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Primavera Sound was founded in Barcelona in 2001.",
    "detailedExplanation": "Primavera Sound began in Barcelona in 2001 as a small indie music festival and has since grown into one of Europe's most respected music festivals. Held annually in late May and early June at the Parc del Fòrum, the festival is known for its eclectic lineup spanning indie rock, electronic, pop, and experimental music. The festival has expanded internationally with editions in cities like Porto, Los Angeles, and São Paulo, but Barcelona remains its spiritual home and flagship location.",
    "citationUrl": "https://en.wikipedia.org/wiki/Primavera_Sound",
    "citationTitle": "Wikipedia: Primavera Sound"
  },
  {
    "id": "f4ecde5e-5504-43f0-b007-bdb2c94041a7",
    "text": "The disastrous Fyre Festival was supposed to take place on which Bahamian island in 2017?",
    "options": [
      "Great Exuma",
      "Eleuthera",
      "Cat Island",
      "Andros"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Fyre Festival was planned for Great Exuma in the Bahamas.",
    "detailedExplanation": "The infamous Fyre Festival was marketed as a luxury music festival scheduled to take place in April and May 2017 on Great Exuma in the Bahamas. Organized by Billy McFarland and promoted by Ja Rule, the festival was heavily promoted on social media with promises of luxury accommodations and gourmet food. Instead, attendees found disaster relief tents, cheese sandwiches, and complete organizational chaos. The festival became a symbol of influencer marketing gone wrong and resulted in multiple lawsuits and criminal charges for fraud.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fyre_Festival",
    "citationTitle": "Wikipedia: Fyre Festival"
  },
  {
    "id": "20de55b1-e109-43b0-bb98-f4c85c42ece2",
    "text": "Download Festival, one of the UK's premier rock and metal festivals, takes place at which historic venue?",
    "options": [
      "Silverstone Circuit",
      "Donington Park",
      "Brands Hatch",
      "Goodwood Circuit"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Download Festival is held at Donington Park in Leicestershire.",
    "detailedExplanation": "Download Festival has been held at Donington Park in Leicestershire, England, since 2003. The venue has a rich musical history, having hosted the famous Monsters of Rock festival from 1980 to 1996. Donington Park is primarily known as a motorsport venue, but its large open spaces make it ideal for hosting major music festivals. Download typically takes place in June and features some of the biggest names in rock and metal music, with the festival growing from 60,000 attendees in its first year to over 100,000 in recent editions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Download_Festival",
    "citationTitle": "Wikipedia: Download Festival"
  },
  {
    "id": "17841e2a-d9ef-40ee-8ed5-a7b7e4e548d7",
    "text": "Which legendary music festival producer founded Coachella and is also credited with creating the modern festival circuit through his company Goldenvoice?",
    "options": [
      "Paul Tollett",
      "Michael Eavis",
      "Rick Farman",
      "Jonathan Mayers"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Paul Tollett founded Coachella in 1999 and runs Goldenvoice, which produces numerous major festivals.",
    "detailedExplanation": "Paul Tollett is the president and CEO of Goldenvoice, the company that launched Coachella Valley Music and Arts Festival in 1999. Under his leadership, Goldenvoice has become one of the most influential festival promotion companies in the world, producing events like FYF Fest, Panorama, and numerous other major festivals. Tollett is widely credited with helping to create the modern music festival circuit and the festival culture that dominates today's music industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paul_Tollett",
    "citationTitle": "Wikipedia: Paul Tollett"
  },
  {
    "id": "f7c3f1ff-d129-4098-ae22-7bea0ada8edb",
    "text": "The world's largest heavy metal festival, Wacken Open Air, takes place annually in which country?",
    "options": [
      "Sweden",
      "Norway",
      "Germany",
      "Finland"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Wacken Open Air takes place in Wacken, Germany and is considered the world's largest heavy metal festival.",
    "detailedExplanation": "Wacken Open Air (W:O:A) is held annually in the small town of Wacken in northern Germany, attracting over 85,000 metal fans from around the world. Founded in 1990, it has grown to become the world's largest heavy metal festival, featuring hundreds of bands across multiple stages over four days. The festival has become so culturally significant that the town of Wacken, with a population of only about 1,800 people, becomes temporarily one of Germany's largest cities during the festival weekend.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wacken_Open_Air",
    "citationTitle": "Wikipedia: Wacken Open Air"
  },
  {
    "id": "84fc8384-db8d-4c44-8ef0-10e92b1615e8",
    "text": "Which music festival holds the Guinness World Record for the largest attendance at a music festival, with over 1.5 million attendees in 1997?",
    "options": [
      "Love Parade",
      "Rock in Rio",
      "Summerfest",
      "Donauinselfest"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Love Parade in Berlin set the record in 1997 with approximately 1.5 million attendees.",
    "detailedExplanation": "The Love Parade, originally held in Berlin, Germany, set the Guinness World Record for largest attendance at a music festival when approximately 1.5 million people attended the 1997 event. The Love Parade was an annual electronic dance music festival and parade that celebrated peace, love, and electronic music. The event began in 1989 as a small political demonstration for peace and international understanding through love and music, but grew into a massive cultural phenomenon before ending tragically in 2010 due to a crowd disaster in Duisburg that killed 21 people.",
    "citationUrl": "https://en.wikipedia.org/wiki/Love_Parade",
    "citationTitle": "Wikipedia: Love Parade"
  },
  {
    "id": "df66dc68-f594-4e95-9091-f530b38da32f",
    "text": "The Newport Folk Festival is famous for Bob Dylan's controversial performance in 1965, but in which U.S. state does it take place?",
    "options": [
      "Massachusetts",
      "Connecticut",
      "Rhode Island",
      "New Hampshire"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Newport Folk Festival takes place in Newport, Rhode Island, where Dylan famously 'went electric' in 1965.",
    "detailedExplanation": "The Newport Folk Festival is held annually in Newport, Rhode Island, and is one of the first and most prestigious folk music festivals in America, founded in 1959. The festival gained legendary status when Bob Dylan performed with an electric band on July 25, 1965, shocking the traditional folk audience and marking a pivotal moment in music history. This performance is often cited as the moment Dylan 'went electric,' representing a major shift from acoustic folk to electric folk rock that would influence countless musicians and the direction of popular music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Newport_Folk_Festival",
    "citationTitle": "Wikipedia: Newport Folk Festival"
  },
  {
    "id": "9c31dcbd-acf8-4439-a7f7-4d754b83337d",
    "text": "Which electronic music festival, known for its elaborate stage designs and performances, was founded by Pasquale Rotella and takes place in Las Vegas?",
    "options": [
      "Ultra Music Festival",
      "Electric Forest",
      "Electric Daisy Carnival",
      "Movement"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Electric Daisy Carnival (EDC) was founded by Pasquale Rotella and its flagship event takes place annually in Las Vegas.",
    "detailedExplanation": "Electric Daisy Carnival (EDC) was founded by Pasquale Rotella and his company Insomniac Events. The festival began in Los Angeles in 1997 but moved to Las Vegas in 2011, where it now takes place annually at the Las Vegas Motor Speedway. EDC Las Vegas is known for its massive elaborate stage designs, carnival rides, art installations, and performances, creating an immersive experience that goes beyond just music. The festival typically attracts over 400,000 attendees across three days and has become one of the largest electronic dance music festivals in North America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Electric_Daisy_Carnival",
    "citationTitle": "Wikipedia: Electric Daisy Carnival"
  },
  {
    "id": "d631e9d3-8b18-415f-95c4-2fdfac3b38a8",
    "text": "The Roskilde Festival, one of Europe's largest music festivals, is notable for being run by which type of organization?",
    "options": [
      "Government agency",
      "Non-profit organization",
      "Publicly traded corporation",
      "Religious institution"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Roskilde Festival is operated by a non-profit organization and donates its profits to humanitarian and cultural causes.",
    "detailedExplanation": "The Roskilde Festival in Denmark is unique among major music festivals because it is operated by a non-profit organization, the Roskilde Festival Charity Society. Founded in 1971, the festival donates its annual profits to humanitarian and cultural causes around the world. Over the decades, it has donated millions of Danish kroner to various charities and organizations. This non-profit model makes Roskilde stand out in an industry increasingly dominated by commercial interests, and the festival's commitment to social responsibility has become an integral part of its identity and appeal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roskilde_Festival",
    "citationTitle": "Wikipedia: Roskilde Festival"
  },
  {
    "id": "141ee419-d73a-4276-9553-f31645118ec1",
    "text": "Which jazz festival, founded in 1967, is considered the world's largest jazz festival and takes place annually in Montreal?",
    "options": [
      "Montreal International Jazz Festival",
      "Toronto Jazz Festival",
      "Ottawa Jazz Festival",
      "Quebec City Summer Festival"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Montreal International Jazz Festival, founded in 1967, holds the Guinness World Record as the world's largest jazz festival.",
    "detailedExplanation": "The Montreal International Jazz Festival (Festival International de Jazz de Montréal) was founded in 1967 and has grown to become the world's largest jazz festival according to the Guinness World Records. The festival typically features over 3,000 artists from around the world performing in more than 650 concerts, including around 450 free outdoor performances. Taking place annually in late June and early July, the festival transforms downtown Montreal into a massive celebration of jazz and related musical styles, attracting over 2 million visitors each year and significantly impacting the city's cultural and economic landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/Montreal_International_Jazz_Festival",
    "citationTitle": "Wikipedia: Montreal International Jazz Festival"
  },
  {
    "id": "426ac422-f45b-410d-bd88-b03f76e1065f",
    "text": "The Sziget Festival, often called the 'Island of Freedom,' takes place on an island in the Danube River in which European capital city?",
    "options": [
      "Vienna",
      "Belgrade",
      "Budapest",
      "Bratislava"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Sziget Festival takes place on Óbudai-sziget island in the Danube River in Budapest, Hungary.",
    "detailedExplanation": "The Sziget Festival is held annually on Óbudai-sziget (Old Buda Island), a leafy island in the Danube River in Budapest, Hungary. Founded in 1993, Sziget has grown to become one of Europe's largest music and cultural festivals, attracting over 500,000 visitors from around the world. The festival's island location creates a unique atmosphere, as attendees can camp on the island and become completely immersed in the festival experience for a week. The festival is known for its diverse lineup spanning multiple genres, art installations, and cultural programs, earning its nickname 'Island of Freedom.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Sziget_Festival",
    "citationTitle": "Wikipedia: Sziget Festival"
  },
  {
    "id": "b29555f6-a16d-4dc2-972a-f957308f4e1b",
    "text": "Which music festival was founded in 1970 by Michael Eavis on his dairy farm and has become synonymous with mud, rain, and iconic performances, including David Bowie's legendary 2000 headline set?",
    "options": [
      "Reading Festival",
      "Glastonbury Festival",
      "Isle of Wight Festival",
      "V Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Glastonbury Festival was founded by Michael Eavis in 1970 on his Somerset dairy farm.",
    "detailedExplanation": "Glastonbury Festival, officially known as the Glastonbury Festival of Contemporary Performing Arts, was established in 1970 by farmer Michael Eavis on his Worthy Farm in Somerset, England. The festival has become legendary not only for its diverse musical lineup spanning rock, pop, folk, electronic, and world music, but also for its unpredictable weather conditions that often result in muddy fields. David Bowie's 2000 performance is widely regarded as one of the greatest festival sets of all time, marking his return to major festival stages after years of absence.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glastonbury_Festival",
    "citationTitle": "Wikipedia: Glastonbury Festival"
  },
  {
    "id": "8b144902-6722-470a-b359-bf8662866e15",
    "text": "The Montreux Jazz Festival, founded in 1967, takes place on the shores of which European lake and inspired the Deep Purple song 'Smoke on the Water' after a fire destroyed the venue in 1971?",
    "options": [
      "Lake Como",
      "Lake Constance",
      "Lake Geneva",
      "Lake Zurich"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "The Montreux Jazz Festival takes place on Lake Geneva, and the 1971 fire inspired Deep Purple's famous song.",
    "detailedExplanation": "The Montreux Jazz Festival is held annually in Montreux, Switzerland, on the shores of Lake Geneva. The festival gained additional fame in rock history when a fire broke out during a Frank Zappa concert at the Casino de Montreux on December 4, 1971. Deep Purple witnessed the fire from their hotel across the lake and immortalized the event in their classic song 'Smoke on the Water,' with the lyrics referencing 'some stupid with a flare gun burned the place to the ground.' The festival has since become one of the world's most prestigious jazz festivals, though it now features artists from many genres.",
    "citationUrl": "https://en.wikipedia.org/wiki/Montreux_Jazz_Festival",
    "citationTitle": "Wikipedia: Montreux Jazz Festival"
  },
  {
    "id": "6fa5fba6-5178-41ac-bee3-c650fb70d5f0",
    "text": "Which Australian music festival, known for its alternative rock lineup, was founded by Jane's Addiction's Perry Farrell and has been running annually since 1996, making it the longest-running traveling rock festival?",
    "options": [
      "Big Day Out",
      "Lollapalooza",
      "Splendour in the Grass",
      "Falls Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Lollapalooza was founded by Perry Farrell and began its Australian edition in 1996.",
    "detailedExplanation": "While Lollapalooza originated in the United States in 1991 as Perry Farrell's farewell tour for Jane's Addiction, the festival concept has expanded globally. The question specifically references the traveling festival format that became synonymous with alternative rock culture in the 1990s. Perry Farrell created Lollapalooza to showcase alternative rock, industrial, and punk rock bands, along with performance artists and political activist booths. The festival helped bring underground music to mainstream audiences and launched many alternative bands to wider recognition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lollapalooza",
    "citationTitle": "Wikipedia: Lollapalooza"
  },
  {
    "id": "b1a55e4c-1eef-4811-83ad-f5809fe5a768",
    "text": "The Woodstock Music and Art Fair in 1969 was originally planned to take place in Woodstock, New York, but actually occurred on a dairy farm in which nearby town?",
    "options": [
      "White Lake",
      "Bethel",
      "Liberty",
      "Monticello"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Woodstock actually took place in Bethel, New York, on Max Yasgur's dairy farm.",
    "detailedExplanation": "Despite its name, the famous Woodstock festival of August 15-18, 1969, did not actually take place in Woodstock, New York. After being denied permits in Woodstock and other locations, organizers secured a location on Max Yasgur's 600-acre dairy farm in Bethel, New York, about 40 miles southwest of Woodstock. The festival attracted an estimated 400,000 attendees, far exceeding expectations, and featured legendary performances by artists including Jimi Hendrix, Janis Joplin, The Who, and Joe Cocker. The event became a defining moment of the 1960s counterculture movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Woodstock",
    "citationTitle": "Wikipedia: Woodstock"
  },
  {
    "id": "baf16ef9-9de4-40cd-b2de-584ca721aee6",
    "text": "Which electronic dance music festival, held annually in Miami during Winter Music Conference week, is credited with helping establish Miami as a global hub for electronic music and features multiple stages across South Beach?",
    "options": [
      "Ultra Music Festival",
      "Winter Music Conference",
      "Miami Music Week",
      "Art Basel Music"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "hard",
    "explanation": "Ultra Music Festival transformed Miami into a major electronic music destination during WMC week.",
    "detailedExplanation": "Ultra Music Festival, first held in 1999, takes place annually in Miami, Florida, typically in March during the Winter Music Conference week. The festival was founded by Russell Faibisch and Alex Omes and has grown from a single-day event to a three-day festival featuring the world's top DJs and electronic music artists. Ultra is credited with establishing Miami as one of the world's premier destinations for electronic dance music, spawning numerous smaller events throughout 'Miami Music Week.' The festival features elaborate stage productions, including the iconic Ultra Main Stage, and has expanded internationally to locations including Europe, South America, and Asia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ultra_Music_Festival",
    "citationTitle": "Wikipedia: Ultra Music Festival"
  }
]