[
  {
    "id": "af82389c-cb32-4395-a129-bbd0f688262b",
    "text": "Which music festival holds the Guinness World Record as the largest music festival in the world by attendance?",
    "options": [
      "Coachella",
      "Donauinselfest",
      "Glastonbury",
      "Lollapalooza"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Donauinselfest in Vienna, Austria holds the record with over 3 million attendees.",
    "detailedExplanation": "Donauinselfest, held annually on Vienna's Danube Island, is officially recognized by Guinness World Records as the world's largest music festival by attendance. The free three-day event attracts over 3 million visitors each year, featuring multiple stages with rock, pop, folk, and electronic music. Despite its massive scale, it remains relatively unknown outside of German-speaking countries compared to more commercially famous festivals like Coachella or Glastonbury.",
    "citationUrl": "https://en.wikipedia.org/wiki/Donauinselfest",
    "citationTitle": "Wikipedia: Donauinselfest"
  },
  {
    "id": "4b414812-5615-420d-8f51-e3b8c889e169",
    "text": "The famous Woodstock festival of 1969 actually took place in which New York town?",
    "options": [
      "Woodstock",
      "Bethel",
      "Saugerties",
      "Kingston"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Despite its name, Woodstock 1969 was held on a dairy farm in Bethel, New York.",
    "detailedExplanation": "The iconic Woodstock Music & Art Fair was originally planned to take place in Woodstock, New York, but due to permit issues and local opposition, organizers had to relocate the festival. It ultimately took place on Max Yasgur's 600-acre dairy farm in Bethel, New York, about 40 miles southwest of Woodstock. The festival kept its original name despite the location change, and the site in Bethel is now home to the Bethel Woods Center for the Arts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Woodstock",
    "citationTitle": "Wikipedia: Woodstock"
  },
  {
    "id": "839a6f07-e34f-409f-bf59-6208a5a79d6c",
    "text": "Which European music festival is famous for taking place in a natural amphitheater called 'The Park'?",
    "options": [
      "Download Festival",
      "Glastonbury Festival",
      "Roskilde Festival",
      "Rock Werchter"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Glastonbury Festival's Pyramid Stage is located in a natural amphitheater area known as 'The Park.'",
    "detailedExplanation": "Glastonbury Festival, held at Worthy Farm in Somerset, England, features a natural amphitheater formation that creates perfect acoustics for outdoor performances. The famous Pyramid Stage sits at the bottom of this natural bowl, allowing sound to carry effectively to audiences positioned on the surrounding slopes. This geography, combined with the festival's location in the mystical Somerset countryside near the town of Glastonbury with its ancient tor, contributes to the festival's legendary atmosphere and has helped make it one of the world's most prestigious music festivals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glastonbury_Festival",
    "citationTitle": "Wikipedia: Glastonbury Festival"
  },
  {
    "id": "f6874952-3dc6-494c-8439-9a9e5cdeefda",
    "text": "Burning Man, the famous desert festival, operates on which alternative economic principle?",
    "options": [
      "Barter system",
      "Gift economy",
      "Time banking",
      "Resource sharing"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Burning Man operates on a gift economy where goods and services are freely given without expectation of return.",
    "detailedExplanation": "Burning Man, held annually in Nevada's Black Rock Desert, is built around the concept of a gift economy, which is one of its Ten Principles. In this system, participants are encouraged to give freely without expecting anything in return, creating a culture of radical generosity. Money transactions are prohibited except for ice, coffee, and tickets to the event itself. This economic model fosters community, creativity, and human connection, distinguishing Burning Man from commercial festivals and creating a unique social experiment in the desert.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burning_Man",
    "citationTitle": "Wikipedia: Burning Man"
  },
  {
    "id": "2f35b4ec-3aa9-4924-8426-655db1a1feff",
    "text": "Which music festival was the first to be broadcast live via satellite around the world?",
    "options": [
      "Live Aid",
      "Woodstock",
      "Monterey Pop Festival",
      "Isle of Wight Festival"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Live Aid in 1985 was the first global satellite broadcast of a music festival, reaching 1.9 billion viewers.",
    "detailedExplanation": "Live Aid, organized by Bob Geldof and Midge Ure on July 13, 1985, made history as the first music festival to be broadcast live via satellite to a global audience. The dual-venue benefit concert, held simultaneously at Wembley Stadium in London and John F. Kennedy Stadium in Philadelphia, was watched by an estimated 1.9 billion people across 150 countries. This groundbreaking broadcast technology allowed viewers to witness performances by Queen, U2, Madonna, Led Zeppelin, and many others in real-time, revolutionizing how music festivals could reach global audiences and raising over $125 million for famine relief in Africa.",
    "citationUrl": "https://en.wikipedia.org/wiki/Live_Aid",
    "citationTitle": "Wikipedia: Live Aid"
  },
  {
    "id": "5f35969c-00e6-49d6-bbad-739222cc9e6a",
    "text": "The Fuji Rock Festival, one of Japan's largest music festivals, is unusual because it takes place in which season?",
    "options": [
      "Spring during cherry blossom season",
      "Summer during rainy season",
      "Autumn during leaf season",
      "Winter in the snow"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Fuji Rock takes place in late July during Japan's rainy season, often requiring muddy conditions.",
    "detailedExplanation": "Fuji Rock Festival, held annually at Naeba Ski Resort in the mountains of Niigata Prefecture, takes place in late July during Japan's rainy season (tsuyu). This timing often results in muddy, challenging conditions that have become part of the festival's character and appeal. Despite the weather challenges, or perhaps because of them, Fuji Rock has developed a reputation for its hardy, dedicated audience and unique atmosphere. The festival's mountain setting, combined with frequent rain and mud, creates an experience quite different from typical summer festivals, earning it the nickname 'the muddiest festival in the world.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Fuji_Rock_Festival",
    "citationTitle": "Wikipedia: Fuji Rock Festival"
  },
  {
    "id": "58311b6a-f000-47dc-8635-0da727fe7602",
    "text": "Which music festival pioneered the now-common practice of livestreaming performances online?",
    "options": [
      "Bonnaroo",
      "Coachella",
      "SXSW",
      "Electric Daisy Carnival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Coachella was among the first major festivals to offer comprehensive livestreaming in 2011.",
    "detailedExplanation": "Coachella Valley Music and Arts Festival pioneered large-scale festival livestreaming in 2011 when it partnered with YouTube to broadcast performances live online. This innovation allowed fans worldwide to experience the festival remotely and helped establish the now-standard practice of festival livestreaming. The Coachella livestream became hugely popular, attracting millions of viewers and setting the template for how festivals could extend their reach beyond physical attendees. This digital expansion has since become crucial for festivals' marketing, revenue, and cultural impact, especially highlighted during the COVID-19 pandemic when livestreaming became essential for the music industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coachella_Valley_Music_and_Arts_Festival",
    "citationTitle": "Wikipedia: Coachella Valley Music and Arts Festival"
  },
  {
    "id": "7168c1a8-f6f8-4ef0-81ef-5b5dfad9412b",
    "text": "The Exit Festival in Serbia was originally created to protest against which political figure?",
    "options": [
      "Radovan Karadžić",
      "Ratko Mladić",
      "Slobodan Milošević",
      "Vojislav Šešelj"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Exit Festival began in 2000 as a student protest movement against Slobodan Milošević's regime.",
    "detailedExplanation": "Exit Festival, now held annually in Novi Sad, Serbia, began in 2000 as 'Exit 001' - a student protest movement calling for political change and an 'exit' from Slobodan Milošević's authoritarian regime. The original event lasted 100 days and combined music with political activism, playing a significant role in the opposition movement that eventually led to Milošević's downfall. After achieving its political goals, Exit evolved into a major international music festival while maintaining its spirit of promoting positive social change. The festival's transformation from protest movement to celebrated cultural event makes it unique among world music festivals.",
    "citationUrl": "https://en.wikipedia.org/wiki/Exit_Festival",
    "citationTitle": "Wikipedia: Exit Festival"
  },
  {
    "id": "ae0b9d59-b648-4344-a39a-31bbe1aba083",
    "text": "Which music festival is known for its distinctive pyramid-shaped main stage that has become an iconic symbol?",
    "options": [
      "Glastonbury Festival",
      "Coachella",
      "Bonnaroo",
      "Reading Festival"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Glastonbury Festival features the famous Pyramid Stage, which has been the festival's main stage since 1971.",
    "detailedExplanation": "The Pyramid Stage at Glastonbury Festival is one of the most recognizable structures in the music festival world. Originally built in 1971 and inspired by the Great Pyramid of Giza, it has been rebuilt and modified several times over the decades. The stage has hosted legendary performances from artists like David Bowie, Beyoncé, and Radiohead, making it a symbol of the festival and British music culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Glastonbury_Festival",
    "citationTitle": "Wikipedia: Glastonbury Festival"
  },
  {
    "id": "9a678a90-4b31-4918-9641-86ef3f9927f5",
    "text": "The Rock in Rio festival originated in which South American city in 1985?",
    "options": [
      "São Paulo, Brazil",
      "Rio de Janeiro, Brazil",
      "Buenos Aires, Argentina",
      "Lima, Peru"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Rock in Rio was first held in Rio de Janeiro, Brazil in 1985 and has since expanded to other cities worldwide.",
    "detailedExplanation": "Rock in Rio was created by Brazilian entrepreneur Roberto Medina and first took place in Rio de Janeiro in January 1985. The inaugural festival was massive, featuring artists like Queen, AC/DC, and Iron Maiden, and attracted over 1.5 million attendees across 10 days. The festival has since become a global brand, with editions held in Lisbon, Madrid, and Las Vegas, but its roots remain firmly planted in Rio de Janeiro.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rock_in_Rio",
    "citationTitle": "Wikipedia: Rock in Rio"
  },
  {
    "id": "2dcea07f-f88f-43d9-aa37-96b4b4452dcc",
    "text": "Which annual electronic music festival takes place in the Belgian town of Boom and is known for elaborate stage designs?",
    "options": [
      "Ultra Music Festival",
      "Electric Daisy Carnival",
      "Tomorrowland",
      "Creamfields"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tomorrowland is held annually in Boom, Belgium and is renowned for its fantasy-themed stages and production.",
    "detailedExplanation": "Tomorrowland, which began in 2005, has become one of the world's most prestigious electronic dance music festivals. Located in the small Belgian town of Boom, the festival is famous for its incredibly detailed stage designs that create immersive fantasy worlds. Each year features a different theme with elaborate decorations, pyrotechnics, and stage structures that can cost millions of euros to construct. The festival attracts EDM fans from around the globe and has spawned sister events in other countries.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tomorrowland_(festival)",
    "citationTitle": "Wikipedia: Tomorrowland"
  },
  {
    "id": "450a4c47-5e99-4d27-9349-8576975f38d0",
    "text": "The Monterey Pop Festival of 1967 is famous for launching which guitarist's career after his performance there?",
    "options": [
      "Eric Clapton",
      "Jimmy Page",
      "Jimi Hendrix",
      "Keith Richards"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jimi Hendrix's performance at Monterey Pop Festival, where he famously burned his guitar, launched his career in America.",
    "detailedExplanation": "The Monterey International Pop Music Festival in June 1967 was a pivotal moment in music history and Jimi Hendrix's career. Hendrix's performance, which included his iconic guitar-burning finale during 'Wild Thing,' introduced him to American audiences and catapulted him to stardom. The festival, organized by John Phillips of The Mamas & The Papas, also featured performances by Janis Joplin, The Who, and Otis Redding, and is considered a precursor to the larger festivals of the late 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Monterey_Pop_Festival",
    "citationTitle": "Wikipedia: Monterey Pop Festival"
  },
  {
    "id": "ee676e26-a769-4870-96da-15eb7672a967",
    "text": "Which music festival takes place annually in the desert of Indio, California and is known for its celebrity fashion culture?",
    "options": [
      "Desert Daze",
      "Stagecoach",
      "Coachella",
      "Lightning in a Bottle"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Coachella Valley Music and Arts Festival takes place in Indio, California and has become synonymous with festival fashion trends.",
    "detailedExplanation": "The Coachella Valley Music and Arts Festival, commonly known as Coachella, has been held annually in Indio, California since 1999. Beyond its diverse musical lineup spanning multiple genres, Coachella has become a major cultural event known for influencing fashion trends. The festival's attendees, including many celebrities and influencers, showcase elaborate outfits that often go viral on social media, making 'festival fashion' a significant part of contemporary style culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coachella_Valley_Music_and_Arts_Festival",
    "citationTitle": "Wikipedia: Coachella Valley Music and Arts Festival"
  },
  {
    "id": "cc397316-a4cc-4eca-8632-71a010665947",
    "text": "The Download Festival, primarily featuring rock and metal acts, is held annually at which English venue?",
    "options": [
      "Silverstone Circuit",
      "Brands Hatch",
      "Donington Park",
      "Goodwood Circuit"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Download Festival takes place at Donington Park in Leicestershire, England, a venue with a rich rock music history.",
    "detailedExplanation": "Download Festival has been held at Donington Park in Leicestershire since its inception in 2003. The venue has a legendary status in rock and metal music, having hosted the famous Monsters of Rock festival from 1980 to 1996. Donington Park, primarily known as a motorsport venue, transforms each June into one of Europe's premier rock festivals, maintaining the tradition of heavy music that has made the location iconic among metal fans worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Download_Festival",
    "citationTitle": "Wikipedia: Download Festival"
  },
  {
    "id": "e15b4578-45ee-44b8-9491-74a85573f068",
    "text": "Which country music festival, held in Manchester, Tennessee, is known for its 'What Stage' and takes place on a 700-acre farm?",
    "options": [
      "Stagecoach",
      "CMA Music Festival",
      "Bonnaroo",
      "Austin City Limits"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Bonnaroo Music and Arts Festival takes place on a farm in Manchester, Tennessee and features the famous 'What Stage' as its main stage.",
    "detailedExplanation": "Bonnaroo Music and Arts Festival, founded in 2002, takes place on a 700-acre farm in Manchester, Tennessee. While it began with roots in jam bands and alternative rock, it has expanded to include various genres including country music. The festival's main stage is called 'What Stage,' and the event is known for its camping culture, late-night performances, and the strong sense of community among attendees who call themselves 'Bonnaroovians.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Bonnaroo_Music_Festival",
    "citationTitle": "Wikipedia: Bonnaroo Music Festival"
  },
  {
    "id": "5fe632d9-295c-4613-8733-950f7f196deb",
    "text": "The Roskilde Festival in Denmark is notable for being one of the largest non-profit music festivals in Europe and donates its profits to which cause?",
    "options": [
      "Environmental conservation",
      "Music education",
      "Humanitarian aid",
      "Local community projects"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Roskilde Festival donates its profits to humanitarian and cultural causes, supporting various charitable organizations worldwide.",
    "detailedExplanation": "The Roskilde Festival, held annually since 1971 in Roskilde, Denmark, operates as a non-profit organization and is unique among major music festivals for its charitable mission. After covering operational costs, all profits are donated to humanitarian, cultural, and music-related causes around the world. Over the decades, the festival has donated millions of euros to support various organizations working in areas such as human rights, cultural development, and emergency relief, making it a significant contributor to global charitable causes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roskilde_Festival",
    "citationTitle": "Wikipedia: Roskilde Festival"
  },
  {
    "id": "59e4985b-9836-46b4-9ff1-00a485de73c4",
    "text": "Which music festival was tragically shut down in 2022 after a crowd surge killed 10 people during Travis Scott's performance?",
    "options": [
      "Rolling Loud",
      "Astroworld Festival",
      "Made in America",
      "Day N Vegas"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Astroworld Festival in Houston was permanently canceled after the deadly crowd crush incident in November 2021.",
    "detailedExplanation": "The Astroworld Festival tragedy occurred on November 5, 2021, in Houston, Texas, during Travis Scott's headlining performance. A crowd surge resulted in 10 deaths and hundreds of injuries, leading to massive lawsuits and the permanent cancellation of the festival. The incident highlighted serious issues with crowd control and safety protocols at large music festivals, sparking industry-wide discussions about festival safety standards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Astroworld_Festival_crowd_crush",
    "citationTitle": "Wikipedia: Astroworld Festival crowd crush"
  },
  {
    "id": "deab5ec6-43ce-40fb-a330-f31b95f3e3d5",
    "text": "The iconic Lollapalooza festival was originally created in 1991 as a farewell tour for which alternative rock band?",
    "options": [
      "Nirvana",
      "Jane's Addiction",
      "Soundgarden",
      "Pearl Jam"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jane's Addiction frontman Perry Farrell created Lollapalooza as the band's farewell tour in 1991.",
    "detailedExplanation": "Lollapalooza began as a touring festival in 1991, conceived by Perry Farrell of Jane's Addiction as a farewell tour for his band. The festival featured an eclectic mix of alternative rock, industrial, and hip-hop acts, helping to bring alternative music into the mainstream. After several years as a touring festival, it eventually became a stationary festival held annually in Chicago's Grant Park, but its origins were rooted in Jane's Addiction's final tour.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lollapalooza",
    "citationTitle": "Wikipedia: Lollapalooza"
  },
  {
    "id": "8eec1e6e-89dd-425f-bf54-88417f42989d",
    "text": "Which music festival is famous for its tradition of attendees wearing colorful tutus and has the slogan 'Nothing else matters'?",
    "options": [
      "Electric Forest",
      "Ultra Music Festival",
      "Electric Daisy Carnival",
      "Tomorrowland"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Electric Daisy Carnival (EDC) is known for its carnival atmosphere, colorful tutus, and the slogan 'Nothing else matters.'",
    "detailedExplanation": "Electric Daisy Carnival, primarily held in Las Vegas, has become synonymous with elaborate costumes, particularly colorful tutus worn by attendees called 'headliners.' The festival creates a carnival-like atmosphere with elaborate stage designs, carnival rides, and art installations. Its motto 'Nothing else matters' reflects the escapist nature of the event, where attendees are encouraged to express themselves freely through dance, music, and creative fashion in a judgment-free environment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Electric_Daisy_Carnival",
    "citationTitle": "Wikipedia: Electric Daisy Carnival"
  },
  {
    "id": "4c1a7dae-3478-4114-8034-40fb553b71bf",
    "text": "The Sziget Festival, one of Europe's largest music festivals held on an island in the Danube River, takes place in which capital city?",
    "options": [
      "Vienna, Austria",
      "Prague, Czech Republic",
      "Budapest, Hungary",
      "Bratislava, Slovakia"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sziget Festival takes place on Óbuda Island in the Danube River in Budapest, Hungary.",
    "detailedExplanation": "Sziget Festival, often called the 'Island of Freedom,' is held annually on Óbuda Island in the Danube River in Budapest, Hungary. Since 1993, it has grown to become one of Europe's largest music festivals, attracting over 400,000 visitors from around the world. The unique island location creates a festival city where attendees can camp, enjoy multiple stages of diverse music genres, and experience art installations, making it a week-long cultural celebration in the heart of Budapest.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sziget_Festival",
    "citationTitle": "Wikipedia: Sziget Festival"
  }
]