[
  {
    "id": "2441e2fb-788b-456c-b470-577a7e17831b",
    "text": "Which country music legend is known as 'The Man in Black'?",
    "options": [
      "Hank Williams",
      "Johnny Cash",
      "Willie Nelson",
      "Waylon Jennings"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Johnny Cash was famously known as 'The Man in Black' due to his signature all-black clothing.",
    "detailedExplanation": "Johnny Cash earned the nickname 'The Man in Black' because of his habit of wearing dark clothing during performances. He explained that he wore black as a symbol of solidarity with the poor and downtrodden, and to represent the darker themes often present in his music. This distinctive style became his trademark throughout his legendary career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johnny_Cash",
    "citationTitle": "Wikipedia: Johnny Cash"
  },
  {
    "id": "c97201b2-850c-4f7b-a9cb-7c70f28e665d",
    "text": "Which female country star sang the hit song 'Coal Miner's Daughter'?",
    "options": [
      "Dolly Parton",
      "Tammy Wynette",
      "Loretta Lynn",
      "Patsy Cline"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Loretta Lynn recorded 'Coal Miner's Daughter' in 1970, which became her signature autobiographical song.",
    "detailedExplanation": "Loretta Lynn's 'Coal Miner's Daughter' was released in 1970 and became one of her most famous songs. The song was autobiographical, telling the story of her upbringing in poverty in Butcher Hollow, Kentucky, where her father worked as a coal miner. The song reached number one on the country charts and later inspired both an autobiography and a biographical film starring Sissy Spacek.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coal_Miner%27s_Daughter_(song)",
    "citationTitle": "Wikipedia: Coal Miner's Daughter (song)"
  },
  {
    "id": "47d09db0-47a3-497d-98cd-aa98df0ec537",
    "text": "What is the real first name of country music star Garth Brooks?",
    "options": [
      "Garrett",
      "Gary",
      "Troyal",
      "George"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Garth Brooks' full name is Troyal Garth Brooks, with Troyal being his first name.",
    "detailedExplanation": "Troyal Garth Brooks was named after his father, Troyal Raymond Brooks Sr. Born in 1962 in Tulsa, Oklahoma, he chose to use his middle name 'Garth' professionally when he began his country music career. This choice proved successful as he became one of the best-selling music artists of all time, with over 170 million albums sold worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Garth_Brooks",
    "citationTitle": "Wikipedia: Garth Brooks"
  },
  {
    "id": "0bc77686-d069-4084-a9c6-a73372f30732",
    "text": "Which country music venue is known as 'The Mother Church of Country Music'?",
    "options": [
      "Grand Ole Opry",
      "Ryman Auditorium",
      "Country Music Hall of Fame",
      "Austin City Limits"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Ryman Auditorium in Nashville is nicknamed 'The Mother Church of Country Music' due to its historic significance.",
    "detailedExplanation": "The Ryman Auditorium in Nashville, Tennessee, earned the nickname 'The Mother Church of Country Music' because it served as the home of the Grand Ole Opry from 1943 to 1974. Originally built as a gospel tabernacle in 1892, the venue's exceptional acoustics and intimate setting made it legendary among country music performers and fans. Many of country music's greatest stars performed on its stage during the genre's golden era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ryman_Auditorium",
    "citationTitle": "Wikipedia: Ryman Auditorium"
  },
  {
    "id": "ef3f417f-7f14-45bb-8bde-075e16550d9e",
    "text": "Which country music star is known for the hit song 'Friends in Low Places'?",
    "options": [
      "Alan Jackson",
      "George Strait",
      "Garth Brooks",
      "Tim McGraw"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Garth Brooks recorded 'Friends in Low Places' in 1990, and it became one of his signature songs.",
    "detailedExplanation": "Garth Brooks' 'Friends in Low Places' was released in August 1990 as the lead single from his album 'No Fences.' The song became Brooks' first number-one hit on the Hot Country Songs chart and is considered one of his signature songs. Written by DeWayne Blackwell and Earl Bud Lee, the song's relatable lyrics about finding comfort among working-class friends resonated with audiences and helped establish Brooks as a major country music star.",
    "citationUrl": "https://en.wikipedia.org/wiki/Friends_in_Low_Places",
    "citationTitle": "Wikipedia: Friends in Low Places"
  },
  {
    "id": "131422e4-32ba-440d-a786-24e2d40aaf32",
    "text": "Which country music legend died in a plane crash on New Year's Eve 1985?",
    "options": [
      "Patsy Cline",
      "Ricky Nelson",
      "Jim Reeves",
      "Rick Nelson"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Rick Nelson died in a plane crash on December 31, 1985, while traveling to a New Year's Eve concert.",
    "detailedExplanation": "Rick Nelson, who had transitioned from teen pop idol to country-rock artist, died in a plane crash on December 31, 1985, near De Kalb, Texas. He was traveling with his band to perform at a New Year's Eve concert in Dallas when their chartered DC-3 aircraft caught fire and crashed. Nelson was 45 years old at the time of his death and had been experiencing a career resurgence in country music after his earlier success in rock and pop.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rick_Nelson",
    "citationTitle": "Wikipedia: Rick Nelson"
  },
  {
    "id": "9d08d6be-5fcc-4821-ac8c-49cbc12c3ad6",
    "text": "What instrument is Keith Whitley most associated with playing?",
    "options": [
      "Banjo",
      "Fiddle",
      "Guitar",
      "Mandolin"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Keith Whitley was primarily known as a country music singer and guitarist.",
    "detailedExplanation": "Keith Whitley was an American country music singer and guitarist who rose to fame in the 1980s. Born in Kentucky, he began his career playing guitar and singing in bluegrass bands before transitioning to mainstream country music. Whitley was known for his traditional country sound and emotional vocal delivery. His career was tragically cut short when he died in 1989 at age 33, but he left behind a legacy of classic country songs including 'Don't Close Your Eyes' and 'When You Say Nothing at All.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Keith_Whitley",
    "citationTitle": "Wikipedia: Keith Whitley"
  },
  {
    "id": "5e3cf1e9-e96a-4205-8d55-073d9565cd75",
    "text": "Which country music star is married to fellow country singer Tim McGraw?",
    "options": [
      "Shania Twain",
      "Faith Hill",
      "Martina McBride",
      "Trisha Yearwood"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Faith Hill has been married to Tim McGraw since 1996, and they are one of country music's power couples.",
    "detailedExplanation": "Faith Hill and Tim McGraw married on October 6, 1996, after meeting during Hill's opening act tour for McGraw. They have become one of country music's most successful power couples, collaborating on several hit duets including 'It's Your Love' and 'Like We Never Loved At All.' Together they have three daughters and have embarked on multiple successful joint concert tours, including their Soul2Soul tours which became some of the highest-grossing country music tours in history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Faith_Hill",
    "citationTitle": "Wikipedia: Faith Hill"
  },
  {
    "id": "57f0cd11-9140-4083-b31a-d567b48cde71",
    "text": "Which country music star is known as 'The King of Country Music'?",
    "options": [
      "George Strait",
      "Hank Williams",
      "Willie Nelson",
      "Alan Jackson"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "George Strait is widely known as 'The King of Country Music' due to his record-breaking career and traditional country sound.",
    "detailedExplanation": "George Strait earned the title 'The King of Country Music' through his incredible success, holding the record for the most number-one hits on the country charts with 44 singles reaching the top spot. His traditional country style and consistent chart performance over decades have solidified his position as one of the most respected figures in country music history.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Strait",
    "citationTitle": "Wikipedia: George Strait"
  },
  {
    "id": "58ada2a6-b236-485c-bca7-1104a5956519",
    "text": "Which country music legend wrote and recorded 'Crazy', later made famous by Patsy Cline?",
    "options": [
      "Kris Kristofferson",
      "Willie Nelson",
      "Waylon Jennings",
      "Merle Haggard"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Willie Nelson wrote 'Crazy' in 1961, which became one of Patsy Cline's biggest hits and a country music classic.",
    "detailedExplanation": "Willie Nelson penned 'Crazy' early in his songwriting career, and it became one of his most successful compositions when Patsy Cline recorded it in 1961. The song reached number 2 on the country charts and has since become a standard, showcasing Nelson's exceptional songwriting abilities long before he became a major recording star himself.",
    "citationUrl": "https://en.wikipedia.org/wiki/Crazy_(Willie_Nelson_song)",
    "citationTitle": "Wikipedia: Crazy (Willie Nelson song)"
  },
  {
    "id": "42b37601-772a-4580-879f-21edfce0a7f5",
    "text": "What is the name of Dolly Parton's famous theme park in Tennessee?",
    "options": [
      "Dollywood",
      "Partonland",
      "Country Kingdom",
      "Tennessee Dreams"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Dollywood is Dolly Parton's theme park located in Pigeon Forge, Tennessee, opened in 1986.",
    "detailedExplanation": "Dollywood opened in 1986 in Pigeon Forge, Tennessee, near Dolly Parton's hometown in the Smoky Mountains. The theme park celebrates Appalachian culture and features rides, shows, and exhibits that reflect the region's heritage. It has become one of Tennessee's most popular tourist attractions and represents Parton's commitment to her home region's economic development.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dollywood",
    "citationTitle": "Wikipedia: Dollywood"
  },
  {
    "id": "b8333259-6d91-48ab-91af-3b469a45a452",
    "text": "Which country music star is known for hits like 'Mammas Don't Let Your Babies Grow Up to Be Cowboys' and 'On the Road Again'?",
    "options": [
      "Waylon Jennings",
      "Willie Nelson",
      "Kris Kristofferson",
      "Merle Haggard"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Willie Nelson recorded both of these classic country songs, with 'On the Road Again' being one of his signature hits.",
    "detailedExplanation": "Willie Nelson co-recorded 'Mammas Don't Let Your Babies Grow Up to Be Cowboys' with Waylon Jennings in 1978, which won a Grammy Award. 'On the Road Again,' released in 1980, became one of Nelson's most recognizable songs and perfectly captured his touring lifestyle. Both songs showcase Nelson's distinctive voice and his role in the outlaw country movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Willie_Nelson_discography",
    "citationTitle": "Wikipedia: Willie Nelson discography"
  },
  {
    "id": "dcdf17d3-61a5-4777-b3da-98f8957bc8d2",
    "text": "Which female country star is known as 'The Queen of Country Music'?",
    "options": [
      "Reba McEntire",
      "Kitty Wells",
      "Tammy Wynette",
      "Patsy Cline"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kitty Wells was the first female country singer to achieve major commercial success and earned the title 'The Queen of Country Music'.",
    "detailedExplanation": "Kitty Wells broke barriers for women in country music with her 1952 hit 'It Wasn't God Who Made Honky Tonk Angels,' becoming the first female country singer to top the charts. Her success paved the way for future female country artists and she maintained her popularity throughout the 1950s and 1960s, earning her the enduring title 'The Queen of Country Music'.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kitty_Wells",
    "citationTitle": "Wikipedia: Kitty Wells"
  },
  {
    "id": "73178c9c-3d57-44db-bc45-7d562ee8f37f",
    "text": "Which country music duo is known for the hit song 'Islands in the Stream'?",
    "options": [
      "Conway Twitty & Loretta Lynn",
      "George Jones & Tammy Wynette",
      "Kenny Rogers & Dolly Parton",
      "Porter Wagoner & Dolly Parton"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Islands in the Stream' was a number-one hit duet by Kenny Rogers and Dolly Parton in 1983.",
    "detailedExplanation": "Kenny Rogers and Dolly Parton's duet 'Islands in the Stream' became a crossover hit in 1983, reaching number one on both the country and pop charts. Written by the Bee Gees, the song showcased the chemistry between the two country superstars and became one of the most successful country duets of all time, helping both artists reach broader audiences.",
    "citationUrl": "https://en.wikipedia.org/wiki/Islands_in_the_Stream_(song)",
    "citationTitle": "Wikipedia: Islands in the Stream (song)"
  },
  {
    "id": "b8010309-0801-4f24-8c69-3b10b02557f8",
    "text": "Which country music star is known for the hit songs 'Achy Breaky Heart' and is the father of pop star Miley Cyrus?",
    "options": [
      "Billy Ray Cyrus",
      "Travis Tritt",
      "Joe Diffie",
      "Mark Chesnutt"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Billy Ray Cyrus had a massive hit with 'Achy Breaky Heart' in 1992 and is the father of pop star Miley Cyrus.",
    "detailedExplanation": "Billy Ray Cyrus achieved international fame with 'Achy Breaky Heart' in 1992, which became a crossover hit and sparked a line dancing craze. The song reached number 4 on the Billboard Hot 100 and number 1 on the country charts. Cyrus later gained additional fame as the father of pop star Miley Cyrus and starred with her in the Disney Channel series 'Hannah Montana'.",
    "citationUrl": "https://en.wikipedia.org/wiki/Billy_Ray_Cyrus",
    "citationTitle": "Wikipedia: Billy Ray Cyrus"
  },
  {
    "id": "35fc71b8-06ea-42b6-a571-f20da5ca981b",
    "text": "Which country music legend is known for songs like 'Your Cheatin' Heart' and 'Hey Good Lookin''?",
    "options": [
      "Hank Williams Sr.",
      "Ernest Tubb",
      "Lefty Frizzell",
      "Webb Pierce"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hank Williams Sr. wrote and recorded both 'Your Cheatin' Heart' and 'Hey Good Lookin'', becoming country music classics.",
    "detailedExplanation": "Hank Williams Sr. penned numerous country music standards including 'Your Cheatin' Heart' and 'Hey Good Lookin'' during his brief but incredibly influential career in the late 1940s and early 1950s. His songwriting genius and emotional delivery style laid the foundation for modern country music, and his songs continue to be covered by artists across all genres decades after his death in 1953.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hank_Williams",
    "citationTitle": "Wikipedia: Hank Williams"
  },
  {
    "id": "8fb4a560-da77-4082-aecb-025a9254a485",
    "text": "Which country music star is known for the crossover hit 'Blue Eyes Crying in the Rain' and founded the annual Farm Aid benefit concert?",
    "options": [
      "Willie Nelson",
      "Waylon Jennings",
      "Kris Kristofferson",
      "Merle Haggard"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Willie Nelson recorded 'Blue Eyes Crying in the Rain' and co-founded Farm Aid in 1985.",
    "detailedExplanation": "Willie Nelson achieved mainstream success with his 1975 version of 'Blue Eyes Crying in the Rain,' which became his first number-one hit as a singer. Along with John Mellencamp and Neil Young, Nelson founded Farm Aid in 1985, an annual benefit concert that raises money for family farmers in the United States. The event has continued for decades and reflects Nelson's commitment to supporting American agriculture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Willie_Nelson",
    "citationTitle": "Wikipedia: Willie Nelson"
  },
  {
    "id": "54bd27ef-efbb-4e34-878b-c47ee5ba1998",
    "text": "Which country music group is known for the hit songs 'Lady Antebellum' and won multiple Grammy Awards before changing their name in 2020?",
    "options": [
      "Little Big Town",
      "Lady A",
      "The Band Perry",
      "Sugarland"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Lady Antebellum changed their name to Lady A in 2020 and are known for hits like 'Need You Now.'",
    "detailedExplanation": "The group originally known as Lady Antebellum, consisting of Hillary Scott, Charles Kelley, and Dave Haywood, achieved massive success with songs like 'Need You Now' and 'Just a Kiss.' They won multiple Grammy Awards including Record of the Year and Song of the Year for 'Need You Now' in 2011. In June 2020, amid nationwide discussions about racial equality, the trio changed their name to Lady A, dropping 'Antebellum' due to its associations with the pre-Civil War South.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lady_A",
    "citationTitle": "Wikipedia: Lady A"
  },
  {
    "id": "4e25e830-1044-4a62-b228-7d4ef165baeb",
    "text": "Which country music star is known for wearing elaborate rhinestone outfits and created the 'Nudie Suit' fashion trend?",
    "options": [
      "Porter Wagoner",
      "Buck Owens",
      "Conway Twitty",
      "George Jones"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Porter Wagoner was famous for his flamboyant rhinestone suits made by Nudie Cohn.",
    "detailedExplanation": "Porter Wagoner was renowned for his flashy, rhinestone-encrusted suits created by Hollywood tailor Nudie Cohn, earning him the nickname 'Mr. Grand Ole Opry.' These elaborate 'Nudie Suits' became his trademark and influenced country music fashion for decades. Wagoner hosted 'The Porter Wagoner Show' for 21 years and was instrumental in launching Dolly Parton's career when she joined his show as a regular performer in the late 1960s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Porter_Wagoner",
    "citationTitle": "Wikipedia: Porter Wagoner"
  },
  {
    "id": "7be9f3a9-be3c-4ae2-a116-99970855c409",
    "text": "Which country music star is known for the hit 'Ring of Fire' and was married to Johnny Cash?",
    "options": [
      "Patsy Cline",
      "June Carter Cash",
      "Tammy Wynette",
      "Loretta Lynn"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "June Carter Cash co-wrote 'Ring of Fire' and was married to Johnny Cash from 1968 until her death in 2003.",
    "detailedExplanation": "June Carter Cash, born into the famous Carter Family of country music, co-wrote 'Ring of Fire' with Merle Kilgore. The song became one of Johnny Cash's biggest hits when he recorded it in 1963. June and Johnny Cash married in 1968 and became one of country music's most iconic couples, frequently performing together. Their love story and musical partnership lasted until June's death in 2003, with Johnny following just four months later.",
    "citationUrl": "https://en.wikipedia.org/wiki/June_Carter_Cash",
    "citationTitle": "Wikipedia: June Carter Cash"
  }
]