[
  {
    "id": "1ffadea6-d4ea-4dfa-99b8-dc60794732e9",
    "text": "Which country music legend is known as 'The Man in Black' and recorded the famous live albums at Folsom Prison and San Quentin?",
    "options": [
      "Hank Williams",
      "Johnny Cash",
      "Waylon Jennings",
      "Merle Haggard"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Johnny Cash earned the nickname 'The Man in Black' for his distinctive all-black stage wardrobe and recorded iconic live albums at both Folsom Prison (1968) and San Quentin (1969).",
    "detailedExplanation": "Johnny Cash became known as 'The Man in Black' both for his signature all-black clothing and his song of the same name, which explained his choice to wear black in solidarity with the poor and downtrodden. His live recordings at Folsom Prison in 1968 and San Quentin in 1969 became legendary albums that revitalized his career and showcased his connection with society's outcasts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Johnny_Cash",
    "citationTitle": "Wikipedia: Johnny Cash"
  },
  {
    "id": "a2abc813-b071-488b-9a54-48eb88cb7a63",
    "text": "What was the name of Patsy Cline's signature song that became her biggest hit and was written by Willie Nelson?",
    "options": [
      "I Fall to Pieces",
      "Walkin' After Midnight",
      "Crazy",
      "Sweet Dreams"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Crazy' was written by Willie Nelson and became Patsy Cline's signature song and biggest hit, reaching #2 on the country charts in 1961.",
    "detailedExplanation": "Willie Nelson wrote 'Crazy' in 1961, and it became Patsy Cline's most famous recording. The song showcased Cline's incredible vocal range and emotional delivery, reaching #2 on the country charts and crossing over to #9 on the pop charts. It remains one of the most beloved country songs of all time and helped establish both Nelson as a songwriter and Cline as a country music icon.",
    "citationUrl": "https://en.wikipedia.org/wiki/Crazy_(Willie_Nelson_song)",
    "citationTitle": "Wikipedia: Crazy (Willie Nelson song)"
  },
  {
    "id": "7495a68d-124f-447c-82d0-cf48da523c97",
    "text": "Which female country star holds the record for the most #1 hits on the Billboard Hot Country Songs chart with 25 number-one singles?",
    "options": [
      "Reba McEntire",
      "Dolly Parton",
      "Loretta Lynn",
      "Tammy Wynette"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Reba McEntire holds the record for most #1 country hits by a female artist with 25 chart-toppers between 1982 and 2008.",
    "detailedExplanation": "Reba McEntire, known as 'The Queen of Country,' achieved an unprecedented 25 #1 hits on the Billboard Hot Country Songs chart throughout her career, spanning from 1982 to 2008. This record makes her the female country artist with the most number-one singles, surpassing other country legends and cementing her status as one of the most successful country performers of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Reba_McEntire",
    "citationTitle": "Wikipedia: Reba McEntire"
  },
  {
    "id": "647f2190-cf45-4b38-bcba-e324078a246a",
    "text": "Which country music outlaw was born Waylon Arnold Jennings and was supposed to be on the plane that crashed and killed Buddy Holly in 1959?",
    "options": [
      "Willie Nelson",
      "Kris Kristofferson",
      "Waylon Jennings",
      "Hank Williams Jr."
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Waylon Jennings was Buddy Holly's bass player and gave up his seat on the fatal flight to The Big Bopper, leading to lifelong guilt about 'The Day the Music Died.'",
    "detailedExplanation": "Waylon Jennings was playing bass for Buddy Holly's Winter Dance Party tour in 1959. Due to the freezing conditions on their tour bus, Holly chartered a plane, but Jennings gave up his seat to The Big Bopper (J.P. Richardson), who was suffering from the flu. The plane crashed on February 3, 1959, killing Holly, Ritchie Valens, and The Big Bopper in what became known as 'The Day the Music Died.' Jennings carried guilt about this for the rest of his life.",
    "citationUrl": "https://en.wikipedia.org/wiki/Waylon_Jennings",
    "citationTitle": "Wikipedia: Waylon Jennings"
  },
  {
    "id": "de9b03db-c7b5-47e0-a159-8d150c49a5ec",
    "text": "What was the name of the all-female country supergroup formed in 1987 featuring Dolly Parton, Linda Ronstadt, and Emmylou Harris?",
    "options": [
      "The Trio",
      "Trio",
      "The Highwaymen",
      "Steel Magnolias"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Trio was the name of the supergroup and their debut album, which won a Grammy Award for Best Country Performance by a Duo or Group in 1987.",
    "detailedExplanation": "Trio was formed in 1987 when three of country and folk music's most respected female voices came together: Dolly Parton, Linda Ronstadt, and Emmylou Harris. Their self-titled album 'Trio' featured harmonious interpretations of classic country, folk, and bluegrass songs. The collaboration was highly successful, winning a Grammy Award and producing hit singles like 'To Know Him Is to Love Him,' showcasing the distinctive vocal blend of these three legendary artists.",
    "citationUrl": "https://en.wikipedia.org/wiki/Trio_(album)",
    "citationTitle": "Wikipedia: Trio (album)"
  },
  {
    "id": "92548b5f-5d3b-4365-b459-69e8945530e0",
    "text": "Which country music star's real name is Eilleen Regina Edwards and hails from Ontario, Canada?",
    "options": [
      "Faith Hill",
      "Shania Twain",
      "Carrie Underwood",
      "Trisha Yearwood"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Shania Twain was born Eilleen Regina Edwards in Windsor, Ontario, Canada, and became one of the best-selling country artists of all time.",
    "detailedExplanation": "Shania Twain was born Eilleen Regina Edwards on August 28, 1965, in Windsor, Ontario, Canada. She later took the surname Twain from her stepfather and adopted the stage name Shania, which reportedly means 'on my way' in Ojibwe. Despite being Canadian, she became one of the most successful country music artists globally, with her album 'Come On Over' becoming the best-selling studio album by a female country artist.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shania_Twain",
    "citationTitle": "Wikipedia: Shania Twain"
  },
  {
    "id": "370fd053-1839-4f9b-8384-00207f63ee92",
    "text": "What was the name of the country music supergroup consisting of Johnny Cash, Waylon Jennings, Willie Nelson, and Kris Kristofferson?",
    "options": [
      "The Outlaws",
      "The Highwaymen",
      "The Legends",
      "The Four Horsemen"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Highwaymen was formed in 1985 and named after their hit song 'Highwayman,' written by Jimmy Webb.",
    "detailedExplanation": "The Highwaymen was a country music supergroup active from 1985 to 1995, consisting of four of country music's most iconic outlaw country artists: Johnny Cash, Waylon Jennings, Willie Nelson, and Kris Kristofferson. The group was named after their signature song 'Highwayman,' written by Jimmy Webb, which told the story of a soul's journey through four different incarnations. They released three major albums and toured extensively, representing the pinnacle of the outlaw country movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Highwaymen_(country_supergroup)",
    "citationTitle": "Wikipedia: The Highwaymen (country supergroup)"
  },
  {
    "id": "8b93c748-9846-4b5d-aaad-cfeb6aba82a9",
    "text": "Which country music star won the first season of American Idol in 2005 and has since become one of the best-selling country artists?",
    "options": [
      "Kelly Pickler",
      "Carrie Underwood",
      "Miranda Lambert",
      "Kacey Musgraves"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Carrie Underwood won the fourth season of American Idol in 2005 and has since become one of the most successful country music artists with multiple Grammy Awards.",
    "detailedExplanation": "Carrie Underwood won the fourth season of American Idol in 2005, becoming the first country music artist to win the competition. Since her victory, she has become one of the best-selling country music artists of all time, with over 70 million records sold worldwide. She has won multiple Grammy Awards, Country Music Association Awards, and Academy of Country Music Awards, with hits like 'Before He Cheats,' 'Jesus Take the Wheel,' and 'Blown Away.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Carrie_Underwood",
    "citationTitle": "Wikipedia: Carrie Underwood"
  },
  {
    "id": "d97f171a-6b8f-480b-a6a5-c70ca8d70a51",
    "text": "Which country music star is known for hits like 'Friends in Low Places' and 'The Dance' and is one of the best-selling music artists of all time?",
    "options": [
      "Keith Whitley",
      "Garth Brooks",
      "George Strait",
      "Alan Jackson"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Garth Brooks is known for these signature hits and has sold over 170 million albums worldwide.",
    "detailedExplanation": "Garth Brooks revolutionized country music in the 1990s with his rock-influenced style and theatrical live performances. 'Friends in Low Places' became his signature song and crowd favorite, while 'The Dance' showcased his more emotional side. Brooks is credited with bringing country music to a broader audience and remains one of the best-selling music artists in any genre, with album sales exceeding 170 million copies worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Garth_Brooks",
    "citationTitle": "Wikipedia: Garth Brooks"
  },
  {
    "id": "0bd269f3-4d0c-4548-85d1-1643d8124a73",
    "text": "Which country music legend was known as 'The King of Country Music' and had hits like 'Your Cheatin' Heart' and 'Hey Good Lookin''?",
    "options": [
      "Hank Williams",
      "Ernest Tubb",
      "Lefty Frizzell",
      "Webb Pierce"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hank Williams earned the title 'The King of Country Music' and wrote these classic songs before his death at age 29.",
    "detailedExplanation": "Hank Williams is widely regarded as one of the most significant and influential country music artists of all time. Despite his career lasting only six years before his death in 1953 at age 29, Williams wrote and recorded numerous songs that became country music standards. His emotional delivery and songwriting ability influenced generations of musicians across multiple genres, earning him the posthumous title 'The King of Country Music.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Hank_Williams",
    "citationTitle": "Wikipedia: Hank Williams"
  },
  {
    "id": "1c522691-3494-49d6-8a16-ffff1187209d",
    "text": "Which country music duo, consisting of married couple Tim McGraw and Faith Hill, went on multiple successful joint concert tours?",
    "options": [
      "Brooks & Dunn",
      "Tim McGraw & Faith Hill",
      "Sugarland",
      "Lady Antebellum"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tim McGraw and Faith Hill, both successful solo artists, toured together as a married couple on multiple occasions.",
    "detailedExplanation": "Tim McGraw and Faith Hill, two of country music's biggest solo stars, married in 1996 and have since collaborated on several joint concert tours including the 'Soul2Soul' tours. While both maintain successful individual careers, their combined star power has made their joint tours among the highest-grossing country music tours of all time. They have also recorded several duets together, including the hit 'It's Your Love.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Tim_McGraw",
    "citationTitle": "Wikipedia: Tim McGraw"
  },
  {
    "id": "19fe219f-455b-445a-a893-23c983c64bd7",
    "text": "Which country music artist is known as 'The Red Headed Stranger' and co-wrote the hit song 'On the Road Again'?",
    "options": [
      "Kris Kristofferson",
      "Willie Nelson",
      "Merle Haggard",
      "Waylon Jennings"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Willie Nelson earned this nickname from his 1975 concept album and wrote 'On the Road Again' for the 1980 film 'Honeysuckle Rose.'",
    "detailedExplanation": "Willie Nelson became known as 'The Red Headed Stranger' after his 1975 concept album of the same name, which marked his transition to outlaw country. The album was initially considered too sparse and uncommercial by his record label but became a critical and commercial success. Nelson wrote 'On the Road Again' for the 1980 film 'Honeysuckle Rose' in which he starred, and the song became one of his most recognizable hits, earning him a Grammy Award.",
    "citationUrl": "https://en.wikipedia.org/wiki/Willie_Nelson",
    "citationTitle": "Wikipedia: Willie Nelson"
  },
  {
    "id": "fe3d5b23-6030-47cc-8da6-2de6f47c1b27",
    "text": "Which country music star's real name is Randy Bruce Traywick and had hits like 'Forever and Ever, Amen' and 'Diggin' Up Bones'?",
    "options": [
      "Randy Owen",
      "Randy Houser",
      "Randy Travis",
      "Randy Whitley"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Randy Travis was born Randy Bruce Traywick and became a major country star in the 1980s with his traditional country sound.",
    "detailedExplanation": "Randy Travis, born Randy Bruce Traywick in 1959, was instrumental in the return to traditional country music in the mid-1980s. His deep, rich baritone voice and neo-traditionalist approach helped revive interest in classic country sounds during a period when the genre had become more pop-oriented. His album 'Storms of Life' was a breakthrough success, and songs like 'Forever and Ever, Amen' became country music classics that showcased his traditional styling.",
    "citationUrl": "https://en.wikipedia.org/wiki/Randy_Travis",
    "citationTitle": "Wikipedia: Randy Travis"
  },
  {
    "id": "e1378e3a-e1e5-4699-860a-8eb9a1ea7c95",
    "text": "Which country music artist is known as 'The Possum' and had numerous hit songs including 'He Stopped Loving Her Today'?",
    "options": [
      "George Jones",
      "Conway Twitty",
      "Merle Haggard",
      "Buck Owens"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "George Jones was nicknamed 'The Possum' and 'He Stopped Loving Her Today' is considered one of the greatest country songs ever recorded.",
    "detailedExplanation": "George Jones, nicknamed 'The Possum' for his distinctive facial features, is widely considered one of the greatest country music vocalists of all time. His 1980 recording of 'He Stopped Loving Her Today' is frequently cited by critics and fellow musicians as the greatest country song ever recorded. Jones's emotional delivery and distinctive voice influenced countless country artists, and despite personal struggles throughout his career, his musical legacy remains unparalleled in traditional country music.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Jones",
    "citationTitle": "Wikipedia: George Jones"
  },
  {
    "id": "a0eeed39-3af7-4bc8-a157-3ba870ecaf32",
    "text": "Which country music legend is known as 'The First Lady of Country Music' and was the first female country artist to headline her own show at the Grand Ole Opry?",
    "options": [
      "Patsy Cline",
      "Tammy Wynette",
      "Kitty Wells",
      "Loretta Lynn"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Kitty Wells earned the title 'The First Lady of Country Music' and broke significant barriers for female country artists in the 1950s.",
    "detailedExplanation": "Kitty Wells, born Muriel Deason, became known as 'The First Lady of Country Music' after her 1952 hit 'It Wasn't God Who Made Honky Tonk Angels' became the first number-one hit by a solo female country artist in over a decade. She broke significant gender barriers in country music and paved the way for future female artists. Her success at the Grand Ole Opry and throughout the 1950s and 1960s established her as a pioneering figure who proved that female country artists could achieve major commercial success.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kitty_Wells",
    "citationTitle": "Wikipedia: Kitty Wells"
  },
  {
    "id": "49bc2f34-96ad-4884-ac18-0bd894b157c1",
    "text": "Which country music artist is known for the crossover hit 'Mammas Don't Let Your Babies Grow Up to Be Cowboys' and wrote 'Me and Bobby McGee'?",
    "options": [
      "Willie Nelson",
      "Waylon Jennings",
      "Kris Kristofferson",
      "Johnny Paycheck"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Kris Kristofferson wrote 'Me and Bobby McGee' and recorded 'Mammas Don't Let Your Babies Grow Up to Be Cowboys' with Waylon Jennings.",
    "detailedExplanation": "Kris Kristofferson is renowned both as a performer and as one of country music's greatest songwriters. He wrote 'Me and Bobby McGee,' which became a posthumous hit for Janis Joplin, as well as classics like 'Sunday Mornin' Comin' Down' and 'Help Me Make It Through the Night.' His duet with Waylon Jennings on 'Mammas Don't Let Your Babies Grow Up to Be Cowboys' won a Grammy Award and became a crossover hit, showcasing his ability to blend country with broader appeal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kris_Kristofferson",
    "citationTitle": "Wikipedia: Kris Kristofferson"
  },
  {
    "id": "d7ea4c3b-7500-467b-839d-b78f92009353",
    "text": "Which country music legend was inducted into the Country Music Hall of Fame in 1973 and is famous for yodeling and the song 'Blue Yodel No. 9'?",
    "options": [
      "Jimmie Rodgers",
      "Roy Acuff",
      "Ernest Tubb",
      "Lefty Frizzell"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jimmie Rodgers, known as 'The Father of Country Music,' was famous for his distinctive yodeling style.",
    "detailedExplanation": "Jimmie Rodgers (1897-1933) is widely considered the father of country music and was one of the first country music superstars. Known as 'The Singing Brakeman,' he was famous for his distinctive yodeling technique and his series of 'Blue Yodel' songs. His 'Blue Yodel No. 9' featured jazz legend Louis Armstrong on trumpet. Despite his career being cut short by tuberculosis, Rodgers' influence on country music was immense, and he was inducted as one of the first three members of the Country Music Hall of Fame in 1961.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jimmie_Rodgers_(country_singer)",
    "citationTitle": "Wikipedia: Jimmie Rodgers"
  },
  {
    "id": "d31dcba9-c9a0-4ca1-af65-8d9317f04ac9",
    "text": "Which country music artist wrote and recorded 'Coal Miner's Daughter' and was portrayed by Sissy Spacek in the 1980 biographical film of the same name?",
    "options": [
      "Tammy Wynette",
      "Loretta Lynn",
      "Kitty Wells",
      "Jean Shepard"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Loretta Lynn wrote 'Coal Miner's Daughter' about her impoverished upbringing in Kentucky, and Sissy Spacek won an Oscar for portraying her.",
    "detailedExplanation": "Loretta Lynn released 'Coal Miner's Daughter' in 1970, a autobiographical song about her childhood in Butcher Hollow, Kentucky. The song became one of her signature hits and later inspired a bestselling autobiography and the 1980 biographical film. Sissy Spacek won the Academy Award for Best Actress for her portrayal of Lynn, and she performed her own vocals in the film. Lynn was known for her honest, often controversial songs about women's experiences and social issues.",
    "citationUrl": "https://en.wikipedia.org/wiki/Loretta_Lynn",
    "citationTitle": "Wikipedia: Loretta Lynn"
  },
  {
    "id": "96cfa45e-1fec-4487-aee1-64d8e5da96d1",
    "text": "Which country music duo, consisting of brothers, had hits like 'Bye Bye Love' and 'All I Have to Do Is Dream' in the 1950s?",
    "options": [
      "The Louvin Brothers",
      "The Everly Brothers",
      "The Stanley Brothers",
      "The Delmore Brothers"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Everly Brothers, Don and Phil Everly, were known for their close harmony singing and crossover success.",
    "detailedExplanation": "The Everly Brothers, consisting of Don and Phil Everly, were one of the most successful country and rock and roll acts of the late 1950s and early 1960s. Their distinctive close harmony singing style influenced countless artists, including The Beatles and Simon & Garfunkel. 'Bye Bye Love' was their breakthrough hit in 1957, reaching #1 on the country charts and crossing over to pop success. 'All I Have to Do Is Dream' followed in 1958, also reaching #1. They were inducted into the Country Music Hall of Fame in 2001.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Everly_Brothers",
    "citationTitle": "Wikipedia: The Everly Brothers"
  },
  {
    "id": "ea1802e2-3778-4c04-9296-093ec707f6ec",
    "text": "Which country music artist is known for the hit 'Ring of Fire' and was married to Johnny Cash from 1968 until his death in 2003?",
    "options": [
      "Vivian Liberto",
      "June Carter Cash",
      "Anita Carter",
      "Maybelle Carter"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "June Carter Cash co-wrote 'Ring of Fire' and was Johnny Cash's second wife and frequent duet partner.",
    "detailedExplanation": "June Carter Cash, born into the famous Carter Family, co-wrote 'Ring of Fire' with Merle Kilgore. The song was originally recorded by her sister Anita Carter, but Johnny Cash's 1963 version with its distinctive mariachi-style horns became the definitive recording and a major hit. June and Johnny began performing together in the 1960s, fell in love (despite both being married to others), and married in 1968. Their duet 'Jackson' won a Grammy Award, and their love story became one of country music's most famous romances.",
    "citationUrl": "https://en.wikipedia.org/wiki/June_Carter_Cash",
    "citationTitle": "Wikipedia: June Carter Cash"
  }
]