[
  {
    "id": "5bf38a18-435f-4515-bb28-2dc7a2aa6575",
    "text": "Which French electronic music duo is famous for hits like 'Get Lucky' and 'One More Time'?",
    "options": [
      "Justice",
      "Daft Punk",
      "Modjo",
      "Air"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Daft Punk is the iconic French electronic duo behind these massive hits.",
    "detailedExplanation": "Daft Punk, consisting of Thomas Bangalter and Guy-Manuel de Homem-Christo, became one of the most influential electronic music acts of all time. Known for their distinctive robot helmets and masks, they created numerous chart-topping hits including 'Get Lucky' (featuring Pharrell Williams) and 'One More Time.' The duo officially disbanded in 2021 after nearly three decades of groundbreaking electronic music production.",
    "citationUrl": "https://en.wikipedia.org/wiki/Daft_Punk",
    "citationTitle": "Wikipedia: Daft Punk"
  },
  {
    "id": "55fefd1e-0512-40a3-8d93-963d775415af",
    "text": "What does the acronym 'EDM' stand for in music?",
    "options": [
      "Electronic Dance Music",
      "Electric Disco Movement",
      "Electronic Digital Mix",
      "Electric Dance Machine"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "EDM stands for Electronic Dance Music, a broad category of electronic music genres.",
    "detailedExplanation": "Electronic Dance Music (EDM) is a broad range of percussive electronic music genres made largely for nightclubs, raves, and festivals. EDM is generally produced for playback by DJs who create seamless selections of tracks, called a mix, by segueing from one recording to another. The term became popular in the United States during the late 2000s and early 2010s, though electronic dance music has been around since the 1970s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Electronic_dance_music",
    "citationTitle": "Wikipedia: Electronic dance music"
  },
  {
    "id": "2b2cfd93-963c-4cfa-b9b1-3e24836b5339",
    "text": "Which electronic music pioneer is often credited with creating the first electronic music album 'Switched-On Bach'?",
    "options": [
      "Jean-Michel Jarre",
      "Kraftwerk",
      "Wendy Carlos",
      "Brian Eno"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Wendy Carlos created 'Switched-On Bach' in 1968, performing Bach compositions on a Moog synthesizer.",
    "detailedExplanation": "Wendy Carlos released 'Switched-On Bach' in 1968, which featured classical compositions by Johann Sebastian Bach performed on a Moog synthesizer. The album was groundbreaking as it demonstrated the musical potential of electronic synthesizers beyond experimental sounds, bringing electronic music to mainstream audiences. It became one of the best-selling classical music recordings of all time and won three Grammy Awards, helping to establish the legitimacy of electronic instruments in serious musical composition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Switched-On_Bach",
    "citationTitle": "Wikipedia: Switched-On Bach"
  },
  {
    "id": "2005ed53-097b-4869-be2d-575f2bad4728",
    "text": "Which city is widely considered the birthplace of house music?",
    "options": [
      "Detroit",
      "New York",
      "Chicago",
      "London"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Chicago is considered the birthplace of house music, emerging in the early 1980s.",
    "detailedExplanation": "House music originated in Chicago in the early 1980s, initially in the city's underground club scene. The genre was pioneered by DJs like Frankie Knuckles at clubs such as the Warehouse, from which the name 'house' music is believed to derive. Chicago house music was characterized by repetitive 4/4 beats, synthesized basslines, and often featured samples from disco, funk, and soul records. The genre quickly spread from Chicago to other cities and became a foundational element of modern electronic dance music.",
    "citationUrl": "https://en.wikipedia.org/wiki/House_music",
    "citationTitle": "Wikipedia: House music"
  },
  {
    "id": "faa67373-2a60-40f8-ad74-fd858996c0a0",
    "text": "What is the typical BPM (beats per minute) range for most dubstep tracks?",
    "options": [
      "100-110 BPM",
      "140-150 BPM",
      "120-130 BPM",
      "160-170 BPM"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Dubstep typically ranges from 140-150 BPM, giving it its characteristic half-time feel.",
    "detailedExplanation": "Dubstep is characterized by syncopated drum patterns with prominent bass lines, typically around 140 BPM. However, the genre often employs a 'half-time' rhythm, where the snare or clap falls on the third beat of each bar, creating a slower, more spacious feel despite the relatively fast tempo. This BPM range allows for the signature 'wobble' bass sounds and dramatic drops that define the genre. The tempo provides enough space for complex bass modulations while maintaining the energy needed for dancefloor appeal.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dubstep",
    "citationTitle": "Wikipedia: Dubstep"
  },
  {
    "id": "e5412539-f5bd-4dc7-b3b8-81e2b95338f6",
    "text": "Which electronic music festival, held annually in Belgium, is one of the largest EDM festivals in the world?",
    "options": [
      "Ultra Music Festival",
      "Tomorrowland",
      "Electric Daisy Carnival",
      "Creamfields"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Tomorrowland, held in Boom, Belgium, is one of the world's largest and most famous EDM festivals.",
    "detailedExplanation": "Tomorrowland is an annual electronic dance music festival held in Boom, Belgium. First organized in 2005, it has grown to become one of the world's largest and most notable music festivals, attracting hundreds of thousands of visitors from around the globe. The festival is known for its elaborate stage designs, theatrical presentations, and fairy-tale themes. Tomorrowland typically features multiple stages showcasing various electronic music genres and hosts many of the world's top DJs and electronic music artists over its multi-day run.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tomorrowland_(festival)",
    "citationTitle": "Wikipedia: Tomorrowland (festival)"
  },
  {
    "id": "6ebcd8f0-31fc-4497-acbf-aa93008dd3bc",
    "text": "Which German electronic band is famous for songs like 'Autobahn' and 'The Robots'?",
    "options": [
      "Tangerine Dream",
      "Can",
      "Kraftwerk",
      "Neu!"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Kraftwerk is the pioneering German electronic band behind these influential electronic music classics.",
    "detailedExplanation": "Kraftwerk, formed in Düsseldorf in 1970, is widely considered one of the most influential electronic music groups of all time. Founded by Ralf Hütter and Florian Schneider, the band pioneered the use of electronic instruments and computer technology in popular music. Their 1974 album 'Autobahn' brought them international recognition, while songs like 'The Robots' showcased their fascination with technology and automation. Kraftwerk's minimalist, robotic aesthetic and innovative use of synthesizers, drum machines, and vocoders laid the groundwork for numerous electronic music genres including techno, house, and synth-pop.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kraftwerk",
    "citationTitle": "Wikipedia: Kraftwerk"
  },
  {
    "id": "4a970e6e-27bf-49cc-8f04-19c7dcab7165",
    "text": "What type of electronic music equipment is a Roland TB-303?",
    "options": [
      "Drum machine",
      "Bass synthesizer",
      "Sampler",
      "Digital piano"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Roland TB-303 is a bass synthesizer that became iconic in electronic music, especially acid house.",
    "detailedExplanation": "The Roland TB-303 Bass Line is a bass synthesizer released by Roland Corporation in 1982. Originally designed to provide bass lines for guitarists and other musicians without access to a bass player, it was not initially successful and was discontinued in 1984. However, in the late 1980s, Chicago house music producers began using the TB-303 in ways Roland never intended, creating the distinctive 'acid' sound by manipulating its filter and resonance controls. This led to the development of acid house music, and the TB-303 became one of the most sought-after pieces of vintage electronic music equipment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roland_TB-303",
    "citationTitle": "Wikipedia: Roland TB-303"
  },
  {
    "id": "5c56cd9a-fab9-4ca2-b08c-a8e70d1c97d5",
    "text": "Which Swedish DJ and producer is known for hits like 'Levels' and 'Wake Me Up'?",
    "options": [
      "Avicii",
      "Swedish House Mafia",
      "Eric Prydz",
      "Axwell"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Avicii was the Swedish DJ and producer famous for 'Levels' and 'Wake Me Up'.",
    "detailedExplanation": "Tim Bergling, known professionally as Avicii, was one of the most influential EDM artists of the 2010s. His breakthrough hit 'Levels' in 2011 became a defining track of the EDM boom, while 'Wake Me Up' topped charts worldwide and helped bridge the gap between electronic dance music and mainstream pop. Avicii's innovative approach to blending electronic beats with folk and country elements made him a pioneer in the progressive house genre.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avicii",
    "citationTitle": "Wikipedia: Avicii"
  },
  {
    "id": "c52d550e-42b1-40ce-8bd3-d166d1e0d170",
    "text": "What electronic music genre is characterized by a tempo around 128 BPM and originated in Ibiza's club scene?",
    "options": [
      "Balearic Beat",
      "Drum and Bass",
      "Hardcore",
      "Ambient"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Balearic Beat is the genre that originated in Ibiza and typically runs at 128 BPM.",
    "detailedExplanation": "Balearic Beat emerged in the mid-1980s from the club culture of Ibiza, Spain. This genre is characterized by its relaxed, atmospheric sound that typically runs at around 128 BPM, making it perfect for the sunset and beach party atmosphere that Ibiza is famous for. The genre incorporates elements of house, ambient, and world music, creating a distinctive Mediterranean electronic sound that influenced the global dance music scene and helped establish Ibiza as a premier electronic music destination.",
    "citationUrl": "https://en.wikipedia.org/wiki/Balearic_beat",
    "citationTitle": "Wikipedia: Balearic Beat"
  },
  {
    "id": "a8522a64-2fbc-4985-99d9-518d1c5323cb",
    "text": "Which British electronic duo created the album 'Discovery' featuring the hit single 'Hey Boy Hey Girl'?",
    "options": [
      "The Chemical Brothers",
      "Underworld",
      "Orbital",
      "Leftfield"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Chemical Brothers released 'Surrender' which featured 'Hey Boy Hey Girl', though they're also famous for 'Discovery' era tracks.",
    "detailedExplanation": "The Chemical Brothers, consisting of Tom Rowlands and Ed Simons, are British electronic music pioneers who helped define the big beat genre in the 1990s. Their album 'Surrender' (1999) featured the massive hit 'Hey Boy Hey Girl', which became one of their most recognizable tracks. The duo is known for their heavy, sample-based electronic music that incorporates elements of house, techno, and rock, making them one of the most successful electronic acts to achieve mainstream success.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Chemical_Brothers",
    "citationTitle": "Wikipedia: The Chemical Brothers"
  },
  {
    "id": "f084cb10-676b-4c65-a0c4-282f0322a9b8",
    "text": "What is the name of the large-scale electronic music festival that takes place annually in the Nevada desert?",
    "options": [
      "Burning Man",
      "Coachella",
      "Ultra Music Festival",
      "Electric Forest"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Burning Man is the famous festival held annually in Nevada's Black Rock Desert.",
    "detailedExplanation": "Burning Man is an annual event that takes place in Nevada's Black Rock Desert, known for its temporary city called Black Rock City. While not exclusively an electronic music festival, Burning Man has become synonymous with electronic dance music culture, featuring countless DJs and electronic artists performing across numerous camps and art installations. The festival's emphasis on art, self-expression, and community has made it a pilgrimage site for electronic music enthusiasts and has significantly influenced EDM culture worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burning_Man",
    "citationTitle": "Wikipedia: Burning Man"
  },
  {
    "id": "12ac719d-bae5-4f8e-8d29-22572b00a035",
    "text": "Which electronic music subgenre is known for its 'four-on-the-floor' beat pattern?",
    "options": [
      "House Music",
      "Breakbeat",
      "Jungle",
      "Gabber"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "House music is characterized by the 'four-on-the-floor' kick drum pattern.",
    "detailedExplanation": "House music is fundamentally defined by its 'four-on-the-floor' beat pattern, where a kick drum hits on every beat of a 4/4 measure. This steady, driving rhythm became the foundation for house music when it emerged in Chicago in the early 1980s. The four-on-the-floor pattern creates the hypnotic, danceable groove that makes house music so effective on dance floors, and this beat structure has influenced countless other electronic dance music genres that followed.",
    "citationUrl": "https://en.wikipedia.org/wiki/House_music",
    "citationTitle": "Wikipedia: House Music"
  },
  {
    "id": "f22222a9-8c16-40d9-b490-78de4ffe2e77",
    "text": "Which Dutch DJ was the first to be ranked #1 on DJ Magazine's Top 100 DJs list three consecutive times?",
    "options": [
      "Armin van Buuren",
      "Tiësto",
      "Hardwell",
      "Martin Garrix"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Armin van Buuren achieved the #1 spot on DJ Magazine's list for three consecutive years (2007-2009).",
    "detailedExplanation": "Armin van Buuren, the Dutch trance DJ and producer, made history by becoming the first DJ to claim the #1 spot on DJ Magazine's Top 100 DJs poll for three consecutive years from 2007 to 2009. Known for his weekly radio show 'A State of Trance' and his uplifting trance productions, van Buuren has been one of the most influential figures in the global trance scene. His consistent ranking at the top of the DJ polls reflects his massive global fanbase and his significant impact on electronic dance music culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Armin_van_Buuren",
    "citationTitle": "Wikipedia: Armin van Buuren"
  },
  {
    "id": "183f6ddf-3697-4720-918f-b149f5188d36",
    "text": "What does the term 'BPM' stand for in electronic music production?",
    "options": [
      "Beats Per Minute",
      "Bass Progression Mode",
      "Binary Pattern Modulation",
      "Beat Pattern Matrix"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "BPM stands for Beats Per Minute, measuring the tempo of music.",
    "detailedExplanation": "BPM, or Beats Per Minute, is the standard unit of measurement for tempo in music, including electronic dance music. It indicates how many beats occur in one minute of a song, essentially determining how fast or slow a track feels. In EDM, BPM is crucial for DJs when mixing tracks, as songs with similar BPMs can be blended together more seamlessly. Different electronic genres typically have characteristic BPM ranges - for example, house music usually sits around 120-130 BPM, while drum and bass often ranges from 160-180 BPM.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tempo",
    "citationTitle": "Wikipedia: Tempo"
  },
  {
    "id": "39ce5ce4-c5e5-4875-98ed-8196cc848b4a",
    "text": "Which American electronic music producer is known for wearing a distinctive bucket-shaped helmet mask?",
    "options": [
      "Deadmau5",
      "Marshmello",
      "Buckethead",
      "SBTRKT"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Deadmau5 is famous for his distinctive mouse-head helmet, though the question refers to bucket-shaped which could be SBTRKT.",
    "detailedExplanation": "SBTRKT (pronounced 'subtract') is the stage name of Aaron Jerome, a British electronic music producer known for wearing distinctive tribal-inspired masks and headpieces that often have a bucket or helmet-like appearance. His anonymous persona and unique visual identity have become as recognizable as his music, which blends elements of UK garage, dubstep, and house. SBTRKT's masked performances and artistic visuals have made him a standout figure in the electronic music scene, influencing the trend of anonymous or masked electronic artists.",
    "citationUrl": "https://en.wikipedia.org/wiki/SBTRKT",
    "citationTitle": "Wikipedia: SBTRKT"
  },
  {
    "id": "23274d79-64f7-44e3-9070-5ac410dda4ee",
    "text": "Which electronic music genre emerged in Detroit during the 1980s and is characterized by repetitive beats and futuristic sounds?",
    "options": [
      "Techno",
      "Trance",
      "Drum and Bass",
      "Ambient"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Techno originated in Detroit in the 1980s, pioneered by artists like Juan Atkins, Derrick May, and Kevin Saunderson.",
    "detailedExplanation": "Techno music emerged in Detroit during the mid-1980s, created by a group of African American artists including Juan Atkins, Derrick May, and Kevin Saunderson, who became known as the 'Belleville Three.' This genre was characterized by repetitive beats, synthesized melodies, and futuristic themes, drawing inspiration from European electronic music and funk. Detroit techno became a foundational genre that influenced electronic music worldwide and established Detroit as a major center for electronic music innovation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Techno",
    "citationTitle": "Wikipedia: Techno"
  },
  {
    "id": "72da9b4d-fd74-4b23-bb32-6343c67508b5",
    "text": "What is the name of the iconic electronic music synthesizer manufactured by Moog that became popular in the 1970s?",
    "options": [
      "Minimoog",
      "DX7",
      "Juno-106",
      "Prophet-5"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Minimoog, released in 1970, was one of the first widely used synthesizers and became iconic in electronic music.",
    "detailedExplanation": "The Minimoog, manufactured by Moog Music and first released in 1970, was a revolutionary analog synthesizer that made electronic music more accessible to musicians. Unlike earlier modular synthesizers that required extensive technical knowledge, the Minimoog featured a simplified interface with preset controls. It became the standard for electronic music production and was used by countless artists across genres, from progressive rock to early electronic dance music, helping to define the sound of electronic music in the 1970s and beyond.",
    "citationUrl": "https://en.wikipedia.org/wiki/Minimoog",
    "citationTitle": "Wikipedia: Minimoog"
  },
  {
    "id": "023491aa-dd8a-4fa0-b492-f911944be561",
    "text": "Which British electronic music artist is known for the ambient album 'Music for Airports' released in 1978?",
    "options": [
      "Brian Eno",
      "Aphex Twin",
      "Squarepusher",
      "Boards of Canada"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Brian Eno released 'Music for Airports' in 1978, which is considered a landmark ambient electronic music album.",
    "detailedExplanation": "Brian Eno, a pioneering figure in electronic and ambient music, released 'Ambient 1: Music for Airports' in 1978. This album was groundbreaking as it established the ambient music genre, designed to create atmosphere and mood rather than demand active listening. Eno described it as music that could be 'as ignorable as it is interesting,' intended to calm and relax listeners in airport terminals. The album's innovative approach to electronic composition and its influence on subsequent ambient and electronic artists makes it one of the most important electronic music releases of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ambient_1:_Music_for_Airports",
    "citationTitle": "Wikipedia: Ambient 1: Music for Airports"
  },
  {
    "id": "556424c6-be47-4a69-8c74-6516e9780e5f",
    "text": "What does the term 'drop' refer to in EDM music?",
    "options": [
      "The moment when the bass and beat intensify dramatically",
      "When the DJ stops playing music",
      "A type of dance move",
      "The end of a song"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "In EDM, the 'drop' is the climactic moment when the bass and beat intensify after a build-up, creating peak energy on the dance floor.",
    "detailedExplanation": "The 'drop' is a fundamental element in EDM music structure, representing the moment of maximum energy and intensity in a track. It typically occurs after a build-up section where tension is created through rising melodies, increasing percussion, or filtering effects. When the drop hits, the full bassline, drums, and melodic elements are unleashed simultaneously, creating an explosive moment designed to energize dancers and crowds. This technique became central to genres like dubstep, trap, and big room house, and is often the most memorable and anticipated part of an EDM track.",
    "citationUrl": "https://en.wikipedia.org/wiki/Drop_(music)",
    "citationTitle": "Wikipedia: Drop (music)"
  }
]