[
  {
    "id": "6f3c8ba9-c54f-4d3a-a5d1-3e20285982b1",
    "text": "Which electronic music duo created the iconic album 'Discovery' featuring hits like 'One More Time' and 'Digital Love'?",
    "options": [
      "Justice",
      "Daft Punk",
      "The Chemical Brothers",
      "Kraftwerk"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Daft Punk released 'Discovery' in 2001, featuring their biggest commercial hits.",
    "detailedExplanation": "Daft Punk's second studio album 'Discovery' was released in 2001 and marked their transition from underground French house to mainstream electronic music. The album featured massive hits like 'One More Time,' 'Digital Love,' and 'Harder, Better, Faster, Stronger,' and later inspired the animated film 'Interstella 5555.' The album is considered a landmark in electronic music history and helped bring EDM to a global audience.",
    "citationUrl": "https://en.wikipedia.org/wiki/Discovery_(Daft_Punk_album)",
    "citationTitle": "Wikipedia: Discovery (Daft Punk album)"
  },
  {
    "id": "0a26a5b3-b74d-487d-8c76-f1c80ccebce8",
    "text": "What does the acronym 'BPM' stand for in electronic music production?",
    "options": [
      "Bass Per Measure",
      "Beats Per Minute",
      "Binary Pulse Modulation",
      "Basic Pattern Mode"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "BPM stands for Beats Per Minute, measuring the tempo of a track.",
    "detailedExplanation": "Beats Per Minute (BPM) is a crucial measurement in electronic music that indicates the tempo or speed of a track. Different EDM subgenres typically fall within specific BPM ranges: house music usually ranges from 120-130 BPM, drum and bass from 160-180 BPM, and dubstep around 140 BPM. DJs use BPM measurements to seamlessly mix tracks together by matching tempos, and producers use it to maintain consistency within genres.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tempo",
    "citationTitle": "Wikipedia: Tempo"
  },
  {
    "id": "1f373cec-bb78-4408-9bd0-2d406554389a",
    "text": "Which Belgian festival, started in 2005, is considered one of the world's largest electronic dance music festivals?",
    "options": [
      "Ultra Music Festival",
      "Electric Daisy Carnival",
      "Tomorrowland",
      "Creamfields"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Tomorrowland, held in Boom, Belgium, is one of the world's most famous EDM festivals.",
    "detailedExplanation": "Tomorrowland began in 2005 in Boom, Belgium, and has grown to become one of the most prestigious electronic dance music festivals globally. Known for its elaborate fairy-tale themed stages and production values, the festival attracts over 400,000 attendees across two weekends. The festival has expanded internationally with editions in other countries and has become synonymous with the global EDM movement, featuring the world's top DJs and electronic music acts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tomorrowland_(festival)",
    "citationTitle": "Wikipedia: Tomorrowland (festival)"
  },
  {
    "id": "74583e51-3ee1-4f1f-a64f-93acb4daad19",
    "text": "What electronic music subgenre is characterized by tempos around 140 BPM and heavy emphasis on bass drops?",
    "options": [
      "Trance",
      "House",
      "Dubstep",
      "Drum and Bass"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Dubstep is known for its 140 BPM tempo and signature bass drops.",
    "detailedExplanation": "Dubstep emerged in South London in the early 2000s and is characterized by syncopated drum patterns, prominent bass lines, and the iconic 'bass drop' - a moment where the rhythm and bass dramatically shift. The genre typically operates around 140 BPM (or 70 BPM depending on how you count the beats) and gained mainstream popularity in the 2010s through artists like Skrillex, Bassnectar, and Nero. The genre's emphasis on sub-bass frequencies and dramatic dynamic changes makes it particularly impactful on large sound systems.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dubstep",
    "citationTitle": "Wikipedia: Dubstep"
  },
  {
    "id": "927d7f06-efa3-46e4-b905-443a6521b986",
    "text": "Which German electronic music pioneers released the influential 1974 album 'Autobahn'?",
    "options": [
      "Tangerine Dream",
      "Can",
      "Kraftwerk",
      "Neu!"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Kraftwerk's 'Autobahn' album was a groundbreaking work in electronic music history.",
    "detailedExplanation": "Kraftwerk's 1974 album 'Autobahn' marked a pivotal moment in electronic music history. The title track, inspired by driving on German highways, showcased the band's innovative use of synthesizers, drum machines, and vocoders. This album helped establish the template for modern electronic music and influenced countless genres including house, techno, and hip-hop. Kraftwerk's minimalist, robotic aesthetic and their pioneering use of electronic instruments earned them recognition as the godfathers of electronic music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Autobahn_(album)",
    "citationTitle": "Wikipedia: Autobahn (album)"
  },
  {
    "id": "cbd87169-9d4d-4fc1-80a9-3ccda4dd01f7",
    "text": "Which piece of equipment, invented by Roland in 1977, became legendary for its distinctive acid house sound?",
    "options": [
      "TB-303 Bass Line",
      "TR-808 Drum Machine",
      "Juno-106 Synthesizer",
      "SH-101 Synthesizer"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Roland TB-303 became the signature sound of acid house music.",
    "detailedExplanation": "The Roland TB-303 Bass Line was originally designed as a bass guitar replacement for guitarists, but it became legendary when Chicago house producers in the 1980s began using it to create the squelchy, resonant sounds that defined acid house. Artists like Phuture, with their track 'Acid Tracks,' demonstrated the TB-303's unique sound when its filters were pushed to extremes. Despite being a commercial failure initially, the TB-303 became one of the most influential and sought-after pieces of electronic music equipment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roland_TB-303",
    "citationTitle": "Wikipedia: Roland TB-303"
  },
  {
    "id": "bd5de1de-d369-446b-bb3d-8d98caa10fc5",
    "text": "Which Dutch DJ was ranked #1 on DJ Mag's Top 100 DJs poll for five consecutive years from 2013-2017?",
    "options": [
      "Tiësto",
      "Armin van Buuren",
      "Martin Garrix",
      "Hardwell"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Hardwell dominated the DJ Mag Top 100 poll from 2013 to 2017.",
    "detailedExplanation": "Hardwell (Robbert van de Corput) achieved unprecedented success in the DJ Mag Top 100 DJs poll, holding the #1 position for five consecutive years from 2013 to 2017. Known for his big room house style and energetic festival performances, Hardwell became one of the most recognizable names in EDM during the genre's mainstream peak. His radio show 'Hardwell On Air' and performances at major festivals like Ultra and Tomorrowland helped cement his position as one of the world's leading DJs before he announced his retirement from touring in 2018.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hardwell",
    "citationTitle": "Wikipedia: Hardwell"
  },
  {
    "id": "7ddc0b1b-033d-4043-ac22-56986bb1a638",
    "text": "What does the term 'four-on-the-floor' refer to in electronic dance music?",
    "options": [
      "Four turntables used simultaneously",
      "A drum pattern with kick drums on every beat",
      "Four-minute song structure",
      "Four-person DJ collective"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Four-on-the-floor describes a kick drum hitting on every quarter note beat.",
    "detailedExplanation": "Four-on-the-floor is a fundamental drum pattern in electronic dance music where the kick drum hits on every quarter note beat (beats 1, 2, 3, and 4) in 4/4 time. This steady, driving rhythm is the backbone of many EDM genres including house, disco, and trance. The pattern creates a hypnotic, danceable groove that helps maintain energy on the dance floor. The term originates from the four beats being 'on the floor' of each measure, and it's one of the most recognizable elements that makes electronic music so effective for dancing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Four_on_the_floor_(music)",
    "citationTitle": "Wikipedia: Four on the floor (music)"
  },
  {
    "id": "27b55136-36a9-4c61-a204-a15b46a314c9",
    "text": "Which electronic music producer is known for creating the 'Amen Break', one of the most sampled drum breaks in electronic music history?",
    "options": [
      "Gregory Coleman",
      "Clyde Stubblefield",
      "Bernard Purdie",
      "Steve Gadd"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Gregory Coleman performed the iconic drum break on 'Amen, Brother' by The Winstons.",
    "detailedExplanation": "Gregory Coleman's drum solo on 'Amen, Brother' by The Winstons (1969) became known as the 'Amen Break' and is arguably the most sampled piece of music in history. This 6-second drum break became foundational to drum and bass, jungle, and breakbeat genres, with thousands of electronic tracks sampling or interpolating this rhythm.",
    "citationUrl": "https://en.wikipedia.org/wiki/Amen_break",
    "citationTitle": "Wikipedia: Amen Break"
  },
  {
    "id": "47975802-93f3-4314-a532-63c5225f3eed",
    "text": "What is the name of the iconic electronic music venue in Ibiza that opened in 1973 and became synonymous with the island's club culture?",
    "options": [
      "Amnesia",
      "Pacha",
      "Space",
      "Privilege"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Pacha opened in 1973 and became one of Ibiza's most famous and enduring electronic music venues.",
    "detailedExplanation": "Pacha, with its distinctive cherry logo, opened in 1973 in Ibiza and played a crucial role in establishing the island as a global electronic music destination. The venue helped launch the careers of numerous DJs and was instrumental in the development of Balearic beat and the broader electronic dance music scene that made Ibiza world-famous.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pacha",
    "citationTitle": "Wikipedia: Pacha"
  },
  {
    "id": "03cfa47b-e9e0-44d3-a4ef-c490c437b25e",
    "text": "Which synthesizer, released by Moog in 1970, became the first commercially successful portable synthesizer?",
    "options": [
      "Moog Modular",
      "Minimoog",
      "Moog Taurus",
      "Moog Source"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Minimoog, released in 1970, was the first portable synthesizer to achieve commercial success.",
    "detailedExplanation": "The Minimoog Model D, introduced in 1970, revolutionized electronic music by making synthesizers accessible and portable for the first time. Unlike the massive modular systems that preceded it, the Minimoog could fit on a keyboard stand and was used by artists like Stevie Wonder, Pink Floyd, and Gary Numan, helping to define the sound of electronic music for decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Minimoog",
    "citationTitle": "Wikipedia: Minimoog"
  },
  {
    "id": "782163ad-c09e-4f00-b467-1777c8b6143e",
    "text": "Which electronic music subgenre emerged in Detroit in the 1980s and is often considered the birthplace of techno?",
    "options": [
      "Chicago House",
      "Detroit Techno",
      "New York Garage",
      "Miami Bass"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Detroit Techno emerged in the 1980s and is widely recognized as the birthplace of the techno genre.",
    "detailedExplanation": "Detroit Techno emerged in the mid-1980s, pioneered by artists like Juan Atkins, Derrick May, and Kevin Saunderson, known as the 'Belleville Three'. This genre combined elements of funk, electro, and Chicago house with futuristic themes, creating a distinctly mechanical and industrial sound that reflected Detroit's automotive heritage and urban decay.",
    "citationUrl": "https://en.wikipedia.org/wiki/Detroit_techno",
    "citationTitle": "Wikipedia: Detroit Techno"
  },
  {
    "id": "d0ca1ad7-00b7-4d99-b686-9a1297699820",
    "text": "What does the term 'sidechain compression' refer to in electronic music production?",
    "options": [
      "A type of reverb effect",
      "A technique that creates pumping effects by ducking audio",
      "A method of pitch shifting",
      "A way to add distortion"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Sidechain compression creates a pumping effect by automatically reducing the volume of one sound when another plays.",
    "detailedExplanation": "Sidechain compression is a production technique where the volume of one audio track is automatically reduced based on the signal from another track, typically a kick drum. This creates the characteristic 'pumping' or 'breathing' effect commonly heard in electronic dance music, where elements like basslines or pads seem to 'duck' out of the way of the kick drum on each beat.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dynamic_range_compression",
    "citationTitle": "Wikipedia: Dynamic Range Compression"
  },
  {
    "id": "7ca7874d-8a8f-431c-8cea-4ee3de188b9c",
    "text": "Which electronic music festival, held annually in the Nevada desert, is famous for its large-scale art installations and temporary community?",
    "options": [
      "Coachella",
      "Burning Man",
      "Electric Daisy Carnival",
      "Ultra Music Festival"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Burning Man is the annual festival in Nevada's Black Rock Desert known for art installations and electronic music.",
    "detailedExplanation": "Burning Man, held annually in Nevada's Black Rock Desert since 1990, has become a significant cultural event for electronic music, featuring everything from ambient and experimental electronic music to full-scale dance music performances. The festival's emphasis on self-expression, art, and community has made it a breeding ground for innovative electronic music performances and sound art installations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Burning_Man",
    "citationTitle": "Wikipedia: Burning Man"
  },
  {
    "id": "3a157482-4d7b-4632-90e3-2071b6c47727",
    "text": "Which electronic music duo released the influential ambient album 'Music for Airports' in 1978?",
    "options": [
      "Tangerine Dream",
      "Brian Eno",
      "Vangelis",
      "Jean-Michel Jarre"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Brian Eno released 'Music for Airports' in 1978, defining the ambient music genre.",
    "detailedExplanation": "'Music for Airports' was created by Brian Eno (though often working solo, he's frequently associated with collaborative projects) in 1978 as the first installment in his 'Ambient' series. This album established ambient music as a distinct genre, designed to be 'as ignorable as it is interesting' and to enhance environments without demanding attention. It used tape loops and processing techniques that became foundational to ambient and electronic music.",
    "citationUrl": "https://en.wikipedia.org/wiki/Music_for_Airports",
    "citationTitle": "Wikipedia: Music for Airports"
  },
  {
    "id": "5cbfac1d-994d-401f-9cb7-2f969689607a",
    "text": "What is the typical tempo range for drum and bass music?",
    "options": [
      "120-130 BPM",
      "140-150 BPM",
      "160-180 BPM",
      "200-220 BPM"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Drum and bass typically ranges from 160-180 BPM, making it one of the faster electronic genres.",
    "detailedExplanation": "Drum and bass music typically operates in the 160-180 BPM range, with some subgenres like neurofunk and techstep pushing even higher. This fast tempo, combined with syncopated drum patterns and heavy basslines, creates the genre's characteristic energy and intensity. The high BPM distinguishes drum and bass from other electronic genres like house (120-130 BPM) or dubstep (around 140 BPM).",
    "citationUrl": "https://en.wikipedia.org/wiki/Drum_and_bass",
    "citationTitle": "Wikipedia: Drum and Bass"
  },
  {
    "id": "c528f9ee-edcb-495c-bcd1-63140f90cb38",
    "text": "Which electronic music artist released the groundbreaking album 'Selected Ambient Works 85-92' and is often credited as a pioneer of intelligent dance music (IDM)?",
    "options": [
      "Aphex Twin",
      "Squarepusher",
      "Boards of Canada",
      "Autechre"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Aphex Twin (Richard D. James) released this influential ambient techno album in 1992.",
    "detailedExplanation": "Richard D. James, performing as Aphex Twin, released 'Selected Ambient Works 85-92' in 1992, which became a seminal album in electronic music history. The album helped establish the intelligent dance music (IDM) genre and influenced countless electronic artists. James is known for his innovative approach to electronic composition, complex rhythms, and atmospheric soundscapes that blend ambient textures with intricate beats.",
    "citationUrl": "https://en.wikipedia.org/wiki/Aphex_Twin",
    "citationTitle": "Wikipedia: Aphex Twin"
  },
  {
    "id": "635776c5-318f-401e-abcd-a93a2aa2c8c5",
    "text": "Which electronic music subgenre, originating in the UK in the early 1990s, typically features breakbeats sampled from funk and hip-hop records played at high speeds?",
    "options": [
      "Jungle",
      "Garage",
      "Dubstep",
      "Grime"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Jungle music emerged in the early 1990s UK rave scene, characterized by fast breakbeats and reggae/dancehall influences.",
    "detailedExplanation": "Jungle is an electronic music genre that developed in England in the early 1990s as part of UK rave culture. It's characterized by fast breakbeats (typically 160-180 BPM), heavily syncopated percussive loops, samples, and ragga vocals. The genre evolved from hardcore techno and incorporated influences from reggae, dancehall, and hip-hop. Jungle later evolved into drum and bass, but maintained its distinctive rapid-fire breakbeat patterns and bass-heavy sound.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jungle_music",
    "citationTitle": "Wikipedia: Jungle music"
  },
  {
    "id": "49b6e3b2-90d2-4d1e-aeab-395d11f54111",
    "text": "Which Swedish DJ and producer had a massive hit with 'Levels' in 2011 and tragically passed away in 2018 at age 28?",
    "options": [
      "Swedish House Mafia",
      "Avicii",
      "Eric Prydz",
      "Alesso"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Avicii (Tim Bergling) released 'Levels' in 2011, which became a global EDM anthem before his death in 2018.",
    "detailedExplanation": "Tim Bergling, known professionally as Avicii, was a Swedish DJ and electronic music producer who became one of the most recognizable names in EDM. His 2011 single 'Levels' became a worldwide hit and helped bring electronic dance music into mainstream consciousness. The track's distinctive Etta James vocal sample and euphoric melody made it an anthem of the EDM boom. Avicii's career was marked by numerous hits and collaborations, but he tragically died by suicide in 2018 at age 28, highlighting issues of mental health in the music industry.",
    "citationUrl": "https://en.wikipedia.org/wiki/Avicii",
    "citationTitle": "Wikipedia: Avicii"
  },
  {
    "id": "4272b59d-9206-423b-9ec2-113b036aa845",
    "text": "What is the name of the iconic electronic music software synthesizer developed by Native Instruments that became synonymous with the 'supersaw' sound in trance and progressive house music?",
    "options": [
      "Massive",
      "Serum",
      "Sylenth1",
      "Spire"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Native Instruments' Massive synthesizer, released in 2007, became famous for its 'supersaw' patches used extensively in EDM.",
    "detailedExplanation": "Massive is a software synthesizer developed by Native Instruments and released in 2007. It quickly became one of the most popular and influential synthesizers in electronic music production, particularly known for its 'supersaw' patches that became a staple sound in trance, progressive house, and later dubstep and other EDM genres. The synthesizer's wavetable synthesis capabilities and intuitive interface made it accessible to producers while offering deep sound design possibilities. Its presets and characteristic sound helped define the sound of electronic music in the late 2000s and 2010s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Native_Instruments",
    "citationTitle": "Wikipedia: Native Instruments"
  }
]