[
  {
    "id": "aade5397-e7bd-482d-a4d4-fa71bcbb9bd9",
    "text": "Which US President served the shortest term in office before dying of pneumonia?",
    "options": [
      "Zachary Taylor",
      "William Henry Harrison",
      "James A. Garfield",
      "Warren G. Harding"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "William Henry Harrison died after just 31 days in office from pneumonia.",
    "detailedExplanation": "William Henry Harrison, the 9th President of the United States, holds the record for the shortest presidency in American history. He delivered the longest inaugural address in US history on a cold, wet day in March 1841 without wearing a coat or hat, and subsequently developed pneumonia. He died on April 4, 1841, just 31 days after taking office, making his presidency the briefest in US history.",
    "citationUrl": "https://en.wikipedia.org/wiki/William_Henry_Harrison",
    "citationTitle": "Wikipedia: William Henry Harrison"
  },
  {
    "id": "3adbbb23-bb11-43f5-9c91-7d8b7a0df6a3",
    "text": "Which President established the Peace Corps in 1961?",
    "options": [
      "Dwight D. Eisenhower",
      "John F. Kennedy",
      "Lyndon B. Johnson",
      "Richard Nixon"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "John F. Kennedy established the Peace Corps by executive order on March 1, 1961.",
    "detailedExplanation": "President John F. Kennedy established the Peace Corps on March 1, 1961, by executive order as a volunteer program run by the United States government. The program was designed to provide social and economic development abroad through technical assistance, while promoting mutual understanding between Americans and populations served. Kennedy first proposed the idea during a 1960 campaign speech at the University of Michigan, and it became one of his signature domestic initiatives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Peace_Corps",
    "citationTitle": "Wikipedia: Peace Corps"
  },
  {
    "id": "1cdd3250-ae9b-4088-94b8-03f2e7b8569d",
    "text": "Which President purchased Louisiana from France, doubling the size of the United States?",
    "options": [
      "George Washington",
      "John Adams",
      "Thomas Jefferson",
      "James Madison"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Thomas Jefferson completed the Louisiana Purchase in 1803, acquiring about 827,000 square miles from France.",
    "detailedExplanation": "Thomas Jefferson authorized the Louisiana Purchase in 1803, acquiring approximately 827,000 square miles of territory from France for $15 million. This land acquisition doubled the size of the United States and included all or part of what would become 15 states. The purchase was controversial because Jefferson, a strict constructionist, worried about the constitutional authority to make such an acquisition, but he ultimately decided the benefits to the nation outweighed his constitutional concerns.",
    "citationUrl": "https://en.wikipedia.org/wiki/Louisiana_Purchase",
    "citationTitle": "Wikipedia: Louisiana Purchase"
  },
  {
    "id": "bfa82088-c016-4a84-9e8b-ee35bad4e540",
    "text": "Which President was in office during the Cuban Missile Crisis?",
    "options": [
      "Dwight D. Eisenhower",
      "John F. Kennedy",
      "Lyndon B. Johnson",
      "Richard Nixon"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "John F. Kennedy was President during the Cuban Missile Crisis in October 1962.",
    "detailedExplanation": "The Cuban Missile Crisis occurred in October 1962 during John F. Kennedy's presidency, representing the closest the world came to nuclear war during the Cold War. The crisis began when American U-2 spy planes discovered Soviet ballistic missiles under construction in Cuba. Kennedy implemented a naval quarantine around Cuba and engaged in intense negotiations with Soviet Premier Nikita Khrushchev for 13 days until the Soviets agreed to remove the missiles in exchange for a US pledge not to invade Cuba and the secret removal of US missiles from Turkey.",
    "citationUrl": "https://en.wikipedia.org/wiki/Cuban_Missile_Crisis",
    "citationTitle": "Wikipedia: Cuban Missile Crisis"
  },
  {
    "id": "c6d0fdf8-6403-4c88-9fc3-ccb139b2021c",
    "text": "Who was the youngest elected President in US history?",
    "options": [
      "John F. Kennedy",
      "Bill Clinton",
      "Barack Obama",
      "Theodore Roosevelt"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "John F. Kennedy was 43 years old when elected, making him the youngest elected president.",
    "detailedExplanation": "John F. Kennedy was the youngest elected president in American history, winning the 1960 election at age 43. While Theodore Roosevelt was younger when he assumed the presidency at age 42, he became president through succession after McKinley's assassination rather than through election. Kennedy's youth was a significant factor in the 1960 campaign, particularly highlighted during his televised debates with the older Richard Nixon, where Kennedy's youthful appearance was credited with helping him win over television viewers.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_F._Kennedy",
    "citationTitle": "Wikipedia: John F. Kennedy"
  },
  {
    "id": "46baf78d-d3e1-4521-8c2c-0e503f855e05",
    "text": "Which President created the national park system by establishing Yellowstone as the first national park?",
    "options": [
      "Abraham Lincoln",
      "Ulysses S. Grant",
      "Andrew Johnson",
      "Rutherford B. Hayes"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Ulysses S. Grant signed the law creating Yellowstone National Park in 1872, establishing the first national park.",
    "detailedExplanation": "President Ulysses S. Grant signed the Yellowstone National Park Protection Act on March 1, 1872, creating Yellowstone as the world's first national park. The legislation set aside over 2 million acres in Wyoming, Montana, and Idaho 'for the benefit and enjoyment of the people' and marked the beginning of the national park system. This groundbreaking conservation effort established the precedent that certain natural wonders should be preserved and protected for future generations rather than exploited for commercial gain.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yellowstone_National_Park",
    "citationTitle": "Wikipedia: Yellowstone National Park"
  },
  {
    "id": "c19a3c79-ea1d-4d89-aba9-1e3d394cdcb6",
    "text": "Which US President was the first to live in the White House?",
    "options": [
      "George Washington",
      "John Adams",
      "Thomas Jefferson",
      "James Madison"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "John Adams was the first president to live in the White House in 1800.",
    "detailedExplanation": "While George Washington oversaw the construction of the White House, he never actually lived in it as his presidency ended before it was completed. John Adams moved into the still-unfinished Executive Mansion (as it was then called) in November 1800, becoming the first president to reside there. The building wasn't fully completed until Thomas Jefferson's presidency.",
    "citationUrl": "https://en.wikipedia.org/wiki/White_House",
    "citationTitle": "Wikipedia: White House"
  },
  {
    "id": "2e5cd014-30a9-4eea-a793-9d96842014fb",
    "text": "Which President served more than two terms in office?",
    "options": [
      "George Washington",
      "Franklin D. Roosevelt",
      "Theodore Roosevelt",
      "Abraham Lincoln"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Franklin D. Roosevelt served four terms from 1933 to 1945, the only president to serve more than two terms.",
    "detailedExplanation": "Franklin D. Roosevelt broke the two-term tradition established by George Washington and was elected to four consecutive terms (1932, 1936, 1940, 1944). He died early in his fourth term in April 1945. His extended presidency led to the 22nd Amendment in 1951, which formally limited presidents to two terms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Franklin_D._Roosevelt",
    "citationTitle": "Wikipedia: Franklin D. Roosevelt"
  },
  {
    "id": "2f47eccb-9c5f-4248-bfc1-5826b7d700b4",
    "text": "Which President was a licensed bartender before entering politics?",
    "options": [
      "Abraham Lincoln",
      "Andrew Johnson",
      "Harry Truman",
      "Ronald Reagan"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Abraham Lincoln co-owned a general store that included a tavern and held a liquor license.",
    "detailedExplanation": "Before becoming a lawyer and politician, Abraham Lincoln co-owned a general store in New Salem, Illinois, with William Berry. The store included a tavern, and Lincoln held a liquor license, technically making him a licensed bartender. Though the business failed financially, this early experience gave Lincoln valuable insight into common people's lives and concerns, which served him well in his political career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Abraham_Lincoln",
    "citationTitle": "Wikipedia: Abraham Lincoln"
  },
  {
    "id": "53e6cebe-d0ce-4f4e-889c-7c02766cef60",
    "text": "Which President appears on Mount Rushmore alongside Washington, Jefferson, and Lincoln?",
    "options": [
      "Franklin D. Roosevelt",
      "Theodore Roosevelt",
      "Andrew Jackson",
      "Woodrow Wilson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Theodore Roosevelt is the fourth president carved on Mount Rushmore.",
    "detailedExplanation": "Mount Rushmore features four presidents: George Washington, Thomas Jefferson, Abraham Lincoln, and Theodore Roosevelt. Theodore Roosevelt was chosen to represent the nation's development phase, particularly for his role in progressive reform and conservation efforts. The monument was carved between 1927 and 1941 under the direction of sculptor Gutzon Borglum in the Black Hills of South Dakota.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mount_Rushmore",
    "citationTitle": "Wikipedia: Mount Rushmore"
  },
  {
    "id": "2f99c887-1574-400e-88e9-3974d9ccb61d",
    "text": "Which President signed the Civil Rights Act of 1964?",
    "options": [
      "John F. Kennedy",
      "Lyndon B. Johnson",
      "Dwight D. Eisenhower",
      "Richard Nixon"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Lyndon B. Johnson signed the Civil Rights Act of 1964 into law on July 2, 1964.",
    "detailedExplanation": "Although John F. Kennedy initially proposed civil rights legislation, he was assassinated before it could pass. Lyndon B. Johnson, who became president after Kennedy's death, made passage of the civil rights bill a priority and successfully navigated it through Congress despite strong opposition. Johnson signed the comprehensive Civil Rights Act of 1964 on July 2, 1964, which prohibited discrimination based on race, color, religion, sex, or national origin.",
    "citationUrl": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964",
    "citationTitle": "Wikipedia: Civil Rights Act of 1964"
  },
  {
    "id": "931f8f43-e19c-4a84-b0b5-161d48cb3bb3",
    "text": "Which President was the first to be impeached by the House of Representatives?",
    "options": [
      "Richard Nixon",
      "Andrew Johnson",
      "Bill Clinton",
      "Donald Trump"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Andrew Johnson was impeached by the House in 1868, the first president to face impeachment.",
    "detailedExplanation": "Andrew Johnson was impeached by the House of Representatives in 1868, primarily over his violation of the Tenure of Office Act when he attempted to remove Secretary of War Edwin Stanton. The impeachment was largely driven by political conflicts between Johnson and the Republican-controlled Congress over Reconstruction policies following the Civil War. Johnson was acquitted in the Senate by just one vote, avoiding removal from office.",
    "citationUrl": "https://en.wikipedia.org/wiki/Impeachment_of_Andrew_Johnson",
    "citationTitle": "Wikipedia: Impeachment of Andrew Johnson"
  },
  {
    "id": "1f96c26c-b660-40cc-bec2-7659bc11ae62",
    "text": "Which US President was the tallest in American history?",
    "options": [
      "George Washington",
      "Abraham Lincoln",
      "Franklin D. Roosevelt",
      "Thomas Jefferson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Abraham Lincoln was the tallest US President at 6 feet 4 inches.",
    "detailedExplanation": "Abraham Lincoln holds the record as the tallest US President, standing at 6 feet 4 inches (193 cm). This height was particularly notable in the 1860s when the average height for men was significantly shorter than today. Lincoln's tall, lanky frame became part of his iconic image and was often referenced in political cartoons and descriptions of the time. His height, combined with his distinctive beard and top hat, made him an instantly recognizable figure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Heights_of_presidents_and_presidential_candidates_of_the_United_States",
    "citationTitle": "Wikipedia: Heights of presidents and presidential candidates of the United States"
  },
  {
    "id": "a54ae3ed-a388-46f7-a6ae-c63d693e3ffb",
    "text": "Which President never married and remained a bachelor throughout his life?",
    "options": [
      "James Buchanan",
      "Chester A. Arthur",
      "Millard Fillmore",
      "Martin Van Buren"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "James Buchanan was the only US President who never married.",
    "detailedExplanation": "James Buchanan, the 15th President of the United States (1857-1861), was the only president to remain unmarried throughout his entire life. While he was once engaged to Anne Caroline Coleman in 1819, the engagement was broken off and she died shortly after. Buchanan never pursued marriage again. His niece, Harriet Lane, served as the White House hostess during his presidency, fulfilling the social duties typically performed by a First Lady.",
    "citationUrl": "https://en.wikipedia.org/wiki/James_Buchanan",
    "citationTitle": "Wikipedia: James Buchanan"
  },
  {
    "id": "1e23cea3-6916-4474-950d-40a4c3ef994a",
    "text": "Which President was the first to be born in the 20th century?",
    "options": [
      "Harry S. Truman",
      "John F. Kennedy",
      "Dwight D. Eisenhower",
      "Lyndon B. Johnson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "John F. Kennedy was born on May 29, 1917, making him the first president born in the 20th century.",
    "detailedExplanation": "John F. Kennedy was the first US President born in the 20th century, on May 29, 1917, in Brookline, Massachusetts. This made him part of a new generation of political leaders who came of age during World War I and the Great Depression. His birth in the 20th century symbolized a generational shift in American politics when he took office in 1961, representing youth, vigor, and modernization compared to his predecessor, Dwight Eisenhower, who was born in 1890.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_F._Kennedy",
    "citationTitle": "Wikipedia: John F. Kennedy"
  },
  {
    "id": "8b9fd4f3-9d76-43f3-9f1f-ffc378c6ba44",
    "text": "Which President was awarded a Pulitzer Prize for Biography?",
    "options": [
      "Theodore Roosevelt",
      "Woodrow Wilson",
      "John F. Kennedy",
      "Jimmy Carter"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "John F. Kennedy won the Pulitzer Prize for Biography in 1957 for his book 'Profiles in Courage.'",
    "detailedExplanation": "John F. Kennedy was awarded the Pulitzer Prize for Biography in 1957 for his book 'Profiles in Courage,' which profiled eight US Senators who showed courage in taking unpopular stands. Kennedy wrote the book while recovering from back surgery in 1955. The book became a bestseller and helped establish Kennedy's reputation as an intellectual and serious political figure, contributing to his presidential ambitions. However, there has been some historical debate about how much of the book Kennedy actually wrote himself versus his speechwriter Ted Sorensen.",
    "citationUrl": "https://en.wikipedia.org/wiki/Profiles_in_Courage",
    "citationTitle": "Wikipedia: Profiles in Courage"
  },
  {
    "id": "a4e49eca-0393-4bd4-8e25-620148ae7e3f",
    "text": "Which President established NASA, the US space agency?",
    "options": [
      "Harry S. Truman",
      "Dwight D. Eisenhower",
      "John F. Kennedy",
      "Lyndon B. Johnson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "President Eisenhower signed the National Aeronautics and Space Act creating NASA in 1958.",
    "detailedExplanation": "President Dwight D. Eisenhower established NASA (National Aeronautics and Space Administration) by signing the National Aeronautics and Space Act on July 29, 1958. This was largely in response to the Soviet Union's successful launch of Sputnik in 1957, which sparked fears that the US was falling behind in space technology during the Cold War. NASA officially began operations on October 1, 1958, absorbing the earlier National Advisory Committee for Aeronautics (NACA) and launching America's civilian space program.",
    "citationUrl": "https://en.wikipedia.org/wiki/NASA",
    "citationTitle": "Wikipedia: NASA"
  },
  {
    "id": "de384c4e-0779-4e61-8c3e-b15f4f14fbff",
    "text": "Which President served as both the 22nd and 24th President of the United States?",
    "options": [
      "Benjamin Harrison",
      "Grover Cleveland",
      "William McKinley",
      "Chester A. Arthur"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Grover Cleveland served non-consecutive terms as the 22nd and 24th President.",
    "detailedExplanation": "Grover Cleveland is unique among US Presidents for serving non-consecutive terms, making him both the 22nd and 24th President of the United States. He first served from 1885-1889, then lost re-election to Benjamin Harrison in 1888 despite winning the popular vote. Cleveland successfully ran again in 1892 and served from 1893-1897. This unusual circumstance means that while there have been 46 presidencies, there have only been 45 different individuals who have served as president.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grover_Cleveland",
    "citationTitle": "Wikipedia: Grover Cleveland"
  },
  {
    "id": "d43a5d81-5cce-443c-a8e1-bab2acfdd14e",
    "text": "Which President was the first to have been born in a hospital?",
    "options": [
      "Franklin D. Roosevelt",
      "Harry S. Truman",
      "Jimmy Carter",
      "Dwight D. Eisenhower"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Jimmy Carter was the first US President born in a hospital, at Wise Sanitarium in Plains, Georgia in 1924.",
    "detailedExplanation": "Jimmy Carter, born on October 1, 1924, was the first US President to be born in a hospital. He was born at the Wise Sanitarium in Plains, Georgia. Prior to the 20th century, most births occurred at home, and even into the early 1900s, hospital births were not common. Carter's hospital birth reflects the changing medical practices of the 1920s when hospital deliveries were becoming more standard, especially in developed areas. This seemingly simple fact represents a significant shift in American healthcare and social practices.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jimmy_Carter",
    "citationTitle": "Wikipedia: Jimmy Carter"
  },
  {
    "id": "f6517c3c-c396-4ef1-8744-ec3f3a5c63cb",
    "text": "Which President created the motto 'Speak softly and carry a big stick'?",
    "options": [
      "William Howard Taft",
      "Theodore Roosevelt",
      "Woodrow Wilson",
      "William McKinley"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Theodore Roosevelt popularized the phrase 'Speak softly and carry a big stick' as his approach to foreign policy.",
    "detailedExplanation": "Theodore Roosevelt popularized the phrase 'Speak softly and carry a big stick; you will go far,' which became emblematic of his foreign policy approach. The saying, which Roosevelt attributed to a West African proverb, meant that the United States should negotiate peacefully while simultaneously showing strength through military power. This philosophy guided Roosevelt's presidency from 1901-1909 and was exemplified in actions like the construction of the Panama Canal and his role in ending the Russo-Japanese War, for which he won the Nobel Peace Prize.",
    "citationUrl": "https://en.wikipedia.org/wiki/Big_stick_ideology",
    "citationTitle": "Wikipedia: Big stick ideology"
  }
]