[
  {
    "id": "530cc470-95cf-424d-97bc-a9b7caf3559b",
    "text": "Which grape variety is known as Syrah in France but goes by a different name in Australia?",
    "options": [
      "Shiraz",
      "Grenache",
      "Mourvedre",
      "Petite Sirah"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Syrah and Shiraz are the same grape variety, with Syrah being the French name and Shiraz the Australian name.",
    "detailedExplanation": "The Syrah grape variety is one of the most famous examples of how the same grape can have different names in different wine regions. In France, particularly in the Northern Rhône Valley where it originated, it's called Syrah and produces elegant, structured wines. When French settlers brought this grape to Australia in the 19th century, it became known as Shiraz and developed its own distinct style, typically producing fuller-bodied, fruit-forward wines. Today, many winemakers choose their preferred name based on the style they're aiming to achieve.",
    "citationUrl": "https://en.wikipedia.org/wiki/Syrah",
    "citationTitle": "Wikipedia: Syrah"
  },
  {
    "id": "840907d9-34d2-4513-bec5-97f263db59a2",
    "text": "The wine region of Rioja is primarily located in which European country?",
    "options": [
      "Portugal",
      "Spain",
      "Italy",
      "France"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Rioja is Spain's most famous wine region, located in north-central Spain.",
    "detailedExplanation": "Rioja is Spain's premier wine region, located in the north-central part of the country along the Ebro River. The region is divided into three sub-zones: Rioja Alta, Rioja Alavesa, and Rioja Baja. Rioja is best known for its red wines made primarily from the Tempranillo grape, often blended with Garnacha, Mazuelo, and Graciano. The region has a long winemaking tradition dating back to Roman times and gained international recognition in the 19th century. Rioja wines are famous for their aging classifications: Crianza, Reserva, and Gran Reserva.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rioja_(wine)",
    "citationTitle": "Wikipedia: Rioja (wine)"
  },
  {
    "id": "254f86b8-866c-4341-b174-7228eca33fe1",
    "text": "Which of these wine regions is NOT located in France?",
    "options": [
      "Burgundy",
      "Tuscany",
      "Champagne",
      "Bordeaux"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Tuscany is located in Italy, while Burgundy, Champagne, and Bordeaux are all famous French wine regions.",
    "detailedExplanation": "Tuscany is one of Italy's most prestigious wine regions, located in central Italy and famous for wines like Chianti, Brunello di Montalcino, and Super Tuscans. The other three options are all renowned French wine regions: Burgundy is famous for its Pinot Noir and Chardonnay, Champagne is the only region that can legally produce true Champagne sparkling wine, and Bordeaux is known for its prestigious red wine blends featuring Cabernet Sauvignon and Merlot. This question tests knowledge of European wine geography and the ability to distinguish between major wine regions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tuscan_wine",
    "citationTitle": "Wikipedia: Tuscan wine"
  },
  {
    "id": "d5cad962-17a2-4cf9-940d-2168539b9b2d",
    "text": "What does the term 'terroir' refer to in winemaking?",
    "options": [
      "The age of the vineyard",
      "The environmental factors that affect wine character",
      "The size of the wine barrel",
      "The harvest date"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Terroir encompasses all environmental factors including soil, climate, and topography that influence wine character.",
    "detailedExplanation": "Terroir is a fundamental concept in winemaking that refers to the complete natural environment in which a wine is produced. This includes factors such as soil composition, climate patterns, topography, elevation, and even local microorganisms. The French believe that terroir is what makes wines from different regions unique, even when made from the same grape variety using similar techniques. For example, a Chardonnay from Burgundy will taste different from one made in California due to differences in terroir. This concept is central to the European appellation system and explains why certain wines can only be authentically produced in specific geographic locations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Terroir",
    "citationTitle": "Wikipedia: Terroir"
  },
  {
    "id": "f783b60e-8c1b-44a6-9ab7-a71fc26ea33d",
    "text": "Which grape variety is the primary component of German Riesling wines?",
    "options": [
      "Gewürztraminer",
      "Riesling",
      "Müller-Thurgau",
      "Silvaner"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Riesling wines are made from the Riesling grape variety, which is Germany's most noble white wine grape.",
    "detailedExplanation": "This question might seem straightforward, but it tests understanding of grape varieties versus wine names. Riesling is both a grape variety and the name of wines made from that grape. In Germany, Riesling is considered the king of white wine grapes and is grown in all major German wine regions, particularly the Mosel, Rheingau, and Pfalz. German Rieslings are known for their exceptional ability to express terroir, ranging from bone-dry to lusciously sweet, and often featuring bright acidity and complex mineral notes. The grape's versatility and Germany's cool climate create ideal conditions for producing some of the world's finest Riesling wines.",
    "citationUrl": "https://en.wikipedia.org/wiki/German_wine",
    "citationTitle": "Wikipedia: German wine"
  },
  {
    "id": "33b25295-54fd-47a2-98a5-5839f77e3074",
    "text": "The Napa Valley is primarily located in which U.S. state?",
    "options": [
      "Oregon",
      "Washington",
      "California",
      "New York"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Napa Valley is located in Northern California and is one of America's most prestigious wine regions.",
    "detailedExplanation": "Napa Valley is situated in Northern California, about an hour's drive north of San Francisco. This relatively small wine region, stretching approximately 30 miles long and ranging from 1 to 5 miles wide, has achieved worldwide recognition for producing premium wines, particularly Cabernet Sauvignon. The valley benefits from a Mediterranean climate with warm, dry summers and mild winters, along with diverse soil types and microclimates created by the surrounding mountains. Napa Valley was the first American wine region to gain international attention, especially after the famous 1976 Judgment of Paris tasting where Napa wines outperformed prestigious French wines in a blind tasting.",
    "citationUrl": "https://en.wikipedia.org/wiki/Napa_Valley_AVA",
    "citationTitle": "Wikipedia: Napa Valley AVA"
  },
  {
    "id": "3347708d-723f-4408-b61e-86c6b45e1099",
    "text": "What is the most widely planted wine grape variety in the world?",
    "options": [
      "Chardonnay",
      "Merlot",
      "Cabernet Sauvignon",
      "Airén"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Airén, a white grape variety grown primarily in Spain, is the most widely planted wine grape in the world by acreage.",
    "detailedExplanation": "While many people might guess more famous varieties like Chardonnay or Cabernet Sauvignon, Airén is actually the most widely planted wine grape variety globally. This white grape is grown predominantly in Spain, particularly in the La Mancha region of central Spain, where it covers vast areas of vineyard land. Airén is well-adapted to hot, dry climates and produces light, neutral wines that are often used for brandy production or simple table wines. Its extensive cultivation in Spain's large wine regions gives it the top spot in terms of total hectares planted worldwide, though it may not be as internationally recognized as other varieties.",
    "citationUrl": "https://en.wikipedia.org/wiki/Air%C3%A9n",
    "citationTitle": "Wikipedia: Airén"
  },
  {
    "id": "a86cd11d-24bc-4cc1-8b56-0b16343bcf85",
    "text": "What is the traditional method of sparkling wine production used in Champagne called?",
    "options": [
      "Charmat method",
      "Méthode champenoise",
      "Transfer method",
      "Ancestral method"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Méthode champenoise is the traditional method where secondary fermentation occurs in the bottle.",
    "detailedExplanation": "Méthode champenoise, also known as the traditional method, is the classic technique for producing Champagne and other high-quality sparkling wines. This method involves a secondary fermentation that takes place directly in the bottle, creating the bubbles naturally. The process includes riddling (gradually rotating bottles to collect sediment) and disgorgement (removing the sediment). This labor-intensive method produces finer, more persistent bubbles compared to other methods like Charmat, where secondary fermentation occurs in large tanks.",
    "citationUrl": "https://en.wikipedia.org/wiki/Traditional_method",
    "citationTitle": "Wikipedia: Traditional method"
  },
  {
    "id": "9c9861b9-3243-45d8-8562-69ccd52b71ad",
    "text": "Which South American country is famous for its Malbec wines?",
    "options": [
      "Chile",
      "Brazil",
      "Argentina",
      "Peru"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Argentina, particularly the Mendoza region, is world-renowned for producing exceptional Malbec wines.",
    "detailedExplanation": "Argentina has become synonymous with Malbec, transforming this grape variety from a relatively obscure French blending grape into one of the world's most celebrated red wines. The high-altitude vineyards of Mendoza, situated in the foothills of the Andes Mountains, provide ideal conditions for Malbec with intense sunlight, cool nights, and well-draining soils. Argentine Malbec is typically fuller-bodied and more fruit-forward than its French counterparts, with rich dark fruit flavors and smooth tannins.",
    "citationUrl": "https://en.wikipedia.org/wiki/Argentine_wine",
    "citationTitle": "Wikipedia: Argentine wine"
  },
  {
    "id": "8046d4cd-b079-4fab-ad1c-999717626421",
    "text": "What does 'Appellation d'Origine Contrôlée' (AOC) regulate in French wine?",
    "options": [
      "Wine pricing",
      "Geographic origin and production methods",
      "Alcohol content only",
      "Export quantities"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "AOC is a certification system that controls geographic origin, grape varieties, and production methods.",
    "detailedExplanation": "Appellation d'Origine Contrôlée (AOC) is France's premier wine classification system that strictly regulates where grapes are grown, which grape varieties can be used, how wines are made, and even maximum yields per hectare. This system ensures that wines labeled with a specific appellation truly reflect the characteristics of their terroir and traditional winemaking methods. For example, Champagne AOC dictates not only that grapes must come from the Champagne region, but also specifies the permitted grape varieties, production methods, and aging requirements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Appellation_d%27origine_contr%C3%B4l%C3%A9e",
    "citationTitle": "Wikipedia: Appellation d'origine contrôlée"
  },
  {
    "id": "17050630-d2c2-469f-b4bb-d5796d3cc533",
    "text": "Which grape variety is the primary component of Portuguese Port wine?",
    "options": [
      "Tempranillo",
      "Touriga Nacional",
      "Sangiovese",
      "Grenache"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Touriga Nacional is considered the flagship grape variety for Port wine production in Portugal's Douro Valley.",
    "detailedExplanation": "Touriga Nacional is widely regarded as Portugal's finest indigenous grape variety and the most important component in premium Port wines. This thick-skinned grape produces wines with intense color, rich fruit flavors, and excellent aging potential. While Port is typically a blend of several Portuguese grape varieties, Touriga Nacional provides the backbone with its concentrated flavors and structured tannins. The grape is grown primarily in the Douro Valley, a UNESCO World Heritage site known for its terraced vineyards along the Douro River.",
    "citationUrl": "https://en.wikipedia.org/wiki/Touriga_Nacional",
    "citationTitle": "Wikipedia: Touriga Nacional"
  },
  {
    "id": "fc724068-3c97-4341-bb3b-e9cce96865bb",
    "text": "The Clare Valley and Barossa Valley are prominent wine regions in which country?",
    "options": [
      "New Zealand",
      "South Africa",
      "Australia",
      "Chile"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Both Clare Valley and Barossa Valley are located in South Australia and are among the country's most famous wine regions.",
    "detailedExplanation": "Clare Valley and Barossa Valley are two of South Australia's most celebrated wine regions. The Barossa Valley, established by German settlers in the 1840s, is renowned for its old-vine Shiraz and is one of the world's great wine regions. Clare Valley, located about 100 kilometers north of Adelaide, is particularly famous for its Riesling wines, which are considered among the finest examples of this variety outside of Germany. Both regions benefit from South Australia's Mediterranean climate and diverse soil types.",
    "citationUrl": "https://en.wikipedia.org/wiki/South_Australian_wine",
    "citationTitle": "Wikipedia: South Australian wine"
  },
  {
    "id": "ebe33cae-f2dc-4610-b767-01a7bdc57262",
    "text": "Which New Zealand wine region is most famous for its Sauvignon Blanc?",
    "options": [
      "Central Otago",
      "Hawke's Bay",
      "Marlborough",
      "Canterbury"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Marlborough is New Zealand's largest wine region and internationally acclaimed for its distinctive Sauvignon Blanc.",
    "detailedExplanation": "Marlborough, located at the northern tip of New Zealand's South Island, revolutionized the global perception of Sauvignon Blanc when Cloudy Bay first exported their wine in the 1980s. The region's unique combination of long sunshine hours, cool nights, and free-draining soils produces Sauvignon Blanc with distinctive tropical fruit and herbaceous characteristics that have become the benchmark for New World expression of this variety. Marlborough now accounts for about two-thirds of New Zealand's total wine production.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marlborough_wine_region",
    "citationTitle": "Wikipedia: Marlborough wine region"
  },
  {
    "id": "e0480f20-7d7c-4f22-9bfe-90aa29670946",
    "text": "What is the minimum aging requirement for Gran Reserva red wines in Spain?",
    "options": [
      "2 years",
      "3 years",
      "5 years",
      "7 years"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Spanish Gran Reserva red wines must be aged for a minimum of 5 years, with at least 18 months in oak barrels.",
    "detailedExplanation": "Spain's wine classification system includes strict aging requirements for different quality levels. Gran Reserva represents the highest tier and requires red wines to be aged for a minimum of five years before release, with at least 18 months spent in oak barrels and the remainder in bottle. This extended aging process is only applied to wines from exceptional vintages and results in wines with complex flavors, smooth tannins, and great aging potential. The system ensures that Gran Reserva wines represent the pinnacle of Spanish winemaking tradition.",
    "citationUrl": "https://en.wikipedia.org/wiki/Spanish_wine",
    "citationTitle": "Wikipedia: Spanish wine"
  },
  {
    "id": "b5629778-35f4-44d5-911d-0cd65affad88",
    "text": "Which Italian wine region is famous for producing Chianti Classico?",
    "options": [
      "Piedmont",
      "Tuscany",
      "Veneto",
      "Sicily"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Tuscany is the Italian region famous for producing Chianti Classico wines.",
    "detailedExplanation": "Tuscany, located in central Italy, is renowned for its Chianti Classico wines made primarily from Sangiovese grapes. The Chianti Classico region sits between Florence and Siena and is distinguished by its black rooster (Gallo Nero) symbol on bottle necks. This historic wine region has been producing wine since Etruscan times and received formal recognition in 1716, making it one of the world's oldest officially demarcated wine regions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chianti",
    "citationTitle": "Wikipedia: Chianti"
  },
  {
    "id": "4c65f9c8-c9bb-4f87-8eb7-e5eb20c612c7",
    "text": "What is the dominant white grape variety used in making Chablis wine?",
    "options": [
      "Sauvignon Blanc",
      "Pinot Grigio",
      "Chardonnay",
      "Riesling"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Chablis is made exclusively from Chardonnay grapes grown in the Chablis region of Burgundy, France.",
    "detailedExplanation": "Chablis, one of France's most prestigious white wines, is produced exclusively from Chardonnay grapes in the northernmost wine region of Burgundy. The cool climate and unique Kimmeridgian soil (containing fossilized oyster shells) give Chablis its characteristic mineral, crisp, and dry profile that differs significantly from Chardonnays produced in warmer climates. This terroir-driven expression of Chardonnay is considered the benchmark for unoaked, mineral-driven white wines.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chablis_wine",
    "citationTitle": "Wikipedia: Chablis wine"
  },
  {
    "id": "505cfb50-79a0-4c8a-9bc3-a0249cfb7c55",
    "text": "Which wine classification system uses terms like 'Kabinett', 'Spätlese', and 'Auslese'?",
    "options": [
      "Italian DOCG",
      "German Prädikatswein",
      "French AOC",
      "Spanish DO"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The German Prädikatswein classification system uses these terms to indicate the ripeness level of grapes at harvest.",
    "detailedExplanation": "Germany's Prädikatswein system classifies wines based on the must weight (sugar content) of grapes at harvest, indicating their ripeness level. Kabinett represents the lightest style made from the least ripe grapes, Spätlese means 'late harvest' with more concentrated flavors, and Auslese indicates 'select harvest' from very ripe grapes. This system continues up through Beerenauslese and Trockenbeerenauslese, representing increasingly sweet and concentrated wines made from progressively riper grapes.",
    "citationUrl": "https://en.wikipedia.org/wiki/German_wine_classification",
    "citationTitle": "Wikipedia: German wine classification"
  },
  {
    "id": "804fe265-6663-4f65-a14b-3cc401af2cb7",
    "text": "The Douro Valley, a UNESCO World Heritage site, is primarily famous for producing which type of wine?",
    "options": [
      "Sherry",
      "Port",
      "Madeira",
      "Vinho Verde"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Douro Valley in Portugal is the historic home of Port wine production.",
    "detailedExplanation": "The Douro Valley in northern Portugal has been producing Port wine since the 17th century and became the world's first officially demarcated wine region in 1756. The steep terraced vineyards along the Douro River create ideal conditions for growing the indigenous grape varieties used in Port production. The region's schist soil, extreme temperatures, and low rainfall contribute to the intense, concentrated grapes that are fortified with grape spirit to create the sweet, fortified wine known as Port.",
    "citationUrl": "https://en.wikipedia.org/wiki/Douro",
    "citationTitle": "Wikipedia: Douro"
  },
  {
    "id": "d4f995cc-5654-4b6b-b9b4-e56fc7366805",
    "text": "Which grape variety is known as the 'King of Grapes' and is the primary grape in Barolo wines?",
    "options": [
      "Sangiovese",
      "Tempranillo",
      "Nebbiolo",
      "Barbera"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Nebbiolo is often called the 'King of Grapes' and is the grape used to make Barolo wines in Piedmont, Italy.",
    "detailedExplanation": "Nebbiolo, named after the fog (nebbia) that often shrouds Piedmont's vineyards during harvest, is considered one of Italy's most noble grape varieties. This late-ripening grape produces the prestigious Barolo and Barbaresco wines, known for their complex aromatics, high tannins, and exceptional aging potential. Nebbiolo wines typically display notes of tar, roses, leather, and dried fruits, and require extended aging to soften their powerful structure. The grape is notoriously difficult to grow and rarely succeeds outside its native Piedmont region.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nebbiolo",
    "citationTitle": "Wikipedia: Nebbiolo"
  },
  {
    "id": "14c0ecf9-468d-4e3a-b1d9-a371051faf7b",
    "text": "Which French wine region is divided into 'Left Bank' and 'Right Bank' areas?",
    "options": [
      "Burgundy",
      "Rhône Valley",
      "Bordeaux",
      "Loire Valley"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Bordeaux is famously divided into Left Bank and Right Bank regions by the Gironde estuary.",
    "detailedExplanation": "Bordeaux wine region is geographically and stylistically divided by the Gironde estuary into Left Bank and Right Bank areas. The Left Bank includes prestigious appellations like Médoc, Haut-Médoc, Saint-Julien, Pauillac, and Saint-Estèphe, known for Cabernet Sauvignon-dominant blends and gravelly soils. The Right Bank encompasses Saint-Émilion and Pomerol, famous for Merlot-dominant wines grown in clay and limestone soils. This geographical division creates distinct wine styles, with Left Bank wines typically being more structured and age-worthy, while Right Bank wines are often more approachable and fruit-forward.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bordeaux_wine",
    "citationTitle": "Wikipedia: Bordeaux wine"
  }
]