[
  {
    "id": "f44e0646-d61c-4977-a616-5ddfef3a236a",
    "text": "Who was the first woman to serve as British Prime Minister?",
    "options": [
      "Margaret Thatcher",
      "Theresa May",
      "Liz Truss",
      "Nicola Sturgeon"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Margaret Thatcher became the first female British Prime Minister in 1979.",
    "detailedExplanation": "Margaret Thatcher, known as the 'Iron Lady', became Britain's first female Prime Minister when she led the Conservative Party to victory in the 1979 general election. She served from 1979 to 1990, making her the longest-serving Prime Minister of the 20th century. Theresa May and Liz Truss would later become the second and third female Prime Ministers respectively, while Nicola Sturgeon serves as First Minister of Scotland, not Prime Minister of the UK.",
    "citationUrl": "https://en.wikipedia.org/wiki/Margaret_Thatcher",
    "citationTitle": "Wikipedia: Margaret Thatcher"
  },
  {
    "id": "ac670d6d-6ac6-4d9a-b669-e6388715cbf8",
    "text": "Which Prime Minister led Britain during World War II?",
    "options": [
      "Neville Chamberlain",
      "Winston Churchill",
      "Clement Attlee",
      "Anthony Eden"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Winston Churchill was Prime Minister during most of World War II, from 1940 to 1945.",
    "detailedExplanation": "Winston Churchill became Prime Minister in May 1940, replacing Neville Chamberlain who had initially led Britain into World War II but lost confidence due to early military failures. Churchill's inspiring leadership, speeches, and determination helped rally Britain during its darkest hours, including the Battle of Britain and the Blitz. He served as wartime Prime Minister until July 1945, when his Conservative Party was defeated by Clement Attlee's Labour Party in the general election.",
    "citationUrl": "https://en.wikipedia.org/wiki/Winston_Churchill",
    "citationTitle": "Wikipedia: Winston Churchill"
  },
  {
    "id": "2bf72923-5aad-4e59-bebf-e3a4e99e2037",
    "text": "Who was Prime Minister when Britain joined the European Economic Community (EEC) in 1973?",
    "options": [
      "Harold Wilson",
      "Edward Heath",
      "James Callaghan",
      "Margaret Thatcher"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Edward Heath was Prime Minister when Britain successfully joined the EEC in 1973.",
    "detailedExplanation": "Edward Heath, Conservative Prime Minister from 1970 to 1974, achieved his long-held ambition of taking Britain into Europe when the UK joined the European Economic Community on January 1, 1973. This came after previous failed attempts under Harold Macmillan and Harold Wilson, which had been blocked by French President Charles de Gaulle. Heath saw European membership as crucial for Britain's economic future, though it remained a divisive issue that would later contribute to political upheavals including Brexit decades later.",
    "citationUrl": "https://en.wikipedia.org/wiki/Edward_Heath",
    "citationTitle": "Wikipedia: Edward Heath"
  },
  {
    "id": "020722ac-a28d-45ab-8cc2-695b3efec009",
    "text": "Which Prime Minister served the shortest term in British history?",
    "options": [
      "Liz Truss",
      "Alec Douglas-Home",
      "Anthony Eden",
      "Gordon Brown"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Liz Truss served only 45 days as Prime Minister in 2022, the shortest tenure in British history.",
    "detailedExplanation": "Liz Truss became Prime Minister on September 6, 2022, but was forced to resign on October 25, 2022, after just 45 days in office. Her tenure was cut short by economic turmoil following her mini-budget, which included unfunded tax cuts that spooked financial markets, caused the pound to plummet, and led to rising mortgage rates. The crisis forced multiple U-turns on policy and ultimately made her position untenable, breaking the previous record for shortest tenure held by George Canning, who died in office after 119 days in 1827.",
    "citationUrl": "https://en.wikipedia.org/wiki/Liz_Truss",
    "citationTitle": "Wikipedia: Liz Truss"
  },
  {
    "id": "b6ea07a9-5e58-4b72-a2a2-ac5ac5c1eea8",
    "text": "Who was the youngest person to become British Prime Minister in the 20th century?",
    "options": [
      "Tony Blair",
      "David Cameron",
      "Harold Wilson",
      "John Major"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Tony Blair became Prime Minister at age 43 in 1997, making him the youngest PM of the 20th century.",
    "detailedExplanation": "Tony Blair was 43 years old when he became Prime Minister in May 1997, making him the youngest Prime Minister of the 20th century. He led the Labour Party to a landslide victory after 18 years of Conservative rule, promising to modernize Britain with his 'New Labour' approach. Blair served for over 10 years until 2007, winning three consecutive general elections. David Cameron was slightly older at 43 years and 192 days when he became PM in 2010, making Blair marginally younger.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tony_Blair",
    "citationTitle": "Wikipedia: Tony Blair"
  },
  {
    "id": "fed8742b-9c61-4a11-a692-c1c912b95784",
    "text": "Which Prime Minister created the National Health Service (NHS)?",
    "options": [
      "Winston Churchill",
      "Clement Attlee",
      "Harold Macmillan",
      "Harold Wilson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Clement Attlee's Labour government established the NHS in 1948.",
    "detailedExplanation": "Clement Attlee, who served as Prime Minister from 1945 to 1951, led the Labour government that created the National Health Service. The NHS was launched on July 5, 1948, under the leadership of Health Minister Aneurin Bevan, as part of Attlee's ambitious post-war social reform program. The service was founded on the principle that healthcare should be free at the point of use and available to all, regardless of wealth. This represented one of the most significant social achievements in British history and became a model for healthcare systems worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Clement_Attlee",
    "citationTitle": "Wikipedia: Clement Attlee"
  },
  {
    "id": "70544435-7095-49a0-b04a-9fb4db072699",
    "text": "Who was Prime Minister during the Falklands War in 1982?",
    "options": [
      "James Callaghan",
      "Margaret Thatcher",
      "John Major",
      "Harold Wilson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Margaret Thatcher was Prime Minister during the Falklands conflict with Argentina in 1982.",
    "detailedExplanation": "Margaret Thatcher was Prime Minister when Argentina invaded the Falkland Islands on April 2, 1982. Her decisive response to send a naval task force 8,000 miles to the South Atlantic to reclaim the islands was initially controversial but ultimately successful. The conflict lasted 74 days and resulted in British victory, with Argentina surrendering on June 14, 1982. The successful outcome of the war significantly boosted Thatcher's popularity and is widely credited with helping her win the 1983 general election with an increased majority.",
    "citationUrl": "https://en.wikipedia.org/wiki/Falklands_War",
    "citationTitle": "Wikipedia: Falklands War"
  },
  {
    "id": "00ec9802-7d7f-4092-9777-536692a20387",
    "text": "Which Prime Minister was known by the nickname 'The Iron Lady'?",
    "options": [
      "Theresa May",
      "Margaret Thatcher",
      "Liz Truss",
      "Elizabeth II"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Margaret Thatcher earned the nickname 'The Iron Lady' for her uncompromising political style.",
    "detailedExplanation": "Margaret Thatcher was dubbed 'The Iron Lady' by the Soviet press in the 1970s, initially as criticism of her strong anti-communist stance while she was Leader of the Opposition. However, Thatcher embraced the nickname, which perfectly captured her reputation for unwavering determination and uncompromising political style. The moniker became synonymous with her leadership approach during her 11 years as Prime Minister, reflecting her firm handling of economic policy, industrial relations, and international affairs including the Cold War and Falklands conflict.",
    "citationUrl": "https://en.wikipedia.org/wiki/Margaret_Thatcher",
    "citationTitle": "Wikipedia: Margaret Thatcher"
  },
  {
    "id": "b4b536c1-7da2-4e87-9037-5d92e5ae49a7",
    "text": "Which Prime Minister was known for implementing the 'Three Day Week' during the 1970s energy crisis?",
    "options": [
      "Harold Wilson",
      "Edward Heath",
      "James Callaghan",
      "Margaret Thatcher"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Edward Heath implemented the Three Day Week in 1974 to conserve electricity during coal miners' strikes.",
    "detailedExplanation": "Edward Heath, Conservative Prime Minister from 1970-1974, introduced the Three Day Week policy in January 1974 as an emergency measure to conserve electricity during industrial action by coal miners and railway workers. Commercial users of electricity were limited to three specified consecutive days' consumption each week, leading to widespread disruption across British industry and commerce.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three-Day_Week",
    "citationTitle": "Wikipedia: Three-Day Week"
  },
  {
    "id": "f3172974-a7d9-4e7b-a353-13c854ec0c27",
    "text": "Who was the last Prime Minister to serve under Queen Elizabeth II before her death in 2022?",
    "options": [
      "Boris Johnson",
      "Liz Truss",
      "Rishi Sunak",
      "Theresa May"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Liz Truss met with Queen Elizabeth II just two days before the Queen's death in September 2022.",
    "detailedExplanation": "Liz Truss became Prime Minister on September 6, 2022, after meeting Queen Elizabeth II at Balmoral Castle in Scotland. This was one of the Queen's final official acts, as she passed away just two days later on September 8, 2022. Truss therefore holds the distinction of being the last of the 15 Prime Ministers to serve under Queen Elizabeth II's 70-year reign.",
    "citationUrl": "https://en.wikipedia.org/wiki/Liz_Truss",
    "citationTitle": "Wikipedia: Liz Truss"
  },
  {
    "id": "4883e053-7e17-4f3c-89e2-8db67c028361",
    "text": "Which Prime Minister served three separate non-consecutive terms in office?",
    "options": [
      "William Gladstone",
      "Winston Churchill",
      "Harold Wilson",
      "Stanley Baldwin"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Stanley Baldwin served as Prime Minister three times: 1923-1924, 1924-1929, and 1935-1937.",
    "detailedExplanation": "Stanley Baldwin is one of only two Prime Ministers to serve three separate terms in office. His first term lasted from May 1923 to January 1924, his second from November 1924 to June 1929, and his third from June 1935 to May 1937. He led the Conservative Party through significant events including the General Strike of 1926 and the abdication crisis of Edward VIII in 1936.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stanley_Baldwin",
    "citationTitle": "Wikipedia: Stanley Baldwin"
  },
  {
    "id": "84d8e072-2f5b-4398-b1b4-0e637781b3d0",
    "text": "Who was Prime Minister when the Channel Tunnel officially opened in 1994?",
    "options": [
      "Margaret Thatcher",
      "John Major",
      "Tony Blair",
      "Gordon Brown"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "John Major was Prime Minister when the Channel Tunnel opened to passenger traffic in May 1994.",
    "detailedExplanation": "John Major served as Conservative Prime Minister from 1990 to 1997 and was in office when the Channel Tunnel officially opened for passenger services in May 1994. The tunnel, connecting England and France beneath the English Channel, was jointly inaugurated by Major and French President François Mitterrand, marking a historic moment in European transportation infrastructure.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Major",
    "citationTitle": "Wikipedia: John Major"
  },
  {
    "id": "0733dfc2-94a5-4300-80ab-089426f6ee3b",
    "text": "Which Prime Minister introduced the controversial 'Poll Tax' in the late 1980s?",
    "options": [
      "Margaret Thatcher",
      "John Major",
      "Tony Blair",
      "Harold Wilson"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Margaret Thatcher's government introduced the Community Charge, known as the Poll Tax, which proved highly unpopular.",
    "detailedExplanation": "Margaret Thatcher's Conservative government introduced the Community Charge, commonly known as the Poll Tax, first in Scotland in 1989 and then in England and Wales in 1990. This flat-rate tax replaced the previous rates system but proved extremely unpopular, leading to widespread protests and riots. The policy's failure contributed significantly to Thatcher's downfall as Conservative Party leader in November 1990.",
    "citationUrl": "https://en.wikipedia.org/wiki/Poll_tax_(Great_Britain)",
    "citationTitle": "Wikipedia: Poll tax (Great Britain)"
  },
  {
    "id": "e7738329-24da-450f-bf79-0bcf78a299c9",
    "text": "Who was the first Labour Prime Minister in British history?",
    "options": [
      "Clement Attlee",
      "Ramsay MacDonald",
      "Harold Wilson",
      "Tony Blair"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Ramsay MacDonald became the first Labour Prime Minister in 1924, leading a minority government.",
    "detailedExplanation": "Ramsay MacDonald made history by becoming Britain's first Labour Prime Minister in January 1924, leading a minority Labour government that lasted until November of that year. He served again as Prime Minister from 1929-1935, initially leading a Labour government before forming a National Government during the economic crisis of 1931, which led to his expulsion from the Labour Party.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ramsay_MacDonald",
    "citationTitle": "Wikipedia: Ramsay MacDonald"
  },
  {
    "id": "4413cb70-dc14-46b8-9f50-ee7c67826bf7",
    "text": "Which Prime Minister was in office during the London 2012 Olympics?",
    "options": [
      "Gordon Brown",
      "David Cameron",
      "Tony Blair",
      "Theresa May"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "David Cameron was the Conservative Prime Minister during the London 2012 Summer Olympics.",
    "detailedExplanation": "David Cameron served as Prime Minister from May 2010 to July 2016 and was therefore in office during the London 2012 Summer Olympics, which took place from July 27 to August 12, 2012. Cameron played a prominent role in the Games, attending the opening ceremony and various events. The Olympics were widely considered a success and provided a boost to his government's popularity during a period of economic austerity measures.",
    "citationUrl": "https://en.wikipedia.org/wiki/David_Cameron",
    "citationTitle": "Wikipedia: David Cameron"
  },
  {
    "id": "7a68f924-5828-4456-83fc-ca74dbb417a9",
    "text": "Who was Prime Minister when decimal currency was introduced in the UK in 1971?",
    "options": [
      "Harold Wilson",
      "Edward Heath",
      "James Callaghan",
      "Harold Macmillan"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Edward Heath was Prime Minister when the UK switched from pounds, shillings and pence to decimal currency on 15 February 1971.",
    "detailedExplanation": "Edward Heath was the Conservative Prime Minister when the United Kingdom completed its transition to decimal currency on February 15, 1971, known as 'Decimal Day' or 'C-Day'. This historic change replaced the old system of pounds, shillings and pence (£sd) with the simpler decimal system of pounds and pence, bringing the UK in line with most other countries. The changeover had been planned for several years but was implemented during Heath's tenure.",
    "citationUrl": "https://en.wikipedia.org/wiki/Decimal_Day",
    "citationTitle": "Wikipedia: Decimal Day"
  },
  {
    "id": "3c57654f-0e69-48f9-9675-cbf8288f0217",
    "text": "Which Prime Minister was known for his famous 'We shall never surrender' speech during World War II?",
    "options": [
      "Neville Chamberlain",
      "Winston Churchill",
      "Clement Attlee",
      "Anthony Eden"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Winston Churchill delivered the famous 'We shall never surrender' speech to the House of Commons on June 4, 1940.",
    "detailedExplanation": "Winston Churchill's 'We shall never surrender' speech was delivered to the House of Commons on June 4, 1940, following the evacuation of Dunkirk. This stirring address became one of the most famous speeches in British history, helping to rally the nation during one of its darkest hours. The speech concluded with the powerful declaration that Britain would defend its island home and never surrender, even if parts of the Empire fell to Nazi Germany.",
    "citationUrl": "https://en.wikipedia.org/wiki/We_shall_fight_on_the_beaches",
    "citationTitle": "Wikipedia: We shall fight on the beaches"
  },
  {
    "id": "9c4044c0-f215-4152-aad8-2c817b66e0c6",
    "text": "Who was the Prime Minister immediately before Tony Blair?",
    "options": [
      "Margaret Thatcher",
      "John Major",
      "Gordon Brown",
      "David Cameron"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "John Major served as Prime Minister from 1990 to 1997, immediately before Tony Blair took office.",
    "detailedExplanation": "John Major became Prime Minister in November 1990 following Margaret Thatcher's resignation and served until May 1997 when Labour won the general election under Tony Blair's leadership. Major's tenure included significant events such as the Gulf War, Black Wednesday, and the beginning of the Northern Ireland peace process. He led the Conservative Party through a difficult period and ultimately lost the 1997 election to Blair's 'New Labour' movement.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_Major",
    "citationTitle": "Wikipedia: John Major"
  },
  {
    "id": "a6318730-22df-4161-9aca-a5313e871473",
    "text": "Which Prime Minister's residence is located at 10 Downing Street?",
    "options": [
      "All British Prime Ministers since 1735",
      "Only Conservative Prime Ministers",
      "Only the current Prime Minister",
      "Only Prime Ministers since 1900"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "10 Downing Street has been the official residence of British Prime Ministers since 1735, regardless of party affiliation.",
    "detailedExplanation": "Number 10 Downing Street has served as the official residence and office of the British Prime Minister since 1735, when King George II offered it to Sir Robert Walpole. While some Prime Ministers have chosen to live elsewhere for personal reasons, it remains the traditional and official residence for all Prime Ministers, whether Conservative, Labour, Liberal, or from other parties. The building serves both as a private residence and as the Prime Minister's principal workplace.",
    "citationUrl": "https://en.wikipedia.org/wiki/10_Downing_Street",
    "citationTitle": "Wikipedia: 10 Downing Street"
  },
  {
    "id": "086ddfe0-2bbb-4c1e-bcdf-7006494d9010",
    "text": "How many terms did Tony Blair serve as Prime Minister?",
    "options": [
      "One term",
      "Two terms",
      "Three terms",
      "Four terms"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Tony Blair won three consecutive general elections in 1997, 2001, and 2005, serving three terms as Prime Minister.",
    "detailedExplanation": "Tony Blair led the Labour Party to victory in three consecutive general elections: 1997, 2001, and 2005, making him one of only a few Prime Ministers to achieve this feat. He served as Prime Minister from May 1997 until June 2007, when he resigned and was succeeded by Gordon Brown. Blair's three electoral victories represented a significant period of Labour dominance, ending 18 years of Conservative rule and establishing him as Labour's most electorally successful leader.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tony_Blair",
    "citationTitle": "Wikipedia: Tony Blair"
  }
]