[
  {
    "id": "b24f59c2-cd98-4211-b8c1-3040feecc735",
    "text": "Which band had their only major hit with 'Come On Eileen' in 1982?",
    "options": [
      "Dexys Midnight Runners",
      "Modern English",
      "Thomas Dolby",
      "Kajagoogoo"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Dexys Midnight Runners reached #1 in multiple countries with 'Come On Eileen' but never had another major hit.",
    "detailedExplanation": "Dexys Midnight Runners, led by Kevin Rowland, achieved massive international success with 'Come On Eileen' in 1982, reaching #1 in the UK, US, and several other countries. Despite the song's enormous popularity and its status as one of the most recognizable songs of the 1980s, the band never managed to replicate this success with subsequent releases, making them a classic example of a one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dexys_Midnight_Runners",
    "citationTitle": "Wikipedia: Dexys Midnight Runners"
  },
  {
    "id": "44716ef6-1c3d-4ec5-9fae-83c23ffe8754",
    "text": "What was the title of Vanilla Ice's massive 1990 hit that made him a one-hit wonder?",
    "options": [
      "Ice Ice Baby",
      "Cool as Ice",
      "Play That Funky Music",
      "I Love You"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Ice Ice Baby' was Vanilla Ice's breakthrough hit that reached #1 but he never achieved similar mainstream success again.",
    "detailedExplanation": "'Ice Ice Baby' became the first hip-hop single to top the Billboard Hot 100 chart in 1990, making Vanilla Ice (Robert Van Winkle) an overnight sensation. The song's distinctive bass line, sampled from Queen and David Bowie's 'Under Pressure,' helped propel it to massive commercial success. However, despite attempts at follow-up singles and albums, Vanilla Ice never came close to matching this level of mainstream popularity, cementing his status as a one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ice_Ice_Baby",
    "citationTitle": "Wikipedia: Ice Ice Baby"
  },
  {
    "id": "354739e2-957d-45bc-894f-b47cd8480403",
    "text": "Which one-hit wonder sang 'Mambo No. 5' in 1999?",
    "options": [
      "Lou Bega",
      "Ricky Martin",
      "Los Del Rio",
      "Mark Morrison"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Lou Bega's 'Mambo No. 5' was a worldwide hit in 1999, but he never achieved similar success with other songs.",
    "detailedExplanation": "German musician Lou Bega achieved international fame with 'Mambo No. 5 (A Little Bit of...)' in 1999, which reached the top 5 in numerous countries and became a cultural phenomenon. The song was based on Pérez Prado's 1949 instrumental 'Mambo No. 5,' but Bega added his own lyrics and vocal style. Despite the massive success of this single and its memorable name-dropping chorus, Lou Bega was unable to create another hit of similar magnitude, making him a textbook one-hit wonder of the late 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lou_Bega",
    "citationTitle": "Wikipedia: Lou Bega"
  },
  {
    "id": "e2f2791a-0b53-46f9-9a11-2d8f1fb8a74e",
    "text": "What dance was associated with Los Del Rio's one-hit wonder from 1995?",
    "options": [
      "Macarena",
      "Electric Slide",
      "Cha Cha Slide",
      "Cupid Shuffle"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Los Del Rio's 'Macarena' sparked a worldwide dance craze and became their only major international hit.",
    "detailedExplanation": "Spanish duo Los Del Rio created a global phenomenon with 'Macarena' in 1995, which not only topped charts worldwide but also introduced a simple dance routine that became a cultural sensation. The song spent 14 weeks at #1 on the US Billboard Hot 100 and was ubiquitous at weddings, sporting events, and parties throughout the mid-1990s. Despite this massive success and the song's enduring popularity at social gatherings, Los Del Rio never managed to create another hit that resonated with international audiences, making them quintessential one-hit wonders.",
    "citationUrl": "https://en.wikipedia.org/wiki/Macarena_(song)",
    "citationTitle": "Wikipedia: Macarena (song)"
  },
  {
    "id": "0c43ff04-635c-4abb-8435-66409bd05379",
    "text": "Which artist had their only major hit with 'Tainted Love' in 1981?",
    "options": [
      "Soft Cell",
      "Duran Duran",
      "New Order",
      "Depeche Mode"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Soft Cell's synth-pop version of 'Tainted Love' became a massive hit, but they never achieved similar mainstream success.",
    "detailedExplanation": "British synthpop duo Soft Cell, consisting of Marc Almond and David Ball, achieved their greatest success with their 1981 cover version of Gloria Jones' 1964 song 'Tainted Love.' Their electronic interpretation became a defining song of the early 1980s new wave movement, reaching #1 in multiple countries and spending a record-breaking 43 consecutive weeks on the US Billboard Hot 100. While the band continued to record and had some minor hits, they never came close to matching the commercial impact of 'Tainted Love,' establishing them as one-hit wonders despite their artistic credibility.",
    "citationUrl": "https://en.wikipedia.org/wiki/Soft_Cell",
    "citationTitle": "Wikipedia: Soft Cell"
  },
  {
    "id": "237654b4-9e0f-43e4-a859-5545564a8b9f",
    "text": "'Mickey' was the signature hit of which one-hit wonder from 1982?",
    "options": [
      "Toni Basil",
      "Pat Benatar",
      "Joan Jett",
      "The Go-Go's"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Toni Basil's energetic performance of 'Mickey' made it a #1 hit, but she never had another major chart success.",
    "detailedExplanation": "Toni Basil, a choreographer and performer, achieved her sole major hit with 'Mickey' in 1982, a song originally recorded by UK band Racey as 'Kitty.' Basil's version, featuring her distinctive cheerleader-style performance and the iconic music video with its gymnastics and cheerleading routines, became a #1 hit in multiple countries. The song's catchy chorus and memorable visual presentation made it a staple of early MTV programming. Despite her background in entertainment and choreography, Basil was never able to follow up with another hit single of similar magnitude.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toni_Basil",
    "citationTitle": "Wikipedia: Toni Basil"
  },
  {
    "id": "6bbe8cdb-236a-4972-b70d-fabfd06d6a3c",
    "text": "Which Norwegian band had their only international hit with 'Take On Me' in 1985?",
    "options": [
      "a-ha",
      "Roxette",
      "Europe",
      "ABBA"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "a-ha's 'Take On Me' was a worldwide #1 hit with an iconic music video, but they never achieved similar international success.",
    "detailedExplanation": "Norwegian synth-pop band a-ha achieved massive international success with 'Take On Me' in 1985, which reached #1 in numerous countries and became famous for its innovative rotoscoped music video featuring a blend of live-action and pencil-sketch animation. The song's distinctive synthesizer melody and Morten Harket's soaring vocals made it an instant classic of the 1980s. While a-ha continued to have success in Europe and maintained a career spanning decades, they never managed to achieve similar chart success in major markets like the United States, making them one-hit wonders in the international context despite their regional popularity.",
    "citationUrl": "https://en.wikipedia.org/wiki/A-ha",
    "citationTitle": "Wikipedia: a-ha"
  },
  {
    "id": "52374c1c-1cac-47a5-978e-519702711d10",
    "text": "What was the name of the one-hit wonder who sang 'Kung Fu Fighting' in 1974?",
    "options": [
      "Carl Douglas",
      "Barry White",
      "Isaac Hayes",
      "Curtis Mayfield"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Carl Douglas recorded 'Kung Fu Fighting' as a B-side, but it became a massive #1 hit and his only major success.",
    "detailedExplanation": "Jamaican-born British singer Carl Douglas recorded 'Kung Fu Fighting' in 1974 almost as an afterthought - it was originally intended as a B-side filler track. However, the song caught the wave of martial arts popularity in Western culture, partly due to Bruce Lee films and the TV series 'Kung Fu.' The track became a surprise #1 hit in multiple countries and sold millions of copies worldwide. Despite this enormous success and several attempts at follow-up singles, Douglas never managed to create another hit that captured the public's imagination in the same way, making him a classic one-hit wonder of the 1970s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Carl_Douglas",
    "citationTitle": "Wikipedia: Carl Douglas"
  },
  {
    "id": "0951c927-a3d6-4710-a91b-89c72b20d84e",
    "text": "Which one-hit wonder group sang 'Tubthumping' in 1997?",
    "options": [
      "Chumbawamba",
      "Spacehog",
      "Local H",
      "Filter"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Chumbawamba had their only major hit with 'Tubthumping' in 1997.",
    "detailedExplanation": "Chumbawamba, a British band that had been around since the 1980s, achieved massive international success with 'Tubthumping' from their album 'Tubthumper' in 1997. The song's memorable chorus 'I get knocked down, but I get up again' became a worldwide anthem, reaching the top 10 in multiple countries. Despite this massive hit, the band never managed to replicate this level of commercial success with any other single.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chumbawamba",
    "citationTitle": "Wikipedia: Chumbawamba"
  },
  {
    "id": "421254c0-ad08-4c02-903e-9ac63415499c",
    "text": "'I'm Gonna Be (500 Miles)' was the signature hit of which Scottish duo?",
    "options": [
      "The Proclaimers",
      "Wet Wet Wet",
      "Simple Minds",
      "Big Country"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Proclaimers are known for their 1988 hit 'I'm Gonna Be (500 Miles)'.",
    "detailedExplanation": "The Proclaimers, twin brothers Charlie and Craig Reid from Scotland, achieved international fame with 'I'm Gonna Be (500 Miles)' in 1988. The song became synonymous with Scottish culture and was later featured prominently in the 1993 film 'Benny & Joon', which helped introduce it to American audiences. While they had other songs, this remains their only major international hit and is considered a classic one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Proclaimers",
    "citationTitle": "Wikipedia: The Proclaimers"
  },
  {
    "id": "84d5a449-0f3d-47b6-9ea8-d24515b86c2f",
    "text": "Which artist sang the 1972 one-hit wonder 'Brandy (You're a Fine Girl)'?",
    "options": [
      "Looking Glass",
      "Seals and Crofts",
      "America",
      "Bread"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Looking Glass performed 'Brandy (You're a Fine Girl)' which reached #1 in 1972.",
    "detailedExplanation": "Looking Glass, an American rock band, achieved their only major success with 'Brandy (You're a Fine Girl)' in 1972. The song tells the story of a barmaid named Brandy who works at a port town tavern. It reached number one on the Billboard Hot 100 and became a classic of early 1970s pop music. The band was unable to follow up this success with another hit of similar magnitude, making them a textbook one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Looking_Glass_(band)",
    "citationTitle": "Wikipedia: Looking Glass (band)"
  },
  {
    "id": "1bc96111-2381-4cdd-aa1b-d2b5ef9f8170",
    "text": "'Video Killed the Radio Star' by The Buggles was famous for being what television milestone?",
    "options": [
      "First video played on MTV",
      "First video to win a Grammy",
      "First video banned by the BBC",
      "First video to cost $1 million"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "'Video Killed the Radio Star' was the very first music video played on MTV when it launched in 1981.",
    "detailedExplanation": "The Buggles' 'Video Killed the Radio Star' holds a unique place in music history as the first music video ever broadcast on MTV when the channel launched on August 1, 1981. Originally released in 1979, this prescient song about technology changing the music industry became ironically prophetic. While The Buggles had this notable hit, they never achieved similar commercial success with subsequent releases, making them a memorable one-hit wonder with historical significance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Video_Killed_the_Radio_Star",
    "citationTitle": "Wikipedia: Video Killed the Radio Star"
  },
  {
    "id": "5cd72b8c-3a49-44b9-9881-243ff6e649ff",
    "text": "Which novelty one-hit wonder sang 'Afternoon Delight' in 1976?",
    "options": [
      "Starland Vocal Band",
      "Player",
      "Wild Cherry",
      "Walter Murphy"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Starland Vocal Band recorded 'Afternoon Delight', which became a #1 hit in 1976.",
    "detailedExplanation": "Starland Vocal Band, featuring Bill Danoff and Taffy Nivert (who were also members of the duo Fat City), achieved massive success with 'Afternoon Delight' in 1976. The song, with its suggestive lyrics disguised as innocent-sounding pop, reached number one on the Billboard Hot 100 and won a Grammy Award for Best Arrangement for Voices. Despite this success and even having their own variety show, the group never managed another major hit.",
    "citationUrl": "https://en.wikipedia.org/wiki/Starland_Vocal_Band",
    "citationTitle": "Wikipedia: Starland Vocal Band"
  },
  {
    "id": "9822b0d9-a068-4d59-9502-845f43bd9f50",
    "text": "'Torn' was the biggest hit for which Australian singer in 1997?",
    "options": [
      "Natalie Imbruglia",
      "Kylie Minogue",
      "Olivia Newton-John",
      "Dannii Minogue"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Natalie Imbruglia had her biggest hit with 'Torn' in 1997.",
    "detailedExplanation": "Natalie Imbruglia, a former Australian soap opera actress, achieved international stardom with her cover version of 'Torn' in 1997. The song, originally written by Anne Preven, Scott Cutler, and Phil Thornalley, became a massive global hit, reaching the top 10 in numerous countries and becoming one of the most successful songs of the late 1990s. While Imbruglia continued recording, she never matched the worldwide success of this debut single, making her primarily known for this one song.",
    "citationUrl": "https://en.wikipedia.org/wiki/Natalie_Imbruglia",
    "citationTitle": "Wikipedia: Natalie Imbruglia"
  },
  {
    "id": "197a0a76-512d-48d8-9ba6-14278dedc81f",
    "text": "'Spirit in the Sky' was a gospel-rock hit for which artist in 1969?",
    "options": [
      "Norman Greenbaum",
      "B.J. Thomas",
      "Johnny Nash",
      "Edwin Starr"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Norman Greenbaum wrote and performed 'Spirit in the Sky', which reached #3 in 1970.",
    "detailedExplanation": "Norman Greenbaum, an American singer-songwriter, created one of rock's most enduring spiritual anthems with 'Spirit in the Sky' in 1969. Despite being Jewish, Greenbaum wrote this gospel-influenced rock song that featured a distinctive fuzzed-out guitar sound and religious lyrics. The song reached number 3 on the Billboard Hot 100 and has been covered numerous times and featured in countless movies and commercials. However, Greenbaum never achieved another hit of comparable success.",
    "citationUrl": "https://en.wikipedia.org/wiki/Norman_Greenbaum",
    "citationTitle": "Wikipedia: Norman Greenbaum"
  },
  {
    "id": "5f61eda9-6b61-40ca-9755-6fbdeeba9a79",
    "text": "Which group sang the 1983 new wave hit 'Der Kommissar'?",
    "options": [
      "After the Fire",
      "Flock of Seagulls",
      "Modern English",
      "Men Without Hats"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "After the Fire had their only major hit with the English version of 'Der Kommissar' in 1983.",
    "detailedExplanation": "After the Fire, a British rock band, achieved their only major international success with their English-language cover of Austrian singer Falco's 'Der Kommissar' in 1983. The song, which mixed German and English lyrics, became a top 5 hit in the United States and introduced many English-speaking audiences to the new wave sound that was emerging from Europe. While the band had been active since the 1970s, this remains their sole major hit in most markets.",
    "citationUrl": "https://en.wikipedia.org/wiki/After_the_Fire",
    "citationTitle": "Wikipedia: After the Fire"
  },
  {
    "id": "a441fefc-8f56-466f-83b9-9349840607b6",
    "text": "Which one-hit wonder group sang 'Ice Ice Baby' wasn't their only hit - but who actually performed the 1958 novelty song 'The Purple People Eater'?",
    "options": [
      "Sheb Wooley",
      "Bobby Boris Pickett",
      "Ray Stevens",
      "Nervous Norvus"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Sheb Wooley recorded 'The Purple People Eater' which reached #1 in 1958.",
    "detailedExplanation": "Sheb Wooley, primarily known as a country music singer and actor, achieved his biggest mainstream success with the novelty song 'The Purple People Eater' in 1958. The song spent six weeks at number one on the Billboard Hot 100 and became a cultural phenomenon, spawning merchandise and even a movie years later. Despite having other country hits, this whimsical tune about a creature from outer space remains his most recognized work in popular music.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Purple_People_Eater",
    "citationTitle": "Wikipedia: The Purple People Eater"
  },
  {
    "id": "8bb8ce98-0435-47d8-a4c7-279ce2789fc2",
    "text": "Which one-hit wonder artist performed 'Escape (The Piña Colada Song)' in 1979?",
    "options": [
      "Jimmy Buffett",
      "Rupert Holmes",
      "Kenny Chesney",
      "Christopher Cross"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Rupert Holmes wrote and performed this hit song that reached #1 in 1979.",
    "detailedExplanation": "Rupert Holmes achieved his biggest commercial success with 'Escape (The Piña Colada Song)' which topped the Billboard Hot 100 in late 1979 and early 1980. The song tells the story of a man who places a personal ad seeking someone who likes piña coladas and getting caught in the rain, only to discover his own partner responds to the ad. While Holmes was a successful songwriter and had other minor hits, this tropical-themed song became his signature tune and only major hit as a performer.",
    "citationUrl": "https://en.wikipedia.org/wiki/Escape_(The_Pi%C3%B1a_Colada_Song)",
    "citationTitle": "Wikipedia: Escape (The Piña Colada Song)"
  },
  {
    "id": "c09fa5d8-eb31-44b1-b378-2faa69986097",
    "text": "What year did Dexys Midnight Runners have their hit 'Come On Eileen'? Actually, which band performed 'Graduation (Friends Forever)' in 1999?",
    "options": [
      "Vitamin C",
      "Blink-182",
      "Third Eye Blind",
      "Semisonic"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Vitamin C performed 'Graduation (Friends Forever)' which became a popular graduation anthem.",
    "detailedExplanation": "Vitamin C, the stage name of Colleen Ann Fitzpatrick, achieved her biggest hit with 'Graduation (Friends Forever)' in 1999. The song became ubiquitous at high school and college graduation ceremonies across America due to its sentimental lyrics about friendship lasting beyond school years. Despite having a few other minor chart entries, this graduation anthem remains her most recognizable and commercially successful song, making her a classic example of a one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Graduation_(Friends_Forever)",
    "citationTitle": "Wikipedia: Graduation (Friends Forever)"
  },
  {
    "id": "1ce94c12-dfd4-4433-bb29-0ff21e91cfeb",
    "text": "Which one-hit wonder performed 'Informer' with its distinctive patois vocals in 1992?",
    "options": [
      "Shaggy",
      "Snow",
      "Shabba Ranks",
      "Super Cat"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Snow, a Canadian reggae rapper, performed 'Informer' which topped charts worldwide in 1992-1993.",
    "detailedExplanation": "Snow (Darrin Kenneth O'Brien), a Canadian musician, achieved international fame with 'Informer' in 1992. The song featured distinctive Jamaican patois vocals and became a massive hit, reaching number one in multiple countries including the United States, Canada, and several European nations. The track's unique sound and Snow's authentic delivery of Caribbean-influenced rap made it stand out in the early 1990s music scene. Despite releasing other albums, Snow never matched the commercial success of 'Informer,' making him a textbook one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Informer_(song)",
    "citationTitle": "Wikipedia: Informer (song)"
  }
]