[
  {
    "id": "7da63458-fb46-470d-b0dc-6fcd047dbf6d",
    "text": "Which one-hit wonder band sang 'Come On Eileen' in 1982?",
    "options": [
      "Dexys Midnight Runners",
      "The Human League",
      "Soft Cell",
      "Kajagoogoo"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Dexys Midnight Runners had their biggest hit with 'Come On Eileen' in 1982.",
    "detailedExplanation": "Dexys Midnight Runners, led by Kevin Rowland, achieved massive international success with 'Come On Eileen' in 1982. The song reached number one in the UK, US, and several other countries. Despite having other minor hits in the UK, they are widely considered a one-hit wonder internationally, as 'Come On Eileen' was their only major global success. The song's distinctive Celtic-influenced sound and memorable fiddle melody made it an enduring classic of the 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dexys_Midnight_Runners",
    "citationTitle": "Wikipedia: Dexys Midnight Runners"
  },
  {
    "id": "7e002b85-cc28-4357-a675-b229ba18f235",
    "text": "What was the name of the one-hit wonder who sang 'Mambo No. 5' in 1999?",
    "options": [
      "Lou Bega",
      "Ricky Martin",
      "Los Del Rio",
      "Chumbawamba"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Lou Bega recorded the famous version of 'Mambo No. 5' that became a worldwide hit in 1999.",
    "detailedExplanation": "Lou Bega, a German mambo musician, scored a massive international hit with 'Mambo No. 5 (A Little Bit of...)' in 1999. The song was based on Pérez Prado's 1949 instrumental 'Mambo No. 5,' but Bega added lyrics and vocals. It reached the top of the charts in multiple countries and became a defining song of the late 1990s. Despite releasing several albums and other singles, Bega never managed to replicate this success, making him a classic example of a one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lou_Bega",
    "citationTitle": "Wikipedia: Lou Bega"
  },
  {
    "id": "14186a70-e822-4b93-a0f8-76e5fedecc6a",
    "text": "Which one-hit wonder group performed 'Ice Ice Baby' in 1990?",
    "options": [
      "MC Hammer",
      "Vanilla Ice",
      "Young MC",
      "Digital Underground"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Vanilla Ice performed 'Ice Ice Baby,' which became the first hip hop single to top the Billboard Hot 100.",
    "detailedExplanation": "Vanilla Ice (Robert Matthew Van Winkle) achieved massive success with 'Ice Ice Baby' in 1990, which sampled Queen and David Bowie's 'Under Pressure.' The song became the first hip hop single to top the Billboard Hot 100 chart and was a global phenomenon. However, Vanilla Ice struggled with credibility issues and never achieved another major mainstream hit of similar magnitude. While he continued making music and had some success in later years, 'Ice Ice Baby' remains his defining moment and makes him a quintessential one-hit wonder of the early 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Vanilla_Ice",
    "citationTitle": "Wikipedia: Vanilla Ice"
  },
  {
    "id": "39ea7ca6-a2fe-4f7a-9393-19798d403117",
    "text": "What was the title of Chumbawamba's 1997 one-hit wonder that included the lyrics 'I get knocked down'?",
    "options": [
      "Knocked Up",
      "Tubthumping",
      "Get Back Up",
      "Never Give Up"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Tubthumping' was Chumbawamba's massive hit single that reached the top 10 in multiple countries.",
    "detailedExplanation": "Chumbawamba, a British alternative rock band that had been active since 1982, achieved their biggest commercial success with 'Tubthumping' in 1997. The song's anthemic chorus 'I get knocked down, but I get up again' became a global phenomenon, reaching number 2 in the UK and top 10 in numerous other countries including the US. Despite being a politically active band with many albums, this single overshadowed their entire career and became their only major mainstream hit, making them one of the most recognizable one-hit wonders of the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Chumbawamba",
    "citationTitle": "Wikipedia: Chumbawamba"
  },
  {
    "id": "e03a67ec-ece4-4fa9-8ef4-84770e114236",
    "text": "Which one-hit wonder sang 'Tainted Love' in 1981, which was actually a cover of a 1964 soul song?",
    "options": [
      "Dexy's Midnight Runners",
      "Soft Cell",
      "OMD",
      "Gary Numan"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Soft Cell's synth-pop cover of 'Tainted Love' became a massive hit and is more famous than the original Gloria Jones version.",
    "detailedExplanation": "Soft Cell, the British synth-pop duo of Marc Almond and David Ball, scored their biggest hit with their electronic cover of 'Tainted Love' in 1981. The original song was recorded by Gloria Jones in 1964, but Soft Cell's version transformed it into a synth-pop classic that reached number 1 in the UK and became a global hit. While the band had other minor successes, particularly in the UK, 'Tainted Love' remained their signature song and is widely considered their defining moment, making them a classic example of a one-hit wonder internationally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Soft_Cell",
    "citationTitle": "Wikipedia: Soft Cell"
  },
  {
    "id": "2a77583b-c088-4d25-9c9a-19173b1d7449",
    "text": "Which Spanish duo is famous for the one-hit wonder 'Macarena' that dominated the mid-1990s?",
    "options": [
      "Los Del Rio",
      "Manu Chao",
      "Jesse & Joy",
      "Mecano"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Los Del Rio created 'Macarena,' which became one of the biggest dance crazes of the 1990s.",
    "detailedExplanation": "Los Del Rio, composed of Antonio Romero Monge and Rafael Ruíz Perdigones, created 'Macarena' in 1993, but it became a worldwide phenomenon in 1996 when the Bayside Boys remix was released. The song not only topped charts globally but also spawned a dance craze that became ubiquitous at weddings, parties, and sporting events. It spent 14 weeks at number one on the Billboard Hot 100, making it one of the longest-running number-one hits of the decade. Despite having a long career in Spain, this remains their only major international success.",
    "citationUrl": "https://en.wikipedia.org/wiki/Los_del_R%C3%ADo",
    "citationTitle": "Wikipedia: Los del Río"
  },
  {
    "id": "bc62ff0a-3fa4-4db9-99db-ffbe681f97c7",
    "text": "Which artist had a one-hit wonder with 'Spirit in the Night' in 1984, despite being primarily known as a comedian?",
    "options": [
      "Weird Al Yankovic",
      "Mickey",
      "Dexys Midnight Runners",
      "Mickey Thomas"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Mickey (Toni Basil) had a hit with 'Mickey' in 1982, not 'Spirit in the Night' - the correct song is 'Mickey'.",
    "detailedExplanation": "Toni Basil, performing under the name Mickey, had a massive hit with 'Mickey' in 1982. The song, which was actually a reworked version of 'Kitty' by UK band Racey, reached number one in the US, Canada, and Australia. Basil was primarily known as a choreographer and performer who had worked with David Bowie and other major artists. The song's success was boosted by its memorable music video featuring cheerleader routines. Despite being a talented artist with other projects, 'Mickey' remained her only major commercial hit, making her a definitive one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Toni_Basil",
    "citationTitle": "Wikipedia: Toni Basil"
  },
  {
    "id": "36cb0f6c-1e93-4adb-ac49-85001d5cebea",
    "text": "What was the name of the one-hit wonder who sang 'Torn' in 1997, which was actually a cover version?",
    "options": [
      "Alanis Morissette",
      "Natalie Imbruglia",
      "Fiona Apple",
      "Sheryl Crow"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Natalie Imbruglia's version of 'Torn' became a massive international hit, overshadowing the original versions.",
    "detailedExplanation": "Natalie Imbruglia, an Australian singer and former Neighbours actress, achieved massive international success with her cover of 'Torn' in 1997. The song was originally recorded by Ednaswap in 1993, but Imbruglia's version became the definitive version, reaching the top 10 in numerous countries and number 2 in the UK. While she had other minor hits and continued releasing albums, 'Torn' remained her signature song and biggest commercial success. The success of this single launched her music career, but she's often considered a one-hit wonder due to the overwhelming dominance of this particular track.",
    "citationUrl": "https://en.wikipedia.org/wiki/Natalie_Imbruglia",
    "citationTitle": "Wikipedia: Natalie Imbruglia"
  },
  {
    "id": "6ade8ee3-c61a-435c-bbbd-e547e2c00d39",
    "text": "Which one-hit wonder group sang 'Kung Fu Fighting' in 1974?",
    "options": [
      "Carl Douglas",
      "Disco Tex",
      "Barry White",
      "War"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Carl Douglas recorded 'Kung Fu Fighting' in 1974, which became a massive worldwide hit.",
    "detailedExplanation": "Carl Douglas, a Jamaican-born singer, recorded 'Kung Fu Fighting' in 1974 during the height of the martial arts movie craze. The song was originally recorded as a B-side but became a massive international hit, reaching number one in multiple countries. Despite the success of this disco-funk anthem, Douglas never achieved another major hit of similar magnitude, making him a classic example of a one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Carl_Douglas",
    "citationTitle": "Wikipedia: Carl Douglas"
  },
  {
    "id": "b4eab07b-0a47-467f-93ff-317ce7997f9c",
    "text": "What instrument was prominently featured in A-ha's 1985 one-hit wonder 'Take On Me'?",
    "options": [
      "Saxophone",
      "Synthesizer",
      "Harmonica",
      "Violin"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The synthesizer was the defining instrument in 'Take On Me', creating its distinctive electronic sound.",
    "detailedExplanation": "A-ha's 'Take On Me' became famous for its innovative use of synthesizers, particularly the catchy synth-pop melody that defined the song's sound. The Norwegian band's hit exemplified the 1980s synth-pop movement and was accompanied by a groundbreaking rotoscoped music video. While A-ha had other hits in Europe, 'Take On Me' remains their only major chart success in the United States, making them American one-hit wonders despite their broader international career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Take_On_Me",
    "citationTitle": "Wikipedia: Take On Me"
  },
  {
    "id": "781a8d9b-22b4-430f-8e11-a04e13a46e20",
    "text": "Which novelty one-hit wonder from 1958 featured the lyrics 'At the hop' and was performed by Danny & The Juniors?",
    "options": [
      "Rock Around the Clock",
      "At the Hop",
      "Splish Splash",
      "Purple People Eater"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'At the Hop' was Danny & The Juniors' signature song that became a rock and roll classic in 1958.",
    "detailedExplanation": "Danny & The Juniors recorded 'At the Hop' in 1957, and it became a number one hit in early 1958. The song captured the energy of the early rock and roll era and became synonymous with 1950s dance culture. Originally titled 'Do the Bop', the song was changed to reference the popular 'sock hop' dances of the era. Despite some minor follow-up hits, the Philadelphia group never matched the success of this rock and roll anthem.",
    "citationUrl": "https://en.wikipedia.org/wiki/At_the_Hop",
    "citationTitle": "Wikipedia: At the Hop"
  },
  {
    "id": "25218e6c-e3aa-4b30-95bf-f7a32aeeadb0",
    "text": "Which one-hit wonder sang 'Mickey' in 1982, with the famous cheerleader-style chant?",
    "options": [
      "Toni Basil",
      "Cyndi Lauper",
      "Pat Benatar",
      "Joan Jett"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Toni Basil recorded 'Mickey' in 1982, which became her only major hit despite her career as a choreographer and filmmaker.",
    "detailedExplanation": "Toni Basil's 'Mickey' became a massive hit in 1982, featuring a cheerleader-themed music video that matched the song's upbeat, chant-like chorus. Interestingly, the song was originally recorded by the band Racey as 'Kitty' in 1979, but Basil's version with the gender-swapped lyrics became the definitive hit. Despite her successful career as a choreographer and filmmaker in Hollywood, 'Mickey' remained her only major recording success, making her a textbook one-hit wonder.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mickey_(Toni_Basil_song)",
    "citationTitle": "Wikipedia: Mickey (Toni Basil song)"
  },
  {
    "id": "18825123-df40-40e8-8976-abd4e4e186b4",
    "text": "What dance move was associated with Los Del Rio's one-hit wonder that wasn't 'Macarena'?",
    "options": [
      "The Electric Slide",
      "The Achy Breaky",
      "The Time Warp",
      "This question has no correct answer - Macarena was their only major hit"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Los Del Rio is exclusively known for 'Macarena' - they didn't have another dance-associated hit.",
    "detailedExplanation": "This is a trick question designed to test knowledge of one-hit wonders. Los Del Rio, the Spanish duo, is famous solely for 'Macarena' and its associated dance moves. They didn't have any other major hits with dance moves attached. The song's success was so overwhelming that it completely overshadowed any other work they may have done, making them the ultimate example of artists defined by a single song and its cultural phenomenon.",
    "citationUrl": "https://en.wikipedia.org/wiki/Los_del_R%C3%ADo",
    "citationTitle": "Wikipedia: Los del Río"
  },
  {
    "id": "9e0d1f28-5c6f-46e2-a65c-995d4807fb59",
    "text": "Which Canadian singer-songwriter had a one-hit wonder with 'Informer' in 1992?",
    "options": [
      "Bryan Adams",
      "Snow",
      "Corey Hart",
      "Glass Tiger"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Snow, a Canadian reggae rapper, achieved international success with 'Informer' in 1992-1993.",
    "detailedExplanation": "Snow (Darrin Kenneth O'Brien) was a Canadian reggae rapper who achieved massive international success with 'Informer' in 1992-1993. The song reached number one in multiple countries and was notable for its distinctive patois lyrics that many listeners found difficult to understand, leading to numerous misheard lyrics becoming part of pop culture. Despite the song's enormous success and follow-up attempts, Snow never achieved another hit of comparable magnitude on the international charts.",
    "citationUrl": "https://en.wikipedia.org/wiki/Snow_(musician)",
    "citationTitle": "Wikipedia: Snow (musician)"
  },
  {
    "id": "1db89dff-cbcf-47ef-b333-47b19540d25b",
    "text": "What year did Dexys Midnight Runners release 'Come On Eileen'?",
    "options": [
      "1981",
      "1982",
      "1983",
      "1984"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'Come On Eileen' was released in 1982 and became Dexys Midnight Runners' signature hit.",
    "detailedExplanation": "Dexys Midnight Runners released 'Come On Eileen' in July 1982, and it became a worldwide hit, reaching number one in the UK, US, and several other countries. The song featured a distinctive Celtic folk influence combined with new wave energy, and its music video showed the band in overalls and neckerchiefs. While the band had other hits in the UK, including 'Geno', 'Come On Eileen' was their only major international success and their sole number one hit in America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Come_On_Eileen",
    "citationTitle": "Wikipedia: Come On Eileen"
  },
  {
    "id": "971ef678-4cf4-4656-8089-b169a586155b",
    "text": "Which one-hit wonder group sang 'Whip It' in 1980?",
    "options": [
      "Blondie",
      "Devo",
      "The Cars",
      "Talking Heads"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Devo recorded 'Whip It' in 1980, which became their biggest and only major mainstream hit.",
    "detailedExplanation": "Devo released 'Whip It' in 1980 as part of their album 'Freedom of Choice'. The song became their biggest hit, reaching number 14 on the Billboard Hot 100 and introducing mainstream audiences to the Ohio band's quirky new wave sound and distinctive visual style. The accompanying music video, featuring the band's signature red flowerpot hats, became an early MTV staple. Despite having a cult following and releasing multiple albums, 'Whip It' remained their only major commercial breakthrough.",
    "citationUrl": "https://en.wikipedia.org/wiki/Whip_It_(Devo_song)",
    "citationTitle": "Wikipedia: Whip It (Devo song)"
  },
  {
    "id": "5a5b67d7-3989-4e6d-9756-696691b8154d",
    "text": "Which one-hit wonder group released 'Tequila' in 1958, an instrumental track with only one spoken word throughout the entire song?",
    "options": [
      "The Champs",
      "The Tornados",
      "The Shadows",
      "The Ventures"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Champs recorded 'Tequila' in 1958, which became a massive hit despite containing only the single spoken word 'Tequila!'",
    "detailedExplanation": "The Champs were an American rock and roll band who achieved their greatest success with the instrumental 'Tequila' in 1958. The song reached number one on the Billboard Hot 100 and is notable for being almost entirely instrumental except for the single word 'Tequila!' shouted at three points during the track. Written by saxophonist Chuck Rio (real name Daniel Flores), the song became one of the most recognizable instrumentals in rock history and has been featured in numerous films and TV shows, though The Champs never managed to replicate this success with subsequent releases.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Champs",
    "citationTitle": "Wikipedia: The Champs"
  },
  {
    "id": "921ad7f8-81c8-400c-865d-d24b66b5d576",
    "text": "Which one-hit wonder artist sang 'I'm Gonna Be (500 Miles)' and hailed from Scotland?",
    "options": [
      "The Proclaimers",
      "Simple Minds",
      "Bay City Rollers",
      "Wet Wet Wet"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Proclaimers, twin brothers from Scotland, had their biggest international hit with 'I'm Gonna Be (500 Miles)' in 1988.",
    "detailedExplanation": "The Proclaimers are Scottish twin brothers Charlie and Craig Reid who became internationally known for their 1988 hit 'I'm Gonna Be (500 Miles).' While they had other successes in the UK, this song became their defining moment globally, particularly after it was featured in the 1993 film 'Benny & Joon.' The song's distinctive Scottish accent and folk-rock sound, combined with its simple but memorable lyrics about walking 500 miles and 500 more, made it an enduring anthem. Despite having a successful career in Scotland and the UK with multiple chart entries, they are primarily remembered internationally for this single song.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Proclaimers",
    "citationTitle": "Wikipedia: The Proclaimers"
  },
  {
    "id": "7b49ab7d-e62a-4e92-ba22-40b831d36198",
    "text": "What was the original name of the band that recorded the one-hit wonder 'Louie Louie' which became a garage rock classic?",
    "options": [
      "The Kingsmen",
      "The Wailers",
      "The Sonics",
      "Paul Revere & the Raiders"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Kingsmen recorded the most famous version of 'Louie Louie' in 1963, though the song was originally written and recorded by Richard Berry in 1955.",
    "detailedExplanation": "The Kingsmen were a garage rock band from Portland, Oregon, who achieved fame with their 1963 recording of 'Louie Louie.' While the song was originally written and recorded by Richard Berry in 1955, The Kingsmen's version became the definitive recording that reached number two on the Billboard Hot 100. The song became controversial due to rumors about obscene lyrics (which were false), leading to an FBI investigation. Despite the massive success of 'Louie Louie,' The Kingsmen never managed to achieve another major hit of comparable magnitude, making them quintessential one-hit wonders in the mainstream market.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kingsmen",
    "citationTitle": "Wikipedia: The Kingsmen"
  },
  {
    "id": "fb45f9f3-9485-45ee-be64-bfdc6c4ce46f",
    "text": "Which one-hit wonder group recorded 'Surfin' Bird' in 1963, combining two songs by The Rivingtons into one frantic rock track?",
    "options": [
      "The Trashmen",
      "The Surfaris",
      "Dick Dale & His Del-Tones",
      "Jan & Dean"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Trashmen from Minneapolis recorded 'Surfin' Bird' in 1963 by combining The Rivingtons' songs 'Papa-Oom-Mow-Mow' and 'The Bird Is the Word.'",
    "detailedExplanation": "The Trashmen were a surf rock band from Minneapolis who created their signature hit 'Surfin' Bird' in 1963 by combining two existing songs by The Rivingtons: 'Papa-Oom-Mow-Mow' and 'The Bird Is the Word.' The resulting track became a frantic, almost nonsensical rock anthem that reached number four on the Billboard Hot 100. Despite being from landlocked Minnesota rather than the California surf scene, their wild performance and Tony Andreason's distinctive vocals made the song an instant classic. The song has maintained cult status over decades, being featured in numerous films and TV shows, though The Trashmen never achieved another hit of similar magnitude.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Trashmen",
    "citationTitle": "Wikipedia: The Trashmen"
  }
]