[
  {
    "id": "62dceabd-55fa-40b7-9dec-128d0f9e63ba",
    "text": "Which restaurant, opened in Madrid in 1725, holds the Guinness World Record as the world's oldest continuously operating restaurant?",
    "options": [
      "Botín",
      "La Tour d'Argent",
      "Stiftskeller St. Peter",
      "Rules"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Botín in Madrid has been operating continuously since 1725.",
    "detailedExplanation": "Sobrino de Botín, commonly known as Botín, opened in Madrid in 1725 and has been recognized by the Guinness Book of Records as the world's oldest restaurant in continuous operation. The restaurant still uses its original wood-fired oven and serves traditional Castilian cuisine. Ernest Hemingway was a regular patron and even mentioned the restaurant in his novel 'The Sun Also Rises.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Sobrino_de_Bot%C3%ADn",
    "citationTitle": "Wikipedia: Sobrino de Botín"
  },
  {
    "id": "c176719a-45b9-4c29-9f72-622b768ebe39",
    "text": "The French restaurant Le Grand Véfour, established in 1784, is famous for having numbered plaques marking the favorite tables of which type of historical patrons?",
    "options": [
      "Revolutionary leaders",
      "Famous writers and emperors",
      "Opera singers",
      "Military generals"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Le Grand Véfour has plaques marking tables used by famous writers like Victor Hugo and emperors like Napoleon.",
    "detailedExplanation": "Le Grand Véfour in Paris features small brass plaques on tables indicating where famous historical figures regularly dined. These include Napoleon Bonaparte, Victor Hugo, Jean Cocteau, and Colette among others. Located in the Palais-Royal, the restaurant has maintained its 18th-century décor and has been awarded three Michelin stars, making it one of the most historically significant fine dining establishments in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Le_Grand_V%C3%A9four",
    "citationTitle": "Wikipedia: Le Grand Véfour"
  },
  {
    "id": "1a66bc9e-7a4b-42c4-a6a9-1c99f29dd5b5",
    "text": "Which pioneering restaurateur is credited with creating the first restaurant menu and establishing many conventions of fine dining in 18th-century Paris?",
    "options": [
      "Auguste Escoffier",
      "Mathurin Roze de Chantoiseau",
      "Antoine Beauvilliers",
      "Marie-Antoine Carême"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Antoine Beauvilliers opened La Grande Taverne de Londres in 1782 and established many fine dining conventions.",
    "detailedExplanation": "Antoine Beauvilliers is often credited as the inventor of the modern restaurant concept. In 1782, he opened La Grande Taverne de Londres in Paris, which featured individual tables, printed menus with fixed prices, and elegant décor. Beauvilliers, who had been chef to the Count of Provence, established many conventions still used in fine dining today, including the concept of the maître d'hôtel and sophisticated table service.",
    "citationUrl": "https://en.wikipedia.org/wiki/Antoine_Beauvilliers",
    "citationTitle": "Wikipedia: Antoine Beauvilliers"
  },
  {
    "id": "1f61b071-7a43-4f2a-811b-e03c0b9f381b",
    "text": "The famous Delmonico's restaurant in New York City is credited with introducing which culinary innovation to America in the 1830s?",
    "options": [
      "The wine list",
      "À la carte dining",
      "The dessert course",
      "Private dining rooms"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Delmonico's introduced à la carte dining to America, allowing customers to order individual dishes.",
    "detailedExplanation": "Delmonico's, which opened in New York City in 1837, revolutionized American dining by introducing the European concept of à la carte ordering, where customers could select individual dishes from a menu rather than being served a fixed meal. The restaurant also introduced Americans to many European culinary traditions and ingredients, and is credited with creating several dishes including Eggs Benedict, Baked Alaska, and Delmonico steak.",
    "citationUrl": "https://en.wikipedia.org/wiki/Delmonico%27s",
    "citationTitle": "Wikipedia: Delmonico's"
  },
  {
    "id": "2300076c-8441-42fd-9492-76dcac788f71",
    "text": "Which London restaurant, established in 1798, claims to be the oldest restaurant in London and was a favorite of Charles Dickens?",
    "options": [
      "Simpson's in the Strand",
      "Rules",
      "Wiltons",
      "The George Inn"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Rules restaurant, established in 1798, is London's oldest restaurant and was frequented by Charles Dickens.",
    "detailedExplanation": "Rules restaurant in Covent Garden was established in 1798 by Thomas Rule and is recognized as London's oldest restaurant. The establishment became famous for its game dishes and traditional British cuisine, attracting literary figures including Charles Dickens, William Thackeray, and H.G. Wells. The restaurant still operates today, maintaining its Victorian décor and serving traditional British fare in the same location where it began over 200 years ago.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rules_(restaurant)",
    "citationTitle": "Wikipedia: Rules (restaurant)"
  },
  {
    "id": "51c763dc-fa73-4233-a2f6-5a4d8cb2b8c2",
    "text": "The term 'restaurant' originally comes from the French word 'restaurer' meaning to restore, but what type of establishment first used this term in 18th-century Paris?",
    "options": [
      "Taverns serving wine",
      "Shops selling restorative broths",
      "Bakeries selling bread",
      "Inns providing lodging"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The first 'restaurants' were establishments selling restorative broths believed to have medicinal properties.",
    "detailedExplanation": "The word 'restaurant' derives from the French verb 'restaurer,' meaning 'to restore.' In 1765, Monsieur Boulanger opened what is considered the first restaurant in Paris, selling restorative broths called 'restaurants' that were believed to restore health and strength. These establishments were different from taverns or inns, as they focused specifically on serving food to restore one's health rather than providing entertainment or lodging.",
    "citationUrl": "https://en.wikipedia.org/wiki/Restaurant",
    "citationTitle": "Wikipedia: Restaurant"
  },
  {
    "id": "9a779487-3def-4d61-a028-d0b17b7fd0da",
    "text": "Which historic American restaurant chain, founded in 1885, is considered the first franchise restaurant operation in the United States?",
    "options": [
      "Howard Johnson's",
      "Harvey House",
      "White Castle",
      "Horn & Hardart"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Harvey House, founded by Fred Harvey in 1885, was the first franchise restaurant chain in America.",
    "detailedExplanation": "The Harvey House restaurant chain, founded by Fred Harvey in 1885, is considered America's first franchise restaurant operation. Harvey established restaurants along the Atchison, Topeka and Santa Fe Railway, creating standardized menus, service, and quality across multiple locations. The restaurants were famous for their 'Harvey Girls' - young women who served customers with strict standards of service and dress. At its peak, the chain operated 84 restaurants, 60 dining cars, and numerous hotels across the American West.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harvey_House",
    "citationTitle": "Wikipedia: Harvey House"
  },
  {
    "id": "a523e874-5a81-41ef-9daa-02be3972bffc",
    "text": "The Michelin Guide, now famous for restaurant ratings, was first published in 1900 for what original purpose?",
    "options": [
      "To promote French cuisine",
      "To help motorists find services while driving",
      "To compete with other travel guides",
      "To establish restaurant quality standards"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Michelin Guide was created to help early motorists find gas stations, tire repair shops, and places to eat.",
    "detailedExplanation": "The first Michelin Guide was published in 1900 by tire manufacturer Michelin as a free guide to help French motorists. It contained practical information such as gas stations, tire repair shops, hotels, and restaurants. The famous star rating system for restaurants wasn't introduced until 1926. The guide was created during the early days of automobile travel when such infrastructure was scarce, and Michelin hoped that encouraging car travel would increase tire sales.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michelin_Guide",
    "citationTitle": "Wikipedia: Michelin Guide"
  },
  {
    "id": "e3484aa3-ab59-4c34-a591-4520d179b037",
    "text": "Which Italian restaurant in New York's Little Italy, opened in 1896, is famous for being the birthplace of chicken parmigiana and claims to have served celebrities like Frank Sinatra and Joe DiMaggio?",
    "options": [
      "Lombardi's",
      "Rao's",
      "Cafe Reggio",
      "Caffe Roma"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Lombardi's is credited as America's first pizzeria and the birthplace of chicken parmigiana.",
    "detailedExplanation": "Lombardi's Pizza, established in 1905 at 32 Spring Street in Manhattan's Little Italy, is widely recognized as America's first pizzeria. Founded by Gennaro Lombardi, an Italian immigrant from Naples, the restaurant received its license to sell pizza in 1905 and is credited with introducing coal-oven pizza to America. The restaurant claims to be the birthplace of chicken parmigiana and has served numerous celebrities throughout its history, becoming a cultural landmark in New York City.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lombardi%27s_Pizza",
    "citationTitle": "Wikipedia: Lombardi's Pizza"
  },
  {
    "id": "86b8fbe0-6183-4307-8095-b975620237f5",
    "text": "The Harvey House restaurant chain, which operated from 1876 to 1968, was famous for revolutionizing dining along which American transportation system?",
    "options": [
      "Interstate highways",
      "Railroad lines",
      "River steamboats",
      "Stagecoach routes"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Harvey House restaurants were established along railroad lines to provide quality dining for train passengers.",
    "detailedExplanation": "Fred Harvey established the Harvey House chain in 1876 to provide quality food and service along the Atchison, Topeka and Santa Fe Railway. These restaurants revolutionized railroad dining by offering fresh, high-quality meals served by well-trained waitresses known as 'Harvey Girls.' The chain grew to include 84 restaurants, 60 dining cars, and numerous hotels across the American Southwest, setting new standards for hospitality and playing a crucial role in the development of the American West.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harvey_House",
    "citationTitle": "Wikipedia: Harvey House"
  },
  {
    "id": "17fa4c7a-7647-46d5-80da-25bf8106d5ae",
    "text": "Which Russian restaurant, opened in Paris in 1927 by refugees fleeing the Russian Revolution, became legendary for its over-the-top theatrical dining experience and flambéed desserts?",
    "options": [
      "Maxim's",
      "Tour d'Argent",
      "Raspoutine",
      "Chez Castel"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Raspoutine was founded by Russian emigres and became famous for its theatrical Russian dining experience.",
    "detailedExplanation": "Restaurant Raspoutine was opened in 1927 by Russian aristocrats and White Army officers who fled to Paris after the Russian Revolution. Located in Montparnasse, it became famous for its authentic Russian cuisine, theatrical atmosphere, and elaborate tableside presentations including flambéed dishes. The restaurant featured traditional Russian entertainment, including gypsy music and folk dancing, and became a gathering place for Russian expatriates while also attracting Parisian society and international celebrities seeking an exotic dining experience.",
    "citationUrl": "https://en.wikipedia.org/wiki/Russian_diaspora",
    "citationTitle": "Wikipedia: Russian diaspora"
  },
  {
    "id": "6f5de0f3-d0ec-4c8d-9e4d-87614f796f20",
    "text": "The famous Brown Derby restaurant in Hollywood, shaped like a giant hat, was instrumental in creating which dining innovation that became standard in upscale restaurants?",
    "options": [
      "Celebrity chef culture",
      "Booth seating",
      "The Cobb salad",
      "Valet parking"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Brown Derby is credited with inventing the Cobb salad in 1937.",
    "detailedExplanation": "The Brown Derby, opened in 1926 on Wilshire Boulevard in Los Angeles, was a chain of restaurants famous for their distinctive hat-shaped architecture and Hollywood clientele. The restaurant is most notably credited with creating the Cobb salad in 1937, invented by owner Robert Cobb. The salad, made with chopped lettuce, tomato, bacon, chicken, hard-boiled eggs, blue cheese, and avocado, was named after the owner and became one of the most popular American salads, spreading to restaurants worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brown_Derby",
    "citationTitle": "Wikipedia: Brown Derby"
  },
  {
    "id": "b8e28603-4a32-4e0c-9a4e-397e6c8db29f",
    "text": "Which Japanese restaurant format, first established in Tokyo in 1958, revolutionized casual dining by introducing the concept of customers sitting around chefs who cooked on a flat iron grill?",
    "options": [
      "Shabu-shabu",
      "Teppanyaki",
      "Robatayaki",
      "Yakiniku"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Teppanyaki dining format was first introduced at Misono restaurant in Tokyo in 1945.",
    "detailedExplanation": "Teppanyaki, which literally means 'grilled on an iron plate,' was first introduced as a restaurant dining format at the Misono restaurant in Tokyo in 1945, though it gained international recognition in the 1960s. The concept involves chefs cooking on a large flat iron griddle in front of diners, combining skilled cooking techniques with entertainment. This format was later popularized in the United States through chains like Benihana, founded by Rocky Aoki in 1964, and became synonymous with Japanese steakhouse dining worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Teppanyaki",
    "citationTitle": "Wikipedia: Teppanyaki"
  },
  {
    "id": "7e86cbb9-60c0-4351-9a0c-527e61032bb6",
    "text": "The famous Pump Room restaurant at the Ambassador East Hotel in Chicago, which operated from 1938 to 2017, was known for which unique service tradition?",
    "options": [
      "Servers wore rollerskates",
      "Celebrity booth numbering system",
      "Live radio broadcasts during dinner",
      "Tableside flaming coffee service"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Pump Room was famous for broadcasting live radio shows during dinner service.",
    "detailedExplanation": "The Pump Room, opened in 1938 at Chicago's Ambassador East Hotel, became legendary for its glamorous atmosphere and unique tradition of live radio broadcasts during dinner service. The restaurant was designed by restaurateur Ernie Byfield to attract celebrities and socialites, featuring elaborate booth seating and theatrical service. It became a favorite of Hollywood stars like Humphrey Bogart, Lauren Bacall, and Frank Sinatra, and was known for its flamboyant presentations, including servers in period costumes and elaborate tableside preparations that made for dramatic radio entertainment.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ambassador_East_Hotel",
    "citationTitle": "Wikipedia: Ambassador East Hotel"
  },
  {
    "id": "e0b57c00-80bb-4442-97aa-93f8389f1992",
    "text": "Which historic Parisian brasserie, established in 1864, claims to have invented the method of serving oysters that became known as 'plateau de fruits de mer'?",
    "options": [
      "Brasserie Lipp",
      "La Coupole",
      "Bofinger",
      "Cafe de Flore"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Bofinger claims to have created the elaborate seafood platter presentation known as plateau de fruits de mer.",
    "detailedExplanation": "Bofinger, established in 1864 near the Bastille in Paris, is one of the oldest brasseries in the city and claims to have invented the elaborate presentation of mixed seafood known as 'plateau de fruits de mer' (seafood platter). This method of serving oysters, clams, prawns, and other shellfish on tiered ice-filled platters became a signature of French brasserie dining. Bofinger was also notable for being the first brasserie in Paris to serve Alsatian beer on tap, reflecting the Alsatian origins of many Parisian brasseries following the Franco-Prussian War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bofinger_(restaurant)",
    "citationTitle": "Wikipedia: Bofinger (restaurant)"
  },
  {
    "id": "a7cfe4ef-4c3c-4b73-8c6d-39c6b1451c10",
    "text": "The automat restaurant concept, which peaked in popularity during the 1940s and 1950s, was first introduced in the United States by which company in Philadelphia in 1902?",
    "options": [
      "White Castle",
      "Horn & Hardart",
      "Chock full o'Nuts",
      "Schrafft's"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Horn & Hardart introduced the first automat in Philadelphia in 1902.",
    "detailedExplanation": "Horn & Hardart opened the first automat in the United States on June 2, 1902, in Philadelphia, followed by locations in New York City in 1912. The automat concept featured rows of small glass compartments containing prepared food that customers could purchase by inserting coins and turning knobs. This self-service dining format became extremely popular during the Great Depression and World War II era, offering affordable, quick meals in a novel setting. At its peak, Horn & Hardart operated nearly 180 automats, revolutionizing fast food service decades before modern fast-food chains emerged.",
    "citationUrl": "https://en.wikipedia.org/wiki/Horn_%26_Hardart",
    "citationTitle": "Wikipedia: Horn & Hardart"
  },
  {
    "id": "0ffce437-fd18-4e49-8fcd-c60f463371ca",
    "text": "Which Austrian chef and restaurateur founded the legendary Le Bernardin restaurant in Paris in 1972, establishing it as one of the world's premier seafood restaurants before it later expanded to New York?",
    "options": [
      "Gilbert Le Coze",
      "Daniel Boulud",
      "Joël Robuchon",
      "Alain Ducasse"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Gilbert Le Coze founded Le Bernardin in Paris in 1972.",
    "detailedExplanation": "Gilbert Le Coze, along with his sister Maguy, founded Le Bernardin in Paris in 1972, revolutionizing fine dining with their exclusive focus on fish and seafood. The restaurant gained international acclaim and three Michelin stars before the siblings brought the concept to New York City in 1986, where it continued to maintain its reputation as one of the world's finest seafood restaurants under subsequent chef Eric Ripert.",
    "citationUrl": "https://en.wikipedia.org/wiki/Le_Bernardin",
    "citationTitle": "Wikipedia: Le Bernardin"
  },
  {
    "id": "f1b3cd26-bef7-4eeb-81ef-b53891dcc10e",
    "text": "The famous Commander's Palace restaurant in New Orleans, which opened in 1893, is historically significant for launching the careers of numerous celebrity chefs, but it's also known for which unusual dining tradition?",
    "options": [
      "Mandatory jacket and tie policy",
      "25-cent martinis at lunch",
      "Live jazz performances during every meal",
      "Tables assigned by lottery system"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "Commander's Palace is famous for its 25-cent martinis served at lunch.",
    "detailedExplanation": "Commander's Palace, the iconic New Orleans restaurant that opened in 1893, became legendary not only for its Creole cuisine and for nurturing famous chefs like Emeril Lagasse and Paul Prudhomme, but also for its tradition of serving 25-cent martinis at lunch. This practice, which continued for decades, became a beloved institution that attracted both locals and tourists, embodying the restaurant's philosophy of creating memorable dining experiences that went beyond just the food.",
    "citationUrl": "https://en.wikipedia.org/wiki/Commander%27s_Palace",
    "citationTitle": "Wikipedia: Commander's Palace"
  },
  {
    "id": "b488cff1-47d5-43c8-926b-30ebed15a43e",
    "text": "Which London restaurant, established in 1889, holds the distinction of being the first restaurant in the world to be lit entirely by electric light and was considered a marvel of modern technology?",
    "options": [
      "The Savoy Grill",
      "Simpson's in the Strand",
      "Café Royal",
      "Romano's"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The Savoy Grill was the first restaurant fully lit by electric light in 1889.",
    "detailedExplanation": "The Savoy Grill, opened in 1889 as part of the luxurious Savoy Hotel in London, made history by becoming the first restaurant in the world to be entirely illuminated by electric lighting. This technological innovation was revolutionary at the time when most establishments still relied on gas lighting or candles. The electric lighting was part of the Savoy's broader commitment to modern luxury and helped establish it as one of London's most prestigious dining destinations, attracting wealthy patrons and celebrities who were drawn to this marvel of contemporary technology.",
    "citationUrl": "https://en.wikipedia.org/wiki/Savoy_Hotel",
    "citationTitle": "Wikipedia: Savoy Hotel"
  },
  {
    "id": "16205bf6-657d-44bd-b3d2-4bfd5189a7d5",
    "text": "The world's first revolving restaurant was opened in 1961 in which city, featuring a dining room that completed a full 360-degree rotation while guests dined?",
    "options": [
      "Seattle, USA",
      "Stuttgart, Germany",
      "Tokyo, Japan",
      "Sydney, Australia"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "hard",
    "explanation": "The first revolving restaurant opened in Stuttgart, Germany in 1961.",
    "detailedExplanation": "The world's first revolving restaurant opened in Stuttgart, Germany in 1961, located atop the Fernsehturm Stuttgart (Stuttgart TV Tower). This innovative dining concept was designed by Fritz Leonhardt and featured a restaurant that slowly rotated 360 degrees, giving diners panoramic views of the city while they ate. The success of this pioneering establishment inspired the construction of similar revolving restaurants around the world, including the famous Space Needle restaurant in Seattle and numerous other tower restaurants that became popular tourist attractions throughout the 1960s and 1970s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fernsehturm_Stuttgart",
    "citationTitle": "Wikipedia: Fernsehturm Stuttgart"
  }
]