[
  {
    "id": "69020543-3a50-4a26-b256-bcd0564d3876",
    "text": "Which restaurant, opened in 1725 in Madrid, holds the Guinness World Record as the world's oldest continuously operating restaurant?",
    "options": [
      "Casa Botín",
      "Le Procope",
      "Zum Franziskaner",
      "Rules Restaurant"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Casa Botín in Madrid has been operating continuously since 1725.",
    "detailedExplanation": "Casa Botín, located in Madrid's historic center, opened its doors in 1725 and has been serving customers without interruption ever since. The restaurant is famous for its traditional Castilian cuisine, particularly its roast suckling pig and lamb cooked in the original wood-fired oven. Ernest Hemingway was a regular customer and even mentioned the restaurant in his novel 'The Sun Also Rises'. The Guinness Book of World Records officially recognizes it as the world's oldest continuously operating restaurant.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sobrino_de_Bot%C3%ADn",
    "citationTitle": "Wikipedia: Sobrino de Botín"
  },
  {
    "id": "48f9edae-ea8b-40db-8f12-d053995310dd",
    "text": "The first known restaurant review was published in which publication in 1804?",
    "options": [
      "The Times of London",
      "Journal des Gourmands",
      "Le Figaro",
      "Almanach des Gourmands"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The Almanach des Gourmands published the first restaurant review in 1804.",
    "detailedExplanation": "The Almanach des Gourmands, published by Alexandre Balthazar Laurent Grimod de la Reynière starting in 1803, contained the first known restaurant reviews in 1804. Grimod de la Reynière is considered one of the world's first food critics and restaurant reviewers. His annual publication not only reviewed restaurants but also provided guidance on proper dining etiquette and seasonal foods. This marked the beginning of food criticism as a literary genre and established the foundation for modern restaurant reviewing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Grimod_de_la_Reyni%C3%A8re",
    "citationTitle": "Wikipedia: Grimod de la Reynière"
  },
  {
    "id": "513e94de-f7d6-4e80-8d31-d91eba7d368d",
    "text": "Which American city is credited with creating the first restaurant week in 1992?",
    "options": [
      "San Francisco",
      "New York City",
      "Chicago",
      "Los Angeles"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "New York City created the first Restaurant Week in 1992 to boost tourism after the 1991 recession.",
    "detailedExplanation": "New York City Restaurant Week was launched in July 1992 by the NYC & Company (then called the New York Convention and Visitors Bureau) as a way to attract visitors and boost the local economy following the 1991 recession. The original event offered prix fixe lunches at $19.92 (representing the year) at participating restaurants. The concept was so successful that it became a twice-yearly event and has been copied by cities worldwide. Restaurant Week has since become a major culinary tourism phenomenon.",
    "citationUrl": "https://en.wikipedia.org/wiki/Restaurant_Week",
    "citationTitle": "Wikipedia: Restaurant Week"
  },
  {
    "id": "4cebabe6-bee8-4971-bd16-fe9ed94845bd",
    "text": "What innovation did White Castle introduce in 1921 that revolutionized the restaurant industry?",
    "options": [
      "Drive-through service",
      "Standardized cooking methods",
      "Franchising system",
      "Assembly-line food preparation"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "White Castle pioneered assembly-line food preparation, creating the first fast-food system.",
    "detailedExplanation": "White Castle, founded in 1921 in Wichita, Kansas, by Walter Anderson and Billy Ingram, revolutionized the restaurant industry by introducing assembly-line food preparation methods. They standardized their cooking process, used identical equipment in all locations, and created a system where multiple workers each performed specific tasks to quickly prepare uniform hamburgers. This innovation, combined with their clean white-tiled restaurants and 5-cent hamburgers, established the template for the modern fast-food industry that would later be adopted by McDonald's and other chains.",
    "citationUrl": "https://en.wikipedia.org/wiki/White_Castle_(restaurant)",
    "citationTitle": "Wikipedia: White Castle"
  },
  {
    "id": "8e232f30-65d4-4bab-bc8c-5e72717e20f6",
    "text": "Which European city is home to Café Central, famous for being a meeting place for intellectuals like Freud and Trotsky in the early 1900s?",
    "options": [
      "Paris",
      "Berlin",
      "Vienna",
      "Prague"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Café Central in Vienna was a famous intellectual gathering place in the early 20th century.",
    "detailedExplanation": "Café Central, located in Vienna's Palais Ferstel, opened in 1876 and became one of Europe's most famous coffeehouses. During the early 1900s, it served as a meeting place for Vienna's intellectual elite, including psychoanalyst Sigmund Freud, revolutionary Leon Trotsky, architect Adolf Loos, and writers like Peter Altenberg and Karl Kraus. The café embodied Vienna's coffeehouse culture, where patrons could spend hours reading newspapers, playing chess, writing, and engaging in political and philosophical discussions. This tradition of coffeehouses as intellectual centers became a defining characteristic of Viennese culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Caf%C3%A9_Central",
    "citationTitle": "Wikipedia: Café Central"
  },
  {
    "id": "2e7fc027-2fcd-4902-9263-75d0e9a0ba5a",
    "text": "The concept of the modern salad bar was first introduced by which American restaurant chain in 1970?",
    "options": [
      "Pizza Hut",
      "Sizzler",
      "Ponderosa Steakhouse",
      "Ruby Tuesday"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Pizza Hut introduced the first modern salad bar in 1970 at a location in Springfield, Ohio.",
    "detailedExplanation": "Pizza Hut pioneered the modern self-service salad bar concept in 1970 at their Springfield, Ohio location. The idea was developed as a way to offer customers more variety and perceived value while reducing labor costs. The salad bar allowed customers to customize their salads and provided an additional revenue stream for the restaurant. This innovation quickly spread throughout the industry, and by the 1980s, salad bars had become a common feature in many casual dining establishments, family restaurants, and even some fast-food chains.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pizza_Hut",
    "citationTitle": "Wikipedia: Pizza Hut"
  },
  {
    "id": "c1866f81-9650-44f4-9e15-c5a0a1d699dd",
    "text": "Which restaurant is credited with being the first to offer a children's menu in the United States in 1963?",
    "options": [
      "McDonald's",
      "Burger King",
      "Denny's",
      "Howard Johnson's"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Howard Johnson's introduced the first children's menu in American restaurants in 1963.",
    "detailedExplanation": "Howard Johnson's restaurant chain, founded by Howard Deering Johnson, introduced the first dedicated children's menu in American restaurants in 1963. The menu featured smaller portions of kid-friendly foods at reduced prices, recognizing that children had different tastes and appetites than adults. This innovation came during the post-war baby boom when families were dining out more frequently. The success of Howard Johnson's children's menu led to its widespread adoption across the restaurant industry, making dining out more family-friendly and accessible.",
    "citationUrl": "https://en.wikipedia.org/wiki/Howard_Johnson%27s",
    "citationTitle": "Wikipedia: Howard Johnson's"
  },
  {
    "id": "37a3e86d-942e-495a-8d0f-89b658e0ed7e",
    "text": "The term 'restaurant' comes from the French verb 'restaurer,' but what did the original 'restaurants' in 18th century Paris primarily serve?",
    "options": [
      "Full course meals",
      "Restorative broths and soups",
      "Wine and cheese",
      "Pastries and coffee"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The first restaurants served restorative broths believed to have medicinal properties.",
    "detailedExplanation": "The word 'restaurant' derives from the French verb 'restaurer,' meaning 'to restore.' The first establishments called restaurants in 18th century Paris served 'restaurants' - light, restorative broths and soups that were believed to have medicinal properties and could restore one's health and energy. These were served in elegant settings with individual tables, unlike the communal dining experience of taverns and inns. Mathurin Roze de Chantoiseau is often credited with opening one of the first true restaurants in Paris in 1766, serving these restorative broths to wealthy customers seeking health benefits rather than just sustenance.",
    "citationUrl": "https://en.wikipedia.org/wiki/Restaurant",
    "citationTitle": "Wikipedia: Restaurant"
  },
  {
    "id": "71900afd-bcbe-4758-bff7-cb92911c46c3",
    "text": "Which fast-food chain was the first to introduce the drive-thru window concept in 1947?",
    "options": [
      "McDonald's",
      "In-N-Out Burger",
      "White Castle",
      "Burger King"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "In-N-Out Burger introduced the first drive-thru window in 1948 in Baldwin Park, California.",
    "detailedExplanation": "Harry Snyder, founder of In-N-Out Burger, revolutionized fast food service by installing a two-way speaker system that allowed customers to order from their cars without leaving their vehicles. This innovation was first implemented at their Baldwin Park location in 1948, predating McDonald's adoption of the drive-thru concept by several decades. The idea was born from Snyder's observation that many customers preferred the convenience of not having to park and walk into the restaurant.",
    "citationUrl": "https://en.wikipedia.org/wiki/Drive-through",
    "citationTitle": "Wikipedia: Drive-through"
  },
  {
    "id": "4673b710-dffb-4fb5-b337-1be9e70d147c",
    "text": "The rotating restaurant concept was first introduced in which decade?",
    "options": [
      "1930s",
      "1950s",
      "1960s",
      "1970s"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The first rotating restaurant opened in 1961 at the top of the Florianturm in Dortmund, Germany.",
    "detailedExplanation": "The revolving restaurant concept became popular during the 1960s as part of the space-age dining experience. The first successful rotating restaurant was installed at the Florianturm television tower in Dortmund, Germany, in 1961. This innovation allowed diners to enjoy panoramic views while eating, as the restaurant floor slowly rotated, typically completing a full rotation in 60-90 minutes. The concept quickly spread worldwide, with famous examples including the CN Tower's 360 Restaurant in Toronto and the Space Needle in Seattle.",
    "citationUrl": "https://en.wikipedia.org/wiki/Revolving_restaurant",
    "citationTitle": "Wikipedia: Revolving restaurant"
  },
  {
    "id": "b196f138-213e-4d21-926a-6db063dd604e",
    "text": "Which restaurant chain is credited with introducing the first value menu in the fast-food industry in 1989?",
    "options": [
      "Taco Bell",
      "Wendy's",
      "Burger King",
      "KFC"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Wendy's introduced the first 99¢ Value Menu in 1989, pioneering the value menu concept.",
    "detailedExplanation": "Wendy's revolutionized fast-food pricing strategy when it launched its 99¢ Value Menu in 1989. This concept was designed to offer customers affordable options during economic uncertainty while maintaining profitability through high-volume sales of lower-margin items. The success of Wendy's value menu prompted other major fast-food chains to develop their own value offerings, fundamentally changing how the industry approached pricing and menu structure. The value menu concept became a standard feature across the fast-food landscape by the 1990s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wendy%27s",
    "citationTitle": "Wikipedia: Wendy's"
  },
  {
    "id": "2b2ef592-902f-4454-8f07-c1ea4df2ff6b",
    "text": "The first franchised restaurant chain in America was which establishment, founded in 1921?",
    "options": [
      "A&W Root Beer",
      "Howard Johnson's",
      "White Castle",
      "Big Boy"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "A&W Root Beer became the first franchised restaurant chain in America when it began franchising in 1921.",
    "detailedExplanation": "A&W Root Beer, founded by Roy W. Allen in 1919, pioneered the restaurant franchising model in 1921 when Allen began selling franchise rights to other entrepreneurs. The company's franchising system allowed individual operators to use the A&W name, recipes, and operating procedures in exchange for fees and ongoing royalties. This business model proved so successful that it became the template for virtually every major restaurant chain that followed, including McDonald's, KFC, and countless others. A&W's franchising innovation fundamentally transformed the restaurant industry from local independent establishments to national branded chains.",
    "citationUrl": "https://en.wikipedia.org/wiki/A%26W_Restaurants",
    "citationTitle": "Wikipedia: A&W Restaurants"
  },
  {
    "id": "6e08040b-cc55-48c4-b6db-9c4e417e10e4",
    "text": "Which famous chef is credited with establishing the modern kitchen brigade system still used in professional kitchens today?",
    "options": [
      "Escoffier",
      "Brillat-Savarin",
      "Carême",
      "Bocuse"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Auguste Escoffier developed the kitchen brigade system in the late 19th century, organizing kitchen staff into specialized roles.",
    "detailedExplanation": "Auguste Escoffier, known as the 'King of Chefs and Chef of Kings,' revolutionized professional kitchen organization in the late 1800s by developing the brigade de cuisine system. This hierarchical structure assigned specific roles and responsibilities to kitchen staff, from the chef de cuisine at the top to commis chefs at entry level, with specialized positions like saucier, garde manger, and pâtissier. Escoffier's system improved efficiency, quality control, and training in restaurant kitchens. His organizational principles, developed while working at prestigious establishments like the Savoy and Carlton hotels in London, remain the foundation of professional kitchen operations worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Auguste_Escoffier",
    "citationTitle": "Wikipedia: Auguste Escoffier"
  },
  {
    "id": "fdbb94f2-ab8b-4b68-81dd-c237374c6728",
    "text": "The first restaurant to receive a Michelin star was located in which country?",
    "options": [
      "France",
      "Italy",
      "Germany",
      "United Kingdom"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The first Michelin stars were awarded to French restaurants in 1926 when the rating system began.",
    "detailedExplanation": "The Michelin Guide began awarding stars in 1926, with the first starred restaurants being French establishments. The guide itself had existed since 1900 as a free publication by the Michelin tire company to encourage automobile travel, but the iconic star rating system wasn't introduced until 1926. The first restaurants to receive the coveted three-star rating included several prestigious French establishments. The Michelin star system quickly became the most prestigious culinary award in the world, though it remained focused primarily on French cuisine and European restaurants for many decades before expanding globally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michelin_Guide",
    "citationTitle": "Wikipedia: Michelin Guide"
  },
  {
    "id": "85027782-dcc2-49b5-b289-f62a57d8eb1b",
    "text": "Which restaurant innovation from the 1950s was specifically designed to serve the growing suburban, car-oriented American lifestyle?",
    "options": [
      "Cafeterias",
      "Carhop service",
      "Food trucks",
      "Buffet restaurants"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Carhop service became popular in the 1950s, allowing customers to be served in their cars at drive-in restaurants.",
    "detailedExplanation": "Carhop service reached its peak popularity during the 1950s as American suburbs expanded and car ownership soared. Drive-in restaurants with carhop service allowed families to dine in their cars, served by waitresses (often on roller skates) who would bring food directly to the vehicle. This concept perfectly matched the era's car culture and family dining trends. Famous chains like Sonic Drive-In built their entire business model around carhop service, while A&W Root Beer stands popularized the format nationwide. Though many drive-ins eventually converted to drive-thrus for efficiency, carhop service represented a unique moment in American dining history that celebrated the automobile as central to social life.",
    "citationUrl": "https://en.wikipedia.org/wiki/Drive-in",
    "citationTitle": "Wikipedia: Drive-in"
  },
  {
    "id": "8a7ebcff-de5e-4d33-a2d1-3cccd38c4461",
    "text": "The first known use of printed menus in restaurants occurred during which historical period?",
    "options": [
      "Renaissance Italy",
      "Colonial America",
      "French Revolution era",
      "Industrial Revolution"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Printed menus first appeared during the French Revolution era in the 1790s as restaurants began offering choices to customers.",
    "detailedExplanation": "The first printed restaurant menus appeared in France during the 1790s, coinciding with the emergence of restaurants as we know them today. Prior to the French Revolution, most public dining occurred at inns or taverns that served whatever was prepared that day, with no choices offered. As the restaurant concept developed in post-revolutionary Paris, establishments began offering multiple dishes and needed a way to communicate options to literate customers. The earliest known printed menu dates to 1790 from a Parisian restaurant. These early menus were simple affairs, but they represented a fundamental shift toward customer choice and the dining experience as we understand it today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Menu",
    "citationTitle": "Wikipedia: Menu"
  },
  {
    "id": "68b8b6bf-6f54-4fc3-af8e-2f06169b2e12",
    "text": "Which European restaurant chain, founded in 1971, was the first to offer self-service cafeteria-style dining with trays and became a model for modern fast-casual restaurants?",
    "options": [
      "Nordsee",
      "Pret A Manger",
      "Automat Horn & Hardart",
      "Quick"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Nordsee pioneered the self-service seafood cafeteria concept in 1971.",
    "detailedExplanation": "Nordsee, founded in Germany in 1971, revolutionized European dining by introducing the first successful self-service cafeteria-style restaurant chain specializing in seafood. Customers would pick up trays and select from various prepared fish dishes displayed behind glass counters. This concept influenced the development of modern fast-casual dining and helped establish the template for self-service restaurants that would later become commonplace across Europe and beyond.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nordsee",
    "citationTitle": "Wikipedia: Nordsee"
  },
  {
    "id": "f8771895-cc3c-4e20-b5b7-1a9752c38382",
    "text": "The world's first underwater restaurant opened in 2005 in which country?",
    "options": [
      "Norway",
      "Maldives",
      "Japan",
      "Australia"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Ithaa Undersea Restaurant opened in the Maldives in 2005 as the world's first all-glass underwater restaurant.",
    "detailedExplanation": "Ithaa Undersea Restaurant, located at the Conrad Maldives Rangali Island resort, opened in April 2005 as the world's first all-glass underwater restaurant. Situated 16 feet below sea level in the Indian Ocean, the restaurant offers 180-degree panoramic views of the coral reef and marine life. The innovative dining concept required advanced engineering and construction techniques, including the transport of the prefabricated acrylic tunnel structure from New Zealand to the Maldives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ithaa",
    "citationTitle": "Wikipedia: Ithaa"
  },
  {
    "id": "56f831a7-19af-4cf9-ad06-e8575e79debe",
    "text": "Which restaurant innovation was first introduced at Delmonico's in New York City during the 1830s that became standard practice in fine dining establishments?",
    "options": [
      "Individual tables instead of communal dining",
      "Wine sommelier service",
      "À la carte ordering from printed menus",
      "Tableside cooking preparation"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "medium",
    "explanation": "Delmonico's pioneered à la carte dining, allowing customers to order individual dishes from an extensive printed menu.",
    "detailedExplanation": "Delmonico's, which opened in New York City in 1837, revolutionized American dining by introducing the à la carte system, where customers could order individual dishes from an extensive printed menu rather than being served a fixed meal. This was a departure from the typical American dining style of the time, which involved large communal tables with set meals. The restaurant's innovation allowed for greater choice and customization in dining, setting the standard for fine dining establishments and influencing restaurant service across America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Delmonico%27s",
    "citationTitle": "Wikipedia: Delmonico's"
  },
  {
    "id": "3a120307-8dd9-4d76-a793-0a3266046293",
    "text": "The first restaurant to be located inside a department store opened in which decade, revolutionizing shopping and dining experiences?",
    "options": [
      "1870s",
      "1890s",
      "1900s",
      "1920s"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "medium",
    "explanation": "The first department store restaurant opened in the 1890s, creating the concept of dining while shopping.",
    "detailedExplanation": "The integration of restaurants into department stores began in the 1890s as retailers recognized the opportunity to keep customers in their stores longer and create a more complete shopping experience. This innovation transformed retail by allowing shoppers to dine without leaving the store, significantly extending shopping trips and increasing sales. The concept proved so successful that it became a standard feature of major department stores worldwide, fundamentally changing how people approached both shopping and dining as leisure activities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Department_store_restaurant",
    "citationTitle": "Wikipedia: Department store restaurant"
  }
]