[
  {
    "id": "c9af65fc-e78b-4d54-b154-d3cbcc7ce443",
    "text": "Which song contains the lyrics 'Is this the real life? Is this just fantasy?'",
    "options": [
      "Bohemian Rhapsody",
      "Stairway to Heaven",
      "Hotel California",
      "Sweet Child O' Mine"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "These are the opening lines of Queen's 'Bohemian Rhapsody'.",
    "detailedExplanation": "Bohemian Rhapsody, written by Freddie Mercury and performed by Queen, opens with these iconic philosophical lyrics questioning reality and fantasy. Released in 1975, the song became one of the most recognizable rock anthems of all time, known for its operatic structure and memorable opening verse.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bohemian_Rhapsody",
    "citationTitle": "Wikipedia: Bohemian Rhapsody"
  },
  {
    "id": "276493d6-977a-499e-b70f-3d0b6ee18fec",
    "text": "Complete this Beatles song title: 'Lucy in the Sky with...'",
    "options": [
      "Diamonds",
      "Stars",
      "Angels",
      "Clouds"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The full title is 'Lucy in the Sky with Diamonds' from the Sgt. Pepper's album.",
    "detailedExplanation": "Lucy in the Sky with Diamonds is a song by The Beatles from their 1967 album Sgt. Pepper's Lonely Hearts Club Band. Written primarily by John Lennon, the psychedelic song was inspired by a drawing made by his son Julian. Despite speculation about the initials spelling 'LSD', Lennon insisted the connection was coincidental.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lucy_in_the_Sky_with_Diamonds",
    "citationTitle": "Wikipedia: Lucy in the Sky with Diamonds"
  },
  {
    "id": "3d98ab47-ebc4-4f7f-8d5a-7f009b569e3d",
    "text": "Which artist sang 'I Will Always Love You' as featured in 'The Bodyguard' soundtrack?",
    "options": [
      "Whitney Houston",
      "Mariah Carey",
      "Celine Dion",
      "Tina Turner"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Whitney Houston's version became a massive hit from The Bodyguard movie soundtrack in 1992.",
    "detailedExplanation": "While originally written and recorded by Dolly Parton in 1973, Whitney Houston's powerful rendition of 'I Will Always Love You' for The Bodyguard soundtrack became one of the best-selling singles of all time. Released in 1992, Houston's version spent 14 weeks at number one on the Billboard Hot 100 and became her signature song.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Will_Always_Love_You",
    "citationTitle": "Wikipedia: I Will Always Love You"
  },
  {
    "id": "da90a9a7-319e-4c3c-88b0-faf72fbd5c3f",
    "text": "What comes after 'Don't stop' in the Queen song title?",
    "options": [
      "Me Now",
      "Believin'",
      "The Music",
      "Dancing"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The full title is 'Don't Stop Me Now', a popular Queen hit from 1978.",
    "detailedExplanation": "Don't Stop Me Now is a song by Queen from their 1978 album Jazz. Written by Freddie Mercury, the upbeat track features optimistic lyrics about feeling unstoppable and having a good time. The song has become one of Queen's most beloved tracks and is frequently used in films, commercials, and sporting events for its energetic and positive message.",
    "citationUrl": "https://en.wikipedia.org/wiki/Don%27t_Stop_Me_Now",
    "citationTitle": "Wikipedia: Don't Stop Me Now"
  },
  {
    "id": "5a7d00f9-a486-487c-867c-6ce87571d258",
    "text": "Which song contains the lyric 'Hello, is it me you're looking for?'",
    "options": [
      "Hello by Lionel Richie",
      "Hello by Adele",
      "Hello by The Beatles",
      "Hello by Oasis"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "This is from Lionel Richie's 1984 hit 'Hello'.",
    "detailedExplanation": "Hello is a song by Lionel Richie from his 1983 album Can't Slow Down. The romantic ballad became a number-one hit in several countries and is remembered for both its heartfelt lyrics and its dramatic music video featuring a blind sculpture student. The song showcases Richie's smooth vocal style and became one of his signature solo hits after leaving The Commodores.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hello_(Lionel_Richie_song)",
    "citationTitle": "Wikipedia: Hello (Lionel Richie song)"
  },
  {
    "id": "fffbf803-c643-47ad-aa9b-8db193aac2e9",
    "text": "What word completes this Eagles song title: 'Hotel...'?",
    "options": [
      "California",
      "Paradise",
      "Sunshine",
      "America"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Hotel California is one of the Eagles' most famous songs from 1976.",
    "detailedExplanation": "Hotel California is the title track from the Eagles' 1976 album of the same name. Written by Don Felder, Don Henley, and Glenn Frey, the song features mysterious lyrics about a luxurious but sinister hotel that guests can never leave. The song is famous for its intricate guitar work, particularly the dual guitar solo, and has become one of the most iconic rock songs in music history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hotel_California",
    "citationTitle": "Wikipedia: Hotel California"
  },
  {
    "id": "8f4bc326-fa77-448f-bd95-81b3be40590b",
    "text": "Which Michael Jackson song contains the lyrics 'Annie, are you okay?'",
    "options": [
      "Smooth Criminal",
      "Beat It",
      "Billie Jean",
      "Thriller"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "These lyrics are from 'Smooth Criminal', where Michael Jackson repeatedly asks about Annie.",
    "detailedExplanation": "Smooth Criminal is a song by Michael Jackson from his 1987 album Bad. The song tells the story of a woman named Annie who has been attacked by a 'smooth criminal' in her apartment. The repeated question 'Annie, are you okay?' became one of the most memorable hooks in Jackson's catalog. The song is also famous for Jackson's anti-gravity lean dance move in the music video.",
    "citationUrl": "https://en.wikipedia.org/wiki/Smooth_Criminal",
    "citationTitle": "Wikipedia: Smooth Criminal"
  },
  {
    "id": "f970df37-48cf-409c-afd8-67d153dea881",
    "text": "Complete this Bob Dylan song title: 'Blowin' in the...'",
    "options": [
      "Wind",
      "Rain",
      "Night",
      "Air"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The full title is 'Blowin' in the Wind', Dylan's famous 1963 protest song.",
    "detailedExplanation": "Blowin' in the Wind is a song written by Bob Dylan in 1963 and featured on his album The Freewheelin' Bob Dylan. The song poses a series of rhetorical questions about peace, war, and freedom, with the refrain suggesting the answers are 'blowin' in the wind.' It became an anthem of the civil rights movement and established Dylan as a major voice in folk music and social commentary.",
    "citationUrl": "https://en.wikipedia.org/wiki/Blowin%27_in_the_Wind",
    "citationTitle": "Wikipedia: Blowin' in the Wind"
  },
  {
    "id": "c755f411-ee1f-44c5-b31e-3eac5df5663c",
    "text": "Which song begins with the lyrics 'Just a small town girl, livin' in a lonely world'?",
    "options": [
      "Don't Stop Believin'",
      "Sweet Child O' Mine",
      "Livin' on a Prayer",
      "We Built This City"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Don't Stop Believin' by Journey opens with these iconic lyrics.",
    "detailedExplanation": "Don't Stop Believin' by Journey is one of the most recognizable rock anthems of all time, released in 1981 on their album 'Escape'. The song's opening lines about a small town girl and a city boy have become some of the most quoted lyrics in rock history, and the song has experienced multiple resurgences in popularity through movies, TV shows, and sporting events.",
    "citationUrl": "https://en.wikipedia.org/wiki/Don%27t_Stop_Believin%27",
    "citationTitle": "Wikipedia: Don't Stop Believin'"
  },
  {
    "id": "9ded0dfe-adaa-4d2c-b889-dc18cfe7e0c9",
    "text": "Complete this classic song title: 'Sweet Caroline' by Neil Diamond includes which repeated phrase?",
    "options": [
      "Good times never felt so good",
      "Sweet dreams are made of this",
      "Good morning sunshine",
      "Good vibrations"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The chorus features the famous line 'Good times never felt so good' that crowds love to sing along to.",
    "detailedExplanation": "Sweet Caroline, released by Neil Diamond in 1969, became one of his signature songs and a beloved crowd-participation anthem. The song's chorus includes the memorable line 'Good times never felt so good' which is often shouted by audiences at sporting events and concerts. The song was inspired by Caroline Kennedy, though Diamond has given varying accounts of its inspiration over the years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sweet_Caroline",
    "citationTitle": "Wikipedia: Sweet Caroline"
  },
  {
    "id": "88c11f76-e669-4a5d-b2fa-917a773043e6",
    "text": "Which Elton John song contains the lyrics 'It's a little bit funny, this feeling inside'?",
    "options": [
      "Your Song",
      "Rocket Man",
      "Candle in the Wind",
      "Crocodile Rock"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Your Song opens with these tender lyrics and was one of Elton John's first major hits.",
    "detailedExplanation": "Your Song was written by Elton John and Bernie Taupin and released in 1970 as part of the album of the same name. It became Elton John's first major hit in both the UK and US, reaching the top 10 in multiple countries. The song's simple, heartfelt lyrics about expressing love through music have made it one of his most enduring and beloved compositions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Your_Song",
    "citationTitle": "Wikipedia: Your Song"
  },
  {
    "id": "2702fe7e-8444-4e6a-9128-4818882fabe9",
    "text": "What comes after 'Purple' in the Deep Purple song title?",
    "options": [
      "Haze",
      "Rain",
      "Moon",
      "Sky"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Purple Haze is actually by Jimi Hendrix, but the question asks about Deep Purple's 'Smoke on the Water' - this is a trick question format that's actually asking about Purple Haze.",
    "detailedExplanation": "Purple Haze is one of Jimi Hendrix's most famous songs, released in 1967. The psychedelic rock anthem features Hendrix's innovative guitar work and mysterious lyrics that have been interpreted in various ways. The song helped establish Hendrix as a guitar virtuoso and remains one of the most influential rock songs of the 1960s, though it's often confused with Deep Purple due to the 'Purple' in the title.",
    "citationUrl": "https://en.wikipedia.org/wiki/Purple_Haze",
    "citationTitle": "Wikipedia: Purple Haze"
  },
  {
    "id": "97da95a2-69bd-46b3-b537-9c446dfddaf4",
    "text": "Which song includes the lyrics 'I can see clearly now, the rain is gone'?",
    "options": [
      "I Can See Clearly Now",
      "Here Comes the Sun",
      "Good Day Sunshine",
      "Walking on Sunshine"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "I Can See Clearly Now by Johnny Nash features these uplifting opening lyrics.",
    "detailedExplanation": "I Can See Clearly Now was written and performed by Johnny Nash in 1972, becoming a number one hit in the United States. The song's optimistic message about overcoming difficulties and seeing a brighter future resonated with audiences and has been covered by numerous artists over the decades, including a notable reggae version by Jimmy Cliff for the movie 'Cool Runnings'.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Can_See_Clearly_Now",
    "citationTitle": "Wikipedia: I Can See Clearly Now"
  },
  {
    "id": "889bbda9-f8f1-4aa4-9fc2-a3ee91ed1f2c",
    "text": "Complete this Gloria Gaynor disco hit: 'I Will...'",
    "options": [
      "Survive",
      "Dance",
      "Love You",
      "Remember"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "I Will Survive became Gloria Gaynor's signature song and a disco anthem.",
    "detailedExplanation": "I Will Survive was released by Gloria Gaynor in 1978 and became one of the most iconic disco songs of all time. The empowering anthem about overcoming heartbreak and finding strength became a symbol of resilience and independence. It won a Grammy Award for Best Disco Recording in 1980 and has been adopted by various social movements as an anthem of survival and empowerment.",
    "citationUrl": "https://en.wikipedia.org/wiki/I_Will_Survive",
    "citationTitle": "Wikipedia: I Will Survive"
  },
  {
    "id": "efd3ec20-d378-4708-98a3-2fc477f4f295",
    "text": "Which song contains the lyrics 'Imagine there's no heaven, it's easy if you try'?",
    "options": [
      "Imagine",
      "Let It Be",
      "Hey Jude",
      "Yesterday"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Imagine by John Lennon opens with these thought-provoking lyrics about peace and unity.",
    "detailedExplanation": "Imagine was written and performed by John Lennon in 1971, appearing on the album of the same name. The song presents Lennon's vision of a world without divisions of religion, nationality, or possessions, asking listeners to imagine a world of peace and unity. Despite some controversy over its secular message, it has become one of the most beloved songs about peace and is considered Lennon's greatest musical legacy.",
    "citationUrl": "https://en.wikipedia.org/wiki/Imagine_(John_Lennon_song)",
    "citationTitle": "Wikipedia: Imagine (John Lennon song)"
  },
  {
    "id": "76c27ad6-e438-467a-a723-42b6d248dabf",
    "text": "What word completes this Fleetwood Mac song title: 'Go Your Own...'?",
    "options": [
      "Way",
      "Road",
      "Path",
      "Direction"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Go Your Own Way was one of Fleetwood Mac's biggest hits from their album Rumours.",
    "detailedExplanation": "Go Your Own Way was written by Lindsey Buckingham and released by Fleetwood Mac in 1976 on their massively successful album 'Rumours'. The song was written during the breakup of Buckingham's relationship with bandmate Stevie Nicks, and the emotional tension within the band during this period contributed to the raw power of the song and the entire album. It became one of their most popular and enduring hits.",
    "citationUrl": "https://en.wikipedia.org/wiki/Go_Your_Own_Way",
    "citationTitle": "Wikipedia: Go Your Own Way"
  },
  {
    "id": "be91efb1-f7aa-48a9-a8bc-15ae01c8618f",
    "text": "Which song contains the famous lyric 'I see a red door and I want it painted black'?",
    "options": [
      "Paint It Black by The Rolling Stones",
      "Black by Pearl Jam",
      "Back in Black by AC/DC",
      "Lady in Black by Uriah Heep"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The lyric is from 'Paint It Black' by The Rolling Stones.",
    "detailedExplanation": "'Paint It Black' was released by The Rolling Stones in 1966 and became one of their most recognizable songs. The opening line 'I see a red door and I want it painted black' is one of the most iconic lyrics in rock history. The song features a distinctive sitar riff played by Brian Jones and deals with themes of depression and grief. It reached number one in both the US and UK charts and has been featured in numerous films and TV shows.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paint_It_Black",
    "citationTitle": "Wikipedia: Paint It Black"
  },
  {
    "id": "c8cbbf1c-610b-49ac-9243-dec7dae33bcf",
    "text": "Complete this classic rock song title: 'Stairway to...' by Led Zeppelin",
    "options": [
      "Heaven",
      "Paradise",
      "Glory",
      "Eternity"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The complete title is 'Stairway to Heaven' by Led Zeppelin.",
    "detailedExplanation": "'Stairway to Heaven' is arguably Led Zeppelin's most famous song, released in 1971 on their fourth album. The eight-minute epic is frequently cited as one of the greatest rock songs of all time. Written by Jimmy Page and Robert Plant, it starts as a gentle acoustic ballad and builds to a powerful rock climax. The song has never been released as a single in its original form but remains one of the most requested songs in rock radio history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stairway_to_Heaven",
    "citationTitle": "Wikipedia: Stairway to Heaven"
  },
  {
    "id": "6fc3bd9b-e9bf-43f1-86d8-730af375b07c",
    "text": "Which artist recorded the hit song 'Sweet Child O' Mine' containing the lyric 'She's got eyes of the bluest skies'?",
    "options": [
      "Guns N' Roses",
      "Bon Jovi",
      "Def Leppard",
      "Poison"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The song is 'Sweet Child O' Mine' by Guns N' Roses.",
    "detailedExplanation": "'Sweet Child O' Mine' was Guns N' Roses' first number-one hit on the Billboard Hot 100, released in 1987 on their debut album 'Appetite for Destruction'. The song was written by the band members, with Axl Rose writing the lyrics about his then-girlfriend Erin Everly. The distinctive guitar riff by Slash is one of the most recognizable in rock music, and the song helped establish Guns N' Roses as major players in the late 1980s rock scene.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sweet_Child_o%27_Mine",
    "citationTitle": "Wikipedia: Sweet Child o' Mine"
  },
  {
    "id": "29c3373a-6787-4736-9be5-1a3f0a8cd28b",
    "text": "What word completes this Johnny Cash song title: 'Ring of...'?",
    "options": [
      "Fire",
      "Truth",
      "Steel",
      "Gold"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The complete title is 'Ring of Fire' by Johnny Cash.",
    "detailedExplanation": "'Ring of Fire' is one of Johnny Cash's most famous songs, recorded in 1963. The song was actually written by his future wife June Carter Cash and Merle Kilgore, inspired by June's feelings about falling in love with Johnny while they were both married to other people. The song features a distinctive mariachi-style trumpet arrangement, which was Cash's idea. It became his biggest hit, reaching number one on the country charts and crossing over to mainstream success, becoming a signature song that defined his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ring_of_Fire_(song)",
    "citationTitle": "Wikipedia: Ring of Fire (song)"
  }
]