[
  {
    "id": "58683e07-a33f-4aa8-8b82-574077c9d95f",
    "text": "Which song contains the famous lyric 'Is this the real life? Is this just fantasy?'?",
    "options": [
      "Bohemian Rhapsody by Queen",
      "Stairway to Heaven by Led Zeppelin",
      "Hotel California by Eagles",
      "Sweet Child O' Mine by Guns N' Roses"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "These are the opening lyrics to Queen's epic 'Bohemian Rhapsody'.",
    "detailedExplanation": "Written by Freddie Mercury, 'Bohemian Rhapsody' opens with these philosophical questioning lyrics that set the tone for the song's operatic and theatrical journey. The song, released in 1975, is famous for its unique structure combining ballad, opera, and hard rock sections, and these opening lines have become some of the most recognizable in rock history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bohemian_Rhapsody",
    "citationTitle": "Wikipedia: Bohemian Rhapsody"
  },
  {
    "id": "b0e0387d-7876-4b1e-9796-723b26bf31a0",
    "text": "What does 'S.O.S.' stand for in the ABBA song title?",
    "options": [
      "Save Our Souls",
      "Same Old Story",
      "Song of Sorrow",
      "It doesn't stand for anything specific"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "According to ABBA, 'S.O.S.' doesn't represent any specific phrase - they liked the distress signal connotation for the song about a troubled relationship.",
    "detailedExplanation": "While S.O.S. is commonly known as a maritime distress signal (often thought to mean 'Save Our Ship' or 'Save Our Souls'), ABBA's Björn Ulvaeus and Benny Andersson have stated that in their 1975 hit song, the letters don't stand for any particular phrase. They chose 'S.O.S.' because the distress signal concept fit the song's theme of a relationship in trouble, making it a metaphorical cry for help.",
    "citationUrl": "https://en.wikipedia.org/wiki/S.O.S._(ABBA_song)",
    "citationTitle": "Wikipedia: S.O.S. (ABBA song)"
  },
  {
    "id": "41d595a2-3193-4eb2-9049-1b141c6aa2e1",
    "text": "In Don McLean's 'American Pie', what event is referred to as 'the day the music died'?",
    "options": [
      "The death of Elvis Presley",
      "The plane crash that killed Buddy Holly, Ritchie Valens, and J.P. Richardson",
      "The breakup of The Beatles",
      "The assassination of John Lennon"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'The day the music died' refers to February 3, 1959, when a plane crash killed rock and roll pioneers Buddy Holly, Ritchie Valens, and J.P. 'The Big Bopper' Richardson.",
    "detailedExplanation": "Don McLean's 1971 epic 'American Pie' uses the phrase 'the day the music died' to commemorate the tragic plane crash near Clear Lake, Iowa, on February 3, 1959. The crash killed three major early rock and roll stars: Buddy Holly, Ritchie Valens, and J.P. 'The Big Bopper' Richardson. McLean was a paperboy at the time and learned about the tragedy while delivering newspapers, which deeply affected him and later inspired this landmark song about the loss of innocence in American culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Day_the_Music_Died",
    "citationTitle": "Wikipedia: The Day the Music Died"
  },
  {
    "id": "7a33aba5-2f77-46a4-996f-9ab3b9643435",
    "text": "Which Beatles song contains the lyric 'Yesterday, all my troubles seemed so far away'?",
    "options": [
      "Help!",
      "Let It Be",
      "Hey Jude",
      "Yesterday"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "These are the opening lyrics to The Beatles' ballad 'Yesterday', written by Paul McCartney.",
    "detailedExplanation": "'Yesterday' was written by Paul McCartney and released in 1965. It's notable for being one of the most covered songs in music history and for being performed by McCartney alone with a string quartet, making it unusual among Beatles recordings. The melody reportedly came to McCartney in a dream, and he initially used placeholder lyrics with the words 'Scrambled Eggs' before writing the final melancholic lyrics about lost love that begin with this famous line.",
    "citationUrl": "https://en.wikipedia.org/wiki/Yesterday_(Beatles_song)",
    "citationTitle": "Wikipedia: Yesterday (Beatles song)"
  },
  {
    "id": "c4f5f5e0-6bb2-4487-9cfd-dc898ec8621c",
    "text": "What nursery rhyme is referenced in Metallica's song 'Enter Sandman'?",
    "options": [
      "Rock-a-bye Baby",
      "Humpty Dumpty",
      "Now I Lay Me Down to Sleep",
      "Mary, Mary, Quite Contrary"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The song references the children's bedtime prayer 'Now I Lay Me Down to Sleep' with the lyrics 'Now I lay me down to sleep, pray the Lord my soul to keep'.",
    "detailedExplanation": "Metallica's 1991 hit 'Enter Sandman' incorporates lines from the traditional children's bedtime prayer 'Now I Lay Me Down to Sleep,' but twists them into a darker context about nightmares and childhood fears. The song's lyrics play with the contrast between innocent childhood bedtime rituals and the frightening dreams that can follow sleep. This juxtaposition of innocent prayer with sinister imagery helped make the song one of Metallica's most popular and recognizable tracks.",
    "citationUrl": "https://en.wikipedia.org/wiki/Enter_Sandman",
    "citationTitle": "Wikipedia: Enter Sandman"
  },
  {
    "id": "4f3edf94-a2e6-4328-84f8-6987a03e3bc7",
    "text": "Which song's title was inspired by a bathroom graffiti message that read 'Clapton is God'?",
    "options": [
      "Layla by Derek and the Dominos",
      "Tears in Heaven by Eric Clapton",
      "Wonderful Tonight by Eric Clapton",
      "White Room by Cream"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "'White Room' by Cream was partly inspired by the 'Clapton is God' graffiti, though the title specifically refers to the white room mentioned in the lyrics.",
    "detailedExplanation": "While 'Clapton is God' graffiti appearing on London walls in the 1960s became legendary and boosted Eric Clapton's reputation, 'White Room' by Cream (1968) drew inspiration from this cultural phenomenon alongside poet Pete Brown's lyrics about isolation and emptiness. The song's title refers to the metaphorical 'white room' described in the lyrics - a place of emptiness and waiting. The graffiti phenomenon reflected Clapton's guitar virtuosity during his time with Cream, helping cement his status as one of rock's greatest guitarists.",
    "citationUrl": "https://en.wikipedia.org/wiki/White_Room",
    "citationTitle": "Wikipedia: White Room"
  },
  {
    "id": "a1004f88-07a2-442f-babc-70c66c7e602c",
    "text": "What Shakespeare play inspired the Dire Straits song 'Romeo and Juliet'?",
    "options": [
      "Hamlet",
      "Romeo and Juliet",
      "Macbeth",
      "A Midsummer Night's Dream"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "The Dire Straits song 'Romeo and Juliet' draws its title and romantic themes from Shakespeare's tragic play of the same name.",
    "detailedExplanation": "Mark Knopfler wrote 'Romeo and Juliet' for Dire Straits' 1980 album 'Making Movies,' using Shakespeare's famous tragedy as inspiration for a modern love song about a relationship's end. While the song shares the title and some thematic elements with the play - particularly the idea of star-crossed lovers - Knopfler adapted the concept to tell a contemporary story of love lost, with lyrics that reference the Shakespearean characters while describing a very modern romantic situation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Romeo_and_Juliet_(Dire_Straits_song)",
    "citationTitle": "Wikipedia: Romeo and Juliet (Dire Straits song)"
  },
  {
    "id": "062f5db3-38c3-44f5-81b9-8d981c41832f",
    "text": "Which word appears in the title of hits by both Elvis Presley and UB40?",
    "options": [
      "Love",
      "Can't",
      "Red",
      "Blue"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "medium",
    "explanation": "Both artists had hits with 'Red' in the title: Elvis with 'Red Red Wine' and UB40 with their famous cover version of 'Red Red Wine'.",
    "detailedExplanation": "The song 'Red Red Wine' was originally written and recorded by Neil Diamond in 1967, but became much more famous through cover versions. Elvis Presley recorded a version, but the most successful interpretation came from British reggae/pop band UB40, whose 1983 version became a massive international hit, reaching number one in multiple countries. UB40's reggae-influenced arrangement transformed Diamond's folk-rock original into a completely different style, demonstrating how the same song can be successfully reinterpreted across genres.",
    "citationUrl": "https://en.wikipedia.org/wiki/Red_Red_Wine",
    "citationTitle": "Wikipedia: Red Red Wine"
  }
]