[
  {
    "id": "a1302e64-05f6-4269-b3b4-dd36890f2410",
    "text": "Which boxer was known as 'The Greatest' and famously said 'Float like a butterfly, sting like a bee'?",
    "options": [
      "Muhammad Ali",
      "Joe Frazier",
      "George Foreman",
      "Sonny Liston"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Muhammad Ali coined this famous phrase and was widely known as 'The Greatest'.",
    "detailedExplanation": "Muhammad Ali, born Cassius Clay, was one of the most famous heavyweight champions in boxing history. He was known for his charismatic personality, quick wit, and memorable catchphrases. 'Float like a butterfly, sting like a bee' became his signature saying, describing his graceful movement and powerful punching ability. Ali held the heavyweight title three times and became a global icon both inside and outside the ring.",
    "citationUrl": "https://en.wikipedia.org/wiki/Muhammad_Ali",
    "citationTitle": "Wikipedia: Muhammad Ali"
  },
  {
    "id": "691f0777-0353-47c1-ad8c-33a18b80040f",
    "text": "Mike Tyson became the youngest heavyweight champion in history at what age?",
    "options": [
      "18 years old",
      "20 years old",
      "22 years old",
      "24 years old"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Mike Tyson won the WBC heavyweight title at age 20 years, 4 months, and 22 days old in 1986.",
    "detailedExplanation": "Mike Tyson made boxing history on November 22, 1986, when he defeated Trevor Berbick to win the WBC heavyweight championship at just 20 years, 4 months, and 22 days old. This made him the youngest heavyweight champion in boxing history, a record that still stands today. Tyson's explosive power and intimidating presence in the ring made him one of the most feared fighters of his era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mike_Tyson",
    "citationTitle": "Wikipedia: Mike Tyson"
  },
  {
    "id": "d0fc6506-6b2b-4eb0-8ae8-b90acca168f9",
    "text": "Which female boxer is widely considered one of the greatest of all time and held titles in multiple weight classes?",
    "options": [
      "Ronda Rousey",
      "Laila Ali",
      "Claressa Shields",
      "Katie Taylor"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Laila Ali, daughter of Muhammad Ali, retired undefeated with titles in multiple weight divisions.",
    "detailedExplanation": "Laila Ali, the daughter of Muhammad Ali, carved out her own legendary career in women's boxing. She retired undefeated with a record of 24-0, holding the WBC, WIBA, IWBF, and IWBA female super middleweight titles, and the WIBA light heavyweight title. Her combination of skill, power, and famous bloodline made her a major draw in women's boxing and helped elevate the sport's profile during her active years from 1999 to 2007.",
    "citationUrl": "https://en.wikipedia.org/wiki/Laila_Ali",
    "citationTitle": "Wikipedia: Laila Ali"
  },
  {
    "id": "efe40cdc-3ed7-4224-8d18-0ddad1c57920",
    "text": "Rocky Marciano is famous for being the only heavyweight champion to do what?",
    "options": [
      "Fight past age 50",
      "Retire undefeated",
      "Win by knockout in every fight",
      "Hold the title for 10 years"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Rocky Marciano retired with a perfect 49-0 record, the only heavyweight champion to retire undefeated.",
    "detailedExplanation": "Rocky Marciano holds one of boxing's most remarkable records - he is the only heavyweight champion in boxing history to retire with a perfect professional record. Marciano finished his career with 49 wins and 0 losses, with 43 of those victories coming by knockout. He held the heavyweight title from 1952 to 1956 and decided to retire at the peak of his career rather than risk his perfect record, making him a unique figure in boxing history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rocky_Marciano",
    "citationTitle": "Wikipedia: Rocky Marciano"
  },
  {
    "id": "25dd0097-7b51-43cb-814c-bc126ac4e669",
    "text": "Which boxer was known as 'The Brown Bomber' and dominated the heavyweight division in the 1930s and 1940s?",
    "options": [
      "Jack Dempsey",
      "Joe Louis",
      "Max Schmeling",
      "Jersey Joe Walcott"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Joe Louis was nicknamed 'The Brown Bomber' and held the heavyweight title for nearly 12 years.",
    "detailedExplanation": "Joe Louis, known as 'The Brown Bomber', was one of the greatest heavyweight champions in boxing history. He held the heavyweight title from 1937 to 1949, making 25 successful title defenses - a record that stood for decades. Louis became a national hero, particularly after his victories over German boxer Max Schmeling, which took on symbolic importance during World War II. His reign of nearly 12 years remains one of the longest in heavyweight history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Louis",
    "citationTitle": "Wikipedia: Joe Louis"
  },
  {
    "id": "0f159a57-1c84-4d48-bdee-6b5136f6fccb",
    "text": "Floyd Mayweather Jr. retired with what professional boxing record?",
    "options": [
      "49-0",
      "50-0",
      "48-1",
      "51-0"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Floyd Mayweather Jr. retired with a perfect 50-0 record after defeating Conor McGregor in 2017.",
    "detailedExplanation": "Floyd Mayweather Jr. retired from professional boxing with a perfect 50-0 record, cementing his legacy as one of the greatest defensive fighters in boxing history. His 50th and final victory came against UFC star Conor McGregor in August 2017, a highly publicized crossover bout. Mayweather won world titles in five different weight classes and was known for his exceptional defensive skills, ring IQ, and ability to adapt to any opponent's style throughout his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Floyd_Mayweather_Jr.",
    "citationTitle": "Wikipedia: Floyd Mayweather Jr."
  },
  {
    "id": "32beb784-c3ff-45e0-a893-a91279ff59e8",
    "text": "Which British heavyweight became a two-time world champion and is known for his comeback victory against Deontay Wilder?",
    "options": [
      "Anthony Joshua",
      "Tyson Fury",
      "David Haye",
      "Lennox Lewis"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Tyson Fury defeated Deontay Wilder to become WBC heavyweight champion and is known for his remarkable comeback story.",
    "detailedExplanation": "Tyson Fury, 'The Gypsy King', made one of boxing's greatest comebacks when he returned from mental health struggles and weight gain to defeat Deontay Wilder for the WBC heavyweight title in February 2020. Fury had previously held the unified heavyweight titles after defeating Wladimir Klitschko in 2015, but vacated them due to personal issues. His trilogy with Wilder, including a dramatic draw in their first fight and two subsequent victories, established him as one of the premier heavyweights of the modern era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tyson_Fury",
    "citationTitle": "Wikipedia: Tyson Fury"
  },
  {
    "id": "8e2e3cdc-bef1-4f93-b10f-8061950fba5c",
    "text": "Sugar Ray Robinson is often cited as the greatest boxer pound-for-pound and primarily fought in which weight division?",
    "options": [
      "Lightweight",
      "Welterweight",
      "Middleweight",
      "Light Heavyweight"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Sugar Ray Robinson was primarily a welterweight champion, though he also won the middleweight title multiple times.",
    "detailedExplanation": "Sugar Ray Robinson is widely regarded as the greatest pound-for-pound boxer of all time. He began his championship career as a welterweight, holding that title from 1946 to 1951. Robinson then moved up to middleweight, where he won the title five separate times between 1951 and 1960. His combination of speed, power, and boxing IQ was unmatched, and he finished his career with a record of 173-19-6 with 108 knockouts. Many modern boxing experts and fellow fighters still consider him the greatest boxer who ever lived.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sugar_Ray_Robinson",
    "citationTitle": "Wikipedia: Sugar Ray Robinson"
  },
  {
    "id": "501f69bf-555a-4bb0-9cff-4068c0704c8e",
    "text": "Which boxing champion was known by the nickname 'Iron Mike'?",
    "options": [
      "Evander Holyfield",
      "Mike Tyson",
      "Michael Moorer",
      "Mike McCallum"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Mike Tyson was famously known as 'Iron Mike' due to his devastating punching power and intimidating presence in the ring.",
    "detailedExplanation": "Mike Tyson earned the nickname 'Iron Mike' early in his professional career due to his ferocious fighting style, incredible knockout power, and seemingly indestructible demeanor in the ring. The nickname perfectly captured his reputation as one of the most feared and physically imposing heavyweight boxers of all time, with his ability to end fights quickly and brutally.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mike_Tyson",
    "citationTitle": "Wikipedia: Mike Tyson"
  },
  {
    "id": "d03ac650-60c6-4c82-9fed-fed9f4dad21c",
    "text": "In which city did the famous 'Rumble in the Jungle' boxing match take place in 1974?",
    "options": [
      "Manila, Philippines",
      "Kinshasa, Zaire",
      "Las Vegas, USA",
      "London, England"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "The 'Rumble in the Jungle' between Muhammad Ali and George Foreman took place in Kinshasa, Zaire (now Democratic Republic of Congo) in 1974.",
    "detailedExplanation": "The 'Rumble in the Jungle' was held on October 30, 1974, in Kinshasa, the capital of Zaire (now the Democratic Republic of Congo). The fight was promoted by Don King and funded by Zairean President Mobutu Sese Seko as a way to promote his country. Muhammad Ali defeated the heavily favored George Foreman by knockout in the eighth round, using his famous 'rope-a-dope' strategy.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rumble_in_the_Jungle",
    "citationTitle": "Wikipedia: The Rumble in the Jungle"
  },
  {
    "id": "7dc1d20b-273f-47e4-81fc-5e64a872769f",
    "text": "Which boxer holds the record for the most knockouts in heavyweight championship fights?",
    "options": [
      "Joe Frazier",
      "George Foreman",
      "Sonny Liston",
      "Joe Louis"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Joe Louis holds the record with 23 knockouts in heavyweight championship fights during his legendary career.",
    "detailedExplanation": "Joe Louis, known as 'The Brown Bomber', achieved 23 knockouts in heavyweight championship fights, which remains a record to this day. During his reign as heavyweight champion from 1937 to 1949, Louis successfully defended his title 25 times, with the vast majority ending in knockouts. His devastating punching power and technical skill made him one of the most dominant champions in boxing history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Louis",
    "citationTitle": "Wikipedia: Joe Louis"
  },
  {
    "id": "3fbe7329-4d4b-44af-8ed6-98671991892c",
    "text": "What weight class did Oscar De La Hoya NOT win a world title in during his professional career?",
    "options": [
      "Super Featherweight",
      "Lightweight",
      "Welterweight",
      "Cruiserweight"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Oscar De La Hoya never competed at cruiserweight, as he won titles from super featherweight up to light middleweight but never moved up to the cruiserweight division.",
    "detailedExplanation": "Oscar De La Hoya, known as 'The Golden Boy', won world titles in six different weight classes during his career: super featherweight, lightweight, light welterweight, welterweight, light middleweight, and middleweight. However, he never competed at cruiserweight (200 lbs), as this would have required him to gain significant weight beyond his natural fighting range. His career spanned from 130 to 160 pounds.",
    "citationUrl": "https://en.wikipedia.org/wiki/Oscar_De_La_Hoya",
    "citationTitle": "Wikipedia: Oscar De La Hoya"
  },
  {
    "id": "f73d59e7-1659-42d4-859d-81d280d643d9",
    "text": "Which female boxer was the first woman to win world titles in four different weight classes?",
    "options": [
      "Laila Ali",
      "Regina Halmich",
      "Lucia Rijker",
      "Christy Martin"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Christy Martin was the first female boxer to win world championships in four different weight divisions during her pioneering career.",
    "detailedExplanation": "Christy Martin broke significant ground in women's boxing by becoming the first female boxer to win world titles in four different weight classes. She won championships at super lightweight, lightweight, welterweight, and light middleweight. Martin was instrumental in bringing women's boxing into the mainstream during the 1990s and paved the way for future generations of female boxers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christy_Martin",
    "citationTitle": "Wikipedia: Christy Martin"
  },
  {
    "id": "9d2539cc-fb64-4617-913b-3cfa6cdc0431",
    "text": "How many times did Evander Holyfield win the heavyweight championship during his career?",
    "options": [
      "Two times",
      "Three times",
      "Four times",
      "Five times"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Evander Holyfield won the heavyweight championship four times, making him one of only three boxers to achieve this feat.",
    "detailedExplanation": "Evander Holyfield captured the heavyweight championship four separate times during his illustrious career. He first won the title by defeating Buster Douglas in 1990, then regained it twice more in the 1990s after losing it, and finally won it a fourth time by defeating John Ruiz in 2000. This achievement places him among the elite company of only three boxers in history to win the heavyweight title four times.",
    "citationUrl": "https://en.wikipedia.org/wiki/Evander_Holyfield",
    "citationTitle": "Wikipedia: Evander Holyfield"
  },
  {
    "id": "5883ca49-762a-4e9b-af6c-fd9c4f539fd1",
    "text": "Which country was Manny Pacquiao representing when he won his world boxing titles?",
    "options": [
      "Indonesia",
      "Thailand",
      "Philippines",
      "Malaysia"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Manny Pacquiao represented the Philippines throughout his boxing career and became a national hero there.",
    "detailedExplanation": "Manny Pacquiao, known as 'PacMan', represented the Philippines throughout his entire professional boxing career. Born in Kibawe, Bukidnon, Philippines, Pacquiao became not only a boxing legend but also a national icon in his home country. He won world titles in eight different weight divisions while fighting under the Philippine flag, and his fights were massive events that would bring the entire country to a standstill.",
    "citationUrl": "https://en.wikipedia.org/wiki/Manny_Pacquiao",
    "citationTitle": "Wikipedia: Manny Pacquiao"
  },
  {
    "id": "98588f85-4cc4-4c9c-b5a8-57efac18b0ed",
    "text": "What unique distinction does Riddick Bowe hold among heavyweight champions?",
    "options": [
      "He never lost a professional fight",
      "He threw his WBC belt in a trash can",
      "He was the tallest heavyweight champion",
      "He had the fastest knockout in a title fight"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Riddick Bowe famously threw his WBC heavyweight belt in a trash can rather than fight mandatory challenger Lennox Lewis.",
    "detailedExplanation": "In 1992, after defeating Evander Holyfield to become the undisputed heavyweight champion, Riddick Bowe was ordered by the WBC to make a mandatory defense against Lennox Lewis. Rather than face Lewis, Bowe dramatically threw his WBC belt into a trash can at a press conference, choosing to give up the title instead of fighting the mandatory challenger. This bizarre incident became one of the most memorable moments in heavyweight boxing history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Riddick_Bowe",
    "citationTitle": "Wikipedia: Riddick Bowe"
  },
  {
    "id": "c120f19a-93eb-4ecd-8e43-799d46b950ef",
    "text": "Which boxing legend was known as 'Smokin' Joe' and fought in the famous trilogy with Muhammad Ali?",
    "options": [
      "Joe Frazier",
      "Joe Louis",
      "Jersey Joe Walcott",
      "Joe Calzaghe"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Joe Frazier was nicknamed 'Smokin' Joe' and had three legendary fights with Muhammad Ali.",
    "detailedExplanation": "Joe Frazier earned the nickname 'Smokin' Joe' for his aggressive, relentless fighting style and his ability to take punishment while dishing it out. He's best remembered for his trilogy of fights with Muhammad Ali, including their first encounter at Madison Square Garden in 1971 where Frazier handed Ali his first professional defeat. Frazier was the undisputed heavyweight champion from 1970 to 1973 and was known for his devastating left hook.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Frazier",
    "citationTitle": "Wikipedia: Joe Frazier"
  },
  {
    "id": "17e20188-3ec3-4651-9096-ec64d97d941f",
    "text": "Which Puerto Rican boxer was known as 'Macho Camacho' and was famous for his flamboyant personality?",
    "options": [
      "Felix Trinidad",
      "Hector Camacho",
      "Wilfredo Gomez",
      "Miguel Cotto"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Hector Camacho was nicknamed 'Macho Camacho' and was known for his colorful personality and showmanship.",
    "detailedExplanation": "Hector 'Macho' Camacho was a Puerto Rican professional boxer who competed from 1980 to 2010. He was known as much for his flamboyant entrances and colorful personality as he was for his boxing skills. Camacho won world championships in three weight classes and was particularly famous for his speed and defensive abilities. His nickname 'Macho Camacho' became synonymous with his larger-than-life persona both inside and outside the ring.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hector_Camacho",
    "citationTitle": "Wikipedia: Hector Camacho"
  },
  {
    "id": "9839f8a1-1b0c-4209-95ae-6e9a2157f59f",
    "text": "Which heavyweight champion was known as 'Big George' and made a famous comeback to win the title at age 45?",
    "options": [
      "George Chuvalo",
      "George Foreman",
      "Lennox Lewis",
      "Larry Holmes"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "George Foreman was nicknamed 'Big George' and became the oldest heavyweight champion when he won the title at age 45.",
    "detailedExplanation": "George Foreman, known as 'Big George,' made one of the most remarkable comebacks in boxing history. After retiring in 1977 following his loss to Jimmy Young, Foreman returned to boxing in 1987 at age 38. Seven years later, in 1994, he knocked out Michael Moorer to become the WBA and IBF heavyweight champion at age 45, making him the oldest heavyweight champion in boxing history. This incredible achievement came 20 years after he had first won the heavyweight title by defeating Joe Frazier in 1973.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Foreman",
    "citationTitle": "Wikipedia: George Foreman"
  },
  {
    "id": "ed6e9423-091f-4889-8e07-3c882ce75822",
    "text": "Which Mexican boxer was known as 'Hands of Stone' and had famous rivalries with Sugar Ray Leonard?",
    "options": [
      "Julio Cesar Chavez",
      "Roberto Duran",
      "Salvador Sanchez",
      "Marco Antonio Barrera"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "easy",
    "explanation": "Roberto Duran was nicknamed 'Hands of Stone' and had multiple memorable fights with Sugar Ray Leonard.",
    "detailedExplanation": "Roberto Duran, nicknamed 'Manos de Piedra' (Hands of Stone), was a Panamanian boxer who competed from 1968 to 2001. He's widely regarded as one of the greatest boxers of all time and held world championships in four weight classes. Duran is perhaps best known for his series of fights with Sugar Ray Leonard, including their first bout in 1980 where he defeated Leonard, and the infamous 'No Mas' rematch later that year where Duran quit in the eighth round, saying 'no more' to the referee.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roberto_Dur%C3%A1n",
    "citationTitle": "Wikipedia: Roberto Durán"
  }
]