[
  {
    "id": "f87cd10b-e71b-4d85-81b3-02c7fd085085",
    "text": "Who holds the record for the most heavyweight title defenses in boxing history?",
    "options": [
      "Joe Louis",
      "Muhammad Ali",
      "Larry Holmes",
      "Wladimir Klitschko"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Joe Louis defended his heavyweight title 25 times between 1937 and 1949.",
    "detailedExplanation": "Joe Louis, known as the 'Brown Bomber,' held the heavyweight championship for nearly 12 years from 1937 to 1949, successfully defending his title 25 times. This record has never been broken and remains one of the most impressive achievements in boxing history. His reign included famous victories over Max Schmeling, Billy Conn, and many other top contenders of his era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Louis",
    "citationTitle": "Wikipedia: Joe Louis"
  },
  {
    "id": "aacc39fb-bc9f-4717-b65e-73ab72ecdb46",
    "text": "Which boxer was the first to defeat Sugar Ray Robinson in his professional career?",
    "options": [
      "Jake LaMotta",
      "Randy Turpin",
      "Gene Fullmer",
      "Carmen Basilio"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jake LaMotta defeated Sugar Ray Robinson on February 5, 1943, ending Robinson's 40-fight winning streak.",
    "detailedExplanation": "Jake LaMotta, nicknamed 'The Bronx Bull,' handed Sugar Ray Robinson his first professional defeat on February 5, 1943, at Olympia Stadium in Detroit. Robinson had started his professional career with 40 consecutive wins before LaMotta's upset victory. The two fighters would go on to have one of boxing's greatest rivalries, fighting six times total, with Robinson winning five of their encounters.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jake_LaMotta",
    "citationTitle": "Wikipedia: Jake LaMotta"
  },
  {
    "id": "2c9d5be0-64a8-476b-a341-5bdb246707c7",
    "text": "Who was the youngest boxer to win a world heavyweight championship?",
    "options": [
      "Mike Tyson",
      "Floyd Patterson",
      "Michael Spinks",
      "Evander Holyfield"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Mike Tyson won the WBC heavyweight title at age 20 years, 4 months, and 22 days in 1986.",
    "detailedExplanation": "Mike Tyson became the youngest heavyweight champion in boxing history when he defeated Trevor Berbick for the WBC heavyweight title on November 22, 1986, at the age of 20 years, 4 months, and 22 days. Tyson's explosive power and intimidating presence made him a dominant force in the heavyweight division during the late 1980s, and this record still stands today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mike_Tyson",
    "citationTitle": "Wikipedia: Mike Tyson"
  },
  {
    "id": "589709e2-47b5-452d-9ed3-76effbcb8713",
    "text": "Which female boxer was the first woman to be inducted into the International Boxing Hall of Fame?",
    "options": [
      "Laila Ali",
      "Christy Martin",
      "Jacqui Frazier-Lyde",
      "Regina Halmich"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Christy Martin was inducted into the International Boxing Hall of Fame in 2020 as the first female boxer.",
    "detailedExplanation": "Christy Martin, known as 'The Coal Miner's Daughter,' broke significant ground for women's boxing and became the first female boxer inducted into the International Boxing Hall of Fame in 2020. Martin compiled a record of 49-7-3 during her career and was instrumental in bringing mainstream attention to women's professional boxing in the 1990s and early 2000s, appearing on numerous high-profile pay-per-view cards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christy_Martin",
    "citationTitle": "Wikipedia: Christy Martin"
  },
  {
    "id": "42b4753c-9689-44ad-bc80-02754caa252b",
    "text": "Who is the only boxer to have defeated both Muhammad Ali and Joe Frazier?",
    "options": [
      "George Foreman",
      "Ken Norton",
      "Leon Spinks",
      "Larry Holmes"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "George Foreman defeated both Ali (before losing to him later) and Joe Frazier during his career.",
    "detailedExplanation": "George Foreman accomplished the rare feat of defeating both Muhammad Ali and Joe Frazier during his boxing career. Foreman knocked out Joe Frazier in 1973 to win the heavyweight title, and later defeated Muhammad Ali in their 1974 'Rumble in the Jungle' fight in Zaire (though Ali won their rematch). This makes Foreman one of the most accomplished heavyweight champions, having victories over two of the greatest fighters of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Foreman",
    "citationTitle": "Wikipedia: George Foreman"
  },
  {
    "id": "4aa4bdb8-f771-4427-a7ef-b59002db842c",
    "text": "Which boxer holds the record for the most knockouts in professional boxing history?",
    "options": [
      "Archie Moore",
      "Young Stribling",
      "Billy Bird",
      "Sam Langford"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Archie Moore recorded 131 knockouts during his professional career, the most in boxing history.",
    "detailedExplanation": "Archie Moore, known as 'The Old Mongoose,' holds the official record for most knockouts in professional boxing with 131 KOs during his lengthy career from 1935 to 1963. Moore was primarily a light heavyweight champion but also fought as a heavyweight. His incredible punching power and longevity in the sport allowed him to accumulate this remarkable knockout total over nearly three decades of professional boxing.",
    "citationUrl": "https://en.wikipedia.org/wiki/Archie_Moore",
    "citationTitle": "Wikipedia: Archie Moore"
  },
  {
    "id": "f01b491e-af01-4745-8bbc-195134cecc0c",
    "text": "Who was the first boxer to regain the heavyweight championship after losing it?",
    "options": [
      "Floyd Patterson",
      "Muhammad Ali",
      "Jersey Joe Walcott",
      "Ezzard Charles"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Floyd Patterson regained the heavyweight title by defeating Ingemar Johansson in 1960.",
    "detailedExplanation": "Floyd Patterson made boxing history in 1960 when he became the first heavyweight champion to regain his title after losing it. Patterson had lost the championship to Sweden's Ingemar Johansson in 1959, but won it back exactly one year later with a fifth-round knockout in their rematch at the Polo Grounds in New York. This achievement broke new ground in heavyweight boxing, as no previous heavyweight champion had successfully reclaimed their title.",
    "citationUrl": "https://en.wikipedia.org/wiki/Floyd_Patterson",
    "citationTitle": "Wikipedia: Floyd Patterson"
  },
  {
    "id": "1d04e381-453b-49e8-a14a-f97557a83e2f",
    "text": "Which boxer was known as 'The Galveston Giant' and became the first African American heavyweight champion?",
    "options": [
      "Sam Langford",
      "Jack Johnson",
      "Joe Jeanette",
      "Peter Jackson"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Jack Johnson, nicknamed 'The Galveston Giant,' became the first African American heavyweight champion in 1908.",
    "detailedExplanation": "Jack Johnson earned the nickname 'The Galveston Giant' due to his birthplace of Galveston, Texas, and his imposing presence in the ring. He became the first African American to win the world heavyweight championship when he defeated Tommy Burns in 1908 in Sydney, Australia. Johnson's victory was highly controversial at the time due to racial tensions, leading to the search for a 'Great White Hope' to defeat him. He held the title until 1915 and was a pivotal figure in both boxing and civil rights history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Jack_Johnson_(boxer)",
    "citationTitle": "Wikipedia: Jack Johnson (boxer)"
  },
  {
    "id": "fc12569b-4900-499d-8239-4cd6c902f5ad",
    "text": "Which boxer was stripped of his Olympic gold medal in 1988 due to a positive drug test, but later had it restored?",
    "options": [
      "Roy Jones Jr.",
      "Park Si-hun",
      "Riddick Bowe",
      "Lennox Lewis"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Roy Jones Jr. was stripped of his silver medal and awarded gold 29 years later after his opponent tested positive for steroids.",
    "detailedExplanation": "Roy Jones Jr. lost a controversial decision to South Korea's Park Si-hun in the 1988 Seoul Olympics light middleweight final, receiving the silver medal. However, in 2017, nearly three decades later, Jones was awarded the gold medal after it was revealed that Park had tested positive for performance-enhancing drugs. The International Olympic Committee officially recognized Jones as the rightful champion, making this one of the most delayed justice cases in Olympic boxing history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roy_Jones_Jr.",
    "citationTitle": "Wikipedia: Roy Jones Jr."
  },
  {
    "id": "d9e1107b-e4c1-4c28-9a0d-435078835f50",
    "text": "Which boxer holds the record for the longest professional boxing career, spanning over 30 years?",
    "options": [
      "Archie Moore",
      "George Foreman",
      "Bernard Hopkins",
      "Roberto Duran"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Bernard Hopkins fought professionally for 32 years, from 1988 to 2016, retiring at age 51.",
    "detailedExplanation": "Bernard Hopkins, known as 'The Executioner,' holds the record for the longest professional boxing career at 32 years (1988-2016). He became the oldest boxer to win a major world championship when he defeated Jean Pascal at age 46 in 2011. Hopkins was known for his exceptional defensive skills and ring intelligence, which allowed him to compete at the highest level well into his 50s. His longevity record surpasses even legends like Archie Moore and George Foreman.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bernard_Hopkins",
    "citationTitle": "Wikipedia: Bernard Hopkins"
  },
  {
    "id": "c560a562-2c89-433f-9116-d6769ae7959e",
    "text": "Which boxer was the first to win world titles in eight different weight divisions?",
    "options": [
      "Sugar Ray Leonard",
      "Thomas Hearns",
      "Manny Pacquiao",
      "Oscar De La Hoya"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Manny Pacquiao was the first boxer to win major world titles in eight different weight classes.",
    "detailedExplanation": "Manny Pacquiao made boxing history by becoming the first fighter to win major world titles in eight different weight divisions, spanning from flyweight (112 lbs) to super welterweight (154 lbs). His divisions included flyweight, super bantamweight, featherweight, super featherweight, lightweight, welterweight, light middleweight, and middleweight. This unprecedented achievement showcased his exceptional ability to maintain power and skill while moving up in weight, earning him recognition as one of the greatest pound-for-pound fighters of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Manny_Pacquiao",
    "citationTitle": "Wikipedia: Manny Pacquiao"
  },
  {
    "id": "1b607f5f-ad5e-4756-aa5e-0ce26d0eb013",
    "text": "Which boxer was known as 'The Brown Bomber' and held the heavyweight title for nearly 12 years?",
    "options": [
      "Ezzard Charles",
      "Jersey Joe Walcott",
      "Joe Louis",
      "Rocky Marciano"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Joe Louis, nicknamed 'The Brown Bomber,' held the heavyweight championship from 1937 to 1949.",
    "detailedExplanation": "Joe Louis, known as 'The Brown Bomber,' dominated the heavyweight division from June 1937 to March 1949, holding the title for 11 years and 8 months. During his reign, he made 25 successful title defenses, which stood as a record until surpassed decades later. Louis became a cultural icon and helped break down racial barriers in sports. His fights against German boxer Max Schmeling became symbolic of the broader struggle against fascism, particularly his 1938 rematch victory that lasted just over two minutes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Louis",
    "citationTitle": "Wikipedia: Joe Louis"
  },
  {
    "id": "dc6725a9-99be-41ff-82d2-7786a15b7662",
    "text": "Which boxer retired undefeated as a professional with a perfect 49-0 record?",
    "options": [
      "Floyd Mayweather Jr.",
      "Rocky Marciano",
      "Willie Pep",
      "Ricardo Lopez"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Rocky Marciano retired in 1956 with a perfect professional record of 49 wins and 0 losses.",
    "detailedExplanation": "Rocky Marciano remains the only heavyweight champion in boxing history to retire with a perfect professional record, finishing his career at 49-0 with 43 knockouts. He held the heavyweight title from 1952 to 1956, successfully defending it six times. Marciano was known for his incredible punching power, relentless pressure, and granite chin. His perfect record has never been matched by another heavyweight champion, making him a unique figure in boxing history. He retired at age 31 at the peak of his career.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rocky_Marciano",
    "citationTitle": "Wikipedia: Rocky Marciano"
  },
  {
    "id": "4e464716-813a-4006-bfa0-5f0c74afa224",
    "text": "Which boxer became the undisputed heavyweight champion by defeating Riddick Bowe, Evander Holyfield, and Mike Tyson?",
    "options": [
      "Lennox Lewis",
      "Vitali Klitschko",
      "David Haye",
      "Shannon Briggs"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Lennox Lewis defeated all three champions to become the last undisputed heavyweight champion of the 20th century.",
    "detailedExplanation": "Lennox Lewis became the last undisputed heavyweight champion of the 20th century by defeating the era's top heavyweights. He knocked out Riddick Bowe in 1995 (though this was actually Oliver McCall who beat Bowe, then Lewis beat McCall), defeated Evander Holyfield in their 1999 rematch after a controversial draw, and knocked out Mike Tyson in 2002. Lewis unified the WBA, WBC, and IBF heavyweight titles, making him the first British-born boxer to hold the undisputed heavyweight championship since Bob Fitzsimmons in 1897.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lennox_Lewis",
    "citationTitle": "Wikipedia: Lennox Lewis"
  },
  {
    "id": "948f0a46-f907-4b70-9a1a-3769d9d79670",
    "text": "Which female boxer was the first woman to headline a pay-per-view boxing event?",
    "options": [
      "Laila Ali",
      "Christy Martin",
      "Lucia Rijker",
      "Ann Wolfe"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Christy Martin was the first woman to headline a pay-per-view boxing event in 1996.",
    "detailedExplanation": "Christy Martin broke significant ground for women's boxing when she became the first woman to headline a pay-per-view boxing event in 1996. Known as 'The Coal Miner's Daughter,' Martin brought mainstream attention to women's boxing through her aggressive fighting style and marketability. She appeared on the cover of Sports Illustrated and helped legitimize women's professional boxing during the 1990s. Her pioneering role opened doors for future generations of female boxers and helped establish women's boxing as a commercially viable sport.",
    "citationUrl": "https://en.wikipedia.org/wiki/Christy_Martin",
    "citationTitle": "Wikipedia: Christy Martin"
  },
  {
    "id": "19403620-0c7c-46de-9a90-969e184fbea9",
    "text": "Which boxer was known as 'Hands of Stone' and won world titles in four different weight classes?",
    "options": [
      "Wilfred Benitez",
      "Roberto Duran",
      "Alexis Arguello",
      "Julio Cesar Chavez"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Roberto Duran, nicknamed 'Hands of Stone,' won world championships in lightweight, welterweight, junior middleweight, and middleweight divisions.",
    "detailedExplanation": "Roberto Duran, known as 'Manos de Piedra' (Hands of Stone), was a Panamanian boxing legend who won world titles in four different weight classes during his career spanning five decades. He captured championships at lightweight (1972-1979), welterweight (1980), junior middleweight (1983-1984), and middleweight (1989). Duran was particularly dominant as a lightweight, where he made 12 successful title defenses. His legendary career included famous victories over Sugar Ray Leonard and Carlos Palomino, and he's widely regarded as one of the greatest pound-for-pound fighters in boxing history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roberto_Dur%C3%A1n",
    "citationTitle": "Wikipedia: Roberto Durán"
  },
  {
    "id": "ffc213a4-96f7-4815-917b-a4fd182061d3",
    "text": "Which boxer was the first to win world championships in five different weight divisions, earning the nickname 'Sugar' for his sweet boxing style?",
    "options": [
      "Sugar Ray Leonard",
      "Sugar Ray Robinson",
      "Thomas Hearns",
      "Roberto Duran"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Sugar Ray Robinson was the first boxer to win titles in five weight divisions and was nicknamed 'Sugar' for his smooth fighting style.",
    "detailedExplanation": "Sugar Ray Robinson, born Walker Smith Jr., was a legendary boxer who revolutionized the sport by winning world championships in five different weight divisions: welterweight, junior middleweight, and middleweight (three times). He earned his famous nickname 'Sugar' due to his sweet, fluid boxing style that combined speed, power, and technical brilliance. Robinson's career spanned from 1940 to 1965, and he is widely considered one of the greatest pound-for-pound boxers in history, paving the way for future multi-division champions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sugar_Ray_Robinson",
    "citationTitle": "Wikipedia: Sugar Ray Robinson"
  },
  {
    "id": "e042392b-9085-43e7-845b-023db2ba1797",
    "text": "Which heavyweight boxing champion was known for his unique peek-a-boo fighting style and was trained by Cus D'Amato?",
    "options": [
      "Larry Holmes",
      "Mike Tyson",
      "Ken Norton",
      "Floyd Patterson"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Mike Tyson was famous for his peek-a-boo style under trainer Cus D'Amato, though Floyd Patterson also used this style earlier.",
    "detailedExplanation": "Mike Tyson became synonymous with the peek-a-boo fighting style, which was developed and refined by legendary trainer Cus D'Amato. This defensive technique involved holding the gloves close to the face, creating a 'peek-a-boo' effect while bobbing and weaving to avoid punches before exploding forward with devastating combinations. D'Amato first used this style with Floyd Patterson, but Tyson perfected it to become one of the most feared heavyweight champions in boxing history. The style maximized Tyson's natural speed and power while compensating for his relatively short reach compared to other heavyweights.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mike_Tyson",
    "citationTitle": "Wikipedia: Mike Tyson"
  },
  {
    "id": "5b94020e-0e9f-4881-b124-22b16cffbeee",
    "text": "Which British boxer became the first person to defeat Floyd Mayweather Jr. in a professional bout, ending Mayweather's perfect record?",
    "options": [
      "Amir Khan",
      "Ricky Hatton",
      "Carl Froch",
      "None - Mayweather retired undefeated"
    ],
    "correctIndex": 3,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Floyd Mayweather Jr. retired with a perfect 50-0 professional record, never losing a professional bout.",
    "detailedExplanation": "Floyd Mayweather Jr. retired from professional boxing with an unprecedented 50-0 record, making him one of only a few boxers in history to retire completely undefeated. Throughout his career from 1996 to 2017, Mayweather faced numerous top-level opponents including British fighters like Ricky Hatton, but his defensive mastery and counter-punching ability kept him unbeaten. His perfect record includes victories over legendary names like Oscar De La Hoya, Manny Pacquiao, and Canelo Alvarez. This achievement places him alongside Rocky Marciano as one of the few champions to retire without a single professional loss.",
    "citationUrl": "https://en.wikipedia.org/wiki/Floyd_Mayweather_Jr.",
    "citationTitle": "Wikipedia: Floyd Mayweather Jr."
  },
  {
    "id": "5c903822-9fc8-4e7a-82a0-9c98e241defe",
    "text": "Which boxer's famous 'Rumble in the Jungle' victory was achieved using the 'rope-a-dope' strategy against a heavily favored opponent?",
    "options": [
      "Joe Frazier",
      "Muhammad Ali",
      "George Foreman",
      "Ken Norton"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "hard",
    "explanation": "Muhammad Ali used the rope-a-dope strategy to defeat heavily favored George Foreman in the 1974 'Rumble in the Jungle' in Zaire.",
    "detailedExplanation": "The 'Rumble in the Jungle' took place on October 30, 1974, in Kinshasa, Zaire (now Democratic Republic of Congo), where Muhammad Ali faced the seemingly unstoppable George Foreman for the heavyweight championship. Ali employed his famous 'rope-a-dope' strategy, leaning against the ropes and allowing Foreman to tire himself out throwing powerful but largely ineffective punches. In the eighth round, after Foreman had exhausted himself, Ali unleashed a combination that sent the champion to the canvas, regaining his heavyweight title in one of boxing's most strategic and memorable victories.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Rumble_in_the_Jungle",
    "citationTitle": "Wikipedia: The Rumble in the Jungle"
  }
]