[
  {
    "id": "8455670b-a4a8-4159-8e4e-c4988afbd6b2",
    "text": "Which heavyweight boxer was known as 'The Greatest' and famously said 'Float like a butterfly, sting like a bee'?",
    "options": [
      "Joe Frazier",
      "Muhammad Ali",
      "George Foreman",
      "Sonny Liston"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Muhammad Ali was known as 'The Greatest' and coined this famous phrase.",
    "detailedExplanation": "Muhammad Ali, born Cassius Clay, was a three-time heavyweight champion who became famous not only for his boxing skills but also for his charismatic personality and memorable quotes. His famous phrase 'Float like a butterfly, sting like a bee' perfectly captured his unique fighting style that combined graceful movement with powerful punching. Ali's impact extended far beyond boxing, as he became a cultural icon and activist.",
    "citationUrl": "https://en.wikipedia.org/wiki/Muhammad_Ali",
    "citationTitle": "Wikipedia: Muhammad Ali"
  },
  {
    "id": "4959d057-eca4-418e-af15-1afb5d160c48",
    "text": "At what age did Mike Tyson become the youngest heavyweight champion in boxing history?",
    "options": [
      "19 years old",
      "20 years old",
      "21 years old",
      "22 years old"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Mike Tyson became heavyweight champion at 20 years, 4 months, and 22 days old.",
    "detailedExplanation": "Mike Tyson made boxing history on November 22, 1986, when he defeated Trevor Berbick to win the WBC heavyweight title at just 20 years, 4 months, and 22 days old. This record still stands today, making him the youngest boxer ever to win a heavyweight championship. Tyson's explosive power and aggressive fighting style, combined with his young age, made him a fearsome opponent and global sensation in the late 1980s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mike_Tyson",
    "citationTitle": "Wikipedia: Mike Tyson"
  },
  {
    "id": "9604b12b-1956-4602-bb27-71da9047d55f",
    "text": "Which boxer holds the record for the most heavyweight title defenses with 25 successful defenses?",
    "options": [
      "Muhammad Ali",
      "Joe Louis",
      "Larry Holmes",
      "Lennox Lewis"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Joe Louis successfully defended his heavyweight title 25 times during his reign from 1937 to 1949.",
    "detailedExplanation": "Joe Louis, known as the 'Brown Bomber,' held the heavyweight championship for nearly 12 years from 1937 to 1949, the longest reign in heavyweight history. During this time, he made 25 successful title defenses, a record that still stands today. Louis was not only a dominant fighter but also broke racial barriers and became a symbol of American strength during World War II. His technical skill, powerful punching, and consistent performance made him one of the greatest heavyweights of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Louis",
    "citationTitle": "Wikipedia: Joe Louis"
  },
  {
    "id": "32a579f8-8f28-4203-a010-1b5a9c054112",
    "text": "Which female boxer was known as 'The Coal Miner's Daughter' and was portrayed by Hilary Swank in a 2004 film?",
    "options": [
      "Laila Ali",
      "Christy Martin",
      "Maggie Fitzgerald",
      "Lucia Rijker"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Maggie Fitzgerald was the fictional character in 'Million Dollar Baby' portrayed by Hilary Swank.",
    "detailedExplanation": "While Maggie Fitzgerald was a fictional character in the 2004 film 'Million Dollar Baby,' the movie brought significant attention to women's boxing. The character was partially inspired by real female boxers, including Katie Dallam. Hilary Swank's portrayal earned her an Academy Award for Best Actress. The film, directed by Clint Eastwood, explored themes of determination, mentorship, and the challenges faced by female boxers in a male-dominated sport.",
    "citationUrl": "https://en.wikipedia.org/wiki/Million_Dollar_Baby",
    "citationTitle": "Wikipedia: Million Dollar Baby"
  },
  {
    "id": "d2558de0-cd86-4adb-af95-cd7e57bc119f",
    "text": "Which boxer was known as 'Sugar Ray' and held world titles in five different weight divisions?",
    "options": [
      "Ray Robinson",
      "Ray Leonard",
      "Ray Mancini",
      "Ray Mercer"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Sugar Ray Leonard won world titles in five weight divisions during his career.",
    "detailedExplanation": "Sugar Ray Leonard, named after the legendary Sugar Ray Robinson, was one of boxing's most versatile champions. He won world titles in five different weight divisions: welterweight, junior middleweight, middleweight, super middleweight, and light heavyweight. Leonard was part of the golden era of boxing in the 1980s, participating in memorable fights against Roberto Durán, Thomas Hearns, and Marvin Hagler. His technical skill, speed, and ability to adapt to different weight classes made him one of the greatest pound-for-pound fighters in history.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sugar_Ray_Leonard",
    "citationTitle": "Wikipedia: Sugar Ray Leonard"
  },
  {
    "id": "e7dd58b0-e624-479e-a7c3-847a6f9ee437",
    "text": "Which heavyweight champion was known for his devastating left hook and defeated Muhammad Ali in the 'Fight of the Century' in 1971?",
    "options": [
      "George Foreman",
      "Joe Frazier",
      "Ken Norton",
      "Leon Spinks"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Joe Frazier defeated Muhammad Ali in their first encounter at Madison Square Garden in 1971.",
    "detailedExplanation": "Joe Frazier, known as 'Smokin' Joe,' possessed one of the most feared left hooks in boxing history. On March 8, 1971, at Madison Square Garden, Frazier faced Muhammad Ali in what was billed as the 'Fight of the Century.' Both fighters were undefeated, and Frazier won by unanimous decision, knocking Ali down in the 15th round with his signature left hook. This victory was significant as it was Ali's first professional loss and proved Frazier's legitimacy as heavyweight champion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Frazier",
    "citationTitle": "Wikipedia: Joe Frazier"
  },
  {
    "id": "3f6b4d0b-100c-4c22-9b36-2b72271208c8",
    "text": "Which boxer was nicknamed 'The Hitman' and became undisputed welterweight champion in the 1980s?",
    "options": [
      "Tommy Hearns",
      "Roberto Durán",
      "Marvin Hagler",
      "Wilfred Benítez"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Tommy Hearns was known as 'The Hitman' and won the undisputed welterweight title.",
    "detailedExplanation": "Tommy Hearns, standing 6'1\" tall with an 78-inch reach, was nicknamed 'The Hitman' for his devastating punching power, particularly his right hand. He became the undisputed welterweight champion and was part of the 'Four Kings' of boxing in the 1980s, along with Sugar Ray Leonard, Roberto Durán, and Marvin Hagler. Hearns was the first boxer to win world titles in five different weight divisions, showcasing his versatility and longevity in the sport. His tall, lanky frame and aggressive style made him a fan favorite.",
    "citationUrl": "https://en.wikipedia.org/wiki/Thomas_Hearns",
    "citationTitle": "Wikipedia: Thomas Hearns"
  },
  {
    "id": "1a5ba147-d492-4b77-ba19-f25c82d4ca07",
    "text": "Which British heavyweight boxer was known as 'The Gypsy King' and defeated Deontay Wilder to win the WBC title in 2020?",
    "options": [
      "Anthony Joshua",
      "Tyson Fury",
      "Dillian Whyte",
      "Derek Chisora"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Tyson Fury, known as 'The Gypsy King,' defeated Deontay Wilder in their rematch in February 2020.",
    "detailedExplanation": "Tyson Fury, standing 6'9\" tall and known for his unorthodox fighting style and colorful personality, earned the nickname 'The Gypsy King' due to his Irish Traveller heritage. After their controversial draw in 2018, Fury dominated Deontay Wilder in their rematch on February 22, 2020, winning by TKO in the seventh round to claim the WBC heavyweight title. Fury's victory was remarkable given his previous battles with mental health issues and a comeback from near-retirement. His technical skills despite his size and his ability to move and box make him unique among modern heavyweights.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tyson_Fury",
    "citationTitle": "Wikipedia: Tyson Fury"
  },
  {
    "id": "b9c37c74-ba25-4072-917e-d4e9c4dd78ae",
    "text": "Which boxer was known as 'Hands of Stone' and famously said 'No mas' during his rematch with Sugar Ray Leonard?",
    "options": [
      "Roberto Duran",
      "Alexis Arguello",
      "Wilfredo Gomez",
      "Julio Cesar Chavez"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Roberto Duran was nicknamed 'Hands of Stone' and surrendered by saying 'No mas' (no more) in his 1980 rematch with Sugar Ray Leonard.",
    "detailedExplanation": "Roberto Duran, the legendary Panamanian boxer known as 'Manos de Piedra' (Hands of Stone), had one of the most shocking moments in boxing history during his November 1980 rematch with Sugar Ray Leonard. After defeating Leonard earlier that year to win the WBC welterweight title, Duran mysteriously quit in the eighth round of their rematch, reportedly saying 'No mas' (no more). This moment became one of boxing's most controversial and talked-about incidents, overshadowing Duran's incredible career achievements.",
    "citationUrl": "https://en.wikipedia.org/wiki/Roberto_Dur%C3%A1n",
    "citationTitle": "Wikipedia: Roberto Durán"
  },
  {
    "id": "12182c9c-0227-4519-91f7-6e2733f756ca",
    "text": "Which boxing weight class has a limit of 175 pounds (79.4 kg)?",
    "options": [
      "Light Heavyweight",
      "Super Middleweight",
      "Cruiserweight",
      "Middleweight"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Light Heavyweight division has an upper weight limit of 175 pounds (79.4 kg).",
    "detailedExplanation": "The Light Heavyweight division is one of boxing's traditional weight classes, with fighters weighing no more than 175 pounds (79.4 kg). This division has produced many legendary champions including Archie Moore, Bob Foster, and more recently, fighters like Roy Jones Jr. and Andre Ward. It sits between Super Middleweight (168 lbs) and Cruiserweight (200 lbs), making it a challenging division where fighters must balance power with speed and agility.",
    "citationUrl": "https://en.wikipedia.org/wiki/Light_heavyweight",
    "citationTitle": "Wikipedia: Light heavyweight"
  },
  {
    "id": "c34a24aa-fb6a-49b4-a88e-de351d38467d",
    "text": "Which Mexican boxer retired with a professional record of 107 wins and only 6 losses, earning him the nickname 'The Lion of Culiacan'?",
    "options": [
      "Julio Cesar Chavez",
      "Salvador Sanchez",
      "Ruben Olivares",
      "Carlos Zarate"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Julio Cesar Chavez Sr. finished his career with 107 wins and 6 losses, and was known as 'The Lion of Culiacan'.",
    "detailedExplanation": "Julio Cesar Chavez Sr. is widely regarded as one of the greatest Mexican boxers of all time. Known as 'El León de Culiacán' (The Lion of Culiacan), he compiled an extraordinary professional record of 107 wins, 6 losses, and 2 draws during his career from 1980 to 2005. Chavez held world titles in three different weight divisions and was undefeated for the first 87 fights of his career. His aggressive fighting style and incredible chin made him a fan favorite and cemented his status as a Mexican boxing legend.",
    "citationUrl": "https://en.wikipedia.org/wiki/Julio_C%C3%A9sar_Ch%C3%A1vez",
    "citationTitle": "Wikipedia: Julio César Chávez"
  },
  {
    "id": "63e6cf3d-031f-4741-ace2-d582b1b7bde0",
    "text": "Which venue in New York City is famously known as 'The Mecca of Boxing'?",
    "options": [
      "Madison Square Garden",
      "Yankee Stadium",
      "Barclays Center",
      "Radio City Music Hall"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Madison Square Garden is known as 'The Mecca of Boxing' due to its long history of hosting major championship fights.",
    "detailedExplanation": "Madison Square Garden in New York City has earned the nickname 'The Mecca of Boxing' through its rich history of hosting some of the sport's most memorable fights. Since the 1920s, MSG has been the site of countless championship bouts featuring legends like Joe Frazier, Muhammad Ali, Sugar Ray Robinson, and many others. The venue's intimate atmosphere and prestigious reputation have made it the most coveted location for major boxing events, with fighters considering a main event at MSG as the pinnacle of their careers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Madison_Square_Garden",
    "citationTitle": "Wikipedia: Madison Square Garden"
  },
  {
    "id": "adebf90c-e337-4093-9c3c-d171b8484fa6",
    "text": "Which organization was the first to sanction professional boxing matches and establish unified rules in 1867?",
    "options": [
      "Marquess of Queensberry Rules",
      "London Prize Ring Rules",
      "Broughton's Rules",
      "International Boxing Federation"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "The Marquess of Queensberry Rules, established in 1867, were the first modern boxing rules that required gloves and established rounds.",
    "detailedExplanation": "The Marquess of Queensberry Rules, drafted in 1867 by John Chambers and endorsed by the 9th Marquess of Queensberry, revolutionized boxing by establishing the modern framework for the sport. These rules mandated the use of padded gloves, created three-minute rounds with one-minute rest periods, and established the ten-count knockout rule. This marked the transition from bare-knuckle prize fighting to modern professional boxing, creating the foundation for the sport as we know it today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marquess_of_Queensberry_Rules",
    "citationTitle": "Wikipedia: Marquess of Queensberry Rules"
  },
  {
    "id": "8361c5d4-6788-4d6c-9092-dcf758a261f7",
    "text": "Which British boxer was known as 'Prince Naseem' and was famous for his flamboyant entrances and southpaw stance?",
    "options": [
      "Naseem Hamed",
      "Amir Khan",
      "Ricky Hatton",
      "Carl Froch"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Naseem Hamed, known as 'Prince Naseem', was famous for his theatrical ring entrances and unorthodox southpaw boxing style.",
    "detailedExplanation": "Naseem Hamed, nicknamed 'Prince Naseem' or 'Naz', was one of Britain's most charismatic and controversial boxers during the 1990s. The Sheffield-born fighter was renowned for his elaborate ring entrances, which included everything from flying carpets to leopard-print robes, and his unorthodox southpaw fighting style. Hamed held multiple featherweight world titles and retired undefeated as a professional with a record of 36 wins and 1 loss, with his only defeat coming against Marco Antonio Barrera in 2001.",
    "citationUrl": "https://en.wikipedia.org/wiki/Naseem_Hamed",
    "citationTitle": "Wikipedia: Naseem Hamed"
  },
  {
    "id": "d72d7aba-41c3-46d1-a051-79b423b949c1",
    "text": "Which boxing stance involves having the right foot forward and left foot back, opposite to the orthodox stance?",
    "options": [
      "Southpaw",
      "Switch-hitter",
      "Orthodox",
      "Crouched"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Southpaw stance has the right foot forward and left foot back, with the left hand as the power hand.",
    "detailedExplanation": "The southpaw stance is adopted by left-handed boxers or those who prefer to lead with their right hand and foot. In this stance, the boxer's right foot is forward, left foot back, with the right hand serving as the lead hand and the left hand as the power hand. This creates a mirror image of the orthodox stance and can be particularly challenging for orthodox fighters to face due to the reversed angles and different timing. Famous southpaw champions include Manny Pacquiao, Marvin Hagler, and Pernell Whitaker.",
    "citationUrl": "https://en.wikipedia.org/wiki/Southpaw_stance",
    "citationTitle": "Wikipedia: Southpaw stance"
  },
  {
    "id": "05f7da41-515f-4ef2-87bf-5b47075ce9b3",
    "text": "Which undisputed heavyweight champion of the 1990s later became better known for his acting career and grilling products?",
    "options": [
      "George Foreman",
      "Evander Holyfield",
      "Riddick Bowe",
      "Lennox Lewis"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "George Foreman became famous for his George Foreman Grill and acting appearances after his boxing career.",
    "detailedExplanation": "George Foreman had two distinct careers in boxing, winning the heavyweight title first in 1973 and then making a remarkable comeback to regain it in 1994 at age 45, making him the oldest heavyweight champion in history. After retiring from boxing, Foreman became even more famous as an entrepreneur and pitchman, particularly for the George Foreman Grill, which became a massive commercial success. He also appeared in various TV shows and commercials, transforming from the intimidating boxer of the 1970s into a beloved, jovial personality in popular culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_Foreman",
    "citationTitle": "Wikipedia: George Foreman"
  },
  {
    "id": "b8fcdfda-2d33-4e25-8cb6-2037f567d3b3",
    "text": "Which boxer was known as 'The Brown Bomber' and held the heavyweight title for nearly 12 years from 1937 to 1949?",
    "options": [
      "Rocky Marciano",
      "Joe Louis",
      "Jack Dempsey",
      "Gene Tunney"
    ],
    "correctIndex": 1,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Joe Louis was nicknamed 'The Brown Bomber' and dominated the heavyweight division for 11 years and 8 months.",
    "detailedExplanation": "Joe Louis, known as 'The Brown Bomber', is considered one of the greatest heavyweight champions in boxing history. He held the heavyweight title from 1937 to 1949, making 25 successful title defenses during his reign. Louis was known for his devastating punching power and technical skill, and he played a significant role in breaking down racial barriers in professional sports during his era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Joe_Louis",
    "citationTitle": "Wikipedia: Joe Louis"
  },
  {
    "id": "cb128024-545c-4ee0-ba23-d85cc450d933",
    "text": "Which welterweight champion was known as 'Pretty Boy' and retired undefeated with a perfect 50-0 professional record?",
    "options": [
      "Floyd Mayweather Jr.",
      "Oscar De La Hoya",
      "Felix Trinidad",
      "Shane Mosley"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Floyd Mayweather Jr., nicknamed 'Pretty Boy' and later 'Money', retired with a perfect 50-0 record.",
    "detailedExplanation": "Floyd Mayweather Jr. is one of the most successful boxers of the modern era, retiring with an unblemished 50-0 professional record. Known for his defensive boxing style and flashy lifestyle, Mayweather won world titles in five different weight classes and was nicknamed 'Pretty Boy Floyd' early in his career before adopting the 'Money' moniker. His final professional fight was against Conor McGregor in 2017, which he won by TKO.",
    "citationUrl": "https://en.wikipedia.org/wiki/Floyd_Mayweather_Jr.",
    "citationTitle": "Wikipedia: Floyd Mayweather Jr."
  },
  {
    "id": "76d02466-8d7a-49a0-8269-444c76eb874c",
    "text": "Which heavyweight boxer was known as 'The Real Deal' and became undisputed champion by defeating Buster Douglas in 1990?",
    "options": [
      "Lennox Lewis",
      "Riddick Bowe",
      "Evander Holyfield",
      "Michael Moorer"
    ],
    "correctIndex": 2,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Evander Holyfield was nicknamed 'The Real Deal' and defeated Buster Douglas to become undisputed heavyweight champion.",
    "detailedExplanation": "Evander Holyfield, known as 'The Real Deal', had one of the most distinguished careers in heavyweight boxing. He defeated Buster Douglas in 1990 to become the undisputed heavyweight champion. Holyfield is the only four-time world heavyweight champion and is famous for his trilogy of fights with Riddick Bowe and his two memorable bouts with Mike Tyson, including the infamous 'Bite Fight' where Tyson bit off part of Holyfield's ear.",
    "citationUrl": "https://en.wikipedia.org/wiki/Evander_Holyfield",
    "citationTitle": "Wikipedia: Evander Holyfield"
  },
  {
    "id": "acc197f2-00c4-48e4-94a4-8269b175bb5f",
    "text": "Which middleweight boxing legend was known as 'Marvelous' and had an intense rivalry with Thomas Hearns in the 1980s?",
    "options": [
      "Marvin Hagler",
      "Carlos Monzon",
      "Bernard Hopkins",
      "Jake LaMotta"
    ],
    "correctIndex": 0,
    "category": "sports",
    "difficulty": "medium",
    "explanation": "Marvin Hagler was known as 'Marvelous Marvin Hagler' and had famous battles with Thomas Hearns.",
    "detailedExplanation": "Marvin Hagler, who legally changed his name to 'Marvelous Marvin Hagler', was the undisputed middleweight champion from 1980 to 1987. He was known for his granite chin, aggressive southpaw style, and incredible conditioning. His most famous fight was against Thomas Hearns in 1985, often called 'The War', which lasted only three rounds but is considered one of the greatest fights in boxing history. Hagler made 12 successful title defenses before losing his final fight to Sugar Ray Leonard in 1987.",
    "citationUrl": "https://en.wikipedia.org/wiki/Marvin_Hagler",
    "citationTitle": "Wikipedia: Marvin Hagler"
  }
]