[
  {
    "id": "3871fd53-8645-48c8-bc12-15a7a47cedf4",
    "text": "Which streaming service produced the hit series 'Stranger Things'?",
    "options": [
      "Netflix",
      "Amazon Prime",
      "Hulu",
      "Disney+"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Netflix produced and released Stranger Things in 2016.",
    "detailedExplanation": "Stranger Things is a Netflix original series that premiered in July 2016. Created by the Duffer Brothers, the show became one of Netflix's most successful original productions, helping to establish the streaming service as a major content creator. The sci-fi horror series set in the 1980s became a cultural phenomenon and ran for four seasons.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stranger_Things",
    "citationTitle": "Wikipedia: Stranger Things"
  },
  {
    "id": "929764e2-1ff8-4706-b4d9-30ed75bcf0a1",
    "text": "What is the name of the fictional continent where most of 'Game of Thrones' takes place?",
    "options": [
      "Essos",
      "Westeros",
      "Sothoryos",
      "Ulthos"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Westeros is the main continent where most Game of Thrones events occur.",
    "detailedExplanation": "Game of Thrones, which aired on HBO from 2011 to 2019, is primarily set on the fictional continent of Westeros. Based on George R.R. Martin's 'A Song of Ice and Fire' novels, the series follows various noble houses vying for control of the Iron Throne. While the show also features scenes in Essos and other locations, Westeros serves as the main setting for the political intrigue and warfare.",
    "citationUrl": "https://en.wikipedia.org/wiki/World_of_A_Song_of_Ice_and_Fire",
    "citationTitle": "Wikipedia: World of A Song of Ice and Fire"
  },
  {
    "id": "37e96083-79ec-43ff-aebf-7478ef20ec9e",
    "text": "In 'The Office' (US version), what is the name of the paper company where the characters work?",
    "options": [
      "Dunder Mifflin",
      "Staples",
      "Paper Plus",
      "Office Depot"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Dunder Mifflin is the fictional paper company in The Office.",
    "detailedExplanation": "The Office (US) ran from 2005 to 2013 and is set at the Scranton, Pennsylvania branch of Dunder Mifflin Paper Company. The mockumentary-style sitcom, adapted from the British series of the same name, follows the daily lives of office employees under the management of Michael Scott (Steve Carell). The show gained renewed popularity on streaming platforms, particularly Netflix and later Peacock.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Office_(American_TV_series)",
    "citationTitle": "Wikipedia: The Office (American TV series)"
  },
  {
    "id": "7987df47-4360-4a4a-8747-a202d6541554",
    "text": "Which actress plays the title character in the Netflix series 'Wednesday'?",
    "options": [
      "Millie Bobby Brown",
      "Jenna Ortega",
      "Anya Taylor-Joy",
      "Zendaya"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Jenna Ortega stars as Wednesday Addams in the Netflix series.",
    "detailedExplanation": "Jenna Ortega plays Wednesday Addams in the 2022 Netflix series 'Wednesday'. The show focuses on Wednesday's time as a student at Nevermore Academy, where she attempts to master her emerging psychic ability, thwart a monstrous killing spree, and solve the murder mystery that embroiled her parents. Ortega's portrayal, particularly her viral dance sequence, made the show a massive hit for Netflix.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wednesday_(TV_series)",
    "citationTitle": "Wikipedia: Wednesday (TV series)"
  },
  {
    "id": "8a976066-e108-472b-bda2-cac2a9f94d39",
    "text": "What is the name of the dragon queen in 'Game of Thrones'?",
    "options": [
      "Cersei Lannister",
      "Arya Stark",
      "Daenerys Targaryen",
      "Sansa Stark"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Daenerys Targaryen is known as the Mother of Dragons in Game of Thrones.",
    "detailedExplanation": "Daenerys Targaryen, played by Emilia Clarke, is one of the main characters in Game of Thrones. Born into the exiled Targaryen dynasty, she becomes known as the 'Mother of Dragons' after hatching three dragon eggs. Throughout the series, she conquers various cities while building her claim to the Iron Throne, ultimately becoming one of the most powerful figures in the show's final seasons.",
    "citationUrl": "https://en.wikipedia.org/wiki/Daenerys_Targaryen",
    "citationTitle": "Wikipedia: Daenerys Targaryen"
  },
  {
    "id": "05c8615d-c2f3-4b18-9092-b013f6c8ea84",
    "text": "In 'Breaking Bad', what subject does Walter White teach before becoming a meth cook?",
    "options": [
      "Physics",
      "Chemistry",
      "Biology",
      "Mathematics"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Walter White is a high school chemistry teacher in Breaking Bad.",
    "detailedExplanation": "Walter White, played by Bryan Cranston, is a high school chemistry teacher in Albuquerque, New Mexico when Breaking Bad begins. His expertise in chemistry becomes crucial to his transformation into a methamphetamine manufacturer after he's diagnosed with terminal lung cancer. The show, which aired from 2008 to 2013, gained massive popularity on Netflix and is considered one of the greatest television series of all time.",
    "citationUrl": "https://en.wikipedia.org/wiki/Walter_White_(Breaking_Bad)",
    "citationTitle": "Wikipedia: Walter White (Breaking Bad)"
  },
  {
    "id": "2582369a-b888-41f6-a8a6-6e0f76558820",
    "text": "Which streaming service is home to 'The Boys', a dark superhero series?",
    "options": [
      "Netflix",
      "Amazon Prime Video",
      "HBO Max",
      "Apple TV+"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Boys is an Amazon Prime Video original series.",
    "detailedExplanation": "The Boys is an Amazon Prime Video original series that premiered in 2019. Based on the comic book series by Garth Ennis and Darick Robertson, the show presents a dark and satirical take on the superhero genre, focusing on a group of vigilantes fighting against corrupt superheroes. The series has been praised for its social commentary and has become one of Prime Video's most successful original productions.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Boys_(TV_series)",
    "citationTitle": "Wikipedia: The Boys (TV series)"
  },
  {
    "id": "abf639b7-7322-43e9-8bb7-59474099d64e",
    "text": "What is the main character's name in the Netflix series 'You'?",
    "options": [
      "Dan Humphrey",
      "Joe Goldberg",
      "Beck Thompson",
      "Will Bettelheim"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Joe Goldberg is the stalker protagonist of the Netflix series You.",
    "detailedExplanation": "Joe Goldberg, played by Penn Badgley, is the main character and unreliable narrator of the Netflix psychological thriller series 'You'. Originally airing on Lifetime before moving to Netflix, the show follows Joe, a bookstore manager who becomes obsessed with different women and uses technology and social media to insert himself into their lives. The series explores themes of digital privacy, social media culture, and toxic relationships.",
    "citationUrl": "https://en.wikipedia.org/wiki/You_(TV_series)",
    "citationTitle": "Wikipedia: You (TV series)"
  },
  {
    "id": "54319b79-73de-4c92-b484-6f6af94a44af",
    "text": "Which streaming platform is home to the hit series 'Stranger Things'?",
    "options": [
      "Hulu",
      "Netflix",
      "Amazon Prime Video",
      "Disney+"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Stranger Things is a Netflix original series that premiered in 2016.",
    "detailedExplanation": "Stranger Things is one of Netflix's most successful original series, premiering on July 15, 2016. Created by the Duffer Brothers, the show is set in the 1980s in the fictional town of Hawkins, Indiana, and follows a group of kids as they encounter supernatural forces. The series has become a cultural phenomenon and helped establish Netflix as a major producer of original content.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stranger_Things",
    "citationTitle": "Wikipedia: Stranger Things"
  },
  {
    "id": "ee0aaa42-41ab-403d-ba99-47a873c7379c",
    "text": "What is the name of the fictional kingdom in 'The Mandalorian'?",
    "options": [
      "The Empire",
      "The New Republic",
      "Mandalore",
      "The Galaxy"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Mandalore is the ancestral home planet of the Mandalorians in the Star Wars universe.",
    "detailedExplanation": "The Mandalorian, which premiered on Disney+ in 2019, follows a lone Mandalorian bounty hunter in the outer reaches of the galaxy. Mandalore is the homeworld of the Mandalorian people, a warrior culture known for their distinctive armor and fighting prowess. The show explores Mandalorian culture and the quest to restore their homeland after it was devastated during the Clone Wars.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Mandalorian",
    "citationTitle": "Wikipedia: The Mandalorian"
  },
  {
    "id": "8c35fffe-1756-4e87-a3f4-332f9618e745",
    "text": "Which actress plays the Queen of England in the Netflix series 'The Crown'?",
    "options": [
      "Helena Bonham Carter",
      "Claire Foy",
      "Olivia Colman",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Multiple actresses have portrayed Queen Elizabeth II across different seasons of The Crown.",
    "detailedExplanation": "The Crown uses different actresses to portray Queen Elizabeth II at different stages of her life. Claire Foy played the young queen in seasons 1-2, Olivia Colman took over for the middle years in seasons 3-4, and Imelda Staunton portrays the older queen in the final seasons. Helena Bonham Carter played Princess Margaret, not the Queen, but the question structure makes 'All of the above' the most comprehensive answer for the royal portrayals.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Crown_(TV_series)",
    "citationTitle": "Wikipedia: The Crown (TV series)"
  },
  {
    "id": "4050b1de-ade0-422c-a65b-757f25da3e08",
    "text": "What type of games do contestants play in Netflix's 'Squid Game'?",
    "options": [
      "Video games",
      "Card games",
      "Children's games",
      "Board games"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Squid Game features deadly versions of traditional Korean children's games.",
    "detailedExplanation": "Squid Game, which became Netflix's most-watched series in 2021, features contestants playing twisted versions of innocent childhood games with deadly consequences. These include games like 'Red Light, Green Light,' 'Honeycomb/Dalgona candy,' 'Tug of War,' and the titular 'Squid Game.' The contrast between the nostalgic, innocent nature of children's games and the life-or-death stakes creates much of the show's psychological horror.",
    "citationUrl": "https://en.wikipedia.org/wiki/Squid_Game",
    "citationTitle": "Wikipedia: Squid Game"
  },
  {
    "id": "84cfd1a0-e723-4b7a-b5a6-145ad35b571d",
    "text": "Which streaming service produces 'The Boys'?",
    "options": [
      "Netflix",
      "Hulu",
      "Amazon Prime Video",
      "HBO Max"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Boys is an Amazon Prime Video original series based on the comic book series.",
    "detailedExplanation": "The Boys is an Amazon Prime Video original superhero series that premiered in 2019. Based on the comic book series by Garth Ennis and Darick Robertson, the show presents a dark and satirical take on superheroes, depicting them as corrupt celebrities managed by a powerful corporation called Vought International. The series has been praised for its subversive approach to the superhero genre and its social commentary.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Boys_(2019_TV_series)",
    "citationTitle": "Wikipedia: The Boys (2019 TV series)"
  },
  {
    "id": "a173e764-d70c-43ad-9812-ffaf81ba3d42",
    "text": "What is the main character's profession in 'Ted Lasso' on Apple TV+?",
    "options": [
      "Soccer player",
      "Football coach",
      "Sports commentator",
      "Team owner"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Ted Lasso is an American football coach who moves to England to coach a soccer team.",
    "detailedExplanation": "Ted Lasso, played by Jason Sudeikis, is an American college football coach who is hired to coach AFC Richmond, a struggling English soccer (football) team, despite having no experience with soccer. The show, which premiered on Apple TV+ in 2020, follows his journey as he tries to win over skeptical players and fans while dealing with personal challenges. The series is known for its optimistic tone and messages about kindness, leadership, and resilience.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ted_Lasso",
    "citationTitle": "Wikipedia: Ted Lasso"
  },
  {
    "id": "b7f201e6-637a-4e00-8f3e-37cda4357018",
    "text": "Which streaming platform is 'The Handmaid's Tale' primarily associated with?",
    "options": [
      "Netflix",
      "Amazon Prime Video",
      "Hulu",
      "Paramount+"
    ],
    "correctIndex": 2,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Handmaid's Tale is a Hulu original series based on Margaret Atwood's novel.",
    "detailedExplanation": "The Handmaid's Tale premiered on Hulu in 2017 and is based on Margaret Atwood's 1985 dystopian novel. The series is set in a totalitarian society called Gilead, where fertile women are forced to bear children for the ruling class. Starring Elisabeth Moss as Offred/June, the show has won multiple Emmy Awards and has been praised for its powerful performances and relevant social commentary about women's rights and authoritarianism.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)",
    "citationTitle": "Wikipedia: The Handmaid's Tale (TV series)"
  },
  {
    "id": "10f0de67-d12b-483e-93c7-166fb676d47f",
    "text": "What is the setting for the Amazon Prime series 'The Marvelous Mrs. Maisel'?",
    "options": [
      "1950s New York",
      "1960s Los Angeles",
      "1970s Chicago",
      "1940s Boston"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The show is set in late 1950s New York and follows Midge Maisel's journey into stand-up comedy.",
    "detailedExplanation": "The Marvelous Mrs. Maisel premiered on Amazon Prime Video in 2017 and is set in late 1950s and early 1960s New York City. The series follows Miriam 'Midge' Maisel, a Jewish-American housewife who discovers she has a talent for stand-up comedy after her husband leaves her. Created by Amy Sherman-Palladino, the show is known for its rapid-fire dialogue, period-accurate costumes and sets, and its exploration of women's roles in the entertainment industry during that era.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Marvelous_Mrs._Maisel",
    "citationTitle": "Wikipedia: The Marvelous Mrs. Maisel"
  },
  {
    "id": "f6543419-f505-4922-84a0-d28859128765",
    "text": "What is the name of the fantasy drama series based on George R.R. Martin's novels that concluded in 2019?",
    "options": [
      "The Witcher",
      "Game of Thrones",
      "House of the Dragon",
      "The Lord of the Rings: The Rings of Power"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Game of Thrones aired on HBO from 2011 to 2019 and was based on Martin's 'A Song of Ice and Fire' book series.",
    "detailedExplanation": "Game of Thrones was HBO's flagship series that ran for eight seasons from 2011 to 2019. Based on George R.R. Martin's 'A Song of Ice and Fire' novels, the show became a global phenomenon and one of the most watched series in television history. Set in the fictional continents of Westeros and Essos, it featured multiple storylines and became known for its complex characters, political intrigue, and unexpected character deaths.",
    "citationUrl": "https://en.wikipedia.org/wiki/Game_of_Thrones",
    "citationTitle": "Wikipedia: Game of Thrones"
  },
  {
    "id": "15e56774-1449-4479-8ef0-e05069c949fb",
    "text": "In the Netflix series 'The Crown', which royal family is the main focus?",
    "options": [
      "Swedish Royal Family",
      "British Royal Family",
      "Spanish Royal Family",
      "Dutch Royal Family"
    ],
    "correctIndex": 1,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Crown chronicles the reign of Queen Elizabeth II and the British Royal Family from the 1940s onwards.",
    "detailedExplanation": "The Crown is a biographical drama series created by Peter Morgan for Netflix. The series focuses on the reign of Queen Elizabeth II and the major political and personal events that shaped the second half of the 20th century. Each season covers roughly a decade of her reign, featuring different actors playing the royal family members as they age. The show has been praised for its production values, writing, and performances, winning numerous awards including Golden Globes and Emmy Awards.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Crown_(TV_series)",
    "citationTitle": "Wikipedia: The Crown (TV series)"
  },
  {
    "id": "1252f443-cf22-43be-a93a-72880bb0c2ae",
    "text": "Which Disney+ series features a Mandalorian bounty hunter in the Star Wars universe?",
    "options": [
      "The Mandalorian",
      "Obi-Wan Kenobi",
      "The Book of Boba Fett",
      "Andor"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "The Mandalorian premiered on Disney+ in 2019 and follows Din Djarin, a Mandalorian bounty hunter.",
    "detailedExplanation": "The Mandalorian is a space Western series created by Jon Favreau for Disney+. Set in the Star Wars universe, it takes place about five years after the events of Return of the Jedi. The series follows Din Djarin, a lone Mandalorian bounty hunter who goes on the run after being hired to retrieve 'The Child' (later named Grogu, but popularly known as 'Baby Yoda'). The show was Disney+'s flagship series at launch and became a major success, spawning several spin-off series.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Mandalorian",
    "citationTitle": "Wikipedia: The Mandalorian"
  },
  {
    "id": "5d5b7c0b-5c0f-4511-bfe6-b3e43be4bc69",
    "text": "Which streaming platform originally produced the hit series 'Stranger Things'?",
    "options": [
      "Netflix",
      "Amazon Prime Video",
      "Hulu",
      "Disney+"
    ],
    "correctIndex": 0,
    "category": "entertainment",
    "difficulty": "easy",
    "explanation": "Netflix originally produced and released Stranger Things in 2016.",
    "detailedExplanation": "Stranger Things is a science fiction horror drama television series created by the Duffer Brothers and one of Netflix's most successful original productions. The show premiered on Netflix on July 15, 2016, and became a global phenomenon, helping to establish Netflix as a major player in original content production. The series is set in the 1980s in the fictional town of Hawkins, Indiana, and follows a group of friends as they encounter supernatural forces and government conspiracies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stranger_Things",
    "citationTitle": "Wikipedia: Stranger Things"
  }
]