[
  {
    "id": "60c10a6b-42c8-4e45-a6c2-ca30a993d932",
    "text": "Who was the first U.S. President to appear on television during a presidential campaign?",
    "options": [
      "Franklin D. Roosevelt",
      "Harry Truman",
      "Dwight D. Eisenhower",
      "John F. Kennedy"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Franklin D. Roosevelt was the first president to appear on television during a campaign in 1939.",
    "detailedExplanation": "Franklin D. Roosevelt made history when he became the first U.S. President to appear on television during a presidential campaign in 1939. This groundbreaking moment occurred at the World's Fair in New York, marking the beginning of television's role in American politics. While FDR pioneered TV appearances, it wasn't until the famous Kennedy-Nixon debates in 1960 that television truly transformed presidential campaigns.",
    "citationUrl": "https://en.wikipedia.org/wiki/United_States_presidential_elections_and_television",
    "citationTitle": "Wikipedia: United States presidential elections and television"
  },
  {
    "id": "be39669f-8479-4993-a767-dee93c250c10",
    "text": "Which U.S. presidential election was decided by the House of Representatives due to no candidate receiving a majority of electoral votes?",
    "options": [
      "1800",
      "1824",
      "1876",
      "2000"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 1824 election went to the House of Representatives, where John Quincy Adams was chosen over Andrew Jackson.",
    "detailedExplanation": "The 1824 presidential election was one of the most controversial in American history. No candidate received a majority of electoral votes, with Andrew Jackson receiving the most popular votes but not enough electoral votes to win. Under the Constitution, the election went to the House of Representatives, which chose John Quincy Adams as president. This led to accusations of a 'corrupt bargain' when Adams appointed Henry Clay as Secretary of State.",
    "citationUrl": "https://en.wikipedia.org/wiki/1824_United_States_presidential_election",
    "citationTitle": "Wikipedia: 1824 United States presidential election"
  },
  {
    "id": "1a4e989a-108f-4a62-a2cd-93676da008cd",
    "text": "What year did women gain the right to vote in the United States?",
    "options": [
      "1918",
      "1920",
      "1922",
      "1925"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 19th Amendment was ratified in 1920, granting women the right to vote nationwide.",
    "detailedExplanation": "The 19th Amendment to the U.S. Constitution was ratified on August 26, 1920, prohibiting the denial of voting rights based on sex. This historic achievement came after decades of activism by suffragettes and marked a turning point in American democracy. The amendment effectively doubled the eligible voting population and represented the culmination of the women's suffrage movement that had been fighting for voting rights since the mid-1800s.",
    "citationUrl": "https://en.wikipedia.org/wiki/Nineteenth_Amendment_to_the_United_States_Constitution",
    "citationTitle": "Wikipedia: Nineteenth Amendment to the United States Constitution"
  },
  {
    "id": "9878bddf-4b29-45b6-a763-b26173d23146",
    "text": "Which British Prime Minister won three consecutive general elections in the 1980s?",
    "options": [
      "John Major",
      "Margaret Thatcher",
      "Tony Blair",
      "Harold Wilson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Margaret Thatcher won the 1979, 1983, and 1987 general elections consecutively.",
    "detailedExplanation": "Margaret Thatcher, known as the 'Iron Lady,' led the Conservative Party to victory in three consecutive general elections: 1979, 1983, and 1987. She became Britain's first female Prime Minister and served for 11 years, making her the longest-serving British PM of the 20th century. Her electoral success was built on policies of economic liberalization, privatization, and a strong stance in foreign policy during the Cold War.",
    "citationUrl": "https://en.wikipedia.org/wiki/Margaret_Thatcher",
    "citationTitle": "Wikipedia: Margaret Thatcher"
  },
  {
    "id": "6a8cb60f-d3aa-404b-92da-9f52f32b8f98",
    "text": "What was the name of the political scandal that led to President Nixon's resignation?",
    "options": [
      "Teapot Dome",
      "Watergate",
      "Iran-Contra",
      "Whitewater"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Watergate scandal led to Nixon's resignation in 1974 following investigations into election-related crimes.",
    "detailedExplanation": "The Watergate scandal began with a break-in at the Democratic National Committee headquarters in the Watergate complex in 1972. Investigations revealed a web of political espionage and abuse of power by the Nixon administration. As evidence mounted of Nixon's involvement in covering up the crimes, he faced almost certain impeachment and chose to resign on August 9, 1974, becoming the first U.S. President to resign from office.",
    "citationUrl": "https://en.wikipedia.org/wiki/Watergate_scandal",
    "citationTitle": "Wikipedia: Watergate scandal"
  },
  {
    "id": "bb7104d1-e17d-4178-81df-7f3c313164f4",
    "text": "Which country held the world's first general election with universal adult suffrage?",
    "options": [
      "United States",
      "New Zealand",
      "Australia",
      "United Kingdom"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "New Zealand achieved universal adult suffrage in 1893, making it the first self-governing country to do so.",
    "detailedExplanation": "New Zealand became the first self-governing country in the world to grant women the right to vote when it passed the Electoral Act in 1893. This gave all adult citizens, regardless of gender, the right to vote in parliamentary elections. The achievement came after a determined campaign led by suffragettes like Kate Sheppard, and New Zealand's pioneering move influenced women's suffrage movements worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Women%27s_suffrage_in_New_Zealand",
    "citationTitle": "Wikipedia: Women's suffrage in New Zealand"
  },
  {
    "id": "8d4c8c52-7dc9-4119-904c-8e2b3a29f46b",
    "text": "In which year did Nelson Mandela become President of South Africa?",
    "options": [
      "1990",
      "1992",
      "1994",
      "1996"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Nelson Mandela became President in 1994 following South Africa's first multiracial democratic elections.",
    "detailedExplanation": "Nelson Mandela was elected as South Africa's first Black president on May 10, 1994, following the country's first fully democratic elections held from April 26-29, 1994. These historic elections marked the end of apartheid and the beginning of majority rule in South Africa. Mandela, who had spent 27 years in prison for fighting apartheid, led the African National Congress to victory and became a symbol of reconciliation and democratic transition.",
    "citationUrl": "https://en.wikipedia.org/wiki/1994_South_African_general_election",
    "citationTitle": "Wikipedia: 1994 South African general election"
  },
  {
    "id": "727b7fdb-e909-46ce-a6dc-accf34578a69",
    "text": "Which U.S. President was elected four times?",
    "options": [
      "Thomas Jefferson",
      "Abraham Lincoln",
      "Theodore Roosevelt",
      "Franklin D. Roosevelt"
    ],
    "correctIndex": 3,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Franklin D. Roosevelt was elected president four times (1932, 1936, 1940, 1944) before the 22nd Amendment limited terms.",
    "detailedExplanation": "Franklin D. Roosevelt broke the two-term tradition established by George Washington when he was elected to four consecutive terms as president (1932, 1936, 1940, and 1944). His unprecedented tenure was driven by the Great Depression and World War II. Following his death in 1945, the 22nd Amendment was ratified in 1951, formally limiting presidents to two terms and ensuring that FDR would remain the only president to serve more than eight years.",
    "citationUrl": "https://en.wikipedia.org/wiki/Franklin_D._Roosevelt",
    "citationTitle": "Wikipedia: Franklin D. Roosevelt"
  },
  {
    "id": "79278685-3ee8-495d-ab11-e0c780f20e33",
    "text": "Which U.S. presidential candidate famously said 'You're no Jack Kennedy' was directed at during a 1988 vice presidential debate?",
    "options": [
      "Dan Quayle",
      "Michael Dukakis",
      "George H.W. Bush",
      "Lloyd Bentsen"
    ],
    "correctIndex": 0,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Lloyd Bentsen said 'You're no Jack Kennedy' to Dan Quayle during the 1988 VP debate.",
    "detailedExplanation": "During the 1988 vice presidential debate, Republican candidate Dan Quayle compared his congressional experience to that of John F. Kennedy. Democratic candidate Lloyd Bentsen responded with the iconic line: 'Senator, I served with Jack Kennedy. I knew Jack Kennedy. Jack Kennedy was a friend of mine. Senator, you're no Jack Kennedy.' This became one of the most memorable moments in debate history.",
    "citationUrl": "https://en.wikipedia.org/wiki/1988_United_States_presidential_election",
    "citationTitle": "Wikipedia: 1988 United States presidential election"
  },
  {
    "id": "5b14e546-c980-411c-850b-e66067129535",
    "text": "What was the margin of victory in the closest U.S. presidential election by popular vote in the 21st century?",
    "options": [
      "537 votes",
      "About 540,000 votes",
      "About 3 million votes",
      "About 120,000 votes"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The 2000 election between Bush and Gore was decided by about 540,000 popular votes.",
    "detailedExplanation": "The 2000 presidential election between George W. Bush and Al Gore was the closest by popular vote in recent history. Gore actually won the popular vote by 543,895 votes (48.4% to 47.9%), but Bush won the presidency through the Electoral College after the controversial Florida recount was stopped by the Supreme Court. This election highlighted the difference between popular vote and Electoral College outcomes.",
    "citationUrl": "https://en.wikipedia.org/wiki/2000_United_States_presidential_election",
    "citationTitle": "Wikipedia: 2000 United States presidential election"
  },
  {
    "id": "eab9e9a8-9650-4409-b474-e5101bd86fb8",
    "text": "Which British political party was led by Paddy Ashdown during the 1990s?",
    "options": [
      "Labour Party",
      "Conservative Party",
      "Liberal Democrats",
      "Green Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Paddy Ashdown led the Liberal Democrats from 1988 to 1999.",
    "detailedExplanation": "Jeremy John Durham 'Paddy' Ashdown led the Liberal Democrats from 1988 to 1999, making him the party's first leader after its formation from the merger of the Liberal Party and the Social Democratic Party. Under his leadership, the Liberal Democrats established themselves as the UK's third major political party and won their highest number of seats since the 1920s in the 1997 general election.",
    "citationUrl": "https://en.wikipedia.org/wiki/Paddy_Ashdown",
    "citationTitle": "Wikipedia: Paddy Ashdown"
  },
  {
    "id": "d3c2e421-844a-4173-8f84-99b243c02a63",
    "text": "In which year did Barack Obama first win the U.S. presidency?",
    "options": [
      "2004",
      "2008",
      "2012",
      "2006"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Barack Obama was first elected president in 2008, defeating John McCain.",
    "detailedExplanation": "Barack Obama won the 2008 U.S. presidential election, defeating Republican nominee John McCain. Obama received 365 electoral votes to McCain's 173, and won 52.9% of the popular vote. This historic election made Obama the first African American president in U.S. history. He was inaugurated as the 44th President on January 20, 2009, and later won re-election in 2012.",
    "citationUrl": "https://en.wikipedia.org/wiki/2008_United_States_presidential_election",
    "citationTitle": "Wikipedia: 2008 United States presidential election"
  },
  {
    "id": "db12b71d-e0d8-473b-a8fe-09b6c38f967e",
    "text": "Which country elected its first female Prime Minister, Golda Meir, in 1969?",
    "options": [
      "United Kingdom",
      "Israel",
      "India",
      "Norway"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Golda Meir became Israel's Prime Minister in 1969, making her one of the world's first female heads of government.",
    "detailedExplanation": "Golda Meir became Prime Minister of Israel in March 1969, serving until 1974. She was Israel's fourth Prime Minister and one of the first women in the world to hold such a position. Known as the 'Iron Lady' before Margaret Thatcher, Meir led Israel during the challenging period of the Yom Kippur War in 1973. She had previously served as Israel's first female Foreign Minister.",
    "citationUrl": "https://en.wikipedia.org/wiki/Golda_Meir",
    "citationTitle": "Wikipedia: Golda Meir"
  },
  {
    "id": "e75f13e7-0d61-43cb-b8d1-ac65a1b76320",
    "text": "What was the name of the third-party candidate who won 19% of the popular vote in the 1992 U.S. presidential election?",
    "options": [
      "Ralph Nader",
      "Ross Perot",
      "Gary Johnson",
      "John Anderson"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Ross Perot ran as an independent candidate in 1992 and received 18.9% of the popular vote.",
    "detailedExplanation": "Ross Perot, a Texas businessman, ran as an independent candidate in the 1992 presidential election against Democrat Bill Clinton and Republican George H.W. Bush. Despite not winning any electoral votes, Perot received 18.9% of the popular vote (19,743,821 votes), making it the strongest showing by a third-party candidate since Theodore Roosevelt in 1912. Perot's campaign focused heavily on reducing the federal deficit and government reform.",
    "citationUrl": "https://en.wikipedia.org/wiki/1992_United_States_presidential_election",
    "citationTitle": "Wikipedia: 1992 United States presidential election"
  },
  {
    "id": "406902bb-3769-43df-b927-95993b8972a8",
    "text": "Which Canadian Prime Minister served for the longest continuous period in the 20th century?",
    "options": [
      "Pierre Trudeau",
      "John A. Macdonald",
      "William Lyon Mackenzie King",
      "Jean Chrétien"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "William Lyon Mackenzie King served as Prime Minister for over 21 years in total during the 20th century.",
    "detailedExplanation": "William Lyon Mackenzie King holds the record as Canada's longest-serving Prime Minister, with over 21 years in office across three separate terms (1921-1926, 1926-1930, and 1935-1948). His longest continuous period was from 1935 to 1948, spanning 13 years. King led Canada through the Great Depression and most of World War II, making him one of the most influential figures in Canadian political history.",
    "citationUrl": "https://en.wikipedia.org/wiki/William_Lyon_Mackenzie_King",
    "citationTitle": "Wikipedia: William Lyon Mackenzie King"
  },
  {
    "id": "b9c9175c-73e8-4914-9388-fcea9ff9cfca",
    "text": "In which decade did Australia introduce compulsory voting for federal elections?",
    "options": [
      "1900s",
      "1910s",
      "1920s",
      "1930s"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Australia introduced compulsory voting for federal elections in 1924.",
    "detailedExplanation": "Australia introduced compulsory voting for federal elections in 1924, following concerns about declining voter turnout which had fallen to around 60% in the 1922 election. The Commonwealth Electoral Act was amended to make voting mandatory for all eligible citizens. Since then, Australia has maintained one of the highest voter turnout rates in the world, typically above 90%. Citizens who fail to vote without a valid reason face a small fine.",
    "citationUrl": "https://en.wikipedia.org/wiki/Compulsory_voting",
    "citationTitle": "Wikipedia: Compulsory voting"
  },
  {
    "id": "66afbed9-997f-4abd-a080-8c4027cf7d58",
    "text": "Which U.S. President was the first to be born in the 20th century?",
    "options": [
      "Harry S. Truman",
      "Dwight D. Eisenhower",
      "John F. Kennedy",
      "Lyndon B. Johnson"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "John F. Kennedy was born on May 29, 1917, making him the first U.S. President born in the 20th century.",
    "detailedExplanation": "John F. Kennedy, born on May 29, 1917, was the first U.S. President to be born in the 20th century. This generational shift was significant as Kennedy represented a new, younger political leadership that contrasted sharply with his predecessors. His youth and vigor became central themes of his 1960 presidential campaign, particularly highlighted during the famous televised debates with Richard Nixon where Kennedy's youthful appearance was credited with helping him win the election.",
    "citationUrl": "https://en.wikipedia.org/wiki/John_F._Kennedy",
    "citationTitle": "Wikipedia: John F. Kennedy"
  },
  {
    "id": "9d1b17e4-ddb3-4f5a-8b60-fae829c010c4",
    "text": "Which political party did Abraham Lincoln represent when he was first elected President in 1860?",
    "options": [
      "Whig Party",
      "Democratic Party",
      "Republican Party",
      "Free Soil Party"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Abraham Lincoln was the first Republican Party candidate to win the presidency in 1860.",
    "detailedExplanation": "Abraham Lincoln was nominated by the Republican Party for the 1860 presidential election, becoming the first Republican to win the presidency. The Republican Party had been formed just six years earlier in 1854, primarily as an anti-slavery party. Lincoln's election on a platform opposing the expansion of slavery into new territories triggered the secession crisis, as several Southern states left the Union before he even took office, ultimately leading to the Civil War.",
    "citationUrl": "https://en.wikipedia.org/wiki/1860_United_States_presidential_election",
    "citationTitle": "Wikipedia: 1860 United States presidential election"
  },
  {
    "id": "95b6bafb-0c64-4892-aa59-bab27b371ce5",
    "text": "In which year did the Berlin Wall fall, leading to significant political changes in East Germany?",
    "options": [
      "1987",
      "1989",
      "1991",
      "1993"
    ],
    "correctIndex": 1,
    "category": "general",
    "difficulty": "easy",
    "explanation": "The Berlin Wall fell on November 9, 1989, leading to German reunification and the end of East Germany as a separate state.",
    "detailedExplanation": "The fall of the Berlin Wall on November 9, 1989, was a pivotal moment in world history that led to dramatic political changes in East Germany. This event marked the beginning of the end for the German Democratic Republic (East Germany) and paved the way for German reunification in 1990. The fall of the wall was both a symbol and catalyst for the broader collapse of communist governments across Eastern Europe, fundamentally reshaping the political landscape of the continent and ending the Cold War division of Germany.",
    "citationUrl": "https://en.wikipedia.org/wiki/Fall_of_the_Berlin_Wall",
    "citationTitle": "Wikipedia: Fall of the Berlin Wall"
  },
  {
    "id": "5309fa3d-a2dd-46ed-bb8d-0f873af6a8f6",
    "text": "Which French military leader became Emperor after staging a coup d'état in 1799?",
    "options": [
      "Louis XVI",
      "Maximilien Robespierre",
      "Napoleon Bonaparte",
      "Charles de Gaulle"
    ],
    "correctIndex": 2,
    "category": "general",
    "difficulty": "easy",
    "explanation": "Napoleon Bonaparte seized power in the coup of 18 Brumaire in 1799 and later crowned himself Emperor in 1804.",
    "detailedExplanation": "Napoleon Bonaparte staged the coup of 18 Brumaire (November 9, 1799) which effectively ended the French Directory and brought him to power as First Consul of France. This bloodless coup marked the end of the French Revolution and the beginning of Napoleon's rise to absolute power. Five years later, in 1804, Napoleon crowned himself Emperor of the French, establishing a new hereditary monarchy and fundamentally changing the course of European politics for the next decade through his conquests and reforms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coup_of_18_Brumaire",
    "citationTitle": "Wikipedia: Coup of 18 Brumaire"
  }
]