[
  {
    "id": "69282bf0-99bb-4a2b-8834-19aaf0df4624",
    "text": "Which country has the highest population density in the world, with over 21,000 people per square kilometer?",
    "options": [
      "Singapore",
      "Monaco",
      "Vatican City",
      "Malta"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Monaco has the highest population density at approximately 26,337 people per square kilometer.",
    "detailedExplanation": "Monaco, the tiny principality on the French Riviera, holds the record for the world's highest population density. With an area of just 2.02 square kilometers and a population of around 39,000 people, it achieves a staggering density of approximately 26,337 people per square kilometer. This is due to its status as a tax haven and luxury destination, attracting wealthy residents to a very limited geographical area. While Vatican City is smaller, its much lower population gives it a lower overall density.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population_density",
    "citationTitle": "Wikipedia: List of countries and dependencies by population density"
  },
  {
    "id": "b254941f-cf95-480e-be65-3056b4d1480d",
    "text": "What is the approximate current global Total Fertility Rate (TFR) as of 2023?",
    "options": [
      "1.8 children per woman",
      "2.3 children per woman",
      "2.7 children per woman",
      "3.1 children per woman"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The global Total Fertility Rate is approximately 2.3 children per woman as of 2023.",
    "detailedExplanation": "The Total Fertility Rate (TFR) represents the average number of children a woman would have in her lifetime based on current age-specific fertility rates. The global TFR has been steadily declining from over 5 children per woman in the 1960s to approximately 2.3 as of 2023. This rate is just above the replacement level of 2.1 children per woman needed to maintain a stable population. The decline reflects factors such as improved education, urbanization, access to contraception, and economic development across many regions of the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Total_fertility_rate",
    "citationTitle": "Wikipedia: Total fertility rate"
  },
  {
    "id": "b9cc8e7f-a77e-48e0-adce-7adf09384aab",
    "text": "Which city is projected to become the world's most populous urban agglomeration by 2030?",
    "options": [
      "Tokyo, Japan",
      "Delhi, India",
      "Shanghai, China",
      "Lagos, Nigeria"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Delhi, India is projected to surpass Tokyo as the world's most populous urban agglomeration by 2030.",
    "detailedExplanation": "According to UN projections, Delhi is expected to become the world's largest urban agglomeration by 2030, with a projected population of around 38-39 million people. This would surpass Tokyo, which has held the top position for decades but is experiencing population decline due to Japan's aging demographics and low birth rates. Delhi's rapid growth is driven by rural-to-urban migration, economic opportunities, and high birth rates. The National Capital Territory of Delhi, combined with surrounding urban areas, forms one of the fastest-growing megacities in the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_urban_agglomerations_by_population",
    "citationTitle": "Wikipedia: List of urban agglomerations by population"
  },
  {
    "id": "4232c646-bdf7-4525-b110-f387b0b8abed",
    "text": "What percentage of the world's population currently lives in urban areas as of 2023?",
    "options": [
      "42%",
      "48%",
      "56%",
      "64%"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Approximately 56% of the world's population lives in urban areas as of 2023.",
    "detailedExplanation": "Global urbanization has been one of the most significant demographic trends of the past century. In 1950, only about 30% of the world's population lived in urban areas. By 2023, this figure has reached approximately 56%, representing about 4.4 billion people living in cities and towns. The UN projects that by 2050, nearly 68% of the global population will be urban. This urbanization trend is particularly pronounced in developing countries in Africa and Asia, where rural populations are migrating to cities in search of economic opportunities, better services, and improved living standards.",
    "citationUrl": "https://en.wikipedia.org/wiki/Urbanization",
    "citationTitle": "Wikipedia: Urbanization"
  },
  {
    "id": "ddfb998e-9c5e-4ff7-9d8a-98191436de2d",
    "text": "Which country has the highest median age in the world, with over half its population being older than 48 years?",
    "options": [
      "Japan",
      "Germany",
      "Monaco",
      "Italy"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Monaco has the highest median age in the world at approximately 55.4 years.",
    "detailedExplanation": "Monaco holds the record for the world's highest median age at approximately 55.4 years, meaning half of its population is older than this age. This is primarily due to Monaco's status as a luxury destination and tax haven that attracts wealthy, typically older residents, combined with very low birth rates. Japan follows as the second-oldest country with a median age of around 48.6 years. These high median ages reflect aging populations with low fertility rates and longer life expectancies, presenting significant challenges for healthcare systems, pension schemes, and economic productivity.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_by_median_age",
    "citationTitle": "Wikipedia: List of countries by median age"
  },
  {
    "id": "dd998fd7-ceca-4d08-9736-baa612ec2cb9",
    "text": "What was the approximate global population when it reached its peak annual growth rate of 2.1% in the late 1960s?",
    "options": [
      "2.8 billion",
      "3.6 billion",
      "4.2 billion",
      "5.1 billion"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The global population was approximately 3.6 billion when it reached peak growth rate around 1968-1970.",
    "detailedExplanation": "The world's population growth rate peaked at approximately 2.1% annually around 1968-1970, when the global population was roughly 3.6 billion people. This period marked the height of the 'population explosion' that characterized the mid-20th century. The high growth rate was driven by declining mortality rates due to medical advances, improved sanitation, and better nutrition, while birth rates remained high in many developing countries. Since then, the annual growth rate has steadily declined to about 0.9% as of 2023, despite the population continuing to grow in absolute numbers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Population_growth",
    "citationTitle": "Wikipedia: Population growth"
  },
  {
    "id": "0d5f5196-d5f0-4dd8-a297-b2cdc935d956",
    "text": "Which continent has the youngest population, with a median age of approximately 19.7 years?",
    "options": [
      "Asia",
      "South America",
      "Africa",
      "Oceania"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Africa has the youngest population globally, with a median age of approximately 19.7 years.",
    "detailedExplanation": "Africa has by far the youngest population of any continent, with a median age of approximately 19.7 years as of 2023. This means half of Africa's 1.4 billion people are younger than 20 years old. This youthful demographic structure is the result of high fertility rates and improving but still relatively low life expectancy compared to other continents. Countries like Niger, Mali, and Chad have median ages below 16 years. This demographic profile presents both opportunities (large workforce potential) and challenges (need for education, jobs, and services) for African nations in the coming decades.",
    "citationUrl": "https://en.wikipedia.org/wiki/Demographics_of_Africa",
    "citationTitle": "Wikipedia: Demographics of Africa"
  },
  {
    "id": "f3243c94-86bc-4ef9-b90e-d4e461045ccf",
    "text": "What is the current approximate sex ratio at birth globally (males per 100 females)?",
    "options": [
      "103-104",
      "105-106",
      "108-109",
      "110-111"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The global sex ratio at birth is approximately 105-106 males per 100 females.",
    "detailedExplanation": "The natural sex ratio at birth globally averages around 105-106 males per 100 females, meaning slightly more boys are born than girls. This biological norm exists because male infants have higher mortality rates, so nature compensates by producing more males to achieve roughly equal numbers by reproductive age. However, in some countries, particularly in parts of Asia, the sex ratio is significantly skewed due to cultural preferences for male children combined with sex-selective practices. Countries like China and India have ratios as high as 110-115 males per 100 females, creating long-term demographic imbalances and social challenges.",
    "citationUrl": "https://en.wikipedia.org/wiki/Human_sex_ratio",
    "citationTitle": "Wikipedia: Human sex ratio"
  },
  {
    "id": "2a476e3d-28d5-44be-978d-0bce9faebfae",
    "text": "What was the approximate global population when it reached its fastest annual growth rate in history?",
    "options": [
      "2.5 billion in 1950",
      "3.7 billion in 1970",
      "5.3 billion in 1990",
      "6.9 billion in 2010"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The global population growth rate peaked around 1970 at about 2.1% annually when the world population was approximately 3.7 billion.",
    "detailedExplanation": "The world's population growth rate reached its historical peak around 1970, when the annual growth rate hit approximately 2.1% and the global population was about 3.7 billion people. This period marked the height of the demographic explosion that began after World War II, driven by improved medical care, better nutrition, and declining infant mortality rates, while birth rates remained high. Since then, the growth rate has gradually declined to about 0.9% annually as of 2023, even though the absolute population has more than doubled to over 8 billion people.",
    "citationUrl": "https://en.wikipedia.org/wiki/Population_growth",
    "citationTitle": "Wikipedia: Population growth"
  },
  {
    "id": "f25ac538-c322-47ba-91b5-2c7b9a4be3e3",
    "text": "What is the approximate total fertility rate needed for a population to remain stable (replacement level fertility)?",
    "options": [
      "1.8 children per woman",
      "2.1 children per woman",
      "2.5 children per woman",
      "3.0 children per woman"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Replacement level fertility is approximately 2.1 children per woman in developed countries, accounting for child mortality and the fact that slightly more males are born than females.",
    "detailedExplanation": "Replacement level fertility is the total fertility rate at which a population exactly replaces itself from one generation to the next, without migration. In developed countries with low mortality rates, this is approximately 2.1 children per woman. The figure is slightly above 2.0 because it accounts for child mortality (some children don't survive to reproductive age) and the fact that slightly more males are born than females (about 105 males per 100 females). In countries with higher mortality rates, replacement level fertility can be higher, sometimes reaching 2.3 or more children per woman.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sub-replacement_fertility",
    "citationTitle": "Wikipedia: Sub-replacement fertility"
  },
  {
    "id": "6a602093-6d95-4360-be89-6e7993bb40bf",
    "text": "Which region of the world is experiencing the most rapid population decline?",
    "options": [
      "Eastern Europe",
      "Western Europe",
      "East Asia",
      "Southern Europe"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Eastern Europe is experiencing the fastest population decline, with countries like Bulgaria and Lithuania losing over 1% of their population annually.",
    "detailedExplanation": "Eastern Europe is experiencing the world's most rapid population decline, driven by a combination of very low birth rates, aging populations, and significant outmigration to Western Europe following EU expansion. Countries like Bulgaria, Lithuania, Latvia, and Ukraine (even before the 2022 war) have been losing 1-2% of their population annually. Bulgaria, for example, has declined from about 9 million people in 1989 to under 7 million today. This decline is attributed to economic emigration, low fertility rates well below replacement level, and the lasting demographic impacts of post-communist economic transitions.",
    "citationUrl": "https://en.wikipedia.org/wiki/Population_decline",
    "citationTitle": "Wikipedia: Population decline"
  },
  {
    "id": "17839648-53f2-4442-85de-66111d9186a7",
    "text": "Which country has the highest population density in the world, excluding city-states like Monaco and Vatican City?",
    "options": [
      "Bangladesh",
      "South Korea",
      "Netherlands",
      "Taiwan"
    ],
    "correctIndex": 0,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Bangladesh has approximately 1,265 people per square kilometer, making it the most densely populated country excluding microstates.",
    "detailedExplanation": "Bangladesh consistently ranks as the most densely populated country in the world when excluding city-states and micronations. With over 164 million people packed into just 147,570 square kilometers, Bangladesh has a population density of approximately 1,265 people per square kilometer. This extreme density is due to the country's fertile delta region formed by the Ganges, Brahmaputra, and Meghna rivers, which has historically supported large agricultural populations in a relatively small area.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population_density",
    "citationTitle": "Wikipedia: List of countries and dependencies by population density"
  },
  {
    "id": "940b6860-9317-4120-a943-0df1eba40374",
    "text": "What is the approximate total fertility rate needed for a population to replace itself without immigration?",
    "options": [
      "1.8 children per woman",
      "2.1 children per woman",
      "2.5 children per woman",
      "1.5 children per woman"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The replacement fertility rate is approximately 2.1 children per woman in developed countries, accounting for mortality before reproductive age.",
    "detailedExplanation": "The replacement fertility rate, also known as replacement-level fertility, is approximately 2.1 children per woman in developed countries with low mortality rates. This figure accounts for the fact that not all children survive to reproductive age, and slightly more males are born than females (about 105 males per 100 females). In developing countries with higher infant and child mortality rates, the replacement fertility rate can be higher, sometimes reaching 2.3 or more children per woman. Countries with fertility rates below replacement level will experience population decline without immigration.",
    "citationUrl": "https://en.wikipedia.org/wiki/Total_fertility_rate",
    "citationTitle": "Wikipedia: Total fertility rate"
  },
  {
    "id": "4d2269ea-e3bf-4864-86ab-fb165bd7a18a",
    "text": "Which country experienced the largest absolute population decline between 2010 and 2020?",
    "options": [
      "Japan",
      "Germany",
      "Bulgaria",
      "Ukraine"
    ],
    "correctIndex": 3,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Ukraine lost approximately 2.2 million people between 2010 and 2020, the largest absolute decline of any country during that decade.",
    "detailedExplanation": "Ukraine experienced the largest absolute population decline of any country between 2010 and 2020, losing approximately 2.2 million people. This dramatic decline was caused by a combination of factors including low birth rates, high emigration rates, excess mortality, and the ongoing conflict in eastern Ukraine since 2014. The population dropped from about 45.9 million in 2010 to approximately 43.7 million in 2020. While other countries like Japan and several Eastern European nations also experienced population decline, none matched Ukraine's absolute numbers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Demographics_of_Ukraine",
    "citationTitle": "Wikipedia: Demographics of Ukraine"
  },
  {
    "id": "c3b8093f-1a0d-493f-abf5-f5a51847fd82",
    "text": "What percentage of Africa's population is under the age of 25?",
    "options": [
      "45%",
      "52%",
      "60%",
      "38%"
    ],
    "correctIndex": 2,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Approximately 60% of Africa's population is under 25 years old, making it the youngest continent demographically.",
    "detailedExplanation": "Africa has the youngest population structure of any continent, with approximately 60% of its 1.3+ billion people under the age of 25. This demographic profile is the result of sustained high fertility rates combined with gradually improving child survival rates across much of the continent. The median age in Africa is around 19 years, compared to 43 years in Europe and 38 years globally. This youth bulge presents both opportunities and challenges, potentially driving economic growth and innovation while also requiring massive investments in education, healthcare, and job creation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Demographics_of_Africa",
    "citationTitle": "Wikipedia: Demographics of Africa"
  },
  {
    "id": "1988df0a-0aa6-4c2c-ba82-8f098e856534",
    "text": "Which country has the highest median age in the world?",
    "options": [
      "Japan",
      "Monaco",
      "Germany",
      "Italy"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Monaco has the highest median age at approximately 55 years, followed closely by Japan at around 48 years.",
    "detailedExplanation": "Monaco holds the distinction of having the world's highest median age at approximately 55 years, largely due to its status as a wealthy principality that attracts affluent retirees and has very low birth rates. However, among major nations, Japan leads with a median age of around 48 years, reflecting its rapidly aging society caused by decades of below-replacement fertility rates and limited immigration. This aging trend has significant implications for Monaco's and Japan's economies, healthcare systems, and social structures, as they must support growing elderly populations with shrinking working-age cohorts.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_by_median_age",
    "citationTitle": "Wikipedia: List of countries by median age"
  },
  {
    "id": "9e3d4ef8-586e-4505-8501-cbd130b9048f",
    "text": "What is the estimated carrying capacity of Earth according to most demographic projections?",
    "options": [
      "8-10 billion people",
      "10-12 billion people",
      "12-15 billion people",
      "15-20 billion people"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Most demographic models suggest Earth's population will peak between 10-12 billion people around 2100 before stabilizing or declining.",
    "detailedExplanation": "Current demographic projections from the UN and other organizations suggest that Earth's population will peak somewhere between 10-12 billion people, likely around the year 2100, before stabilizing or beginning to decline. This projection is based on observed trends of declining fertility rates as countries develop economically and socially. The concept of carrying capacity is complex and depends not just on food production but also on resource consumption patterns, technology, climate change, and living standards. Some researchers argue the carrying capacity could be higher with technological advances, while others suggest it may be lower due to environmental constraints.",
    "citationUrl": "https://en.wikipedia.org/wiki/Projections_of_population_growth",
    "citationTitle": "Wikipedia: Projections of population growth"
  },
  {
    "id": "64153ef8-b61a-4310-9bd1-733dce0fbf9a",
    "text": "Which country has the highest population density among all sovereign nations with a population over 1 million people?",
    "options": [
      "Monaco",
      "Singapore",
      "Bangladesh",
      "Malta"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Singapore has the highest population density among countries with over 1 million people at approximately 8,000 people per square kilometer.",
    "detailedExplanation": "While Monaco has the highest population density in the world at over 19,000 people per square kilometer, its population is only around 39,000 people. Among countries with populations exceeding 1 million, Singapore takes the lead with approximately 8,000 people per square kilometer. Bangladesh follows with about 1,300 people per square kilometer, and Malta has around 1,600 people per square kilometer but a population under 500,000.",
    "citationUrl": "https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population_density",
    "citationTitle": "Wikipedia: List of countries and dependencies by population density"
  },
  {
    "id": "8db76301-f294-4f9f-a577-5939517ca4b9",
    "text": "According to demographic transition theory, which stage is characterized by high birth rates but declining death rates, leading to rapid population growth?",
    "options": [
      "Stage 1",
      "Stage 2",
      "Stage 3",
      "Stage 4"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "Stage 2 of demographic transition features high birth rates with declining death rates due to improved healthcare and sanitation, causing rapid population growth.",
    "detailedExplanation": "The demographic transition model describes how countries move through different stages of population change. Stage 1 features high birth and death rates with stable population. Stage 2 occurs when death rates decline due to improvements in medicine, sanitation, and food supply, while birth rates remain high, leading to rapid population growth. Stage 3 sees declining birth rates as urbanization and education increase. Stage 4 has low birth and death rates with stable population growth.",
    "citationUrl": "https://en.wikipedia.org/wiki/Demographic_transition",
    "citationTitle": "Wikipedia: Demographic transition"
  },
  {
    "id": "02b17296-3998-43d1-a12e-5ad35b149e7f",
    "text": "What is the approximate replacement fertility rate needed to maintain a stable population in developed countries?",
    "options": [
      "1.8 children per woman",
      "2.1 children per woman",
      "2.5 children per woman",
      "3.0 children per woman"
    ],
    "correctIndex": 1,
    "category": "geography",
    "difficulty": "hard",
    "explanation": "The replacement fertility rate is approximately 2.1 children per woman in developed countries to maintain population stability.",
    "detailedExplanation": "Replacement fertility is the total fertility rate at which a population exactly replaces itself from one generation to the next, without migration. In developed countries with low infant mortality rates, this rate is approximately 2.1 children per woman. The figure is slightly above 2.0 because it accounts for the small percentage of children who die before reaching reproductive age and the slightly higher number of male births compared to female births. In developing countries with higher infant mortality, the replacement rate can be higher, sometimes reaching 2.3 or more.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sub-replacement_fertility",
    "citationTitle": "Wikipedia: Sub-replacement fertility"
  }
]