[
  {
    "id": "7f587efd-d850-499f-9695-e24747f981c8",
    "text": "Which English king was known as 'Lackland' and was forced to sign the Magna Carta in 1215?",
    "options": [
      "Henry II",
      "John",
      "Richard I",
      "Edward I"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "King John earned the nickname 'Lackland' because he lost most English territories in France and was forced to sign the Magna Carta at Runnymede.",
    "detailedExplanation": "King John (1166-1216) was nicknamed 'Lackland' originally because as the youngest son of Henry II, he was not expected to inherit significant lands. However, the name became more fitting when he lost most of the English territories in France, including Normandy, to Philip II of France. His failures in warfare and heavy taxation led to a baronial revolt, forcing him to sign the Magna Carta at Runnymede in 1215, which limited royal power and established important legal principles.",
    "citationUrl": "https://en.wikipedia.org/wiki/John,_King_of_England",
    "citationTitle": "Wikipedia: John, King of England"
  },
  {
    "id": "b1bd101d-5d00-4e68-aa24-67ce85b5cd6f",
    "text": "Which monarch founded the Church of England and broke away from papal authority?",
    "options": [
      "Henry VII",
      "Henry VIII",
      "Edward VI",
      "Mary I"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Henry VIII broke from Rome and established the Church of England in the 1530s primarily to annul his marriage to Catherine of Aragon.",
    "detailedExplanation": "Henry VIII initiated the English Reformation in the 1530s when Pope Clement VII refused to annul his marriage to Catherine of Aragon. Through a series of acts of Parliament, including the Act of Supremacy in 1534, Henry established himself as the Supreme Head of the Church of England, effectively breaking England's religious ties with Rome. This religious revolution was driven more by Henry's desire for a male heir and his infatuation with Anne Boleyn than by theological concerns, but it fundamentally changed England's religious and political landscape.",
    "citationUrl": "https://en.wikipedia.org/wiki/English_Reformation",
    "citationTitle": "Wikipedia: English Reformation"
  },
  {
    "id": "f0bb281c-b04d-4c06-9412-8b5c1af0f73a",
    "text": "How long did Queen Victoria's reign last, making her the longest-reigning British monarch until Elizabeth II?",
    "options": [
      "58 years",
      "63 years",
      "67 years",
      "71 years"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Queen Victoria reigned for 63 years and 216 days (1837-1901), a record that stood until Elizabeth II surpassed it in 2015.",
    "detailedExplanation": "Queen Victoria ascended to the throne in 1837 at age 18 and reigned until her death in 1901, totaling 63 years and 216 days. Her reign, known as the Victorian Era, saw unprecedented expansion of the British Empire, industrial revolution, and social reform. She became a symbol of British imperial power and moral values. Her record as the longest-reigning British monarch stood for over a century until Queen Elizabeth II surpassed it on September 9, 2015, eventually reigning for over 70 years until her death in 2022.",
    "citationUrl": "https://en.wikipedia.org/wiki/Queen_Victoria",
    "citationTitle": "Wikipedia: Queen Victoria"
  },
  {
    "id": "4fad1af6-a1fc-4afa-9fb1-58472d6603e3",
    "text": "Which royal house came to power after the Wars of the Roses ended in 1485?",
    "options": [
      "House of York",
      "House of Lancaster",
      "House of Tudor",
      "House of Stuart"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Henry Tudor (Henry VII) founded the House of Tudor after defeating Richard III at the Battle of Bosworth Field in 1485.",
    "detailedExplanation": "The Wars of the Roses (1455-1487) was a series of civil wars between the Houses of Lancaster and York for control of the English throne. The conflict effectively ended at the Battle of Bosworth Field in 1485 when Henry Tudor, with a tenuous claim to the throne through his mother's Lancastrian lineage, defeated and killed Richard III of York. Henry VII then founded the House of Tudor, symbolically uniting the warring factions by marrying Elizabeth of York, Richard III's niece, thus combining the red rose of Lancaster with the white rose of York.",
    "citationUrl": "https://en.wikipedia.org/wiki/House_of_Tudor",
    "citationTitle": "Wikipedia: House of Tudor"
  },
  {
    "id": "4a2bc961-c45d-4824-91c9-c495ae6f23ba",
    "text": "Which British king was executed during the English Civil War in 1649?",
    "options": [
      "Charles I",
      "James I",
      "Charles II",
      "James II"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Charles I was executed on January 30, 1649, after being found guilty of treason by a parliamentary court during the English Civil War.",
    "detailedExplanation": "Charles I's conflicts with Parliament over taxation, religious policy, and royal prerogatives led to the English Civil War (1642-1651). After being defeated by Parliamentary forces led by Oliver Cromwell, Charles was captured and put on trial for high treason and 'other high crimes.' Despite refusing to recognize the court's authority, he was found guilty and executed outside the Banqueting House in Whitehall on January 30, 1649. His execution shocked European monarchies and led to the establishment of the Commonwealth of England under Oliver Cromwell.",
    "citationUrl": "https://en.wikipedia.org/wiki/Execution_of_Charles_I",
    "citationTitle": "Wikipedia: Execution of Charles I"
  },
  {
    "id": "25578fcd-a1b0-4da0-b384-de30a7dba23d",
    "text": "Who was known as the 'Lionheart' and spent most of his reign on crusade in the Holy Land?",
    "options": [
      "Richard I",
      "Edward I",
      "Henry V",
      "William I"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Richard I 'the Lionheart' spent most of his 10-year reign (1189-1199) fighting in the Third Crusade and defending his French territories.",
    "detailedExplanation": "Richard I, known as 'Coeur de Lion' or 'the Lionheart,' earned his nickname through his reputation as a great military leader and warrior during the Third Crusade (1189-1192). He spent only six months of his ten-year reign actually in England, dedicating most of his time and resources to crusading in the Holy Land and defending his extensive territories in France. His exploits against Saladin became legendary, though he failed to recapture Jerusalem. He died in 1199 from a crossbow wound while besieging a castle in France, leaving England heavily in debt from financing his military campaigns.",
    "citationUrl": "https://en.wikipedia.org/wiki/Richard_I_of_England",
    "citationTitle": "Wikipedia: Richard I of England"
  },
  {
    "id": "98030703-35ea-46db-a378-2c0f31309adc",
    "text": "Which Scottish king defeated the English at the Battle of Bannockburn in 1314?",
    "options": [
      "William Wallace",
      "John Balliol",
      "Robert the Bruce",
      "David I"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Robert the Bruce led the Scottish forces to a decisive victory over Edward II's English army at Bannockburn, securing Scottish independence.",
    "detailedExplanation": "Robert the Bruce, King of Scots from 1306 to 1329, achieved his greatest military victory at the Battle of Bannockburn on June 23-24, 1314. Leading a smaller Scottish army, he decisively defeated the much larger English force under Edward II, who had come north to relieve the besieged Stirling Castle. This victory effectively secured Scottish independence after years of warfare following Edward I's attempts to conquer Scotland. The battle became a defining moment in Scottish history and significantly weakened English claims to overlordship of Scotland, ultimately leading to the Declaration of Arbroath in 1320.",
    "citationUrl": "https://en.wikipedia.org/wiki/Battle_of_Bannockburn",
    "citationTitle": "Wikipedia: Battle of Bannockburn"
  },
  {
    "id": "9c273ecd-0af4-422c-b0ee-2b071adcf288",
    "text": "What was unusual about the reign of Lady Jane Grey in 1553?",
    "options": [
      "She was only 9 days old when crowned",
      "She reigned for only 9 days",
      "She ruled from prison",
      "She was crowned twice"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Lady Jane Grey's reign lasted only 9 days in July 1553 before Mary I successfully claimed the throne, earning Jane the nickname 'the Nine Days' Queen.'",
    "detailedExplanation": "Lady Jane Grey, great-granddaughter of Henry VII, was proclaimed queen on July 10, 1553, following the death of Edward VI. Her claim was based on Edward's will, which excluded his half-sisters Mary and Elizabeth from the succession to maintain Protestant rule. However, Mary Tudor had significant popular support and successfully challenged Jane's claim. Jane's reign ended on July 19, 1553, when Mary entered London triumphantly. Jane, who was likely a reluctant participant in this political maneuver orchestrated by powerful nobles including her father-in-law the Duke of Northumberland, was subsequently imprisoned in the Tower of London and executed for treason in 1554 at age 16.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lady_Jane_Grey",
    "citationTitle": "Wikipedia: Lady Jane Grey"
  },
  {
    "id": "45c0b258-0f02-4e4d-ba9a-abf4242e7b21",
    "text": "Which English king was known as 'Longshanks' due to his unusual height?",
    "options": [
      "Edward I",
      "Henry VIII",
      "Richard III",
      "William the Conqueror"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Edward I was nicknamed 'Longshanks' because he was exceptionally tall for his era, standing around 6'2\".",
    "detailedExplanation": "Edward I of England (1239-1307) earned the nickname 'Longshanks' due to his impressive height of approximately 6 feet 2 inches, which was considered extraordinarily tall for the medieval period. He was also known as the 'Hammer of the Scots' for his military campaigns in Scotland. His height was confirmed when his tomb was opened in 1774, revealing his well-preserved remains that confirmed historical accounts of his stature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Edward_I_of_England",
    "citationTitle": "Wikipedia: Edward I of England"
  },
  {
    "id": "4f48a7d0-d4a8-46de-8e42-c11877c51977",
    "text": "How many wives did Henry VIII have executed?",
    "options": [
      "One",
      "Two",
      "Three",
      "Four"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Henry VIII had two of his six wives executed: Anne Boleyn and Catherine Howard.",
    "detailedExplanation": "Of Henry VIII's six wives, two were executed on charges of treason. Anne Boleyn, his second wife and mother of Elizabeth I, was beheaded in 1536 on charges of adultery, incest, and treason. Catherine Howard, his fifth wife, was also beheaded in 1542 on similar charges of adultery and treason. His other wives met different fates: Catherine of Aragon was divorced, Jane Seymore died in childbirth, Anne of Cleves was divorced, and Catherine Parr survived him.",
    "citationUrl": "https://en.wikipedia.org/wiki/Wives_of_Henry_VIII",
    "citationTitle": "Wikipedia: Wives of Henry VIII"
  },
  {
    "id": "821d7036-07ae-4a75-9371-688adb3fad8d",
    "text": "Which British monarch had the shortest reign in history?",
    "options": [
      "Lady Jane Grey",
      "Edward VIII",
      "Edward V",
      "William IV"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Lady Jane Grey reigned for only 9 days in 1553, earning her the title 'Nine Days' Queen'.",
    "detailedExplanation": "Lady Jane Grey holds the record for the shortest reign in British royal history, ruling for just nine days from July 10-19, 1553. She was proclaimed queen following the death of Edward VI, as part of a Protestant succession plan to prevent the Catholic Mary Tudor from taking the throne. However, Mary gathered support and successfully claimed the crown, leading to Jane's imprisonment in the Tower of London. Jane was eventually executed in 1554 at age 16, becoming known to history as the 'Nine Days' Queen'.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lady_Jane_Grey",
    "citationTitle": "Wikipedia: Lady Jane Grey"
  },
  {
    "id": "22953c98-d15e-49e9-b7ee-14e8b28e9821",
    "text": "Which king established the Church of England?",
    "options": [
      "Henry VII",
      "Henry VIII",
      "Edward VI",
      "James I"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Henry VIII established the Church of England in 1534 through the Act of Supremacy.",
    "detailedExplanation": "Henry VIII established the Church of England in 1534 when Parliament passed the Act of Supremacy, which declared the king to be the 'Supreme Head of the Church of England.' This break with Rome was primarily motivated by Henry's desire to annul his marriage to Catherine of Aragon, which Pope Clement VII had refused to authorize. The English Reformation that followed fundamentally changed the religious landscape of England and established the monarch as the head of the English church, a position still held by British monarchs today.",
    "citationUrl": "https://en.wikipedia.org/wiki/English_Reformation",
    "citationTitle": "Wikipedia: English Reformation"
  },
  {
    "id": "2cd8ec13-99d6-4071-a195-09ce60df52c9",
    "text": "What year did Queen Victoria's reign end?",
    "options": [
      "1899",
      "1901",
      "1903",
      "1905"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Queen Victoria died on January 22, 1901, ending her 63-year reign.",
    "detailedExplanation": "Queen Victoria's reign ended with her death on January 22, 1901, at Osborne House on the Isle of Wight. Her reign of 63 years and 216 days was the longest in British history until it was surpassed by Elizabeth II in 2015. Victoria's death marked the end of the Victorian era and the beginning of the Edwardian period under her son Edward VII. Her reign had seen massive changes including industrialization, expansion of the British Empire, and significant social reforms.",
    "citationUrl": "https://en.wikipedia.org/wiki/Queen_Victoria",
    "citationTitle": "Wikipedia: Queen Victoria"
  },
  {
    "id": "88ad2bc9-eff8-456b-bd8b-fc7931c2a664",
    "text": "Which monarch was restored to the English throne in 1660?",
    "options": [
      "James II",
      "Charles I",
      "Charles II",
      "William III"
    ],
    "correctIndex": 2,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Charles II was restored to the throne in 1660, ending the Commonwealth period.",
    "detailedExplanation": "Charles II was restored to the English throne in 1660, marking the end of the republican Commonwealth period that had lasted since his father Charles I's execution in 1649. This event, known as the English Restoration, occurred after the collapse of the Protectorate following Oliver Cromwell's death in 1658. Charles II had been living in exile in France and the Netherlands. His restoration was facilitated by General George Monck and was welcomed by many who had grown weary of Puritan rule. The period that followed was known as the Restoration era.",
    "citationUrl": "https://en.wikipedia.org/wiki/Stuart_Restoration",
    "citationTitle": "Wikipedia: Stuart Restoration"
  },
  {
    "id": "51bcf0f7-a2fd-4cbb-97d6-e893c3847bb0",
    "text": "Who was the first Hanoverian monarch of Great Britain?",
    "options": [
      "George I",
      "George II",
      "William III",
      "Anne"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "George I became the first Hanoverian king in 1714 following Queen Anne's death.",
    "detailedExplanation": "George I became the first Hanoverian monarch of Great Britain in 1714, following the death of Queen Anne who left no surviving children. George was chosen because he was Anne's closest living Protestant relative, being the great-grandson of James I through his mother. The Act of Settlement 1701 had established that only Protestant descendants could inherit the throne, which excluded many closer Catholic relatives. George I spoke little English and spent much of his time in Hanover, which contributed to the development of the modern constitutional monarchy as power increasingly shifted to Parliament and his ministers.",
    "citationUrl": "https://en.wikipedia.org/wiki/George_I_of_Great_Britain",
    "citationTitle": "Wikipedia: George I of Great Britain"
  },
  {
    "id": "cf053232-6ae7-412b-b98c-98a94cc7436b",
    "text": "In what year did Queen Victoria's reign begin?",
    "options": [
      "1835",
      "1837",
      "1840",
      "1842"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Queen Victoria became queen in 1837 at age 18, following the death of her uncle King William IV.",
    "detailedExplanation": "Queen Victoria ascended to the throne on June 20, 1837, at just 18 years old, following the death of her uncle King William IV who had no surviving legitimate children. Her reign would last 63 years until her death in 1901, making her the second-longest reigning British monarch after Elizabeth II. The Victorian era became synonymous with British imperial expansion, industrial progress, and strict moral codes. She married Prince Albert in 1840 and had nine children who married into royal families across Europe.",
    "citationUrl": "https://en.wikipedia.org/wiki/Queen_Victoria",
    "citationTitle": "Wikipedia: Queen Victoria"
  },
  {
    "id": "e3557759-878c-417b-8b64-9aff4fce5926",
    "text": "Which English king was known as 'Longshanks' and conquered Wales in the 13th century?",
    "options": [
      "Edward I",
      "Edward II",
      "Henry III",
      "Richard I"
    ],
    "correctIndex": 0,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Edward I was nicknamed 'Longshanks' due to his tall stature and successfully conquered Wales between 1277-1283.",
    "detailedExplanation": "Edward I (1239-1307) earned the nickname 'Longshanks' because of his unusual height for the time period, standing over 6 feet tall. He conducted two major campaigns in Wales, first in 1277 and then decisively in 1282-1283, which resulted in the complete conquest of Wales. He built a series of castles to maintain control and made his son Edward the first English Prince of Wales in 1301, establishing a tradition that continues today.",
    "citationUrl": "https://en.wikipedia.org/wiki/Edward_I_of_England",
    "citationTitle": "Wikipedia: Edward I of England"
  },
  {
    "id": "ce5b0881-0858-49e1-b894-6667bf2eaf26",
    "text": "Which Tudor monarch was married six times and established the Church of England?",
    "options": [
      "Henry VII",
      "Henry VIII",
      "Edward VI",
      "Mary I"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Henry VIII famously had six wives and broke from Rome to establish the Church of England in 1534.",
    "detailedExplanation": "Henry VIII (1491-1547) is one of England's most notorious monarchs, primarily remembered for his six marriages and his break with the Roman Catholic Church. When Pope Clement VII refused to annul his marriage to Catherine of Aragon, Henry established the Church of England through the Act of Supremacy in 1534, making himself Supreme Head of the English Church. This dramatic religious and political shift was initially motivated by his desire to remarry and produce a male heir, but it fundamentally changed English society and religion.",
    "citationUrl": "https://en.wikipedia.org/wiki/Henry_VIII",
    "citationTitle": "Wikipedia: Henry VIII"
  },
  {
    "id": "3c19c00d-e850-439b-a077-a1118b7da056",
    "text": "In what year did Queen Victoria's reign end with her death?",
    "options": [
      "1899",
      "1901",
      "1903",
      "1905"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Queen Victoria died on January 22, 1901, ending the Victorian era after 63 years on the throne.",
    "detailedExplanation": "Queen Victoria died on January 22, 1901, at Osborne House on the Isle of Wight, aged 81. Her death marked the end of the Victorian era, which had lasted for over 63 years, making her the longest-reigning British monarch at that time (a record later surpassed by Elizabeth II). Her reign saw massive industrial, cultural, political, scientific and military changes within the United Kingdom, and the British Empire reached its zenith during her rule. She was succeeded by her eldest son, Edward VII.",
    "citationUrl": "https://en.wikipedia.org/wiki/Queen_Victoria",
    "citationTitle": "Wikipedia: Queen Victoria"
  },
  {
    "id": "2c9ba697-81d1-40b0-8b20-2a18837aad49",
    "text": "Which British king abdicated the throne in 1936 to marry American divorcée Wallis Simpson?",
    "options": [
      "George V",
      "Edward VIII",
      "George VI",
      "Edward VII"
    ],
    "correctIndex": 1,
    "category": "history",
    "difficulty": "medium",
    "explanation": "Edward VIII abdicated in December 1936 after less than a year as king to marry Wallis Simpson.",
    "detailedExplanation": "Edward VIII reigned for only 326 days in 1936 before abdicating on December 11, 1936, to marry Wallis Simpson, an American socialite who had been divorced twice. The British government, the Church of England, and the Dominion governments opposed the marriage, as the Church of England did not permit remarriage after divorce if the former spouse was still alive. His abdication caused a constitutional crisis and led to his younger brother Albert becoming King George VI. Edward was subsequently given the title Duke of Windsor.",
    "citationUrl": "https://en.wikipedia.org/wiki/Edward_VIII",
    "citationTitle": "Wikipedia: Edward VIII"
  }
]