[
  {
    "id": "910b3009-3d81-4215-8021-0ab29d0cfeac",
    "text": "In Terry Pratchett's Discworld series, what is the name of the turtle that carries the four elephants supporting the Disc?",
    "options": [
      "Great A'Tuin",
      "Om",
      "Binky",
      "The Luggage"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Great A'Tuin is the World Turtle that carries the four elephants Berilia, Tubul, Great T'Phon, and Jerakeen, who in turn support the Disc.",
    "detailedExplanation": "Great A'Tuin is the giant star turtle (of the species Chelys galactica) that travels through space carrying the four giant elephants that support the Discworld on their backs. This cosmic turtle is a fundamental part of Pratchett's mythology, and its gender and ultimate destination remain mysteries throughout the series. Great A'Tuin is said to be slowly swimming through space toward an unknown destination, and some characters speculate about what will happen when it arrives.",
    "citationUrl": "https://en.wikipedia.org/wiki/Discworld_(world)",
    "citationTitle": "Wikipedia: Discworld (world)"
  },
  {
    "id": "2d45f4b6-c729-4792-88b7-6445a3943522",
    "text": "Which fantasy series features the magical system called 'Allomancy' where practitioners ingest and burn metals to gain supernatural abilities?",
    "options": [
      "The Wheel of Time",
      "Mistborn",
      "The Stormlight Archive",
      "The Kingkiller Chronicle"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Allomancy is the primary magic system in Brandon Sanderson's Mistborn series, where Allomancers consume and metabolize metals to fuel magical abilities.",
    "detailedExplanation": "In Brandon Sanderson's Mistborn series, Allomancy is one of the three main Metallic Arts. Allomancers ingest metal shavings or flakes, then 'burn' them internally to produce various magical effects. Each of the sixteen metals grants different abilities - iron and steel allow manipulation of metals, pewter enhances physical abilities, tin sharpens senses, and the more rare metals like atium allow users to see slightly into the future. The magic system is known for its hard rules and scientific approach to fantasy magic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mistborn_series",
    "citationTitle": "Wikipedia: Mistborn series"
  },
  {
    "id": "e98db27e-7467-44ee-9559-317f5b2ddabc",
    "text": "In Robin Hobb's Realm of the Elderlings series, what is the name of the skill that allows mental communication and influence between practitioners?",
    "options": [
      "The Wit",
      "The Skill",
      "Forging",
      "Stone-shaping"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Skill is the telepathic magic system used by the Farseer royal family, allowing mental communication, healing, and influence over others.",
    "detailedExplanation": "The Skill is an ancient magic in Robin Hobb's Realm of the Elderlings that allows practitioners to communicate telepathically across great distances, influence others' thoughts and emotions, and perform powerful healing. It was traditionally used by the Farseer royal family and their coteries. The magic is dangerous and addictive, and untrained users can lose themselves in the 'Skill-stream' - the flow of consciousness that connects all Skill-users. The protagonist FitzChivalry Farseer struggles throughout the series to master this ability while avoiding its perils.",
    "citationUrl": "https://en.wikipedia.org/wiki/Farseer_trilogy",
    "citationTitle": "Wikipedia: Farseer trilogy"
  },
  {
    "id": "c537b04a-84c3-4ebd-bada-2d52804753d0",
    "text": "What is the name of the sword wielded by Elric of Melniboné in Michael Moorcock's series?",
    "options": [
      "Mournblade",
      "Stormbringer",
      "Blackblade",
      "Kinslayer"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Stormbringer is Elric's cursed runesword that feeds on souls and grants him strength, but also brings tragedy to those he loves.",
    "detailedExplanation": "Stormbringer is the infamous black runesword wielded by Elric of Melniboné in Michael Moorcock's sword and sorcery series. The blade is semi-sentient and feeds on the souls of those it kills, providing Elric with strength and vitality to compensate for his physical weakness as an albino. However, the sword is cursed and has a malevolent will of its own, often forcing Elric to kill friends and loved ones. Stormbringer has become one of the most iconic weapons in fantasy literature and has influenced countless other fictional magical swords.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elric_of_Melnibon%C3%A9",
    "citationTitle": "Wikipedia: Elric of Melniboné"
  },
  {
    "id": "3e17216b-5a83-4f79-a1e9-b6f85c4d74d9",
    "text": "In Glen Cook's The Black Company series, what is the name of the ancient evil sorceress who becomes the Lady?",
    "options": [
      "Ardath",
      "The Dominator",
      "Soulcatcher",
      "Her name is never revealed"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Lady's true name is never revealed in the series - she is only known by her title, as speaking her true name would give power over her.",
    "detailedExplanation": "In Glen Cook's The Black Company series, the Lady is one of the most powerful sorceresses in the world, but her true name is never revealed throughout the entire series. This is a deliberate choice by Cook, as in the series' magic system, knowing someone's true name grants power over them. The Lady was once married to the Dominator and was one of the Ten Who Were Taken, but after being freed from his control, she maintains her anonymity as a form of protection. Even Croaker, who becomes intimately involved with her, never learns her real name.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Black_Company",
    "citationTitle": "Wikipedia: The Black Company"
  },
  {
    "id": "3e48b612-f51d-43ae-ad36-0370a19e4427",
    "text": "Which fantasy author created the 'Malazan' world and co-authored the Malazan Book of the Fallen series?",
    "options": [
      "Steven Erikson only",
      "Ian C. Esslemont only",
      "Steven Erikson and Ian C. Esslemont",
      "Glen Cook and Steven Erikson"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Steven Erikson and Ian C. Esslemont co-created the Malazan world through their gaming campaigns, though Erikson wrote the main ten-book series.",
    "detailedExplanation": "The Malazan world was co-created by Steven Erikson and Ian C. Esslemont during their university years through gaming campaigns and archaeological studies. While Steven Erikson wrote the main Malazan Book of the Fallen ten-book series, Ian C. Esslemont has written several companion novels set in the same world, including the Malazan Empire series. Both authors continue to contribute to the Malazan universe, with Erikson focusing on prequels and Esslemont exploring different aspects of their shared world. Their collaboration began in the 1980s and has resulted in one of the most complex and expansive fantasy universes in modern literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Malazan_Book_of_the_Fallen",
    "citationTitle": "Wikipedia: Malazan Book of the Fallen"
  },
  {
    "id": "fb22d25e-e73f-4418-842e-30112ac3fe9c",
    "text": "In Tad Williams' Memory, Sorrow, and Thorn series, what are the names of the three titular swords?",
    "options": [
      "Memory, Sorrow, and Thorn",
      "Bright-Nail, Sorrow, and Thorn",
      "Minneyar, Sorrow, and Jingizu",
      "Thorn, Bright-Nail, and Minneyar"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The three Great Swords are Thorn, Bright-Nail (formerly Minneyar), and Sorrow (Jingizu), though the series title uses the metaphorical names.",
    "detailedExplanation": "In Tad Williams' Memory, Sorrow, and Thorn series, the three Great Swords that are central to the plot are actually named Thorn, Bright-Nail, and Sorrow. However, the series title refers to them metaphorically: Memory refers to Bright-Nail (which was reforged from the sword Minneyar), Sorrow refers to the sword Jingizu, and Thorn keeps its actual name. These three swords were forged in ancient times and are key to defeating the returning Storm King. The complexity of their naming - with both actual names and metaphorical titles - reflects Williams' intricate world-building and the layered history of his fantasy realm.",
    "citationUrl": "https://en.wikipedia.org/wiki/Memory,_Sorrow,_and_Thorn",
    "citationTitle": "Wikipedia: Memory, Sorrow, and Thorn"
  },
  {
    "id": "8d302e4e-1664-4e78-8802-06b4cbdfa97b",
    "text": "In Joe Abercrombie's First Law series, what is the real identity of the mysterious figure known as The Prophet Khalul?",
    "options": [
      "He is Bayaz in disguise",
      "He is one of the Magi, rival to Bayaz",
      "He is a demon from the Other Side",
      "He is actually Glokta's father"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Khalul is revealed to be one of the Magi, an ancient wizard and former apprentice of Juvens, making him Bayaz's peer and rival.",
    "detailedExplanation": "In Joe Abercrombie's First Law universe, Khalul is revealed to be one of the Magi, the ancient wizards who were apprentices to Juvens alongside Bayaz. While Bayaz presents himself as the last of the Magi and a force for civilization in the Union, Khalul operates from the South as the Prophet of the Gurkish Empire. The revelation of Khalul's true nature as another surviving Magi adds complexity to Bayaz's claims about being the sole guardian of civilization, and shows that the conflict between the Union and Gurkish Empire is really a proxy war between two ancient, powerful wizards with their own agendas.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_First_Law",
    "citationTitle": "Wikipedia: The First Law"
  },
  {
    "id": "4b641cdc-7899-4926-a5bf-b374e1a62698",
    "text": "In Patrick Rothfuss's The Kingkiller Chronicle, what is the name of the ancient tree that grows in the courtyard of the University and is considered nearly immortal?",
    "options": [
      "The Heart Tree",
      "The Mews",
      "The Mauthen Farm Oak",
      "The Cthaeh"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Mews is the ancient tree in the University courtyard.",
    "detailedExplanation": "The Mews is a massive, ancient tree that grows in the Mews courtyard at the University in Patrick Rothfuss's Kingkiller Chronicle series. It is described as being incredibly old and nearly immortal, serving as a central landmark of the University. Students often gather beneath its branches, and it plays a significant role in the daily life of the institution where Kvothe studies.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kingkiller_Chronicle",
    "citationTitle": "Wikipedia: The Kingkiller Chronicle"
  },
  {
    "id": "f9156759-28c0-45be-9789-1431ecf02108",
    "text": "In N.K. Jemisin's Broken Earth trilogy, what geological phenomenon serves as the magical system that certain people can control?",
    "options": [
      "Volcanic eruptions",
      "Seismic activity and earthquakes",
      "Crystal formations",
      "Magnetic fields"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Orogenes in the series can control seismic activity and earthquakes.",
    "detailedExplanation": "In N.K. Jemisin's Hugo Award-winning Broken Earth trilogy, the magic system revolves around orogeny - the ability to control seismic and geological forces. Orogenes can sense and manipulate the kinetic and thermal energy within the earth, allowing them to start, stop, or redirect earthquakes and other seismic events. This power is both feared and essential in a world constantly threatened by catastrophic seismic disasters called 'Seasons.'",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Broken_Earth",
    "citationTitle": "Wikipedia: The Broken Earth"
  },
  {
    "id": "3eb7c799-1f62-47d3-95b5-cfed08048cdc",
    "text": "In Ursula K. Le Guin's Earthsea series, what is the fundamental rule about using magic that all wizards must learn?",
    "options": [
      "Magic always demands a blood sacrifice",
      "Every spell cast shortens the wizard's life",
      "Magic cannot create, only transform what already exists",
      "Using magic in anger turns the wizard evil"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "In Earthsea, magic follows the principle of equilibrium and cannot create something from nothing.",
    "detailedExplanation": "In Ursula K. Le Guin's Earthsea series, magic operates under strict natural laws, primarily the concept of equilibrium. Magic cannot create matter or energy from nothing - it can only transform, move, or change what already exists. This fundamental principle means that every magical act has consequences, and wizards must carefully consider the balance of their actions. This philosophical approach to magic reflects Le Guin's deeper themes about responsibility and the interconnectedness of all things.",
    "citationUrl": "https://en.wikipedia.org/wiki/Earthsea",
    "citationTitle": "Wikipedia: Earthsea"
  },
  {
    "id": "a43ce4b2-c7d8-4a20-80b8-47476cb72376",
    "text": "In Gene Wolfe's The Book of the New Sun series, what is the profession of the protagonist Severian before his exile?",
    "options": [
      "Torturer",
      "Librarian",
      "Soldier",
      "Priest"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Severian is a torturer in the Guild of Torturers before being exiled.",
    "detailedExplanation": "In Gene Wolfe's acclaimed Book of the New Sun series, the protagonist Severian begins as a member of the Guild of Torturers, specifically trained in the art of inflicting pain and executing criminals. He is exiled from the guild after showing mercy to a client, which goes against the guild's strict code. This unusual protagonist choice reflects Wolfe's complex exploration of morality, redemption, and the unreliable narrator, as Severian claims to have perfect memory while clearly being an unreliable storyteller.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Book_of_the_New_Sun",
    "citationTitle": "Wikipedia: The Book of the New Sun"
  },
  {
    "id": "9d43c570-10cf-4caa-9e9b-ace8834a3008",
    "text": "In Robert Jordan's Wheel of Time series, what is the name of the wolves' shared consciousness that certain characters can access?",
    "options": [
      "The Pack Mind",
      "The Wolf Dream",
      "The Hunt Eternal",
      "The Wild Calling"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Wolf Dream is the shared consciousness and dream world of wolves.",
    "detailedExplanation": "In Robert Jordan's Wheel of Time series, the Wolf Dream (also called Tel'aran'rhiod when referring to the World of Dreams more broadly) is a spiritual realm that wolves naturally access, and which certain humans like Perrin Aybara can enter. Those with the ability to communicate with wolves can access this shared consciousness where wolves exist as spirits, and time moves differently. It's a dangerous realm where death in the dream can mean death in reality, and it plays a crucial role in several characters' development throughout the series.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wheel_of_Time",
    "citationTitle": "Wikipedia: The Wheel of Time"
  },
  {
    "id": "58501c2b-79f1-498a-b1cd-8b39ea341c77",
    "text": "In China Miéville's Bas-Lag series, what is the name of the bizarre floating city that appears in 'The Scar'?",
    "options": [
      "Armada",
      "New Crobuzon",
      "Tesh",
      "Iron Bay"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Armada is the massive floating pirate city featured in 'The Scar.'",
    "detailedExplanation": "Armada is the extraordinary floating city that serves as the primary setting for China Miéville's novel 'The Scar,' the second book in his Bas-Lag series. This massive floating metropolis is constructed from thousands of captured ships of all kinds lashed together, inhabited by pirates, refugees, and outcasts. Armada constantly moves across the oceans, growing larger as it captures more vessels. The city represents Miéville's innovative approach to weird fiction and urban fantasy, combining steampunk elements with bizarre, surreal imagery.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Scar_(novel)",
    "citationTitle": "Wikipedia: The Scar (novel)"
  },
  {
    "id": "615ee241-1eeb-4f7f-b571-2a59beb02320",
    "text": "In Scott Lynch's Gentleman Bastard series, what is the name of the Venice-like city where the first book 'The Lies of Locke Lamora' primarily takes place?",
    "options": [
      "Tal Verrar",
      "Karthain",
      "Camorr",
      "Espara"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Camorr is the canal city inspired by Venice where most of the first book occurs.",
    "detailedExplanation": "Camorr is the primary setting of Scott Lynch's 'The Lies of Locke Lamora' and serves as the base of operations for the Gentleman Bastards. This fictional city is heavily inspired by Renaissance Venice, complete with canals, bridges, and a complex social hierarchy. Built on islands and connected by waterways, Camorr is divided into different districts and is known for its elaborate cons, criminal organizations, and the ancient Elderglass structures left by a previous civilization. The city's rich detail and atmosphere are crucial to the series' blend of fantasy and heist fiction.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Lies_of_Locke_Lamora",
    "citationTitle": "Wikipedia: The Lies of Locke Lamora"
  },
  {
    "id": "3ab82744-1ac2-46f3-8ba5-e4b9c8ba0cd5",
    "text": "In Brandon Sanderson's Stormlight Archive series, what are the massive hurricane-like storms that regularly devastate the continent called?",
    "options": [
      "Everstorms",
      "Highstorms",
      "Voidstorms",
      "Stormwalls"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Highstorms are the massive magical storms that regularly cross Roshar.",
    "detailedExplanation": "Highstorms are the massive, magical hurricane-like storms that regularly sweep across the continent of Roshar in Brandon Sanderson's Stormlight Archive series. These storms are so powerful and frequent that they have shaped the entire ecology, architecture, and culture of the world. Highstorms bring both destruction and life - they carry Stormlight, the magical energy that powers much of the world's magic system, and they follow predictable patterns that allow people to prepare for them. The storms are tied to the world's fundamental magical and cosmological systems.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Stormlight_Archive",
    "citationTitle": "Wikipedia: The Stormlight Archive"
  },
  {
    "id": "51f6f6ad-2397-4a32-8ee4-7d9fec248ca6",
    "text": "In Steven Erikson's Malazan Book of the Fallen series, what is the name of the ancient warren (magical realm) of darkness that is considered one of the oldest and most dangerous?",
    "options": [
      "Kurald Galain",
      "Kurald Emurlahn",
      "Tellann",
      "Omtose Phellack"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Kurald Galain is the warren of Darkness, one of the Elder Warrens in the Malazan universe.",
    "detailedExplanation": "In Steven Erikson's complex Malazan Book of the Fallen series, warrens serve as sources of magical power and alternate dimensions. Kurald Galain, the warren of Darkness, is one of the most ancient and powerful Elder Warrens. It is closely associated with the Tiste Andii race and plays a crucial role throughout the series, particularly in the storylines involving Anomander Rake and the politics of the ancient races.",
    "citationUrl": "https://en.wikipedia.org/wiki/Malazan_Book_of_the_Fallen",
    "citationTitle": "Wikipedia: Malazan Book of the Fallen"
  },
  {
    "id": "b198b0cd-78be-4109-88f4-83cab5155e0b",
    "text": "In Michael J. Sullivan's Riyria Revelations series, what are the first names of the two protagonists who form the thieving partnership known as Riyria?",
    "options": [
      "Royce and Hadrian",
      "Marcus and Theron",
      "Gareth and Alric",
      "Esrahaddon and Degan"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Royce Melborn and Hadrian Blackwater are the two main characters who form the thieving duo Riyria.",
    "detailedExplanation": "The Riyria Revelations series by Michael J. Sullivan follows the adventures of Royce Melborn, a skilled assassin and thief, and Hadrian Blackwater, a mercenary and swordsman. Together they form Riyria, which means 'two' in elvish. Their contrasting personalities - Royce's cynicism and Hadrian's optimism - create much of the series' dynamic as they become embroiled in increasingly complex political conspiracies.",
    "citationUrl": "https://en.wikipedia.org/wiki/Michael_J._Sullivan_(author)",
    "citationTitle": "Wikipedia: Michael J. Sullivan (author)"
  },
  {
    "id": "0ad9d878-71d7-478c-b237-278fff16a2e8",
    "text": "In Mark Lawrence's Broken Empire trilogy, what title does the protagonist Jorg Ancrath eventually claim by the end of the series?",
    "options": [
      "Emperor of the Broken Empire",
      "King of Red March",
      "Prince of Arrow",
      "Duke of Ancrath"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Jorg Ancrath becomes Emperor of the Broken Empire, uniting the fractured kingdoms under his rule.",
    "detailedExplanation": "Mark Lawrence's Broken Empire trilogy follows the dark journey of Prince Jorg Ancrath from a ruthless young royal to ultimately becoming Emperor of the Broken Empire. Set in a post-apocalyptic world that was once our own, Jorg's quest for power culminates in his coronation as Emperor, achieving his goal of uniting the fragmented kingdoms of what was once Europe under a single rule, though his methods are often morally questionable.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Broken_Empire",
    "citationTitle": "Wikipedia: The Broken Empire"
  },
  {
    "id": "a711dbc7-df28-491f-9211-81d60cb07827",
    "text": "In Kate Elliott's Crown of Stars series, what catastrophic magical event from the distant past continues to threaten the world throughout the series?",
    "options": [
      "The Sundering",
      "The Cataclysm",
      "The Cursed Ones' return",
      "The Great Drought"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The return of the Cursed Ones, an ancient people banished long ago, is the overarching threat in the Crown of Stars series.",
    "detailedExplanation": "Kate Elliott's Crown of Stars series is built around the looming return of the Cursed Ones, an ancient civilization that was magically banished from the world centuries ago. As astronomical alignments approach that will allow their return, the various kingdoms and peoples must prepare for this existential threat. The series explores themes of political intrigue, religious conflict, and social change against this backdrop of approaching apocalyptic danger.",
    "citationUrl": "https://en.wikipedia.org/wiki/Kate_Elliott",
    "citationTitle": "Wikipedia: Kate Elliott"
  }
]