[
  {
    "id": "9e0f49f1-2775-4b6a-836b-491a79645327",
    "text": "In Terry Pratchett's Discworld series, what creature does the Disc rest upon?",
    "options": [
      "Four elephants",
      "A giant turtle",
      "A colossal dragon",
      "The World Tree"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Discworld rests on four giant elephants standing on the shell of Great A'Tuin, a giant turtle.",
    "detailedExplanation": "Terry Pratchett's Discworld is a flat disc supported by four giant elephants named Berilia, Tubul, Great T'Phon, and Jerakeen. These elephants stand on the shell of Great A'Tuin, a giant star turtle swimming through space. This cosmology is based on various mythological traditions, particularly Hindu and Native American creation myths, and serves as the foundation for Pratchett's satirical fantasy universe spanning over 40 novels.",
    "citationUrl": "https://en.wikipedia.org/wiki/Discworld_(world)",
    "citationTitle": "Wikipedia: Discworld (world)"
  },
  {
    "id": "34429c11-48c7-4ff3-947a-3dac01fb2934",
    "text": "Which fantasy series features the concept of 'weaves' and the One Power divided into saidin and saidar?",
    "options": [
      "The Kingkiller Chronicle",
      "The Wheel of Time",
      "The First Law trilogy",
      "The Stormlight Archive"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Wheel of Time series by Robert Jordan features the One Power, divided into male (saidin) and female (saidar) halves.",
    "detailedExplanation": "In Robert Jordan's epic 14-book series The Wheel of Time, magic users channel the One Power through complex patterns called 'weaves.' The One Power is divided into saidin (the male half) and saidar (the female half), which work differently and cannot be directly sensed by users of the opposite half. This gender-based magic system is central to the series' plot, especially since saidin was tainted by the Dark One, driving male channelers insane.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wheel_of_Time",
    "citationTitle": "Wikipedia: The Wheel of Time"
  },
  {
    "id": "e1ec8438-a3bd-477f-bad5-852d28806d54",
    "text": "In Brandon Sanderson's Mistborn series, what is the name of the magic system that involves ingesting and burning metals?",
    "options": [
      "Feruchemy",
      "Hemalurgy",
      "Allomancy",
      "Awakening"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Allomancy is the magic system where practitioners ingest and burn metals to gain supernatural abilities.",
    "detailedExplanation": "Allomancy is one of three magic systems in Brandon Sanderson's Mistborn series. Allomancers swallow small amounts of specific metals and then 'burn' them internally to fuel magical abilities. Each metal grants different powers - iron and steel for pushing and pulling on metals, pewter for enhanced strength, tin for enhanced senses, and so on. The most powerful Allomancers, called Mistborn, can use all metals, while Mistings can only use one type.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mistborn_series",
    "citationTitle": "Wikipedia: Mistborn series"
  },
  {
    "id": "981f0b92-4ee4-4904-8a9c-8f82352e4dfa",
    "text": "Which author wrote The Chronicles of Amber series featuring the protagonist Corwin of Amber?",
    "options": [
      "Glen Cook",
      "Roger Zelazny",
      "Michael Moorcock",
      "Fritz Leiber"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Roger Zelazny wrote The Chronicles of Amber, a 10-book series following Prince Corwin and later his son Merlin.",
    "detailedExplanation": "Roger Zelazny's Chronicles of Amber consists of two five-book series published between 1970 and 1991. The first series follows Prince Corwin of Amber as he recovers his memories and fights for the throne of Amber, the one true world of which all others are shadows. The series is known for its innovative use of the concept of parallel worlds, the Pattern that creates reality, and Zelazny's poetic prose style that earned him multiple Hugo and Nebula awards.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Chronicles_of_Amber",
    "citationTitle": "Wikipedia: The Chronicles of Amber"
  },
  {
    "id": "9959dce5-7ecc-4699-b80f-8c9838da6212",
    "text": "In Robin Hobb's Realm of the Elderlings, what type of magical creatures are central to multiple series within this universe?",
    "options": [
      "Phoenixes",
      "Dragons",
      "Unicorns",
      "Griffins"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Dragons are central to Robin Hobb's Realm of the Elderlings, appearing prominently across multiple interconnected series.",
    "detailedExplanation": "Dragons are fundamental to Robin Hobb's Realm of the Elderlings universe, which spans multiple series including the Fitz and Fool trilogies, the Liveship Traders, and the Rain Wild Chronicles. The dragons have a complex lifecycle involving sea serpents and dragon cocoons, and they share an ancient connection with the mysterious Elderlings race. The magical memory stone and the city of Kelsingra are also tied to dragon lore, making these creatures essential to the overarching mythology of Hobb's interconnected fantasy world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Realm_of_the_Elderlings",
    "citationTitle": "Wikipedia: Realm of the Elderlings"
  },
  {
    "id": "edfbd759-f59f-480a-95e1-2eb1dd12f21d",
    "text": "Which fantasy series by Joe Abercrombie is known for its gritty, morally ambiguous take on traditional fantasy tropes?",
    "options": [
      "The Broken Empire",
      "The First Law",
      "The Gentleman Bastard",
      "The Powder Mage"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Joe Abercrombie's The First Law series is famous for subverting fantasy tropes with morally gray characters and realistic consequences.",
    "detailedExplanation": "Joe Abercrombie's The First Law trilogy, beginning with 'The Blade Itself' (2006), is considered a landmark work in grimdark fantasy. The series deliberately subverts traditional fantasy tropes by featuring morally ambiguous protagonists, anticlimactic quests, and realistic political consequences. Characters like Logen Ninefingers and Sand dan Glokta are neither heroes nor villains but complex individuals shaped by violence and pragmatism. The series helped establish the grimdark subgenre alongside works by authors like George R.R. Martin.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_First_Law",
    "citationTitle": "Wikipedia: The First Law"
  },
  {
    "id": "e128015b-0728-49ca-b84c-359ae4abd035",
    "text": "In Ursula K. Le Guin's Earthsea series, what is the fundamental principle of magic based on?",
    "options": [
      "Emotional intensity",
      "True names and the old speech",
      "Bloodline inheritance",
      "Divine blessing"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Magic in Earthsea is based on knowing the true names of things and speaking in the Old Speech, the language of creation.",
    "detailedExplanation": "In Ursula K. Le Guin's Earthsea cycle, magic operates through the Old Speech, which is described as the language in which Segoy spoke the world into being. Everything has a true name in this language, and knowing these names grants power over them. However, the magic system emphasizes balance and responsibility - every magical act has consequences, and wizards must understand the interconnectedness of all things. This philosophical approach to magic reflects Le Guin's interest in Taoism and ecological thinking, making Earthsea distinctive among fantasy series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Earthsea",
    "citationTitle": "Wikipedia: Earthsea"
  },
  {
    "id": "f451c8f5-846b-4958-a070-51d0df815ff6",
    "text": "Which fantasy series by Scott Lynch follows the adventures of a master thief in the city of Camorr?",
    "options": [
      "The Lies of Locke Lamora series",
      "The Night Angel trilogy",
      "The Lightbringer series",
      "The Kingkiller Chronicle"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Gentleman Bastard series by Scott Lynch begins with 'The Lies of Locke Lamora' and follows master thief Locke Lamora in Camorr.",
    "detailedExplanation": "Scott Lynch's Gentleman Bastard sequence, beginning with 'The Lies of Locke Lamora' (2006), follows the exploits of Locke Lamora and his gang of elite thieves called the Gentleman Bastards. Set in the Venice-inspired city of Camorr, the series combines fantasy elements with elaborate heist plots and con games. The books are known for their witty dialogue, complex plotting that jumps between past and present, and Lynch's richly detailed world-building that draws inspiration from various historical periods and cultures.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gentleman_Bastard_series",
    "citationTitle": "Wikipedia: Gentleman Bastard series"
  },
  {
    "id": "c51ee131-e3ae-44f2-81b1-6c8196a63911",
    "text": "In George R.R. Martin's A Song of Ice and Fire series, what is the name of the ancestral Valyrian steel sword of House Stark?",
    "options": [
      "Longclaw",
      "Ice",
      "Needle",
      "Oathkeeper"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ice was the ancestral greatsword of House Stark, made of Valyrian steel.",
    "detailedExplanation": "Ice was the massive two-handed greatsword that served as the ancestral weapon of House Stark for generations. Made of Valyrian steel, it was wielded by Ned Stark until his execution, after which Tywin Lannister had it melted down and reforged into two smaller swords: Oathkeeper and Widow's Wail. The sword's destruction symbolized the fall of House Stark's power in King's Landing.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Song_of_Ice_and_Fire",
    "citationTitle": "Wikipedia: A Song of Ice and Fire"
  },
  {
    "id": "afe08cde-b27f-484b-9a3e-b5de75930ad1",
    "text": "Which fantasy series by Patrick Rothfuss features the protagonist Kvothe telling his life story at the Waystone Inn?",
    "options": [
      "The Stormlight Archive",
      "The Kingkiller Chronicle",
      "The First Law",
      "The Broken Empire"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Kingkiller Chronicle follows Kvothe recounting his legendary exploits to the Chronicler.",
    "detailedExplanation": "The Kingkiller Chronicle is Patrick Rothfuss's acclaimed fantasy series that uses a frame narrative structure. The story follows Kvothe, a legendary figure now living quietly as an innkeeper named Kote, as he tells his life story over three days to a scribe called Chronicler. The series is known for its beautiful prose, intricate magic system called sympathy, and the mystery surrounding Kvothe's past and his current exile from his former life.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kingkiller_Chronicle",
    "citationTitle": "Wikipedia: The Kingkiller Chronicle"
  },
  {
    "id": "b2989213-afe5-43c3-be14-5134de0ca71e",
    "text": "In Rick Riordan's Percy Jackson series, Camp Half-Blood is a summer camp for the children of which mythological figures?",
    "options": [
      "Norse gods",
      "Egyptian gods",
      "Greek gods",
      "Roman gods"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Camp Half-Blood is specifically for demigods who are children of Greek gods and mortals.",
    "detailedExplanation": "Camp Half-Blood serves as a safe haven and training ground for demigods—children born from the union of Greek gods and mortal humans. Located on Long Island, the camp is protected by magical barriers and provides training in combat, mythology, and how to control their divine powers. Each cabin at the camp is dedicated to a different Olympian god, and campers are sorted into cabins based on their divine parentage.",
    "citationUrl": "https://en.wikipedia.org/wiki/Percy_Jackson_%26_the_Olympians",
    "citationTitle": "Wikipedia: Percy Jackson & the Olympians"
  },
  {
    "id": "e2d11cd7-68d9-4cd4-b3cb-ef675b133b88",
    "text": "What is the name of the giant wolf in Neil Gaiman's American Gods who serves as one of Odin's companions?",
    "options": [
      "Fenrir",
      "Shadow",
      "Low Key Lyesmith",
      "None - there is no giant wolf"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "American Gods does not feature a giant wolf as one of Odin's companions in the story.",
    "detailedExplanation": "While Norse mythology traditionally includes wolves like Geri and Freki as Odin's companions, Neil Gaiman's American Gods does not prominently feature giant wolves as characters. The story focuses on the conflict between old gods brought to America by immigrants and new gods of modern obsessions. Odin appears as Mr. Wednesday, but his mythological wolf companions are not significant characters in this particular narrative.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_Gods",
    "citationTitle": "Wikipedia: American Gods"
  },
  {
    "id": "f2af4d37-133d-4b1e-ad75-94bf664e9ad7",
    "text": "In J.K. Rowling's Harry Potter series, what are the four houses of Hogwarts School of Witchcraft and Wizardry?",
    "options": [
      "Gryffindor, Slytherin, Ravenclaw, Hufflepuff",
      "Gryffindor, Slytherin, Ravenclaw, Thornfield",
      "Gryffindor, Slytherin, Brightclaw, Hufflepuff",
      "Lionheart, Slytherin, Ravenclaw, Hufflepuff"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The four houses are Gryffindor, Slytherin, Ravenclaw, and Hufflepuff, each founded by a different wizard.",
    "detailedExplanation": "Hogwarts School of Witchcraft and Wizardry is divided into four houses, each named after its founder: Gryffindor (Godric Gryffindor), known for bravery; Slytherin (Salazar Slytherin), known for ambition; Ravenclaw (Rowena Ravenclaw), known for intelligence; and Hufflepuff (Helga Hufflepuff), known for loyalty and hard work. Students are sorted into houses by the Sorting Hat, which considers their personality traits and potential.",
    "citationUrl": "https://en.wikipedia.org/wiki/Harry_Potter",
    "citationTitle": "Wikipedia: Harry Potter"
  },
  {
    "id": "397d4eac-0797-41c5-b321-97e53bf38b52",
    "text": "In Mercedes Lackey's Heralds of Valdemar series, what are the magical horse-like creatures that choose and bond with Heralds called?",
    "options": [
      "Firesteeds",
      "Companions",
      "Windrunners",
      "Bondmates"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Companions are the magical, telepathic horse-like creatures that form lifelong bonds with Heralds.",
    "detailedExplanation": "In the Heralds of Valdemar series, Companions are mystical white horse-like creatures with blue eyes who possess telepathic abilities and near-human intelligence. They Choose individuals to become Heralds of Valdemar, forming an unbreakable psychic bond with their human partner. Companions can communicate telepathically, have their own personalities and wisdom, and are essential to the magical and governmental system of the kingdom of Valdemar.",
    "citationUrl": "https://en.wikipedia.org/wiki/Heralds_of_Valdemar",
    "citationTitle": "Wikipedia: Heralds of Valdemar"
  },
  {
    "id": "0fa6c01e-258e-4c80-88df-aafe1f68b870",
    "text": "Which fantasy series by Jim Butcher follows a professional wizard who works as a private investigator in modern-day Chicago?",
    "options": [
      "The Codex Alera",
      "The Dresden Files",
      "The Iron Druid Chronicles",
      "The Alex Verus series"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Dresden Files features Harry Dresden, a wizard private investigator in contemporary Chicago.",
    "detailedExplanation": "The Dresden Files is Jim Butcher's urban fantasy series featuring Harry Blackstone Copperfield Dresden, a professional wizard who advertises in the Yellow Pages and works as a private investigator and consultant to the Chicago Police Department. The series blends traditional fantasy elements with modern urban settings, featuring supernatural crimes, various magical creatures, and Dresden's ongoing battles against dark forces while trying to pay his rent and survive in the mortal world.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Dresden_Files",
    "citationTitle": "Wikipedia: The Dresden Files"
  },
  {
    "id": "0b83cc67-11d2-4dce-8b53-87c9c8f945c0",
    "text": "In N.K. Jemisin's Broken Earth trilogy, what catastrophic geological events regularly devastate the world?",
    "options": [
      "Volcanic eruptions",
      "Earthquakes",
      "Seasons",
      "Solar flares"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "In the Broken Earth series, 'Seasons' are apocalyptic periods of geological catastrophe that can last centuries.",
    "detailedExplanation": "In N.K. Jemisin's Broken Earth trilogy, 'Seasons' are not regular weather patterns but catastrophic geological events that periodically devastate the world called the Stillness. These can include massive volcanic eruptions, earthquakes, and other seismic disasters that can last anywhere from months to centuries, during which civilization struggles to survive. The series explores how society has adapted to these recurring apocalyptic events and the role of orogenes—people with the power to control geological forces.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Broken_Earth",
    "citationTitle": "Wikipedia: The Broken Earth"
  },
  {
    "id": "0928cc19-b81c-4353-82ee-5787553153eb",
    "text": "In Robert Jordan's The Wheel of Time series, what is the name of the prophesied figure who will either save or destroy the world at the Last Battle?",
    "options": [
      "The Dragon Reborn",
      "The Chosen One",
      "The Light Bearer",
      "The Pattern Weaver"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Dragon Reborn is the prophesied reincarnation of Lews Therin Telamon who will face the Dark One at Tarmon Gai'don.",
    "detailedExplanation": "In Robert Jordan's epic fantasy series The Wheel of Time, the Dragon Reborn is a central prophetic figure who represents the reincarnation of the legendary Lews Therin Telamon, known as the Dragon. This individual is destined to either save the world from the Dark One's influence or break it completely in the process. The main protagonist Rand al'Thor is revealed to be the Dragon Reborn, and much of the series focuses on his journey to accept this destiny and prepare for the Last Battle, known as Tarmon Gai'don.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Wheel_of_Time",
    "citationTitle": "Wikipedia: The Wheel of Time"
  },
  {
    "id": "a19a96b6-ca6a-4e09-84f6-2ddaee9c1c48",
    "text": "Which fantasy series by Michael Moorcock features the eternal champion Elric, who wields the soul-drinking sword Stormbringer?",
    "options": [
      "The Chronicles of Corum",
      "The Elric Saga",
      "The Hawkmoon Chronicles",
      "The Jerry Cornelius Quartet"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Elric Saga follows the albino sorcerer-emperor Elric of Melniboné and his cursed black sword Stormbringer.",
    "detailedExplanation": "Michael Moorcock's Elric Saga is a seminal work in fantasy literature, featuring the tragic anti-hero Elric of Melniboné, the last emperor of a decadent civilization. Elric is physically weak and albino, dependent on drugs and magic to survive, but he wields the powerful runesword Stormbringer, which drinks the souls of those it kills to give Elric strength. The series is notable for subverting traditional fantasy hero tropes and introducing the concept of the Eternal Champion, a figure who appears across multiple dimensions and timelines in Moorcock's multiverse.",
    "citationUrl": "https://en.wikipedia.org/wiki/Elric_of_Melnibon%C3%A9",
    "citationTitle": "Wikipedia: Elric of Melniboné"
  },
  {
    "id": "8eee651a-ee6b-4f29-bd10-e1ce0d9103c9",
    "text": "In Glen Cook's The Black Company series, what is the name of the ancient evil sorceress who becomes both enemy and ally to the mercenary company?",
    "options": [
      "The Lady",
      "The Dominator",
      "Soulcatcher",
      "The White Rose"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The Lady is the powerful sorceress who rules the northern empire and has a complex relationship with the Black Company throughout the series.",
    "detailedExplanation": "In Glen Cook's dark military fantasy series The Black Company, The Lady is one of the most compelling and complex characters. She is an ancient and immensely powerful sorceress who was once married to the Dominator, the series' ultimate evil. After helping to imprison her husband, she rules the northern empire and employs the Black Company as her elite mercenaries. Her relationship with the Company, particularly with the character Croaker, evolves throughout the series from employer to ally to something more personal, making her one of fantasy literature's most nuanced antagonists-turned-protagonists.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Black_Company",
    "citationTitle": "Wikipedia: The Black Company"
  },
  {
    "id": "19907386-b14d-4ea1-9694-4aad9fddb955",
    "text": "What is the name of the desert planet that serves as the primary setting for Frank Herbert's Dune series?",
    "options": [
      "Caladan",
      "Giedi Prime",
      "Arrakis",
      "Kaitain"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Arrakis, also known as Dune, is the desert planet that is the sole source of the spice melange and the main setting of the series.",
    "detailedExplanation": "Arrakis, also called Dune, is the harsh desert planet at the center of Frank Herbert's science fantasy epic. This seemingly barren world is actually the most valuable planet in the universe because it is the only source of melange, or 'spice,' a substance essential for space travel, extending life, and enhancing mental abilities. The planet is inhabited by the Fremen, a desert people adapted to the harsh conditions, and by giant sandworms that are integral to the spice production cycle. Control of Arrakis means control of the spice trade, making it the focal point of political intrigue throughout the series.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arrakis",
    "citationTitle": "Wikipedia: Arrakis"
  }
]