[
  {
    "id": "16b19a52-2e87-4796-b42a-57b3e212632a",
    "text": "Which book series by Rick Riordan features Greek mythological gods living in modern America?",
    "options": [
      "The Kane Chronicles",
      "Percy Jackson & The Olympians",
      "Magnus Chase and the Gods of Asgard",
      "The Heroes of Olympus"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Percy Jackson & The Olympians features Greek gods and demigod children in contemporary settings.",
    "detailedExplanation": "Rick Riordan's Percy Jackson & The Olympians series, beginning with 'The Lightning Thief' in 2005, revolutionized young adult literature by placing Greek mythology in modern American settings. The series follows Percy Jackson, a demigod son of Poseidon, as he discovers a world where the Greek gods are alive and still having children with mortals. The books cleverly incorporate classical myths while making them accessible to contemporary readers.",
    "citationUrl": "https://en.wikipedia.org/wiki/Percy_Jackson_%26_the_Olympians",
    "citationTitle": "Wikipedia: Percy Jackson & the Olympians"
  },
  {
    "id": "3f162289-a4ed-4675-880a-5b0a1fdcbad9",
    "text": "In Neil Gaiman's 'American Gods', which Norse god is the main character Shadow's mysterious employer?",
    "options": [
      "Thor",
      "Loki",
      "Odin",
      "Freyr"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Mr. Wednesday is revealed to be Odin, the All-Father of Norse mythology.",
    "detailedExplanation": "In Neil Gaiman's 'American Gods', the enigmatic Mr. Wednesday who employs Shadow Moon is actually Odin, the chief god of the Norse pantheon. Wednesday gets his name from 'Woden's Day' (Wednesday), which is derived from Odin's Anglo-Saxon name Woden. The novel explores how old gods brought by immigrants struggle for relevance against new American gods of technology and media, with Odin serving as a central figure orchestrating events throughout the story.",
    "citationUrl": "https://en.wikipedia.org/wiki/American_Gods",
    "citationTitle": "Wikipedia: American Gods"
  },
  {
    "id": "52f4feab-cba9-42c5-9325-e2229002cd1a",
    "text": "Which author wrote 'The Song of Achilles', a retelling of the Trojan War from Patroclus's perspective?",
    "options": [
      "Madeline Miller",
      "Jennifer Saint",
      "Pat Barker",
      "Stephen Fry"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Madeline Miller wrote 'The Song of Achilles', which won the Orange Prize for Fiction in 2012.",
    "detailedExplanation": "Madeline Miller's 'The Song of Achilles' (2011) is a critically acclaimed retelling of Homer's Iliad from the perspective of Patroclus, Achilles' companion and lover. The novel won the Orange Prize for Fiction (now the Women's Prize for Fiction) in 2012 and became a bestseller. Miller, who has a background in classics, brings scholarly knowledge of Greek mythology to create an emotionally resonant story that explores themes of love, honor, and destiny within the framework of the Trojan War.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Song_of_Achilles",
    "citationTitle": "Wikipedia: The Song of Achilles"
  },
  {
    "id": "77564f82-a375-43e4-b53d-c08c28ebaf9c",
    "text": "In J.R.R. Tolkien's Middle-earth, which mythological tradition heavily influenced the creation of the Valar?",
    "options": [
      "Greek mythology",
      "Celtic mythology",
      "Norse mythology",
      "Egyptian mythology"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Valar were heavily influenced by Norse mythology, particularly the Æsir gods.",
    "detailedExplanation": "J.R.R. Tolkien drew extensively from Norse mythology when creating the Valar, the godlike beings who govern Middle-earth in his legendarium. The structure of the Valar, with their roles as shapers and guardians of the world, mirrors the Norse Æsir. Additionally, the apocalyptic elements in Tolkien's mythology, such as the prophecy of Dagor Dagorath (the final battle), parallel Ragnarök from Norse tradition. Tolkien's academic background in Germanic philology and Old Norse literature deeply influenced his mythological creations.",
    "citationUrl": "https://en.wikipedia.org/wiki/Valar",
    "citationTitle": "Wikipedia: Valar"
  },
  {
    "id": "aa36e452-5711-4189-aa19-3f08890cd945",
    "text": "Which book by Circe author Madeline Miller retells the story of which Greek mythological figure?",
    "options": [
      "Medea",
      "Circe",
      "Cassandra",
      "Penelope"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The book 'Circe' retells the story of the Greek sorceress Circe from her own perspective.",
    "detailedExplanation": "Madeline Miller's second novel 'Circe' (2018) reimagines the story of the Greek goddess and sorceress Circe, who appears in Homer's Odyssey as the enchantress who transforms Odysseus's men into pigs. Miller's novel expands Circe's story, exploring her origins as a minor goddess, her exile to the island of Aiaia, and her encounters with famous mythological figures including the Minotaur, Daedalus, and Odysseus. The book became a New York Times bestseller and further established Miller's reputation for bringing fresh perspectives to classical mythology.",
    "citationUrl": "https://en.wikipedia.org/wiki/Circe_(novel)",
    "citationTitle": "Wikipedia: Circe (novel)"
  },
  {
    "id": "681b2412-bb08-4ca2-84f7-1f238ff32c56",
    "text": "In which book does author Joanne Harris blend Norse mythology with contemporary British setting?",
    "options": [
      "Chocolat",
      "The Gospel of Loki",
      "Runemarks",
      "Five Quarters of the Orange"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'Runemarks' combines Norse mythology with a post-Ragnarök world set in Yorkshire.",
    "detailedExplanation": "Joanne Harris's 'Runemarks' (2007) is set 500 years after Ragnarök in a world where the old Norse gods have been largely forgotten and replaced by a monotheistic religion called the Order. The story takes place in a Yorkshire-like setting and follows Maddy Smith, a girl who discovers she has magical abilities connected to the old gods. The novel creatively blends traditional Norse mythology with contemporary British culture, creating a unique fantasy world where ancient powers struggle to survive in a changed world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Runemarks",
    "citationTitle": "Wikipedia: Runemarks"
  },
  {
    "id": "883a9418-dfd4-4957-b87f-265fe5782c7d",
    "text": "Which Egyptian god features prominently in Rick Riordan's 'The Kane Chronicles' series?",
    "options": [
      "Anubis",
      "Ra",
      "Horus",
      "All of the above"
    ],
    "correctIndex": 3,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Kane Chronicles features multiple Egyptian gods including Ra, Horus, Anubis, and many others.",
    "detailedExplanation": "Rick Riordan's 'The Kane Chronicles' trilogy incorporates the entire Egyptian pantheon, with Ra (the sun god), Horus (god of the sky and kingship), and Anubis (god of death and mummification) all playing significant roles. The series follows siblings Carter and Sadie Kane as they discover their family's connection to Egyptian magic and must prevent the serpent Apophis from destroying the world. The books draw extensively from Egyptian mythology, featuring gods like Isis, Set, Thoth, and Bast alongside the pharaonic magic system.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Kane_Chronicles",
    "citationTitle": "Wikipedia: The Kane Chronicles"
  },
  {
    "id": "1e7535f0-a292-46d3-9995-f83817ea4e93",
    "text": "Which classic fantasy novel by Ursula K. Le Guin draws heavily from Taoist philosophy and mythology?",
    "options": [
      "The Left Hand of Darkness",
      "A Wizard of Earthsea",
      "The Dispossessed",
      "The Lathe of Heaven"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'A Wizard of Earthsea' incorporates Taoist concepts of balance and the unity of opposites.",
    "detailedExplanation": "Ursula K. Le Guin's 'A Wizard of Earthsea' (1968) draws significantly from Taoist philosophy, particularly the concept of balance and the interconnectedness of all things. The novel's central theme revolves around the protagonist Ged's need to accept and integrate his shadow self, reflecting Taoist ideas about the necessity of embracing both light and dark aspects of existence. The magic system in Earthsea is based on understanding true names and maintaining natural balance, concepts that align with Taoist principles of harmony with the natural order.",
    "citationUrl": "https://en.wikipedia.org/wiki/A_Wizard_of_Earthsea",
    "citationTitle": "Wikipedia: A Wizard of Earthsea"
  },
  {
    "id": "e5b09fba-0341-44e9-9549-32d3a310ddec",
    "text": "Which author wrote 'The Silmarillion', a collection of mythopoeic stories that serves as a mythology for Middle-earth?",
    "options": [
      "J.R.R. Tolkien",
      "C.S. Lewis",
      "George R.R. Martin",
      "Terry Pratchett"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "J.R.R. Tolkien wrote 'The Silmarillion', published posthumously in 1977.",
    "detailedExplanation": "The Silmarillion is a collection of mythopoeic stories by J.R.R. Tolkien, edited and published posthumously by his son Christopher Tolkien in 1977. It tells of the Elder Days of Middle-earth and serves as a prequel to The Lord of the Rings, containing creation myths, legends of the Elves, and the early history of Tolkien's fictional world. The work establishes a complete mythology and cosmology for Middle-earth.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Silmarillion",
    "citationTitle": "Wikipedia: The Silmarillion"
  },
  {
    "id": "9ee942e7-3d96-4208-983d-495cb9b35515",
    "text": "In Stephen King's 'It', the titular monster is inspired by which type of mythological creature that feeds on fear?",
    "options": [
      "Banshee",
      "Wendigo",
      "Shapeshifter",
      "Vampire"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "IT is a shapeshifting entity that can take various forms, drawing from ancient shapeshifter mythology.",
    "detailedExplanation": "In Stephen King's novel 'It', the monster is an ancient, cosmic entity that primarily appears as Pennywise the Dancing Clown but can shapeshift into the fears of its victims. This concept draws heavily from shapeshifter mythology found in various cultures worldwide, where creatures can change their physical form at will. The entity feeds on fear and terror, making it particularly dangerous to children, and has existed for centuries in cycles of awakening and dormancy.",
    "citationUrl": "https://en.wikipedia.org/wiki/It_(novel)",
    "citationTitle": "Wikipedia: It (novel)"
  },
  {
    "id": "cb51cbe7-3c21-4b71-878f-a07a349d67e4",
    "text": "Which Japanese author wrote 'The Tale of Genji', often considered the world's first novel and deeply rooted in Japanese court mythology?",
    "options": [
      "Murasaki Shikibu",
      "Sei Shonagon",
      "Matsuo Basho",
      "Yukio Mishima"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Murasaki Shikibu wrote 'The Tale of Genji' in the early 11th century.",
    "detailedExplanation": "Murasaki Shikibu, a Japanese noblewoman and lady-in-waiting at the Imperial court during the Heian period, wrote 'The Tale of Genji' in the early 11th century. The work is often cited as the world's first novel and is deeply embedded with Japanese mythology, folklore, and court traditions. The story follows Prince Genji and incorporates elements of Shinto beliefs, Buddhist philosophy, and classical Japanese poetry, creating a rich tapestry of cultural and mythological references.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Tale_of_Genji",
    "citationTitle": "Wikipedia: The Tale of Genji"
  },
  {
    "id": "a7b82333-5c38-4504-a759-042befbac2cf",
    "text": "In which book series does author Cassandra Clare incorporate angel and demon mythology into a modern urban fantasy setting?",
    "options": [
      "The Vampire Chronicles",
      "The Mortal Instruments",
      "The Dresden Files",
      "The Hollows"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The Mortal Instruments series by Cassandra Clare features Shadowhunters who fight demons with angel-given powers.",
    "detailedExplanation": "The Mortal Instruments is a series of six young adult fantasy novels by Cassandra Clare, beginning with 'City of Bones' in 2007. The series is set in a world where angels, demons, and other supernatural beings exist alongside humans. The story follows Shadowhunters, warriors who are part human and part angel, as they protect mundane humans from demons and other supernatural threats. The mythology draws heavily from Christian angelology and demonology, incorporating elements like the Angel Raziel and various demonic hierarchies.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Mortal_Instruments",
    "citationTitle": "Wikipedia: The Mortal Instruments"
  },
  {
    "id": "79cd5692-8948-4aa0-8942-032f3e54330f",
    "text": "Which Celtic mythological figure is the protagonist of Marion Zimmer Bradley's 'The Mists of Avalon'?",
    "options": [
      "Guinevere",
      "Morgaine",
      "Brigid",
      "Rhiannon"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Morgaine (Morgan le Fay) is the main character in Bradley's retelling of the Arthurian legend.",
    "detailedExplanation": "'The Mists of Avalon' by Marion Zimmer Bradley retells the Arthurian legend from the perspective of the women involved, particularly Morgaine (also known as Morgan le Fay in traditional tales). Published in 1983, the novel draws heavily from Celtic mythology and presents a feminist retelling where Morgaine is portrayed as a priestess of the old Celtic religion struggling against the rise of Christianity in Britain. The book incorporates Celtic goddesses, druidic traditions, and ancient British mythology.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Mists_of_Avalon",
    "citationTitle": "Wikipedia: The Mists of Avalon"
  },
  {
    "id": "cd4d7f41-762c-433f-bcd0-ead30c1e36b1",
    "text": "Which Hindu epic poem serves as the basis for Ramesh Menon's modern retelling 'The Ramayana: A Shortened Modern Prose Version'?",
    "options": [
      "Mahabharata",
      "Ramayana",
      "Bhagavata Purana",
      "Vishnu Purana"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The book is based on the ancient Hindu epic Ramayana, originally attributed to sage Valmiki.",
    "detailedExplanation": "Ramesh Menon's work is a modern prose adaptation of the ancient Hindu epic Ramayana, originally composed by the sage Valmiki. The Ramayana tells the story of Prince Rama's quest to rescue his wife Sita from the demon king Ravana, and is one of the most important works in Hindu mythology and literature. Menon's version makes this classical text more accessible to contemporary readers while preserving the essential mythological and spiritual elements of the original Sanskrit epic.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ramayana",
    "citationTitle": "Wikipedia: Ramayana"
  },
  {
    "id": "c21b6073-4a74-4c50-8c3c-be9ea37914d7",
    "text": "In Terry Pratchett's Discworld series, which mythological concept is literally supported by four elephants standing on a giant turtle?",
    "options": [
      "The World Tree",
      "The Flat Earth",
      "The Cosmic Egg",
      "The Sacred Mountain"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Discworld is a flat earth supported by four elephants on the back of Great A'Tuin, a giant turtle.",
    "detailedExplanation": "Terry Pratchett's Discworld is a flat, disc-shaped world supported by four giant elephants (Berilia, Tubul, Great T'Phon, and Jerakeen) who stand on the back of Great A'Tuin, an enormous turtle swimming through space. This concept parodies the ancient mythological idea of a flat earth and draws inspiration from various world mythologies, including Hindu cosmology's concept of the world being supported by elephants and the Native American 'World Turtle' mythology. Pratchett used this fantastical setting to satirize our own world and its belief systems.",
    "citationUrl": "https://en.wikipedia.org/wiki/Discworld_(world)",
    "citationTitle": "Wikipedia: Discworld (world)"
  },
  {
    "id": "3ac647f7-9910-417f-b1e3-d1d3d7691cf2",
    "text": "Which Slavic folklore creature that lives in a hut on chicken legs features prominently in books by authors like Catherynne M. Valente?",
    "options": [
      "Rusalka",
      "Domovoi",
      "Baba Yaga",
      "Firebird"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Baba Yaga, the witch who lives in a hut on chicken legs, appears in Valente's 'Deathless' and other works.",
    "detailedExplanation": "Baba Yaga is a prominent figure in Slavic folklore, depicted as a witch who lives in a hut that stands on chicken legs deep in the forest. This mythological character has been featured in numerous modern literary works, including Catherynne M. Valente's novel 'Deathless' and her Fairyland series. Baba Yaga can be either helpful or harmful depending on the story, and her character represents the ambiguous nature of magic in Slavic mythology. Contemporary authors have embraced this complex figure, reimagining her for modern audiences while maintaining her essential mythological characteristics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Baba_Yaga",
    "citationTitle": "Wikipedia: Baba Yaga"
  },
  {
    "id": "561b49b8-5eee-45f4-8216-55913e3d978e",
    "text": "Which mythological realm serves as the primary setting for Jostein Gaarder's novel 'The Solitaire Mystery'?",
    "options": [
      "Asgard from Norse mythology",
      "A philosophical wonderland inspired by playing card mythology",
      "Mount Olympus from Greek mythology",
      "The Celtic Otherworld"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The novel uses playing card imagery and philosophical concepts to create a mythological framework around card symbolism.",
    "detailedExplanation": "Jostein Gaarder's 'The Solitaire Mystery' weaves together philosophical themes with a mythological framework based on playing cards and their symbolic meanings. The story follows a father and son on a journey that becomes intertwined with a mysterious book about playing card characters who have gained consciousness. Gaarder, known for making philosophy accessible through storytelling, creates a unique mythological system that draws from the archetypal nature of card suits and figures, transforming them into a coherent mythological narrative that explores themes of identity, fate, and free will.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Solitaire_Mystery",
    "citationTitle": "Wikipedia: The Solitaire Mystery"
  },
  {
    "id": "6a9c4921-8275-4296-a9b7-3f459f16957e",
    "text": "Which African mythological tradition is prominently featured in Nnedi Okorafor's 'Who Fears Death'?",
    "options": [
      "Egyptian mythology",
      "Yoruba mythology",
      "San mythology",
      "Dogon mythology"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "The novel incorporates Yoruba spiritual traditions and West African mythological elements into its post-apocalyptic fantasy setting.",
    "detailedExplanation": "Nnedi Okorafor's award-winning novel 'Who Fears Death' draws heavily from Yoruba mythology and West African spiritual traditions. The story follows Onyesonwu, a young woman with magical abilities in a post-apocalyptic Africa, and incorporates elements such as shape-shifting, ancestor worship, and traditional African magical practices. Okorafor, a Nigerian-American author, weaves authentic African mythological concepts into her speculative fiction, including references to juju, spiritual transformations, and the complex relationship between the living and the dead that characterizes Yoruba cosmology.",
    "citationUrl": "https://en.wikipedia.org/wiki/Who_Fears_Death",
    "citationTitle": "Wikipedia: Who Fears Death"
  },
  {
    "id": "636d3e96-570d-4f51-9d17-dd938b6b3490",
    "text": "In which novel does Isabel Allende blend Chilean folklore with magical realism to tell a multi-generational family saga?",
    "options": [
      "Eva Luna",
      "The House of the Spirits",
      "Paula",
      "City of the Beasts"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "'The House of the Spirits' incorporates Chilean folk beliefs, indigenous mythology, and supernatural elements throughout the del Valle family's story.",
    "detailedExplanation": "Isabel Allende's debut novel 'The House of the Spirits' masterfully weaves Chilean folklore and indigenous South American mythological elements into its narrative spanning several generations of the del Valle and Trueba families. The novel features characters with supernatural abilities, ghostly apparitions, and folk magic practices that reflect the rich mythological traditions of Chile and broader Latin American culture. Allende incorporates elements such as premonitory dreams, communication with spirits, and the blending of Catholic and indigenous beliefs that characterize much of Latin American folk mythology, creating a tapestry that reflects the cultural syncretism of the region.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_House_of_the_Spirits",
    "citationTitle": "Wikipedia: The House of the Spirits"
  },
  {
    "id": "3596dc50-e70a-4604-9ee4-3ff54052dca8",
    "text": "Which Mesopotamian epic poem is retold in Herbert Mason's popular modern verse adaptation?",
    "options": [
      "The Enuma Elish",
      "The Epic of Gilgamesh",
      "Inanna's Descent to the Underworld",
      "The Atrahasis Epic"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "easy",
    "explanation": "Herbert Mason's 1970 verse retelling of 'The Epic of Gilgamesh' made this ancient Mesopotamian mythology accessible to modern readers.",
    "detailedExplanation": "Herbert Mason's acclaimed 1970 adaptation of 'The Epic of Gilgamesh' brought this foundational work of world mythology to contemporary audiences through accessible modern verse. The original epic, dating from ancient Mesopotamia, tells the story of Gilgamesh, king of Uruk, and his friendship with the wild man Enkidu, their adventures together, and Gilgamesh's subsequent quest for immortality. Mason's retelling preserves the mythological themes of friendship, mortality, and the human condition while making the ancient Sumerian and Akkadian source material readable for modern audiences, helping to establish Gilgamesh as one of the most widely read works of ancient mythology in contemporary literature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Epic_of_Gilgamesh",
    "citationTitle": "Wikipedia: Epic of Gilgamesh"
  }
]