[
  {
    "id": "563c75c8-760c-4a6b-8323-d4bd383858a4",
    "text": "In Shakespeare's Sonnet 18 ('Shall I compare thee to a summer's day?'), what does the speaker claim will give the beloved eternal life?",
    "options": [
      "The memory of their love",
      "The verses of the poem itself",
      "Their children and descendants",
      "The beauty of nature"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The speaker promises that 'So long as men can breathe or eyes can see, / So long lives this, and this gives life to thee' - referring to the poem itself.",
    "detailedExplanation": "Sonnet 18 is one of Shakespeare's most famous sonnets, exploring the theme of immortality through poetry. The speaker initially compares the beloved to a summer's day but finds the comparison inadequate because summer is fleeting and imperfect. Instead, the speaker argues that the beloved's beauty will be preserved forever in the 'eternal lines' of the poem itself. The final couplet makes this explicit: the poem will live as long as humans exist to read it, and through this reading, the beloved achieves immortality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sonnet_18",
    "citationTitle": "Wikipedia: Sonnet 18"
  },
  {
    "id": "7c49270f-d93d-424b-adb4-88f2330e408e",
    "text": "Which character in 'King Lear' disguises himself as 'Poor Tom,' a mad beggar, to escape persecution?",
    "options": [
      "Kent",
      "Edgar",
      "Edmund",
      "Gloucester"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Edgar, legitimate son of Gloucester, assumes the identity of 'Poor Tom' after being falsely accused by his half-brother Edmund.",
    "detailedExplanation": "Edgar's transformation into 'Poor Tom' represents one of the most dramatic character disguises in Shakespeare. After Edmund manipulates their father Gloucester into believing Edgar is plotting against him, Edgar flees and adopts the persona of a mad, homeless beggar known as 'Poor Tom o' Bedlam.' This disguise allows him to survive in the hostile world of the play while also serving as a commentary on social inequality and the treatment of the mentally ill in Shakespeare's time. Edgar's assumed madness contrasts with the real madness that afflicts other characters in the play.",
    "citationUrl": "https://en.wikipedia.org/wiki/Edgar_(King_Lear)",
    "citationTitle": "Wikipedia: Edgar (King Lear)"
  },
  {
    "id": "9650ae86-2aab-4075-bb00-3f8d7ff65119",
    "text": "In 'The Tempest,' what is the name of Caliban's mother, the witch who previously ruled the island?",
    "options": [
      "Hecate",
      "Sycorax",
      "Medea",
      "Circe"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Sycorax was the Algerian witch and Caliban's mother who had been banished to the island and died before Prospero's arrival.",
    "detailedExplanation": "Sycorax is a crucial figure in The Tempest's backstory, though she never appears on stage. She was an Algerian witch who was banished to the island while pregnant with Caliban. Before her death, she had imprisoned the spirit Ariel in a cloven pine tree for twelve years because he refused to obey her commands. When Prospero arrives on the island, he frees Ariel and makes him his servant instead. Sycorax represents a colonial 'other' and her relationship with the island raises questions about legitimate rule and the nature of colonialism that run throughout the play.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sycorax",
    "citationTitle": "Wikipedia: Sycorax"
  },
  {
    "id": "c16df4c4-06d3-4cfc-b238-eedb11b70395",
    "text": "What is the unusual structural feature of Shakespeare's Sonnet 126, making it different from his other sonnets?",
    "options": [
      "It has 16 lines instead of 14",
      "It consists of 12 lines with two blank spaces",
      "It uses only masculine rhymes",
      "It contains no metaphors"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Sonnet 126 has only 12 lines followed by two sets of empty parentheses, making it structurally unique in the sequence.",
    "detailedExplanation": "Sonnet 126 is often called the 'envoi' or conclusion to the first section of Shakespeare's sonnet sequence addressing the 'Fair Youth.' Instead of the traditional 14-line structure, it consists of six rhyming couplets (12 lines) followed by two sets of empty parentheses or brackets. This unusual structure has been interpreted as representing the silence of death or the incompleteness that comes with the end of youth and beauty. The poem serves as a bridge between the Fair Youth sonnets (1-126) and the Dark Lady sonnets (127-152), marking a significant transition in the sequence's thematic focus.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sonnet_126",
    "citationTitle": "Wikipedia: Sonnet 126"
  },
  {
    "id": "084e3fd1-6f44-4d5b-9a78-2d671d19b3ad",
    "text": "In 'Measure for Measure,' what is the name of the strict deputy who demands sexual favors in exchange for saving a condemned man's life?",
    "options": [
      "Angelo",
      "Escalus",
      "Lucio",
      "Claudio"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Angelo is the puritanical deputy left in charge of Vienna who propositions Isabella, demanding she sleep with him to save her brother Claudio.",
    "detailedExplanation": "Angelo serves as the primary antagonist in Measure for Measure, embodying the play's exploration of justice, mercy, and moral hypocrisy. When the Duke of Vienna temporarily leaves Angelo in charge to enforce the city's neglected moral laws, Angelo condemns Claudio to death for premarital sex. When Claudio's sister Isabella, a novice nun, pleads for her brother's life, Angelo propositions her with the corrupt bargain that he will spare Claudio if she sleeps with him. This creates the central moral crisis of the play and demonstrates how power can corrupt even those who appear most virtuous.",
    "citationUrl": "https://en.wikipedia.org/wiki/Angelo_(Measure_for_Measure)",
    "citationTitle": "Wikipedia: Angelo (Measure for Measure)"
  },
  {
    "id": "818791a5-0969-4cf2-91f7-94cdca602d04",
    "text": "In Shakespeare's Sonnet sequence, what is the traditional name given to the mysterious woman addressed in sonnets 127-152?",
    "options": [
      "The Fair Maiden",
      "The Dark Lady",
      "The Cruel Mistress",
      "The Unknown Beloved"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The 'Dark Lady' is the conventional term for the woman addressed in the later sonnets, characterized by her dark features and morally ambiguous nature.",
    "detailedExplanation": "The Dark Lady sonnets (127-152) form the second major section of Shakespeare's sonnet sequence and present a dramatically different relationship from the idealized love of the Fair Youth sonnets. The Dark Lady is described as having black hair and dark eyes, which contradicted Renaissance beauty standards that favored fair coloring. More significantly, she represents a morally complex figure who is both sexually alluring and destructive. The speaker's relationship with her is characterized by lust, betrayal, and self-loathing rather than the pure devotion expressed elsewhere. The identity of this woman has been the subject of extensive scholarly speculation, with various historical candidates proposed.",
    "citationUrl": "https://en.wikipedia.org/wiki/Dark_Lady_of_the_Sonnets",
    "citationTitle": "Wikipedia: Dark Lady of the Sonnets"
  },
  {
    "id": "8041138d-425b-4a75-b2a9-d901cbb2b905",
    "text": "In 'Troilus and Cressida,' which Greek warrior is portrayed as a brutal, almost bestial figure who drags Hector's body around Troy?",
    "options": [
      "Agamemnon",
      "Ajax",
      "Achilles",
      "Diomedes"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Achilles kills Hector dishonorably with the help of his Myrmidons and then drags the body behind his chariot, subverting the heroic tradition.",
    "detailedExplanation": "Shakespeare's portrayal of Achilles in Troilus and Cressida deliberately subverts the traditional heroic image found in Homer's Iliad. Rather than the noble warrior of classical literature, Shakespeare presents Achilles as sulking, prideful, and ultimately dishonorable. He kills Hector not in fair combat but through treachery, having his Myrmidons surround and murder the unarmed Trojan prince. The dragging of Hector's body represents the play's cynical view of war and heroism, stripping away romantic notions of military glory to reveal the brutal reality beneath. This reflects the play's overall tone as one of Shakespeare's most bitter and disillusioned works.",
    "citationUrl": "https://en.wikipedia.org/wiki/Troilus_and_Cressida",
    "citationTitle": "Wikipedia: Troilus and Cressida"
  },
  {
    "id": "db80da73-75b0-4a19-96fd-9bf1c2af5484",
    "text": "In Shakespeare's 'Hamlet,' what are the final words spoken by the dying Prince of Denmark?",
    "options": [
      "The rest is silence",
      "Good night, sweet prince",
      "Now cracks a noble heart",
      "Flights of angels sing thee to thy rest"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Hamlet's last words are 'The rest is silence' before he dies.",
    "detailedExplanation": "In Act V, Scene 2 of Hamlet, after being mortally wounded by Laertes' poisoned sword, Hamlet speaks his final line: 'The rest is silence.' This poignant ending contrasts with Hamlet's earlier verbose soliloquies and reflects his acceptance of death. The other options are words spoken by Horatio about Hamlet after his death, making this a particularly challenging question that tests knowledge of who says what in the play's climactic scene.",
    "citationUrl": "https://en.wikipedia.org/wiki/Hamlet",
    "citationTitle": "Wikipedia: Hamlet"
  },
  {
    "id": "22552197-6f4e-4755-8307-d84a0521d059",
    "text": "In Shakespeare's Sonnet 73, the speaker compares himself to three things representing aging and mortality. Which is NOT one of them?",
    "options": [
      "A withering flower",
      "Twilight after sunset",
      "Yellow leaves on autumn boughs",
      "A dying fire's glowing embers"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Sonnet 73 uses twilight, autumn leaves, and dying embers as metaphors, but not withering flowers.",
    "detailedExplanation": "Shakespeare's Sonnet 73 ('That time of year thou mayst in me behold') presents three powerful metaphors for aging across its three quatrains: autumn with yellow leaves clinging to bare branches, twilight giving way to night, and a fire dying down to glowing embers. Each metaphor becomes progressively more immediate and intense, moving from seasonal change to daily change to momentary change. The withering flower, while a common metaphor for mortality in poetry, does not appear in this particular sonnet, making this a challenging question about specific textual details.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sonnet_73",
    "citationTitle": "Wikipedia: Sonnet 73"
  },
  {
    "id": "8bd3de16-ebbd-4422-897f-7af50de0ced0",
    "text": "In 'Macbeth,' what does Lady Macbeth claim she would do to prove her ruthless determination to her hesitant husband?",
    "options": [
      "Pluck a nursing baby from her breast and dash its brains out",
      "Poison Duncan's wine with her own hands",
      "Kill her own father if he stood in their way",
      "Walk through fire to claim the crown"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Lady Macbeth uses the shocking image of killing a nursing baby to demonstrate her ruthless commitment.",
    "detailedExplanation": "In Act I, Scene 7 of Macbeth, when her husband wavers about murdering Duncan, Lady Macbeth delivers one of the most chilling speeches in all of Shakespeare. She declares that she would have 'plucked my boneless gums and dashed the brains out, had I so sworn as you have done to this.' This horrific hypothetical scenario is meant to shame Macbeth into action by showing that she would commit even the most unnatural act—infanticide—if she had sworn to do so, emphasizing the sacred nature of oaths and her perception of his cowardice.",
    "citationUrl": "https://en.wikipedia.org/wiki/Lady_Macbeth",
    "citationTitle": "Wikipedia: Lady Macbeth"
  },
  {
    "id": "c4fa9ea7-60f4-472d-9e5c-919a1ddc4793",
    "text": "Which character in 'Othello' is referred to by Othello as 'honest' a total of 15 times throughout the play?",
    "options": [
      "Iago",
      "Cassio",
      "Desdemona",
      "Emilia"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Othello repeatedly calls Iago 'honest,' creating dramatic irony as Iago orchestrates the tragedy through deception.",
    "detailedExplanation": "One of the most powerful examples of dramatic irony in Shakespeare comes from Othello's repeated references to Iago as 'honest Iago.' Throughout the play, various characters call Iago 'honest' a total of 52 times, with Othello himself using the term 15 times. This creates devastating dramatic irony, as the audience knows that Iago is the architect of all the play's deceptions and tragedies. The repetition of 'honest' in reference to the play's most dishonest character emphasizes how completely Iago has manipulated everyone around him and highlights the gap between appearance and reality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Iago",
    "citationTitle": "Wikipedia: Iago"
  },
  {
    "id": "6845672d-7094-4ad4-98b2-12bbc74d000d",
    "text": "In 'Romeo and Juliet,' how long does Friar Lawrence tell Juliet the potion will make her appear dead?",
    "options": [
      "42 hours",
      "24 hours",
      "36 hours",
      "48 hours"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Friar Lawrence specifies that Juliet will appear dead for exactly 42 hours after taking his potion.",
    "detailedExplanation": "In Act IV, Scene 1 of Romeo and Juliet, Friar Lawrence gives Juliet very specific instructions about his sleeping potion. He tells her that after drinking it, she will appear dead for 'two and forty hours' (42 hours), after which she will awaken as if from a pleasant sleep. This precise timing is crucial to his plan—it allows time for her family to discover her 'death,' prepare for her funeral, place her in the Capulet tomb, and for Romeo to receive word and return from Mantua. The specificity of the timeframe makes this a particularly challenging detail that tests close reading of the text.",
    "citationUrl": "https://en.wikipedia.org/wiki/Romeo_and_Juliet",
    "citationTitle": "Wikipedia: Romeo and Juliet"
  },
  {
    "id": "c3fb2c3a-6f99-4544-8fac-038cf2c3906c",
    "text": "Which Shakespeare play is the only one to observe the classical unities of time, place, and action throughout its entirety?",
    "options": [
      "The Tempest",
      "Macbeth",
      "Julius Caesar",
      "Othello"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Tempest uniquely follows all three classical unities: taking place in one location over a few hours with a single plot.",
    "detailedExplanation": "The Tempest is Shakespeare's only play that strictly adheres to the classical unities derived from Aristotle's Poetics: unity of time (the action occurs in real time over about four hours), unity of place (everything happens on Prospero's island), and unity of action (all events center on Prospero's plan for revenge and reconciliation). Written late in Shakespeare's career, this adherence to classical rules was unusual for him, as most of his other plays span years, move between multiple locations, and include subplots. This structural discipline makes The Tempest unique among his works and demonstrates his mastery of different dramatic forms.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Tempest",
    "citationTitle": "Wikipedia: The Tempest"
  },
  {
    "id": "628d0e4b-9ac2-4890-a33e-6499c3e0045d",
    "text": "In Shakespeare's Sonnet 130 ('My mistress' eyes are nothing like the sun'), what literary convention is the poet deliberately subverting?",
    "options": [
      "The blazon tradition of cataloguing a lover's idealized features",
      "The pastoral tradition of rural romantic settings",
      "The carpe diem tradition of seizing the day",
      "The memento mori tradition of remembering death"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Sonnet 130 parodies the blazon tradition by honestly describing his mistress rather than using idealized comparisons.",
    "detailedExplanation": "Sonnet 130 is Shakespeare's brilliant parody of the blazon, a poetic tradition dating back to Petrarch where poets would catalog their beloved's features using elaborate, idealized comparisons (eyes like stars, lips like coral, etc.). Instead, Shakespeare's speaker honestly states that his mistress's 'eyes are nothing like the sun,' her lips are less red than coral, and her hair is like black wires. However, the final couplet reveals the poem's true message: despite avoiding false comparisons, his love is genuine and 'as rare / As any she belied with false compare.' This makes the sonnet both a critique of artificial poetic conventions and a sincere love poem.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sonnet_130",
    "citationTitle": "Wikipedia: Sonnet 130"
  },
  {
    "id": "b460b93e-5ac1-416b-ba91-f72a2dd44c53",
    "text": "In 'The Winter's Tale,' what is the name of the kingdom ruled by the jealous King Leontes?",
    "options": [
      "Sicilia",
      "Bohemia",
      "Illyria",
      "Navarre"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Leontes is the King of Sicilia in The Winter's Tale.",
    "detailedExplanation": "In Shakespeare's 'The Winter's Tale,' Leontes rules the kingdom of Sicilia, while his childhood friend Polixenes is King of Bohemia. The play's action moves between these two kingdoms, with the famous stage direction 'Exit, pursued by a bear' occurring during the Bohemian scenes. Leontes' unfounded jealousy regarding his wife Hermione and Polixenes drives the tragic first half of this late romance.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Winter%27s_Tale",
    "citationTitle": "Wikipedia: The Winter's Tale"
  },
  {
    "id": "afc248a1-8b14-4972-8b58-a9a0e0793442",
    "text": "Which Shakespeare sonnet begins with the famous line 'When in disgrace with fortune and men's eyes'?",
    "options": [
      "Sonnet 29",
      "Sonnet 116",
      "Sonnet 55",
      "Sonnet 65"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Sonnet 29 opens with 'When in disgrace with fortune and men's eyes.'",
    "detailedExplanation": "Shakespeare's Sonnet 29 is one of his most beloved poems, beginning with the melancholic line 'When in disgrace with fortune and men's eyes.' The sonnet follows the speaker's journey from despair and self-pity to joy when he remembers his beloved. The poem's volta occurs with 'Yet in these thoughts myself almost despising, / Haply I think on thee,' showing how love transforms the speaker's mood from despair to elation.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sonnet_29",
    "citationTitle": "Wikipedia: Sonnet 29"
  },
  {
    "id": "701e2002-a6bd-4bd9-89c4-d8a495205c2a",
    "text": "In 'As You Like It,' what is the name of the exiled Duke Senior's forest domain?",
    "options": [
      "Forest of Arden",
      "Sherwood Forest",
      "Windsor Forest",
      "Forest of Dean"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "The Forest of Arden is where Duke Senior lives in exile with his followers.",
    "detailedExplanation": "The Forest of Arden in 'As You Like It' serves as Shakespeare's idealized pastoral setting where the exiled Duke Senior holds court with his loyal followers. This forest, likely named after the real Forest of Arden in Warwickshire near Shakespeare's birthplace, becomes a place of transformation where characters like Rosalind (disguised as Ganymede) and Orlando find love, and where the corrupt are reformed. The forest represents a retreat from the artificial constraints of court life.",
    "citationUrl": "https://en.wikipedia.org/wiki/As_You_Like_It",
    "citationTitle": "Wikipedia: As You Like It"
  },
  {
    "id": "48fe62d7-70e4-40b9-97c3-0b072662d0d4",
    "text": "In 'Coriolanus,' what physical feature does the title character refuse to show the Roman people to gain their votes?",
    "options": [
      "His battle scars",
      "His bare head",
      "His sword wounds",
      "His branded hand"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Coriolanus refuses to display his battle scars to the plebeians as was customary for candidates.",
    "detailedExplanation": "In Shakespeare's 'Coriolanus,' the proud warrior Caius Marcius Coriolanus is expected to show his battle wounds and scars to the Roman citizens in the marketplace as part of the traditional ritual for gaining their votes for consul. However, his aristocratic pride and contempt for the common people make him reluctant to engage in this display of humility. This refusal becomes a crucial turning point that leads to his banishment from Rome, as it demonstrates his inability to perform the political theater necessary for democratic leadership.",
    "citationUrl": "https://en.wikipedia.org/wiki/Coriolanus",
    "citationTitle": "Wikipedia: Coriolanus"
  },
  {
    "id": "a898301b-7114-4252-9a91-c4584d2593be",
    "text": "What distinctive rhyme scheme pattern do Shakespeare's sonnets follow?",
    "options": [
      "ABAB CDCD EFEF GG",
      "ABBA ABBA CDECDE",
      "ABAB BCBC CDCD EE",
      "ABAD ABAD CDCD EE"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Shakespearean sonnets use the ABAB CDCD EFEF GG rhyme scheme.",
    "detailedExplanation": "The Shakespearean sonnet, also known as the English sonnet, follows a distinctive ABAB CDCD EFEF GG rhyme scheme across its 14 lines. This differs from the Petrarchan (Italian) sonnet which uses ABBA ABBA for the octave followed by various patterns in the sestet. Shakespeare's pattern creates three quatrains that develop an argument or idea, followed by a final rhyming couplet that provides resolution, summary, or ironic commentary. This structure allows for a more flexible development of themes compared to the more rigid division of the Petrarchan form.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shakespearean_sonnet",
    "citationTitle": "Wikipedia: Shakespearean sonnet"
  },
  {
    "id": "36f382c8-47af-4324-9991-96000786706b",
    "text": "In 'The Merchant of Venice,' what is the name of Portia's waiting-woman who accompanies her to the trial disguised as a law clerk?",
    "options": [
      "Nerissa",
      "Jessica",
      "Emilia",
      "Bianca"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "hard",
    "explanation": "Nerissa is Portia's lady-in-waiting who disguises herself as a clerk during the trial scene.",
    "detailedExplanation": "Nerissa serves as Portia's intelligent and loyal waiting-woman in 'The Merchant of Venice.' When Portia disguises herself as the young lawyer Balthasar to defend Antonio in court, Nerissa accompanies her disguised as a law clerk. Nerissa is more than just a servant; she's Portia's confidante and friend, and she also participates in the casket plot by marrying Gratiano. Her wit matches her mistress's, as demonstrated in the ring plot where both women trick their husbands after the trial by demanding their wedding rings as payment.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Merchant_of_Venice",
    "citationTitle": "Wikipedia: The Merchant of Venice"
  }
]