[
  {
    "id": "f59beb95-9f46-4063-a305-a1523dbfdf66",
    "text": "In which Shakespeare play does the character Shylock demand 'a pound of flesh' as collateral for a loan?",
    "options": [
      "Romeo and Juliet",
      "The Merchant of Venice",
      "Othello",
      "King Lear"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Shylock is the Jewish moneylender in The Merchant of Venice who demands a pound of flesh from Antonio.",
    "detailedExplanation": "In The Merchant of Venice, Shylock agrees to lend money to Antonio with the unusual condition that if the loan isn't repaid on time, he can take a pound of Antonio's flesh. This creates the central conflict of the play when Antonio's ships are delayed and he cannot repay the debt. The famous courtroom scene where Portia disguised as a lawyer saves Antonio by pointing out that Shylock can take flesh but not blood is one of Shakespeare's most memorable dramatic moments.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Merchant_of_Venice",
    "citationTitle": "Wikipedia: The Merchant of Venice"
  },
  {
    "id": "462d8000-b531-404c-a2a9-19e2b43d7f78",
    "text": "Which of Shakespeare's sonnets begins with the famous line 'Shall I compare thee to a summer's day?'",
    "options": [
      "Sonnet 17",
      "Sonnet 18",
      "Sonnet 19",
      "Sonnet 20"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Sonnet 18 is one of Shakespeare's most famous sonnets, beginning with 'Shall I compare thee to a summer's day?'",
    "detailedExplanation": "Sonnet 18 is perhaps Shakespeare's most widely recognized sonnet, exploring themes of beauty, mortality, and immortality through verse. The poem argues that the beloved's beauty surpasses that of a summer's day because summer is temporary and imperfect, while the beloved's beauty will be eternal through the poem itself. The sonnet concludes with the famous couplet 'So long as men can breathe or eyes can see, / So long lives this, and this gives life to thee,' suggesting that poetry can grant immortality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sonnet_18",
    "citationTitle": "Wikipedia: Sonnet 18"
  },
  {
    "id": "7062f0a5-cc24-4b80-934a-d983a9ed8a73",
    "text": "In Macbeth, what are the names of the three witches also known as?",
    "options": [
      "The Fates",
      "The Weird Sisters",
      "The Harpies",
      "The Furies"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The three witches in Macbeth are commonly referred to as the Weird Sisters.",
    "detailedExplanation": "The three witches in Macbeth are called the 'Weird Sisters,' a term that appears in the play itself. The word 'weird' in Shakespeare's time came from the Old English 'wyrd,' meaning fate or destiny, making them literally the 'sisters of fate.' They appear in Act 1, Scene 1, and throughout the play, delivering prophecies that drive Macbeth's ambition and ultimate downfall. Their famous incantation 'Double, double toil and trouble; Fire burn and caldron bubble' is one of the most quoted passages from the play.",
    "citationUrl": "https://en.wikipedia.org/wiki/Three_Witches",
    "citationTitle": "Wikipedia: Three Witches"
  },
  {
    "id": "d5fdb080-b8f2-4524-8188-cc5f8e7dabc3",
    "text": "In A Midsummer Night's Dream, what is the name of the fairy queen who falls in love with Bottom?",
    "options": [
      "Peaseblossom",
      "Titania",
      "Cobweb",
      "Mustardseed"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Titania is the fairy queen who, under Oberon's love spell, falls in love with Bottom who has been given a donkey's head.",
    "detailedExplanation": "Titania, Queen of the Fairies, becomes the victim of a magical prank orchestrated by her husband Oberon and the mischievous Puck. While she sleeps, Puck applies a love potion to her eyes that will make her fall in love with the first creature she sees upon waking. This happens to be Bottom, one of the 'mechanicals' (amateur actors) who has been transformed to have a donkey's head. The comedic situation of the elegant fairy queen doting on the crude, ass-headed weaver creates one of the play's most memorable comic episodes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Titania_(A_Midsummer_Night%27s_Dream)",
    "citationTitle": "Wikipedia: Titania (A Midsummer Night's Dream)"
  },
  {
    "id": "1787af37-9db1-41f3-95fe-f3385e075a21",
    "text": "What is the name of Prospero's spirit servant in The Tempest?",
    "options": [
      "Ariel",
      "Caliban",
      "Ferdinand",
      "Antonio"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Ariel is the air spirit who serves Prospero and helps him orchestrate the events on the island.",
    "detailedExplanation": "Ariel is a supernatural spirit of the air who was trapped in a tree by the witch Sycorax before being freed by Prospero. In gratitude and obligation, Ariel serves Prospero throughout the play, using magical powers to create the tempest, lead characters around the island, and produce various illusions. Unlike the earthbound and rebellious Caliban, Ariel is ethereal and obedient, eagerly anticipating the freedom that Prospero has promised. At the play's end, Prospero releases Ariel from service, and the spirit's final song about freedom is one of Shakespeare's most beautiful lyrics.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ariel_(The_Tempest)",
    "citationTitle": "Wikipedia: Ariel (The Tempest)"
  },
  {
    "id": "14b64bec-ac26-44a5-803e-7db6628fa43e",
    "text": "In King Lear, how many daughters does the title character have?",
    "options": [
      "Two",
      "Three",
      "Four",
      "Five"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "King Lear has three daughters: Goneril, Regan, and Cordelia.",
    "detailedExplanation": "King Lear's three daughters are central to the play's plot. Goneril and Regan, the elder daughters, flatter their father with false declarations of love to receive larger portions of his kingdom, while Cordelia, the youngest, refuses to participate in this hollow ceremony and speaks honestly about her love. This leads to Lear banishing Cordelia and dividing her portion between her sisters. The parallel subplot involves the Earl of Gloucester and his two sons, Edgar and Edmund, creating a double plot structure that explores themes of family, legitimacy, and the consequences of poor judgment.",
    "citationUrl": "https://en.wikipedia.org/wiki/King_Lear",
    "citationTitle": "Wikipedia: King Lear"
  },
  {
    "id": "430f04a9-7b2e-42e3-bf67-47759cf7a944",
    "text": "Which Shakespeare play contains the famous Stage direction 'Exit, pursued by a bear'?",
    "options": [
      "The Winter's Tale",
      "As You Like It",
      "The Tempest",
      "A Midsummer Night's Dream"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The famous stage direction 'Exit, pursued by a bear' appears in The Winter's Tale when Antigonus flees from a bear.",
    "detailedExplanation": "'Exit, pursued by a bear' is one of Shakespeare's most famous and unusual stage directions, appearing in Act III, Scene 3 of The Winter's Tale. The character Antigonus, who has just abandoned the infant Perdita on the coast of Bohemia, is chased off stage by a bear and is killed (though this happens offstage). This moment marks a crucial turning point in the play, as it removes Antigonus, who could have revealed Perdita's true identity, thus allowing for the dramatic recognition scene years later. The staging of this scene has puzzled directors for centuries - whether to use a real bear, a person in costume, or leave it to the audience's imagination.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Winter%27s_Tale",
    "citationTitle": "Wikipedia: The Winter's Tale"
  },
  {
    "id": "ba1372ad-baa0-4ec7-a903-0e689e6857db",
    "text": "In Romeo and Juliet, what is the name of Romeo's friend who is killed by Tybalt in Act 3?",
    "options": [
      "Benvolio",
      "Mercutio",
      "Paris",
      "Balthasar"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Mercutio is Romeo's witty friend who is fatally wounded by Tybalt in the famous sword fight scene.",
    "detailedExplanation": "Mercutio is one of Shakespeare's most memorable supporting characters, known for his wordplay and the famous 'Queen Mab' speech. His death in Act 3, Scene 1 is a crucial turning point in Romeo and Juliet, as it prompts Romeo to kill Tybalt in revenge, leading to Romeo's banishment from Verona and setting up the tragic conclusion of the play.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mercutio",
    "citationTitle": "Wikipedia: Mercutio"
  },
  {
    "id": "0fbd6b3c-0c99-4f16-865d-1daf5d41e092",
    "text": "Which Shakespeare play features the famous soliloquy beginning 'Tomorrow, and tomorrow, and tomorrow'?",
    "options": [
      "Hamlet",
      "Othello",
      "Macbeth",
      "King Lear"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "This famous soliloquy is spoken by Macbeth in Act 5, Scene 5, after learning of Lady Macbeth's death.",
    "detailedExplanation": "The 'Tomorrow' soliloquy is one of Shakespeare's most powerful meditations on the meaninglessness of life and the passage of time. Macbeth delivers these lines upon hearing of his wife's death, reflecting on how life 'creeps in this petty pace from day to day' and comparing life to 'a poor player that struts and frets his hour upon the stage and then is heard no more.'",
    "citationUrl": "https://en.wikipedia.org/wiki/Tomorrow_and_tomorrow_and_tomorrow",
    "citationTitle": "Wikipedia: Tomorrow and tomorrow and tomorrow"
  },
  {
    "id": "379c5605-7148-424e-b8c1-49a05ec6370f",
    "text": "In Othello, what is the name of Iago's wife who unknowingly helps him carry out his evil scheme?",
    "options": [
      "Desdemona",
      "Emilia",
      "Bianca",
      "Portia"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Emilia is Iago's wife and Desdemona's lady-in-waiting, who unknowingly provides Iago with Desdemona's handkerchief.",
    "detailedExplanation": "Emilia plays a crucial role in Othello's plot. She finds and gives her husband Iago the handkerchief that Othello had given to Desdemona, not knowing that Iago plans to use it as 'evidence' of Desdemona's infidelity. Emilia's discovery of her husband's treachery and her brave decision to reveal the truth ultimately exposes Iago's manipulation, though it comes too late to save Desdemona.",
    "citationUrl": "https://en.wikipedia.org/wiki/Emilia_(Othello)",
    "citationTitle": "Wikipedia: Emilia (Othello)"
  },
  {
    "id": "a6008d64-8c02-4476-86e1-05887378a251",
    "text": "How many sonnets did Shakespeare write in total?",
    "options": [
      "144",
      "154",
      "164",
      "174"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Shakespeare wrote 154 sonnets, first published together in 1609.",
    "detailedExplanation": "Shakespeare's 154 sonnets were published in 1609, though many were likely written years earlier. The collection is divided into two main sequences: sonnets 1-126 are addressed to a 'Fair Youth,' while sonnets 127-152 concern a 'Dark Lady.' The final two sonnets (153-154) are translations of Greek poems. The sonnets explore themes of love, beauty, mortality, and the power of poetry to preserve memory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shakespeare%27s_sonnets",
    "citationTitle": "Wikipedia: Shakespeare's sonnets"
  },
  {
    "id": "527d99bb-698f-4976-89d9-b1b538dae748",
    "text": "In which play does the character Beatrice engage in witty verbal sparring with Benedick?",
    "options": [
      "As You Like It",
      "Twelfth Night",
      "Much Ado About Nothing",
      "The Taming of the Shrew"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Beatrice and Benedick are the sparring lovers in Much Ado About Nothing, famous for their 'merry war' of words.",
    "detailedExplanation": "Much Ado About Nothing features one of Shakespeare's most entertaining romantic relationships between Beatrice and Benedick, who engage in constant verbal dueling while secretly harboring feelings for each other. Their friends conspire to trick them into admitting their love by staging conversations for each to overhear. Their witty banter and eventual romance provides a comedic counterpoint to the more serious romantic plot involving Hero and Claudio.",
    "citationUrl": "https://en.wikipedia.org/wiki/Much_Ado_About_Nothing",
    "citationTitle": "Wikipedia: Much Ado About Nothing"
  },
  {
    "id": "05de2d6c-c32a-46a7-b425-049bd3ec6cf5",
    "text": "What is the opening word of Sonnet 130, which begins 'My mistress' eyes are nothing like the sun'?",
    "options": [
      "When",
      "My",
      "Shall",
      "Let"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Sonnet 130 begins with 'My mistress' eyes are nothing like the sun,' making 'My' the opening word.",
    "detailedExplanation": "Sonnet 130 is one of Shakespeare's most famous sonnets, notable for its anti-Petrarchan approach to describing the beloved. Instead of using exaggerated comparisons typical of love poetry, Shakespeare honestly describes his mistress's ordinary features ('My mistress' eyes are nothing like the sun; Coral is far more red than her lips' red'). The sonnet concludes by stating that despite these realistic descriptions, his love is as genuine as any founded on false comparisons.",
    "citationUrl": "https://en.wikipedia.org/wiki/Sonnet_130",
    "citationTitle": "Wikipedia: Sonnet 130"
  },
  {
    "id": "7ad0f454-c0d3-4e19-af9e-e4a59fcea6d9",
    "text": "In Hamlet, what is the name of Polonius's son who seeks to avenge his father's death?",
    "options": [
      "Laertes",
      "Fortinbras",
      "Rosencrantz",
      "Horatio"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Laertes is Polonius's son who returns from France to avenge his father's murder by Hamlet.",
    "detailedExplanation": "Laertes serves as a foil to Hamlet in the play. Like Hamlet, he seeks to avenge his father's death, but unlike the hesitant prince, Laertes acts quickly and decisively when he learns of Polonius's murder. Claudius manipulates Laertes's desire for revenge, arranging the fatal duel between Laertes and Hamlet in the play's final act. The poisoned sword fight results in the deaths of both young men, fulfilling the play's tragic trajectory.",
    "citationUrl": "https://en.wikipedia.org/wiki/Laertes_(Hamlet)",
    "citationTitle": "Wikipedia: Laertes (Hamlet)"
  },
  {
    "id": "eca8a9b3-7e87-4762-9ba6-af698a804621",
    "text": "Which Shakespeare comedy features the characters Rosalind and Orlando?",
    "options": [
      "Twelfth Night",
      "As You Like It",
      "A Midsummer Night's Dream",
      "The Comedy of Errors"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Rosalind and Orlando are the main romantic leads in As You Like It, set primarily in the Forest of Arden.",
    "detailedExplanation": "As You Like It follows Rosalind, who flees to the Forest of Arden disguised as a young man named Ganymede, accompanied by her cousin Celia and the fool Touchstone. There she encounters Orlando, who has also fled to the forest. While disguised, Rosalind offers to cure Orlando of his lovesickness by pretending to be his beloved Rosalind, creating a complex comedy of mistaken identity and gender confusion that explores themes of love, nature, and social conventions.",
    "citationUrl": "https://en.wikipedia.org/wiki/As_You_Like_It",
    "citationTitle": "Wikipedia: As You Like It"
  },
  {
    "id": "d2949a9a-6cb1-48f0-b788-73a7cc0932b7",
    "text": "In which Shakespeare play does the character Iago manipulate everyone by saying 'I am not what I am'?",
    "options": [
      "Macbeth",
      "Othello",
      "King Lear",
      "Richard III"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Iago speaks this famous line in Othello, revealing his deceptive nature.",
    "detailedExplanation": "In Act 1, Scene 1 of Othello, the villainous Iago declares 'I am not what I am' to Roderigo, establishing himself as one of literature's most notorious manipulators. This line reveals Iago's fundamental duplicity - while he appears loyal and honest to other characters, he is actually plotting their destruction. The phrase ironically contrasts with God's declaration 'I am that I am' in the Bible, suggesting Iago's evil nature.",
    "citationUrl": "https://en.wikipedia.org/wiki/Othello",
    "citationTitle": "Wikipedia: Othello"
  },
  {
    "id": "133e08e2-e8f6-451e-ace2-72fa0d77b840",
    "text": "What unusual rhyme scheme do Shakespeare's sonnets follow?",
    "options": [
      "ABAB CDCD EFEF GG",
      "ABBA ABBA CDECDE",
      "ABAB BCBC CDCD EE",
      "AABA AABA AABA AA"
    ],
    "correctIndex": 0,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "Shakespeare's sonnets follow the ABAB CDCD EFEF GG rhyme scheme, known as the Shakespearean or English sonnet form.",
    "detailedExplanation": "The Shakespearean sonnet structure consists of three quatrains (four-line stanzas) followed by a rhyming couplet, creating the distinctive ABAB CDCD EFEF GG pattern. This differs from the Petrarchan sonnet form which uses ABBA ABBA CDECDE. The final couplet (GG) typically provides a conclusion, twist, or summary to the preceding twelve lines, making it a crucial element in Shakespeare's poetic arguments about love, beauty, time, and mortality.",
    "citationUrl": "https://en.wikipedia.org/wiki/Shakespeare%27s_sonnets",
    "citationTitle": "Wikipedia: Shakespeare's sonnets"
  },
  {
    "id": "3d0b6ad2-a0c0-4830-8199-84c632a1fbbd",
    "text": "In The Merchant of Venice, what are the three caskets made of that Portia's suitors must choose between?",
    "options": [
      "Gold, silver, and bronze",
      "Gold, silver, and lead",
      "Gold, silver, and iron",
      "Gold, copper, and lead"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The three caskets are made of gold, silver, and lead, with the lead casket containing Portia's portrait.",
    "detailedExplanation": "In The Merchant of Venice, Portia's father devised a test for her suitors involving three caskets made of gold, silver, and lead. Each bears an inscription: the gold casket promises 'what many men desire,' the silver 'what he deserves,' and the lead 'what he must give and hazard.' The correct choice is the lead casket, which contains Portia's portrait, teaching that true worth lies not in outward appearance but in substance and the willingness to risk everything for love.",
    "citationUrl": "https://en.wikipedia.org/wiki/The_Merchant_of_Venice",
    "citationTitle": "Wikipedia: The Merchant of Venice"
  },
  {
    "id": "2b2cdd5b-94e1-4465-8ccb-6f6d865c0644",
    "text": "Which Shakespeare play contains the famous quote 'All the world's a stage, and all the men and women merely players'?",
    "options": [
      "Hamlet",
      "As You Like It",
      "Twelfth Night",
      "Much Ado About Nothing"
    ],
    "correctIndex": 1,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "This famous quote is spoken by Jaques in As You Like It during his 'Seven Ages of Man' speech.",
    "detailedExplanation": "The melancholic character Jaques delivers this famous monologue in Act 2, Scene 7 of As You Like It. The speech continues to describe the seven stages of human life from infancy to old age, using the extended metaphor of life as a theatrical performance. This philosophical reflection on the human condition has become one of Shakespeare's most quoted passages, encapsulating themes of fate, the passage of time, and the roles we play throughout our lives.",
    "citationUrl": "https://en.wikipedia.org/wiki/As_You_Like_It",
    "citationTitle": "Wikipedia: As You Like It"
  },
  {
    "id": "75836b62-4964-4fc7-9502-1e390868dbc5",
    "text": "In Julius Caesar, what warning does the soothsayer give to Caesar?",
    "options": [
      "'Trust no one close to you'",
      "'Death comes with March'",
      "'Beware the Ides of March'",
      "'Your crown brings your doom'"
    ],
    "correctIndex": 2,
    "category": "literature",
    "difficulty": "medium",
    "explanation": "The soothsayer warns Caesar to 'Beware the Ides of March,' referring to March 15th, the day of Caesar's assassination.",
    "detailedExplanation": "In Act 1, Scene 2 of Julius Caesar, a soothsayer calls out the famous warning 'Beware the Ides of March' to Caesar. The Ides of March refers to March 15th in the Roman calendar. Caesar dismisses the soothsayer as 'a dreamer,' but the warning proves prophetic as Caesar is assassinated on that very date. This moment establishes the theme of fate versus free will that runs throughout the play, and the phrase has become synonymous with impending doom in popular culture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Julius_Caesar_(play)",
    "citationTitle": "Wikipedia: Julius Caesar (play)"
  }
]