[
  {
    "id": "7d0b2bf0-a890-4f81-bc21-c826aabcbb6c",
    "text": "The Parthenon in Athens is a prime example of which ancient architectural order?",
    "options": [
      "Ionic",
      "Doric",
      "Corinthian",
      "Tuscan"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "The Parthenon features the Doric order, characterized by simple, sturdy columns without decorative capitals.",
    "detailedExplanation": "The Doric order is the oldest and simplest of the three classical Greek architectural orders. It features columns with plain, circular capitals and no base, sitting directly on the stylobate. The Parthenon, built in the 5th century BCE, is considered the finest example of Doric architecture, showcasing the order's emphasis on strength, functionality, and geometric harmony.",
    "citationUrl": "https://en.wikipedia.org/wiki/Doric_order",
    "citationTitle": "Wikipedia: Doric order"
  },
  {
    "id": "b42f71d5-ca71-4442-b4d6-f2d67343370f",
    "text": "Which architectural movement emphasized 'form follows function' and minimal ornamentation?",
    "options": [
      "Victorian",
      "Modernism",
      "Rococo",
      "Renaissance"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Modernism promoted the principle that a building's design should reflect its intended function, with minimal decorative elements.",
    "detailedExplanation": "Modernist architecture emerged in the early 20th century as a reaction against ornate historical styles. Pioneered by architects like Louis Sullivan, Le Corbusier, and Mies van der Rohe, it emphasized clean lines, geometric forms, and the honest use of materials like steel, glass, and concrete. The movement rejected unnecessary decoration in favor of functional design that expressed the building's purpose.",
    "citationUrl": "https://en.wikipedia.org/wiki/Modern_architecture",
    "citationTitle": "Wikipedia: Modern architecture"
  },
  {
    "id": "56a602b2-03a8-4f43-ab12-c3f3eb08001d",
    "text": "What is the distinctive dome-shaped roof structure commonly found in Islamic architecture called?",
    "options": [
      "Cupola",
      "Onion dome",
      "Muqarnas",
      "Qubba"
    ],
    "correctIndex": 3,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "A qubba is the Arabic term for the dome structures that are characteristic features of Islamic architecture.",
    "detailedExplanation": "The qubba (plural: qibab) is a fundamental element in Islamic architecture, representing the vault of heaven in Islamic cosmology. These domes can be found on mosques, mausoleums, and palaces throughout the Islamic world. They vary in shape from hemispherical to bulbous and are often decorated with geometric patterns, calligraphy, or colorful tiles. Famous examples include the Dome of the Rock in Jerusalem and the domes of the Hagia Sophia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Islamic_architecture",
    "citationTitle": "Wikipedia: Islamic architecture"
  },
  {
    "id": "9c2ae70e-464e-45d3-9ff4-224b58c1e439",
    "text": "Which architectural style is known for its ornate decoration, curved lines, and asymmetrical designs popular in 18th century Europe?",
    "options": [
      "Gothic Revival",
      "Rococo",
      "Brutalism",
      "Art Nouveau"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Rococo architecture featured elaborate ornamentation, pastel colors, and asymmetrical designs that were popular in 18th century Europe.",
    "detailedExplanation": "Rococo architecture developed in early 18th century France as a more intimate and decorative evolution of Baroque style. Characterized by elaborate ornamentation including shells, scrolls, and foliage, pastel color schemes, and asymmetrical designs, Rococo emphasized grace and lightness over the grandeur of Baroque. The style spread throughout Europe and can be seen in palaces like Sanssouci in Germany and Catherine Palace in Russia.",
    "citationUrl": "https://en.wikipedia.org/wiki/Rococo",
    "citationTitle": "Wikipedia: Rococo"
  },
  {
    "id": "96688803-35e7-4d82-a5ef-3b65ca1d442c",
    "text": "Frank Lloyd Wright was a leading figure in which architectural philosophy that emphasized harmony with nature?",
    "options": [
      "Deconstructivism",
      "International Style",
      "Organic Architecture",
      "Postmodernism"
    ],
    "correctIndex": 2,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Frank Lloyd Wright pioneered Organic Architecture, which sought to create buildings that harmonized with their natural surroundings.",
    "detailedExplanation": "Organic Architecture is a philosophy that promotes harmony between humanity and the world through design approaches that integrate buildings with their natural surroundings. Frank Lloyd Wright coined the term and exemplified it in works like Fallingwater, which is built over a waterfall, and his Prairie Houses that emphasize horizontal lines echoing the Midwest landscape. The approach considers the site, materials, and purpose as integral parts of the design process.",
    "citationUrl": "https://en.wikipedia.org/wiki/Organic_architecture",
    "citationTitle": "Wikipedia: Organic architecture"
  },
  {
    "id": "f86e85e3-e15f-4a59-873d-50c66409db61",
    "text": "Which architectural feature consists of a series of arches supported by columns, commonly found in Roman and Islamic buildings?",
    "options": [
      "Colonnade",
      "Arcade",
      "Portico",
      "Loggia"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "An arcade is a series of arches supported by columns, a structural element used extensively in Roman and Islamic architecture.",
    "detailedExplanation": "An arcade is a succession of arches, each supported by a column or pillar. This architectural element was perfected by the Romans and became a defining feature of Romanesque architecture. Arcades serve both structural and aesthetic purposes, creating rhythmic patterns while supporting weight. They can be found in cloisters, aqueducts, bridges, and building facades. Islamic architecture also extensively uses arcades, as seen in the Mosque-Cathedral of Córdoba and the Alhambra.",
    "citationUrl": "https://en.wikipedia.org/wiki/Arcade_(architecture)",
    "citationTitle": "Wikipedia: Arcade (architecture)"
  },
  {
    "id": "730f7203-3fb4-4d58-a416-a21feef18b78",
    "text": "The Sydney Opera House is considered a masterpiece of which 20th century architectural movement?",
    "options": [
      "Brutalism",
      "Expressionist Architecture",
      "High-tech Architecture",
      "Memphis Design"
    ],
    "correctIndex": 1,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "The Sydney Opera House exemplifies Expressionist Architecture with its dramatic, sculptural shell-like forms.",
    "detailedExplanation": "Expressionist Architecture emphasized bold, sculptural forms and the expression of inner experience rather than practical considerations alone. The Sydney Opera House, designed by Jørn Utzon and completed in 1973, is considered one of the finest examples of this movement. Its distinctive shell-like concrete structures were revolutionary in their time, created through complex geometric calculations and representing a departure from traditional building forms to create an emotionally powerful architectural statement.",
    "citationUrl": "https://en.wikipedia.org/wiki/Expressionist_architecture",
    "citationTitle": "Wikipedia: Expressionist architecture"
  },
  {
    "id": "a8856986-0c06-4385-bb3e-f23604517559",
    "text": "What distinctive feature gives Art Deco buildings their characteristic appearance?",
    "options": [
      "Geometric patterns and zigzag motifs",
      "Thatched roofs",
      "Log construction",
      "Stone gargoyles"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Art Deco architecture is known for its geometric patterns, zigzag motifs, and streamlined designs.",
    "detailedExplanation": "Art Deco architecture flourished in the 1920s and 1930s, characterized by bold geometric patterns, zigzag motifs, streamlined forms, and decorative elements inspired by modern technology and ancient cultures. This style often featured vertical emphasis, metallic finishes, and stylized ornamentation. Famous examples include the Chrysler Building in New York City and the Hoover Building in London, which showcase the movement's emphasis on glamour and modernity.",
    "citationUrl": "https://en.wikipedia.org/wiki/Art_Deco_architecture",
    "citationTitle": "Wikipedia: Art Deco architecture"
  },
  {
    "id": "b133ebe3-c97f-4936-8401-7128c47c15f0",
    "text": "Which architectural style typically features whitewashed walls, blue accents, and flat roofs?",
    "options": [
      "Mediterranean",
      "Tudor",
      "Colonial",
      "Prairie School"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Mediterranean architecture commonly features whitewashed walls, blue accents, and flat roofs inspired by coastal regions.",
    "detailedExplanation": "Mediterranean architecture draws inspiration from the coastal regions of Spain, Italy, and Greece. This style became popular in warmer climates and resort areas, featuring stucco or whitewashed walls, red tile or flat roofs, blue shutters and accents, arched windows and doorways, and outdoor living spaces like courtyards and terraces. The style emphasizes indoor-outdoor living and reflects the relaxed lifestyle of Mediterranean coastal communities.",
    "citationUrl": "https://en.wikipedia.org/wiki/Mediterranean_Revival_architecture",
    "citationTitle": "Wikipedia: Mediterranean Revival architecture"
  },
  {
    "id": "2e064956-bab0-4f70-b95d-aefdccf51bb2",
    "text": "What is the main building material associated with Brutalist architecture?",
    "options": [
      "Raw concrete",
      "Red brick",
      "Marble",
      "Timber"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Brutalist architecture is characterized by its use of raw, unfinished concrete (béton brut in French).",
    "detailedExplanation": "Brutalist architecture emerged in the 1950s and is defined by its use of raw concrete, known as 'béton brut' in French, which gives the style its name. This architectural movement emphasized massive, blocky forms with repetitive angular elements and minimal decoration. The concrete surfaces were often left unfinished, showing the texture of wooden boards or molds used in casting. Notable examples include the Barbican Centre in London and Boston City Hall.",
    "citationUrl": "https://en.wikipedia.org/wiki/Brutalist_architecture",
    "citationTitle": "Wikipedia: Brutalist architecture"
  },
  {
    "id": "b0f4e461-9622-498e-8bb4-20447060741a",
    "text": "Which architectural style is known for its half-timbered construction with exposed wooden beams?",
    "options": [
      "Tudor",
      "Art Nouveau",
      "Bauhaus",
      "Postmodern"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Tudor architecture is famous for its half-timbered construction with exposed dark wooden beams against lighter walls.",
    "detailedExplanation": "Tudor architecture, popular in 16th century England and revived in the early 20th century, is characterized by half-timbered construction where wooden structural frames are left exposed against lighter-colored walls, typically white plaster or stucco. Other features include steeply pitched roofs, tall narrow windows with small panes, ornate chimneys, and arched doorways. This style creates a distinctive 'black and white' appearance that has become iconic of English medieval architecture.",
    "citationUrl": "https://en.wikipedia.org/wiki/Tudor_architecture",
    "citationTitle": "Wikipedia: Tudor architecture"
  },
  {
    "id": "b776aa43-0fd7-45dc-925c-950c6b40a32a",
    "text": "What type of roof is most commonly associated with Victorian architecture?",
    "options": [
      "Mansard roof",
      "Flat roof",
      "Geodesic dome",
      "Green roof"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Victorian architecture commonly features mansard roofs, which have two slopes on each side with the lower slope being steeper.",
    "detailedExplanation": "Victorian architecture, popular during Queen Victoria's reign (1837-1901), often featured mansard roofs, which are characterized by having two slopes on each of the four sides, with the lower slope being much steeper than the upper slope. This French-inspired roofing style allowed for additional living space in the attic area while maintaining an elegant roofline. Victorian homes also typically included ornate trim, bay windows, asymmetrical facades, and decorative elements known as 'gingerbread' details.",
    "citationUrl": "https://en.wikipedia.org/wiki/Victorian_architecture",
    "citationTitle": "Wikipedia: Victorian architecture"
  },
  {
    "id": "6d8ebd4e-c0bd-4c20-8c42-a48313e83999",
    "text": "Which ancient architectural style is characterized by thick walls, round arches, and barrel vaults?",
    "options": [
      "Romanesque",
      "Gothic",
      "Renaissance",
      "Baroque"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Romanesque architecture features thick walls, round arches, and barrel vaults, preceding Gothic architecture.",
    "detailedExplanation": "Romanesque architecture developed in medieval Europe from roughly 1000 to 1150 CE, before being succeeded by Gothic architecture. It is characterized by thick stone walls, round arches (rather than pointed ones), barrel vaults, sturdy pillars, and relatively small windows. This style drew inspiration from Roman architecture, hence the name 'Romanesque.' The thick walls and massive construction were necessary to support the heavy stone roofs, and the style is exemplified by churches like the Abbey of Sainte-Foy in France.",
    "citationUrl": "https://en.wikipedia.org/wiki/Romanesque_architecture",
    "citationTitle": "Wikipedia: Romanesque architecture"
  },
  {
    "id": "a3eab586-fe40-4658-9470-4e8cb6add27d",
    "text": "What is the defining characteristic of ranch-style architecture?",
    "options": [
      "Single-story layout with horizontal emphasis",
      "Multiple towers",
      "Gothic spires",
      "Curved walls"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Ranch-style architecture is defined by its single-story layout with a strong horizontal emphasis and open floor plans.",
    "detailedExplanation": "Ranch-style architecture, also known as ranch house or rambler, became popular in the United States from the 1920s through the 1970s. The defining characteristic is its single-story layout with a long, low profile that emphasizes horizontal lines. These homes typically feature open floor plans, large windows, sliding glass doors leading to patios, attached garages, and minimal exterior ornamentation. The style was designed for casual living and took advantage of the wide-open spaces available in suburban America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Ranch-style_house",
    "citationTitle": "Wikipedia: Ranch-style house"
  },
  {
    "id": "f731636d-2a72-415f-9482-92e1e2b4f4af",
    "text": "Which Gothic architectural feature is designed to transfer the weight of the roof and walls to an external support?",
    "options": [
      "Flying buttress",
      "Rose window",
      "Pointed arch",
      "Ribbed vault"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Flying buttresses are external supports that transfer structural weight away from walls in Gothic architecture.",
    "detailedExplanation": "Flying buttresses are one of the most distinctive and innovative features of Gothic architecture. These arched external supports allowed medieval builders to construct much taller buildings with thinner walls and larger windows by transferring the weight and thrust of the roof and upper walls to external supports. This engineering innovation was crucial to achieving the soaring heights and expansive glass windows that characterize Gothic cathedrals like Notre-Dame de Paris.",
    "citationUrl": "https://en.wikipedia.org/wiki/Flying_buttress",
    "citationTitle": "Wikipedia: Flying buttress"
  },
  {
    "id": "af48118c-8fb2-454d-8a91-a28dd93601f0",
    "text": "What is the name for the decorative triangular space above the entrance of a classical building?",
    "options": [
      "Pediment",
      "Frieze",
      "Cornice",
      "Entablature"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "A pediment is the triangular decorative element typically found above the entrance or portico of classical buildings.",
    "detailedExplanation": "The pediment is a classical architectural element that forms a triangular decorative feature, usually supported by columns and positioned above the entrance of a building. Originally derived from ancient Greek and Roman temple design, pediments often contain sculptural decoration or relief work in the triangular space called the tympanum. This feature became a hallmark of neoclassical architecture and can be seen on government buildings, museums, and other institutional structures worldwide.",
    "citationUrl": "https://en.wikipedia.org/wiki/Pediment",
    "citationTitle": "Wikipedia: Pediment"
  },
  {
    "id": "8e3c26c0-8339-4135-945b-3cbf1925c1b5",
    "text": "Which architectural style is characterized by onion-shaped domes and colorful, elaborate decoration?",
    "options": [
      "Russian Orthodox",
      "Byzantine",
      "Moorish",
      "Ottoman"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Russian Orthodox architecture is famous for its distinctive onion-shaped domes and vibrant, ornate decoration.",
    "detailedExplanation": "Russian Orthodox church architecture developed its own unique characteristics, most notably the onion dome (луковичная глава). These bulbous, often gilded domes are not just decorative but serve practical purposes in snowy climates, as their shape helps shed snow and ice. Russian Orthodox churches typically feature multiple colorful domes, elaborate exterior decoration, and rich interior ornamentation with icons and frescoes. St. Basil's Cathedral in Moscow's Red Square is perhaps the most famous example of this architectural style.",
    "citationUrl": "https://en.wikipedia.org/wiki/Russian_architecture",
    "citationTitle": "Wikipedia: Russian architecture"
  },
  {
    "id": "c6d86956-d2a7-4cb9-a5ef-23e1f3a124ad",
    "text": "What type of window is characterized by a projecting structure that extends from the wall of a building?",
    "options": [
      "Bay window",
      "Casement window",
      "Sash window",
      "Dormer window"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Bay windows project outward from the main wall of a building, creating additional interior space and allowing more light.",
    "detailedExplanation": "Bay windows are architectural features that project outward from the main walls of a building, forming a bay in the room inside. They typically consist of three or more windows set at angles to each other, creating a semicircular or polygonal projection. Bay windows became particularly popular during the Victorian era and serve both functional and aesthetic purposes: they provide additional interior space, allow more natural light into rooms, and create visual interest on building facades. They're commonly found in residential architecture, especially in British and American homes.",
    "citationUrl": "https://en.wikipedia.org/wiki/Bay_window",
    "citationTitle": "Wikipedia: Bay window"
  },
  {
    "id": "0b5c60ea-b8bf-4d2e-83af-9c08522e6dc6",
    "text": "Which architectural term describes a covered entrance or porch supported by columns?",
    "options": [
      "Portico",
      "Loggia",
      "Colonnade",
      "Peristyle"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "A portico is a covered entrance or porch supported by columns, commonly found in classical architecture.",
    "detailedExplanation": "A portico is a structure consisting of a roof supported by columns, typically forming a covered entrance or porch at the front of a building. Derived from classical Greek and Roman architecture, porticos serve both practical and ceremonial functions, providing shelter from weather while creating an impressive entrance. They became a defining feature of neoclassical architecture and can be seen on many important buildings, including the White House, the British Museum, and countless government buildings, banks, and institutional structures around the world.",
    "citationUrl": "https://en.wikipedia.org/wiki/Portico",
    "citationTitle": "Wikipedia: Portico"
  },
  {
    "id": "6970f480-9dd3-4960-85a8-ccd2492391b1",
    "text": "Which 19th-century architectural revival style sought to recreate medieval building techniques and aesthetics?",
    "options": [
      "Gothic Revival",
      "Classical Revival",
      "Colonial Revival",
      "Egyptian Revival"
    ],
    "correctIndex": 0,
    "category": "arts",
    "difficulty": "easy",
    "explanation": "Gothic Revival architecture emerged in the 19th century as a movement to revive medieval Gothic building styles and craftsmanship.",
    "detailedExplanation": "Gothic Revival, also known as Neo-Gothic, was an architectural movement that began in the late 18th century and flourished throughout the 19th century. This style sought to revive the medieval Gothic architecture of the 12th-16th centuries, emphasizing pointed arches, ribbed vaults, flying buttresses, and elaborate stone tracery. The movement was partly inspired by romanticism and a nostalgia for medieval craftsmanship. Famous examples include the Palace of Westminster in London, Trinity Church in New York, and many university buildings, particularly in Britain and North America.",
    "citationUrl": "https://en.wikipedia.org/wiki/Gothic_Revival_architecture",
    "citationTitle": "Wikipedia: Gothic Revival architecture"
  }
]